[
    {
        "content": "<p>Next week Wednesday (July 29), there is a Machine Learning and Theorem Proving session of the <a href=\"https://cicm-conference.org/2020\">Conference on Intelligent Computer Mathematics</a>.  The conference is now virtual (UCT+2).  You must however <a href=\"https://cicm-conference.org/2020/cicm.php?event=&amp;menu=registration\">register for free using a Google form</a>.  I'm going to take a half-day off of work to attend that session.  The <a href=\"https://easychair.org/smart-program/CICM-13/2020-07-29.html#session:46699\">line-up of talks</a> is pretty great:</p>",
        "id": 204418869,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250136
    },
    {
        "content": "<ul>\n<li>15:00–16:00 CEST (UTC+2) <span class=\"user-mention\" data-user-id=\"239426\">@Christian Szegedy</span>: (Invited Talk) A Promising Path Towards Autoformalization and General Artificial Intelligence<ul>\n<li>No abstract but looks looks to be quite provocative.  I'd attend just to see this.</li>\n</ul>\n</li>\n</ul>",
        "id": 204418895,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250148
    },
    {
        "content": "<ul>\n<li>16:30–16:45 CEST (UTC+2) <span class=\"user-mention\" data-user-id=\"306713\">@Lasse</span>  <span class=\"user-mention\" data-user-id=\"223577\">@Josef Urban</span> and Herman Geuvers: The Tactician: A Seamless, Interactive Tactic Learner and Prover for Coq<ul>\n<li>Abstract: We present Tactician, a tactic learner and prover for the Coq Proof Assistant. Tactician helps users make tactical proof decisions while they retain control over the general proof strategy. To this end, Tactician learns from previously written tactic scripts and gives users either suggestions about the next tactic to be executed or altogether takes over the burden of proof synthesis. Tactician’s goal is to provide users with a seamless, interactive, and intuitive experience together with robust and adaptive proof automation. In this paper, we give an overview of Tactician from the user’s point of view, regarding both day-to-day usage and issues of package dependency management while learning in the large. Finally, we give a peek into Tactician’s implementation as a Coq plugin and machine learning platform.</li>\n<li>Proceedings paper: <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_17\">https://link.springer.com/chapter/10.1007/978-3-030-53518-6_17</a></li>\n<li>Project website: <a href=\"https://coq-tactician.github.io\">https://coq-tactician.github.io</a></li>\n<li>This seems to be the project I used to call TacticToe for Coq (discussed in <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/Paper.3A.20Tactic.20Learning.20and.20Proving.20for.20the.20Coq.20Proof.20Assista\">this Zulip thread</a>).   I'm glad they gave its own name!  I've been talking privately with Lasse, and it looks like there are some good things coming out of this project.  From the abstract, it seems that they have both improved the system and have been trying this system out with users of Coq.  I'd love to see what the feedback was!</li>\n</ul>\n</li>\n</ul>",
        "id": 204418930,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250171
    },
    {
        "content": "<ul>\n<li>16:45–17:00 CEST (UCT+2) Yutaka Nagashima: Simple Dataset for Proof Method Recommendation in Isabelle/HOL (Dataset Description)<ul>\n<li>Abstract: Recently, a growing number of researchers have applied machine learning to assist users of interactive theorem provers. However, the expressive nature of underlying logics and esoteric structures of proof scripts impede machine l earning practitioners from achieving a large scale success in this field. In this data showcase, we present a simplified dataset that represents essence of tactic-based interactive theorem proving in Isabelle/HOL. Our simple data format allows machine learning practitioners to test their machine learning algorithms for proof tactic recommendation in Isabelle/HOL, even if they are unfamiliar with theorem proving.</li>\n<li>Proceedings paper: <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_21\">https://link.springer.com/chapter/10.1007/978-3-030-53518-6_21</a></li>\n<li>This project has been discussed before in <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/Paper.3A.20Simple.20Dataset.20for.20.2E.2E.2E.20Isabelle.2FHOL\">this Zulip thread</a>.</li>\n</ul>\n</li>\n</ul>",
        "id": 204418965,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250188
    },
    {
        "content": "<ul>\n<li>17:00–17:15 CEST (UCT+2) Thibault Gauthier: Tree Neural Networks for HOL4<ul>\n<li>Abstract: We present an implementation of tree neural networks within the proof assistant HOL4. Their architecture makes them naturally suited for approximating functions whose domain is a set of formulas. We measure the performance of our implementation and compare it with other machine learning predictors on the tasks of evaluating arithmetical expressions and estimating the truth of propositional formulas.</li>\n<li>Proceedings paper: <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_18\">https://link.springer.com/chapter/10.1007/978-3-030-53518-6_18</a></li>\n</ul>\n</li>\n</ul>",
        "id": 204419054,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250232
    },
    {
        "content": "<ul>\n<li>17:15–17:30 CEST (UCT+2) <span class=\"user-mention\" data-user-id=\"257492\">@Bartosz Piotrowski</span> and <span class=\"user-mention\" data-user-id=\"223577\">@Josef Urban</span> Guiding Connection Tableau by Recurrent Neural Networks<ul>\n<li>Abstract: We present an experiment on applying a sequence-to-sequence recurrent neural system for learning clause choices in the extension steps in the connection tableau proof calculus. The neural system encodes a sequence of literals (or clauses) from a current branch from a partial proof tree to a hidden state (represented as a real vector); using it the system selects a clause for extending the proof tree. We describe the data used for the training, the training setup and the results. We compare the recurrent neural approach with another learning system -- gradient boosted trees. We present also an experiment in which the neural system does not select the next clause for the extension step, but tries to encode it from the available logical symbols, which is in a sense a conjecturing task.</li>\n<li>Proceedings paper: <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_23\">https://link.springer.com/chapter/10.1007/978-3-030-53518-6_23</a></li>\n</ul>\n</li>\n</ul>",
        "id": 204419133,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250256
    },
    {
        "content": "<ul>\n<li>17:30–17:45 CEST (UTC+2) <span class=\"user-mention\" data-user-id=\"223577\">@Josef Urban</span> First Datasets and Experiments with Neural Conjecturing<ul>\n<li>Abstract: We describe several datasets and first experiments with creating conjectures by neural methods. The datasets are based on the Mizar Mathematical Library processed in several forms and the problems extracted from it by the MPTP system and proved by the E prover using the ENIGMA guidance. The conjecturing experiments use the Transformer architecture and in particular its GPT-2 implementation.</li>\n<li>Proceedings paper: <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-53518-6_24\">https://link.springer.com/chapter/10.1007/978-3-030-53518-6_24</a></li>\n<li>See <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/Papers.20on.20Neural.20Conjecturing\">this Zulip thread</a> for a lot of interesting discussion on this project and a similar one by the N2Formal team.</li>\n</ul>\n</li>\n</ul>",
        "id": 204419159,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595250267
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/CICM.20Machine.20Learning.20and.20Theorem.20Proving.20Session/near/204418895\">said</a>:</p>\n<blockquote>\n<ul>\n<li>15:00–16:00 CEST (UTC+2) <span class=\"user-mention silent\" data-user-id=\"239426\">Christian Szegedy</span>: (Invited Talk) A Promising Path Towards Autoformalization and General Artificial Intelligence<ul>\n<li>No abstract but looks looks to be quite provocative.  I'd attend just to see this.</li>\n</ul>\n</li>\n</ul>\n</blockquote>\n<p>I just try to be a conservative realist, but many perceive my views as provocative. In the past year my expectations have been only adjusted up rather than down.</p>",
        "id": 204459847,
        "sender_full_name": "Christian Szegedy",
        "timestamp": 1595270759
    },
    {
        "content": "<p>I just realized that <span class=\"user-mention\" data-user-id=\"239426\">@Christian Szegedy</span>'s invited talk also has a(n) (invited) paper here: <a href=\"http://link-springer-com-443.webvpn.fjmu.edu.cn/chapter/10.1007%2F978-3-030-53518-6_1\">http://link-springer-com-443.webvpn.fjmu.edu.cn/chapter/10.1007%2F978-3-030-53518-6_1</a><br>\nActually, I realize now this paper comes from the preprint on the <a href=\"https://sites.google.com/view/holist/home\">HOList website</a> on which we've already had a fruitful discussion (flamewar???) in <a href=\"#narrow/stream/113488-general/topic/AI.20and.20theorem.20proving/near/177462760\">this Zulip conversation</a>.  It is a very interesting read.</p>",
        "id": 204613185,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595372711
    },
    {
        "content": "<p>For what it is worth, I also have high hopes for autoformalization and other applications of machine learning to the understanding of mathematics.  So many things which have come out in the last year alone could be directly applied to the task (advances in language modeling, reinforcement learning, symbolic reasoning, and program synthesis to name a few).  It's pretty exciting stuff!</p>",
        "id": 204613206,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595372728
    },
    {
        "content": "<p>I still, however, find it difficult to believe that any computer agent in the next 10 years is going to be able to \"understand\" and formalize my math research.  :)  I'll guess we will have to wait and see...</p>",
        "id": 204613218,
        "sender_full_name": "Jason Rute",
        "timestamp": 1595372737
    }
]