[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"249373\">Stanislas Polu</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/AITP.202020/near/210139173\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> hi hi! To follow-up on your question. Anybody who has applied State of the Art technology to code generation knows how useful are comments in code to train models to translate from informal prompts to usable code. If I was to make one recommendation for the Lean community, that would be to comment Lean code as much as conceivably possible. Future ML experts will thank you for that :)</p>\n</blockquote>\n<p>I hadn't heard about anything like this before and I'm curious: are there particular kinds of comments that are especially useful?</p>",
        "id": 210252489,
        "sender_full_name": "Reid Barton",
        "timestamp": 1600258682
    },
    {
        "content": "<p>There is quite a variety of sorts of comments in mathlib, for example:</p>\n<ul>\n<li>technical comments about local choices made to work around a bug or limitation in Lean</li>\n<li>comments within tactic blocks that give the reader a sense of the structure of the argument, without having to load the proof in an IDE</li>\n<li>declaration-level \"docstring\" comments, mainly on definitions, or on particularly complicated or well-known lemmas</li>\n<li>module-level docstrings which give an overview of the contents of a module, any relevant implementation decisions, local notations, etc.</li>\n<li>\"library notes\" which explain the reason for some pattern (usually a technical one related to the workings of Lean in particular) which can be referenced throughout mathlib</li>\n</ul>",
        "id": 210253003,
        "sender_full_name": "Reid Barton",
        "timestamp": 1600258959
    },
    {
        "content": "<p>I would like to use this as an excuse to fill my forthcoming mathlib PRs with comments so hopefully the answer is going to be \"everything is useful\" ;-)</p>",
        "id": 210253067,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1600258984
    },
    {
        "content": "<p>I was imagining commenting long proofs</p>",
        "id": 210253116,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1600259010
    },
    {
        "content": "<p>One line comments saying where we're going</p>",
        "id": 210253138,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1600259020
    },
    {
        "content": "<p>I always wondered whether there was anything to be gained from (hypothetical) docstrings like</p>\n<div class=\"codehilite\"><pre><span></span><code><span class=\"c\">/-</span><span class=\"cm\">- The canonical &quot;swap&quot; isomorphism between `α × β` and `β × α`. -/</span>\n<span class=\"n\">def</span> <span class=\"n\">prod_comm</span> <span class=\"o\">(</span><span class=\"n\">α</span> <span class=\"n\">β</span> <span class=\"o\">:</span> <span class=\"kt\">Type</span><span class=\"bp\">*</span><span class=\"o\">)</span> <span class=\"o\">:</span> <span class=\"n\">α</span> <span class=\"bp\">×</span> <span class=\"n\">β</span> <span class=\"err\">≃</span> <span class=\"n\">β</span> <span class=\"bp\">×</span> <span class=\"n\">α</span> <span class=\"o\">:=</span> <span class=\"o\">[</span><span class=\"bp\">...</span><span class=\"o\">]</span>\n</code></pre></div>\n\n\n<p>that wasn't already obvious from the type, but now I can see that it might teach a machine reader something about the meaning of the English words \"canonical\" and \"swap\"!</p>",
        "id": 210253380,
        "sender_full_name": "Reid Barton",
        "timestamp": 1600259131
    },
    {
        "content": "<p>Well if the AI can do something useful with copyright and author information comments then we're all set on that front.</p>",
        "id": 210253605,
        "sender_full_name": "Reid Barton",
        "timestamp": 1600259270
    },
    {
        "content": "<p>Kevin you asked about Stacks project crossreferences--I guess any time one of your lemmas overlaps in content with a Stacks project item (but isn't contained in a more specific item) then you should link the lemma to the item.</p>",
        "id": 210255682,
        "sender_full_name": "Reid Barton",
        "timestamp": 1600260341
    },
    {
        "content": "<p><strong>Everything is useful</strong></p>",
        "id": 210266352,
        "sender_full_name": "Stanislas Polu",
        "timestamp": 1600265225
    },
    {
        "content": "<p>More precisely, </p>\n<ul>\n<li>Comments inlined in proofs would help alignment between local informal hints and actual proof code.</li>\n<li>Declaration-level comments even if trivial would provide precious alignement between informal and formal definitions or theorem statements.</li>\n<li>Module level docstrings that provide an overview are very probably useful as well</li>\n</ul>\n<p>I think intuitively, any comment that relate to some mathematical knowledge, even if trivial has a good chance to be leverageable in a useful way.</p>\n<p>I have less to say about \"technical comments\" about Lean or specific work-arounds but you shouldn't feel like they would hurt anything.</p>",
        "id": 210267200,
        "sender_full_name": "Stanislas Polu",
        "timestamp": 1600265563
    },
    {
        "content": "<p>I think a very useful type of comment that does not really exists that much in Lean today would be a high-level summary of the proof strategy as part of the declaration-level docstring. But I also appreciate the fact that this may not be very natural for mathlib contributors to provide those.</p>",
        "id": 210267902,
        "sender_full_name": "Stanislas Polu",
        "timestamp": 1600265845
    },
    {
        "content": "<p>You say this but I suspect that when mathematicians write lean they very much know the high level summary of the proof strategy. These are not like the \"heavy refl\" or crush tactics of program verification</p>",
        "id": 210273913,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1600268165
    },
    {
        "content": "<p>Yeah, I mostly meant it might generally feel repetitive or useless to them to state it in plain english, as it does not seem to happen a lot.</p>",
        "id": 210274435,
        "sender_full_name": "Stanislas Polu",
        "timestamp": 1600268383
    },
    {
        "content": "<p>People don't see it done, so they don't do it. The teaching materials I write are full of comments.</p>",
        "id": 210287828,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1600274188
    }
]