[
    {
        "content": "<p>I'd like to share with folks here about our recent work, Minerva (<a href=\"https://ai.googleblog.com/2022/06/minerva-solving-quantitative-reasoning.html\">blog post</a>, <a href=\"https://storage.googleapis.com/minerva-paper/minerva_paper.pdf\">paper</a>): a language model that can reason mathematics, general science in natural language, using step-by-step reasoning.  Some remarkable achievements with this model:</p>\n<p>1) 51% acc on MATH, a math competition dataset, which was predicted to happen in 2025.<br>\n2) 65% acc in 2022 Poland’s National Math Exam which is more than the national average! <br>\n3) 30% acc on “undergrad” problems in physics, biology, chemistry, economics, etc. <br>\n4) 82% on GCSE Mathematics - this is a UK exam for 16 years old taken by about 700K students each year.</p>\n<p>You can find some example solutions at <a href=\"https://minerva-demo.github.io/\">sample explorer</a>. </p>\n<p>Appreciate any comments, questions, or other feedback!</p>",
        "id": 288240590,
        "sender_full_name": "Yuhuai Tony Wu",
        "timestamp": 1656726033
    },
    {
        "content": "<p>One clear limitation is the lack of verification with natural language models, and especially when it comes to proofs. But I'm optimistic to make use of the <a href=\"https://arxiv.org/abs/2205.12615\">autoformalization abilities of these models</a> to help verify, and further provide feedback signals to ground meanings etc.</p>",
        "id": 288240826,
        "sender_full_name": "Yuhuai Tony Wu",
        "timestamp": 1656726388
    },
    {
        "content": "<p>Nice work <span class=\"user-mention\" data-user-id=\"240875\">@Yuhuai Tony Wu</span>!</p>",
        "id": 288274480,
        "sender_full_name": "Jason Rute",
        "timestamp": 1656773931
    },
    {
        "content": "<p>This is very impressive. Some of the solutions in the samples are really good!</p>",
        "id": 288278381,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1656779239
    }
]