[
    {
        "content": "<p>In general, the <a href=\"https://cmsa.fas.harvard.edu/tech-in-math/\">Harvard New Technologies in Mathematics Seminar</a> is focusing this semester on topics related to interactive theorem proving and machine learning.  There have already been recorded talks by Josef Urban, Christian Szegedy, and others.</p>",
        "id": 228588099,
        "sender_full_name": "Jason Rute",
        "timestamp": 1614777099
    },
    {
        "content": "<p>Today's talk is by me.  In that talk, which is in 7 hours, at 3pm EST (UTC-5) on Zoom, I'm going to discuss our machine learned Lean <code>gptf</code> tactic and the PACT method we use to train the current version.  There will be a demo. Here is <a href=\"https://cmsa.fas.harvard.edu/3-3-2021-new-tech-in-math/\">the abstract and Zoom link</a>. I also think it will be recorded and put on YouTube.  I think the best place to discuss this will be at the <a class=\"stream\" data-stream-id=\"274007\" href=\"/#narrow/stream/274007-lean-gptf\">#lean-gptf</a> stream (but we will be happy to field questions anywhere).</p>",
        "id": 228588850,
        "sender_full_name": "Jason Rute",
        "timestamp": 1614777415
    },
    {
        "content": "<p>As for my talk, the <a href=\"https://www.youtube.com/watch?v=EXpmbAfBNnw\">video</a> is up on YouTube and the slides are <a href=\"https://cmsa.fas.harvard.edu/wp-content/uploads/2021/03/LeanStep-Talk-New-Technology-in-Mathematics-Seminar.pdf\">here</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"EXpmbAfBNnw\" href=\"https://www.youtube.com/watch?v=EXpmbAfBNnw\"><img src=\"https://i.ytimg.com/vi/EXpmbAfBNnw/default.jpg\"></a></div>",
        "id": 229042528,
        "sender_full_name": "Jason Rute",
        "timestamp": 1614987293
    },
    {
        "content": "<p>We'd love for you to try out the tool.  Join the discussion at <a class=\"stream\" data-stream-id=\"274007\" href=\"/#narrow/stream/274007-lean-gptf\">#lean-gptf</a> (or go straight to <a href=\"https://github.com/jesse-michael-han/lean-gptf\">https://github.com/jesse-michael-han/lean-gptf</a> for setup instructions.)</p>",
        "id": 229042667,
        "sender_full_name": "Jason Rute",
        "timestamp": 1614987371
    },
    {
        "content": "<p>Tomorrow there is a <a href=\"https://cmsa.fas.harvard.edu/1-26-2022-new-technologies-in-mathematics/\">talk</a> at the New Technologies in Mathematics Seminar that some might find interesting.<br>\nIt is given by Alex Davies from Deepmind and titled \"Machine learning with mathematicians\"<br>\n<a href=\"https://harvard.zoom.us/j/99651364593?pwd=Q1R0RTMrZ2NZQjg1U1ZOaUYzSE02QT09\">Zoom link</a> (ID: 99651364593)<br>\nPassword: cmsa</p>",
        "id": 269278138,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1643126465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> asked a good question at this talk about what sort of mathematical objects are representable in a neural network (NN).  Here is my response to him (edited for clarity).  I don't have a blog, but he thought it should be more widely shared.</p>\n<p>In short, if it can be represented on a computer in a practical way, it likely can be represented in a neural network.  But some structures are more easy than others.  Here are some examples:</p>\n<ul>\n<li><em>Real numbers</em>: A fixed sized array of real numbers is the easiest thing for a NN to work with both for input and output.  (But even here, we assume they can be well represented as floating point numbers, so they can't be astronomically large or microscopically small or microscopically close together, at least not without additional rescaling.)</li>\n<li><em>Categorical values</em>: A fixed list of labels (e.g. red-green-blue, up-down-left-right, Z mod p for a fixed p) is also easy to represent.  For input, you can just assign each label a vector (this is called an embedding and the NN can learn the embedding for you--it's also basically equivalent but more efficient than one-hot encoding if you have heard of that).  For output, this is also fairly standard.  The NN makes a probability distribution over all the labels.  </li>\n<li><em>Boolean values</em>: These are a special case of categorical values, but can be handled even more easily and efficiently.</li>\n<li><em>Complex numbers</em>:  These can be represented just as pairs of real numbers (for imaginary and real parts).</li>\n<li><em>Images</em>: There are good NN architectures for representing 2d images, or any 2-D grid of vectors which is \"picture-like\" (meaning the rows and columns represent evenly spaced positions in the plane).</li>\n<li><em>Matrices</em>: A lot of mathematical objects can be represented as matrices.   On one hand this is really easy to represent since it is just an array of reals (or bools or categorical values), but also many practical matrices may be huge and sparse.  This presents challenges.  There are frameworks for dealing with sparce arrays in NNs which may help here.  (Also see about manifolds below.)</li>\n<li><em>Integers</em>: Integers can be tricky.  Sometimes it is best to just treat them as reals.  Other times it is best to think of them as categorical values (but that can get tricky if your integers don't fall in a fixed list).  There are other representations as well for integers using sin and cos functions that make it easy for the network to compare the relative distance of two integers (c.f. <a href=\"https://kazemnejad.com/blog/transformer_architecture_positional_encoding/\">positional encodings</a>).</li>\n<li><em>Points in a manifold with group structure</em>: While I said you can represent complex numbers as real and imaginary parts, you could also represent it as the magnitude and argument, but note for the argument a naive representation from 0 to 2pi would treat arguments of .01 and 2pi -.01 quite differently.  Hopefully, the NN would adapt, but there is also a growing body of literature of representing manifold data (where the manifold has a group structure) in a way which represents its symmetries.  For example, there are nice ways to represent points on a sphere.  The main property you want your NN to have in this case is that if you rotate the input then the output will be the same (the NN is invariant to rotations) or the output will be similarly rotated (the NN is equivariant to rotations). The speaker next week is an expert on this topic.</li>\n<li><em>Graphs</em>: As you saw from Alex’s talk, there are good architectures for working with medium size directed graphs as input.  These are called graph neural networks.  A lot of data, like trees or logical formulas can be represented as graphs if you think about it the right way.</li>\n<li><em>Sequences</em>: Arbitrary length sequences (including time series data) can be represented as input or output with sequence models like recurrent neural networks or transformers.</li>\n<li><em>Unordered sets</em>: A set can be represented as a sequence, but also some architectures like Transformers are actually set models already. (Transformer encoders are invariant under permutations.  They only become sequence models through the addition of positional encodings.)</li>\n<li><em>Symbolic/Text data</em>: A special case of sequence-to-sequence models is where the input is just text or symbols.  This isn't always the most refined way to input data, but it is one of the most flexible.  It is a great catch-all for working with symbols, formulas, terms, sequence data, structured data, and the like.  Also, the Transformer sequence models are some of the most powerful NN architectures around.</li>\n<li><em>Other</em>:  Basically a neural network isn't much more than a differential function and all these architectures are quite composable.  While it is good when possible to take advantage of established architectures, it is entirely possible to invent a new NN component for a special use case.  Again, I think any data which is representable on a computer can be put into a NN with a bit of work.</li>\n</ul>",
        "id": 269685787,
        "sender_full_name": "Jason Rute",
        "timestamp": 1643344818
    },
    {
        "content": "<p>Great list! Some other stuff off the top of my head:</p>\n<ul>\n<li>Differential equations: <a href=\"https://github.com/SciML/DiffEqFlux.jl\">https://github.com/SciML/DiffEqFlux.jl</a></li>\n<li>Not sure if that's exactly what you mean by representable, but real function fixed points: <a href=\"http://implicit-layers-tutorial.org/deep_equilibrium_models/\">http://implicit-layers-tutorial.org/deep_equilibrium_models/</a></li>\n</ul>",
        "id": 269687348,
        "sender_full_name": "Zygimantas Straznickas",
        "timestamp": 1643346411
    },
    {
        "content": "<p>i usually think of them as graphs (if finite/discrete i/o) or flows (if smooth/manifold)</p>",
        "id": 269693718,
        "sender_full_name": "Alok Singh (S1'17)",
        "timestamp": 1643352541
    },
    {
        "content": "<p>A lot of the things on this list are a very long way from the mathematical objects I think about in practice (eg abstract rings, infinite topological groups, vector spaces over an arbitrary field). Does this matter?</p>",
        "id": 269697934,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1643356196
    },
    {
        "content": "<p>What I took away from the talk (and this list) is that we should try to find invariants that are on the list (e.g. dimension, Euler-characteristic, etc...) when working with such abstract objects that you mention.</p>",
        "id": 269699892,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1643357421
    },
    {
        "content": "<p>Part of the talk was explaining how DeepMind helped Geordie Williamson make progress on the combinatorial invariance conjecture about Khazdan-Lustzig polynomials. That was quite impressive.</p>",
        "id": 269700069,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1643357536
    },
    {
        "content": "<p>Yes I talked to Geordie about the work recently. It certainly is impressive!</p>",
        "id": 269700559,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1643357869
    },
    {
        "content": "<p>In cohomology of algebraic varieties (the field of maths that I really care about) there are dozens of integers floating around: Betti numbers, Hodge numbers, dimension of subspace of algebraic classes, Euler characteristic, Kodaira dimension, etc...</p>\n<p>What I don't know is: how easily can we produce huge datasets of examples? And if we can, how do we make sure that these examples are \"generic\" instead of all belonging to \"the easy subset\"?</p>",
        "id": 269701356,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1643358349
    },
    {
        "content": "<p>This is clearly a big obstacle. It's not a coincidence that those people investigated knot theory and combinatorics. Only a tiny proportion of maths satisfies the requirements of having numerical invariants that are easy to compute for lots of examples.</p>",
        "id": 269701653,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1643358512
    },
    {
        "content": "<p>I agree -- this is the main problem with the method. Computing torsion in cohomology of Shimura varieties of dimension greater than one is very painful. Theorems get proved about these things by the pencil and paper crowd more often than examples are computed by the computer algebra crowd.</p>",
        "id": 269703042,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1643359298
    },
    {
        "content": "<p>It is certainly the case that for this line of work, you need to find areas of math which are amenable to computer representations and gathering large numbers of examples.  It's hard for me to know how realistic this is.  I've seen enough databases of mathematical objects both gathered by crowdsourcing (e.g. OEIS) and brute force enumeration (e.g. databases of all groups up to some size) that I think for some areas of math it is an untapped resource.  (My old area of math however specifically dealt with uncomputable objects, so not as much one can do there. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>)</p>",
        "id": 269725941,
        "sender_full_name": "Jason Rute",
        "timestamp": 1643371834
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/New.20Technologies.20in.20Mathematics.20Seminar.20at.20Harvard/near/269701356\">said</a>:</p>\n<blockquote>\n<p>What I don't know is: how easily can we produce huge datasets of examples? And if we can, how do we make sure that these examples are \"generic\" instead of all belonging to \"the easy subset\"?</p>\n</blockquote>\n<p>The authors discuss this in the appendix (and it is the little detail that I really think shows they are thinking about this approach carefully).  Indeed, you have to be careful since whatever dataset you pick will have statistical biases.  (And ML models are statistical models.)  For example, if your dataset is all groups up to order 1 million, then 99% have order 1024. <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span>   The trick the authors mention is to gather lots of different datasets, specifically looking for ones likely to generate counterexamples.  Then (if feasible) rerun your analysis on each of these datasets, retraining the model from scratch.  For example, If you are working with groups, you may want to also work with a database of simple groups (or even subfamilies of simple groups like cyclic groups), or families of commutative groups, or a database of groups with more diverse orders.  One thing Alex said was a missed opportunity was once they found their family of counterexamples to their knot conjecture, they could have made that into its own dataset and re-trained the model on that adversarial dataset.</p>",
        "id": 269727642,
        "sender_full_name": "Jason Rute",
        "timestamp": 1643372783
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/New.20Technologies.20in.20Mathematics.20Seminar.20at.20Harvard/near/269727642\">said</a>:</p>\n<blockquote>\n<p>For example, if your dataset is all groups up to order 1 million, then 99% have order 1024.</p>\n</blockquote>\n<p>While I get the point you are making I would guess that 99% of groups of order at most 1 million will have order <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><msup><mn>2</mn><mrow><mo stretchy=\"false\">⌊</mo><msub><mrow><mi>log</mi><mo>⁡</mo></mrow><mn>2</mn></msub><mo stretchy=\"false\">(</mo><mn>1000000</mn><mo stretchy=\"false\">)</mo><mo stretchy=\"false\">⌋</mo></mrow></msup></mrow><annotation encoding=\"application/x-tex\">2^{\\lfloor\\log_2(1000000)\\rfloor}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.888em;\"></span><span class=\"mord\"><span class=\"mord\">2</span><span class=\"msupsub\"><span class=\"vlist-t\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.888em;\"><span style=\"top:-3.063em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mopen mtight\">⌊</span><span class=\"mop mtight\"><span class=\"mop mtight\"><span class=\"mtight\">l</span><span class=\"mtight\">o</span><span class=\"mtight\" style=\"margin-right:0.01389em;\">g</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.1944em;\"><span style=\"top:-2.2341em;margin-right:0.0714em;\"><span class=\"pstrut\" style=\"height:2.5em;\"></span><span class=\"sizing reset-size3 size1 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2659em;\"><span></span></span></span></span></span></span><span class=\"mopen mtight\">(</span><span class=\"mord mtight\">1000000</span><span class=\"mclose mtight\">)⌋</span></span></span></span></span></span></span></span></span></span></span></span> <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 269756589,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1643385044
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/New.20Technologies.20in.20Mathematics.20Seminar.20at.20Harvard/near/269701356\">said</a>:</p>\n<blockquote>\n<p>In cohomology of algebraic varieties (the field of maths that I really care about) there are dozens of integers floating around: Betti numbers, Hodge numbers, dimension of subspace of algebraic classes, Euler characteristic, Kodaira dimension, etc...</p>\n</blockquote>\n<p>You'd be interested in Yang-Hui He's series of work, summarized in the recent slides:<br>\n<a href=\"https://dl3.pushbulletusercontent.com/NAms43DGGWVf7s3Q6MRpE0lB70zUbDJq/slides_He.pdf\">https://dl3.pushbulletusercontent.com/NAms43DGGWVf7s3Q6MRpE0lB70zUbDJq/slides_He.pdf</a><br>\n\"Universes as Big Data, or, Machine-Learning Mathematical Structures\"<br>\nHis work <del>isn't cited in DeepMind's main Nature paper, but</del> is cited in this commentary <a href=\"https://www.nature.com/articles/d41586-021-03512-4\">https://www.nature.com/articles/d41586-021-03512-4</a> (edit: it's cited in both)</p>\n<p>By the way, as a mathematician I find the peer review opinions (published with the Nature paper as supplementary material) quite informative: <a href=\"https://dl3.pushbulletusercontent.com/d27MoJhGAfW82vzBRFybShB1vaoYWUTM/5_6159202253170279593.pdf\">https://dl3.pushbulletusercontent.com/d27MoJhGAfW82vzBRFybShB1vaoYWUTM/5_6159202253170279593.pdf</a></p>",
        "id": 269757414,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1643385391
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/New.20Technologies.20in.20Mathematics.20Seminar.20at.20Harvard/near/269727642\">said</a>:</p>\n<blockquote>\n<p>For example, if your dataset is all groups up to order 1 million, then 99% have order 1024.</p>\n</blockquote>\n<p>Has anyone counted them weighted by 1/#Aut? May help with training as well.</p>",
        "id": 269757668,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1643385489
    },
    {
        "content": "<p>Geordie Williamson is currently speaking about his collaboration with DeepMind at UOregon's colloquium: <a href=\"https://math.uoregon.edu/seminars/colloquium\">https://math.uoregon.edu/seminars/colloquium</a><br>\nHe's really into neural nets ...<br>\n\"Representation theorists should understand matrices. I stare at these (weight) matrices, and I can't understand them.\"</p>",
        "id": 269821581,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1643414872
    }
]