[
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2201.04600\">https://arxiv.org/abs/2201.04600</a></p>\n<blockquote>\n<p>Symbolic regression, i.e. predicting a function from the observation of its values, is well-known to be a challenging task. In this paper, we train Transformers to infer the function or recurrence relation underlying sequences of integers or floats, a typical task in human IQ tests which has hardly been tackled in the machine learning literature. We evaluate our integer model on a subset of OEIS sequences, and show that it outperforms built-in Mathematica functions for recurrence prediction. We also demonstrate that our float model is able to yield informative approximations of out-of-vocabulary functions and constants, e.g. bessel0(x)≈sin(x)+cos(x)πx√ and 1.644934≈π2/6. An interactive demonstration of our models is provided at this https URL.</p>\n</blockquote>",
        "id": 268135807,
        "sender_full_name": "Zygimantas Straznickas",
        "timestamp": 1642266513
    },
    {
        "content": "<p>Nice!  I’ve been curious what Lample has been up to.</p>",
        "id": 268141120,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642273295
    },
    {
        "content": "<p>I don't expect their setup (with an upper bound for recurrence degree) or a normal human to be able to guess the $10000 sequence or recurrence relations from games like this one in <em>Winning Ways</em>, but it also <a href=\"https://twitter.com/Junyan_Xu/status/1482268934413987840\">does no good on the look-and-say sequence</a> with recurrence degree 1. Probably their operator family isn't powerful enough to express runlength.<br>\n<a href=\"/user_uploads/3121/cQUCGUbY1am4fBsxIyiHIszJ/image.png\">image.png</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/Junyan_Xu/status/1482268934413987840\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/1e84c1837d0daf58fbcaf79a73896dbc1b4692a3/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313031303034373231383933323434313038392f47776254786e6d745f6e6f726d616c2e6a7067\"></a><p><a href=\"https://twitter.com/GuillaumeLample\">@GuillaumeLample</a> look and say sequence: <a href=\"https://t.co/LT6sH8I3KM\">https://twitter.com/Junyan_Xu/status/1482268934413987840/photo/1</a></p><span>- Junyan Xu (@Junyan_Xu)</span><div class=\"twitter-image\"><a href=\"https://t.co/LT6sH8I3KM\"><img src=\"https://uploads.zulipusercontent.net/08f5d5ebed54a0b6919d30ed5bff9e6b4e7a295d/68747470733a2f2f7062732e7477696d672e636f6d2f6d656469612f464a4954765a42584d414d5563384a2e6a70673a7468756d62\"></a></div></div></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/cQUCGUbY1am4fBsxIyiHIszJ/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/cQUCGUbY1am4fBsxIyiHIszJ/image.png\"></a></div>",
        "id": 268194802,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1642351729
    },
    {
        "content": "<p>yeah I tried it with a sequence which had come up in my research and it didn't get it (I gave it 20 strictly increasing positive integer terms all of which were odd and it predicted even numbers for the next three, the first one of which was not greater than the last of my inputs). But this is very much an experimental science! As a number theorist if I see a conjectural formula for my sequence which is 96% right then as far as I'm concerned it's wrong, whereas I would imagine that people who work in less black and white areas might have different opinions.</p>",
        "id": 268195109,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642352130
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span> <a href=\"#narrow/stream/219941-Machine-Learning.20for.20Theorem.20Proving/topic/New.20paper.3A.20transformers.20for.20symbolic.20regression/near/268194802\">said</a>:</p>\n<blockquote>\n<p>it also <a href=\"https://twitter.com/Junyan_Xu/status/1482268934413987840\">does no good on the look-and-say sequence</a> with recurrence degree 1.</p>\n</blockquote>\n<p>Do they represent the input sequence in decimal?  The look and say sequence would be quite difficult for a human if given in any base but decimal (and without giving the sequence name).   1, 9, 17, 649, 37521, 103561, 2921617, 153949833, …   Also it is a hard sequence to write a formula for this sequence, even in decimal, without string operations (which I don’t think they use in this paper).</p>",
        "id": 268227255,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642394687
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> Does your sequence have a nice formula (or do you think/hope it does)?  I think this system is only designed to give short formulas right now.  Also, as a design choice they decided to have it give solutions even if it doesn't find an exact fit.  For some cases (like floats in physics) I could see this being useful.  But for math, I agree usually an approximate solution is meaningless, and you probably should just interpret it as saying \"no solution found\".  I could also imaging the increasing and odd issue are also consequences of that, if it is optimizing for the wrong thing (like say least squares regression) when it can't find an exact fit.  (I still need to read the paper, so I might be mistaken on my understanding of how this works.)</p>",
        "id": 268228143,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642395689
    },
    {
        "content": "<p>I also wonder if there is any feedback mechanism where the model looks at the output and scores how well it thinks it follows the pattern.  That would be a way for it to catch say the increasing and odd issue, but I don't think many ML models do this sort of thing.</p>",
        "id": 268228314,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642395846
    },
    {
        "content": "<p>My expression had a closed form involving valuations of factorials. I'm just about to go to an airport but a simpler example might be: let a(n) be the number of powers of 2 showing up in the prime factorisation of factorial(n).</p>",
        "id": 268237645,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642406301
    },
    {
        "content": "<p>Looking at the paper, the (integer section of the) model only supports expressions inductively defined by operations <code>abs, sqr, sign, relu, add, sub, mul, intdiv, mod</code>. So it will fail on a recurrence that can't be generated this way. And using their currentl method, adding more operations will likely increase training time exponentially.</p>\n<p>(also, fun language-model-engineering detail: they're representing integers  in base 10000)</p>",
        "id": 268298438,
        "sender_full_name": "Zygimantas Straznickas",
        "timestamp": 1642441321
    },
    {
        "content": "<p>Yeah the operations are too restricted, and I think in a world with Codex, they should try something Turing complete, maybe assembly, and use their transformer to generate (or \"synthesize\") programs that generates the input sequence, instead of just formulas. Since <span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> mentioned the base, I looked and found that b=10000 is what they use, and as a result their vocabulary has ~10000 words. In regards to look-and-say, b=10000 is worse than b=10 but better than a random base like 2, but indeed even for b=10 there isn't a simple formula. Look-and-say has asymptotic doubly-exponential growth as a integer sequence, but their output doesn't capture this, probably because the input is integer instead of float.</p>",
        "id": 268311473,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1642450304
    }
]