[
    {
        "content": "<p>I'm starting a new thing. As I find new (or old) papers on AI/ML for TP, I'm going to start threads to discuss them (and I encourage others to do the same).</p>",
        "id": 187735208,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581203587
    },
    {
        "content": "<p>Here is the first: <a href=\"https://arxiv.org/abs/2002.00423\" target=\"_blank\" title=\"https://arxiv.org/abs/2002.00423\">An Experimental Study of Formula Embeddings for Automated Theorem Proving in First-Order Logic</a> by Ibrahim Abdelaziz, Veronika Thost, Maxwell Crouse, Achille Fokoue (from IBM research and related organizations).</p>",
        "id": 187735210,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581203596
    },
    {
        "content": "<p>I'm currently <a href=\"#narrow/stream/113488-general/topic/AI.20and.20theorem.20proving.20continued/near/184820369\" title=\"#narrow/stream/113488-general/topic/AI.20and.20theorem.20proving.20continued/near/184820369\">enjoying</a> <a href=\"#narrow/stream/113488-general/topic/AI.20and.20theorem.20proving.20continued/near/184820370\" title=\"#narrow/stream/113488-general/topic/AI.20and.20theorem.20proving.20continued/near/184820370\">reading</a> the recent papers by this group.  I like their systematic approach, and this paper seems to be a continuation of that trend.  They look at numerous approaches to creating vector embeddings of first order formulas and show the trade-offs in term of both completion rate and runtime.</p>",
        "id": 187735215,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581203609
    },
    {
        "content": "<p>I just started reading it, but I'd love to hear the opinions of others, especially the Google folks and <span class=\"user-mention\" data-user-id=\"249373\">@Stanislas Polu</span>.  We've already had debates on this Zulip (I guess some of them private) about if GNNs are worth it or if other sequence models (like LSTMs on the sequence of tokens) are better.</p>",
        "id": 187735411,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581203972
    },
    {
        "content": "<p>Also, if anyone here knows the authors, feel free to encourage them to join the discussion...</p>",
        "id": 187735697,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581204476
    },
    {
        "content": "<p>The game is RL of first order theorem proving in their TRAIL system (not to be confused with the TRAIL patterns approach which is also evaluated in this paper).  They test on the Mizar and TPTP datasets.  I think the idea is that each agent is given test theorem statements (but not proofs) to train on with RL and then they are tested on the test sets.  (I don't know if the agents do any additional reinforcement learning from the test sets, but since it is RL, this should be clarified.)  I think the agents create a policy over actions (but I'm not yet clear on the action space).  Since the goal is proving theorems the algorithms are graded on the total numbers of problems solved (completion rate) in a fixed period of time (100 seconds per problem I think).</p>",
        "id": 187737965,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581209192
    },
    {
        "content": "<p>The winner according to them is their TRAIL formula embedding algorithm which was first introduced in <a href=\"https://arxiv.org/abs/1911.02065\" target=\"_blank\" title=\"https://arxiv.org/abs/1911.02065\">this paper</a>.  That algorithm has other advantages like being able to be trained on one theory database and still doing reasonable when tested on another (in the same logical system at least).</p>",
        "id": 187738020,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581209339
    },
    {
        "content": "<p>However it should be noted that all the systems tested did worse than the Beagle prover baseline.</p>",
        "id": 187738073,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581209419
    },
    {
        "content": "<p>Actually, let me correct myself here.  I no longer think they are saying TRAIL patterns are the clear winner.  Instead they highlight the TRAIL patterns approach and the message passing neural networks (MPNN) approach which is a type of graph neural network.</p>",
        "id": 187738760,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581210791
    },
    {
        "content": "<p>Ok, I carefully read the paper and understand it much better.  They are evaluating a number of embedding methods for use in a RL-based, first-order logic, saturation-based theorem prover.  The embedding methods take a formula and turn it into a 64-dimensional vector.  After this, an attention-based mechanism handles the action selection.  Basically all the details of the RL and attention based prover are in the <a href=\"https://arxiv.org/pdf/1911.02065.pdf\" target=\"_blank\" title=\"https://arxiv.org/pdf/1911.02065.pdf\">original TRAIL paper</a>.  The only difference here is the change of the embedding function.  They experiment with two categories of embeddings: (1) hand-designed feature embeddings and (2) graph neural network embeddings.</p>",
        "id": 187768104,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273096
    },
    {
        "content": "<p>Before I talk about the details, it should be mentioned that they were careful not to assume a fixed vocabulary.  It should also be mentioned that the problem they are trying to solve has a trade-off of speed-to-compute and quality of results.  An algorithm which is fast to compute means that in a tree search one can explore more nodes.  An algorithm which givens a better embedding can significantly improve the selection of nodes meaning the tree search goes down fewer dead-ends before reaching the goal.  This is the trade-off they are exploring.  This is good since a lot of the work on Graph Neural Networks has been done on \"offline\" problems where the one doesn't have to do a tree search and this speed concern doesn't matter.</p>",
        "id": 187768107,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273109
    },
    {
        "content": "<p>As for the \"hand-designed\" feature embeddings the key is that they are not learned, but instead given by an algorithm.  However, it should be noted that these algorithms are sufficiently general that they could be applied to a number of problem domains and logics I believe.  (Neither is a bag-of-words or TIDF approach, but that is a good example of the type of approach they are going for.)  One hand-engineered approach is term-walks.  This features in a lot of the work of <span class=\"user-mention\" data-user-id=\"223577\">@Josef Urban</span> and co-authors.   (However, one complaint I have is that most of these papers argument the term-tree walks by other features like the top-level symbol and the term length.  I think if the authors of this paper added all these additional features to both of the hand-designed feature embeddings they might get better results.)  The other hand-designed features are the TRAIL patterns from the original <a href=\"https://arxiv.org/pdf/1911.02065.pdf\" target=\"_blank\" title=\"https://arxiv.org/pdf/1911.02065.pdf\">TRAIL paper</a>.  This approach is one of the best overall mostly because of its speed, but it does create a higher number of useless steps.  (I don't quite understand why the term-walk approach, which is even faster and has few useless steps does worse.  I am missing something?)</p>",
        "id": 187768144,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273126
    },
    {
        "content": "<p>As for the GNN embeddings, they try a number of graph neural net architectures.  The winner seems to be MPNN which I think is an extension of the graph convolutional neural network with edge embeddings as well as node embeddings.  I think, but am not certain, that the HOList GNN is more like a GCN without edge embeddings.  I don't know about NeuroSAT off-hand.  Also they tried out there GLSTM-MPNN from their other paper (which is a combination of a tree-LSTM and a MPNN).  It does well, but not as well as the MPNN.  The MPNN (as with the other GNNs) does take a lot longer to compute than the hand-designed features, which is a tradeoff.</p>",
        "id": 187768158,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273186
    },
    {
        "content": "<blockquote>\n<p>The most simple embedding approaches consider the formula as a sequence of characters and use one-hot encodings followed by standard sequence encodings like LSTMs [Alemi /et al./, 2016]. This encoding does not capture much logical information, not even syntactically. </p>\n</blockquote>\n<p>I wish they included approaches like the kind listed above as a baseline.  This is like what two of the HOList papers do with wave nets.  It is also the approach being advocated by <span class=\"user-mention\" data-user-id=\"249373\">@Stanislas Polu</span>.  Tree-recursive neural nets seem like another natural approach to try.</p>",
        "id": 187768160,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273197
    },
    {
        "content": "<p>In the end the TRAIL patterns and the MPNN do fairly similarly on this problem.  However, as the authors mention this is really dependent on a number of factors.  As I see it here are some advantages of the \"hand-crafted\" features:</p>\n<ul>\n<li>For problems like saturation-style proving that involve a lot of steps, they are really fast.</li>\n<li>They generalize well to other domains since they are not fit to a particular vocabulary or theory.  (I think this needs to be given serious concern, because when we deploy these systems in practice, they will encounter symbols and theories they have never seen before.)</li>\n<li>They aren't differential architectures and hence the other parts of the system can be fast ML models, like gradient boosted trees.  (That would be interesting if the authors tried to replace their transformer architecture with a gradient booted tree.)</li>\n<li>They probably would do even better on this problem set if given a few additional hand-engineered features (like those used in <a href=\"https://arxiv.org/pdf/1805.07563.pdf\" target=\"_blank\" title=\"https://arxiv.org/pdf/1805.07563.pdf\">https://arxiv.org/pdf/1805.07563.pdf</a> or <a href=\"https://arxiv.org/pdf/1903.03182.pdf\" target=\"_blank\" title=\"https://arxiv.org/pdf/1903.03182.pdf\">https://arxiv.org/pdf/1903.03182.pdf</a>).</li>\n<li>They would be easy to implement in an ITP (like Lean).</li>\n</ul>",
        "id": 187768162,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273207
    },
    {
        "content": "<p>Here are the advantages of the GNN features (and in general fully learned features).</p>\n<ul>\n<li>One doesn't have to consider the logic involved too closely and these can generalize to a number of domains (although they need to be retrained for each setting).</li>\n<li>For problems like tactic based proving where there is more time needed to perform an action, having better embeddings is probably much more important than the increase in speed in computing the embeddings.</li>\n<li>This is still a new field and there is probably a lot of improvement that could be made in designing and speeding-up these neural architectures.</li>\n</ul>",
        "id": 187768163,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273215
    },
    {
        "content": "<p>Some additional thoughts:</p>\n<ul>\n<li>Also, one can consider creating \"tactics\" for saturation solvers which handle the routine steps, but let the agent guide the high-level decisions.  For example <span class=\"user-mention\" data-user-id=\"116045\">@Jesse Michael Han</span> has a paper out where he guides a SAT solver at a much higher level reducing the number of times one has to compute graph embeddings.</li>\n<li>I'd love to see an analysis like this done for HOList.  I guess with the current <a href=\"https://github.com/aahadley/deepmath-jupyter/blob/master/HOLJup.ipynb\" target=\"_blank\" title=\"https://github.com/aahadley/deepmath-jupyter/blob/master/HOLJup.ipynb\">high-level DeepHOL Python API</a>, this wouldn't be hard to code.  Joint collaboration of IBM Research and Google Research? :)</li>\n<li>The work of Google on <a href=\"https://arxiv.org/abs/1909.11851\" target=\"_blank\" title=\"https://arxiv.org/abs/1909.11851\">reasoning in embedding space</a>, and the work of DeepMind on <a href=\"https://arxiv.org/abs/1911.08265\" target=\"_blank\" title=\"https://arxiv.org/abs/1911.08265\">Mu Zero</a> shows that it is might be possible to avoid computing embeddings for the tree search.  I think this would even be more true in FOL where the steps are more routine and the next states are more predictable (I think).  In that case, one could do the tree search only in embedding space which would significantly speed things up.  Or one can do the tree search in neural embedding space + hand-designed features like TRAIL patterns.  This would maybe provide a best of both words approach (at least in settings like saturation proving where executing each step is really quick).</li>\n</ul>",
        "id": 187768206,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581273266
    },
    {
        "content": "<p>To add some clarity to my last comment, if one follows something like mu zero, it would still use a neural embedding for the root of the tree search (and maybe for select nodes), but overall one can avoid computing an expensive embedding for each step of the search.  For tactic proving, one can even avoid executing the tactics for some of the tree search.  This would make the GNN embeddings more cost efficient.</p>",
        "id": 187768807,
        "sender_full_name": "Jason Rute",
        "timestamp": 1581274547
    }
]