[
    {
        "content": "<p><a href=\"https://arxiv.org/abs/2004.06997\" title=\"https://arxiv.org/abs/2004.06997\">Prolog Technology Reinforcement Learning Prover (System Description)</a>, by Zsolt Zombori, Josef Urban, and Chad E. Brown</p>",
        "id": 195641909,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588116626
    },
    {
        "content": "<p>I'll write more after I've read the paper.</p>",
        "id": 195641935,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588116651
    },
    {
        "content": "<p>Abstract:<br>\nWe present a reinforcement learning toolkit for experiments with guiding automated theorem proving in the connection calculus. The core of the toolkit is a compact and easy to extend Prolog-based automated theorem prover called plCoP. plCoP builds on the leanCoP Prolog implementation and adds learning-guided Monte-Carlo Tree Search as done in the rlCoP system. Other components include a Python interface to plCoP and machine learners, and an external proof checker that verifies the validity of plCoP proofs. The toolkit is evaluated on two benchmarks and we demonstrate its extendability by two additions: (1) guidance is extended to reduction steps and (2) the standard leanCoP calculus is extended with rewrite steps and their learned guidance. We argue that the Prolog setting is suitable for combining statistical and symbolic learning methods. The complete toolkit is publicly released.</p>",
        "id": 195642515,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588117210
    },
    {
        "content": "<p>Code/Environment: <a href=\"https://github.com/zsoltzombori/plcop\" title=\"https://github.com/zsoltzombori/plcop\">https://github.com/zsoltzombori/plcop</a></p>",
        "id": 195642650,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588117338
    },
    {
        "content": "<p>I think at first glance it is a gym-like environment.  We need to start making a list of these.</p>",
        "id": 195642712,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588117414
    }
]