[
    {
        "content": "<p>Reposted from <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a> </p>\n<p>Hello everyone! I've been looking into autoformalization with natural language processing (NLP), and it seems the task has some promising tracks shown in <a href=\"https://arxiv.org/abs/1912.02636\">Qingxiang Wang’s works</a> but is generally not feasible yet.  From what I’m getting, the main problem is the context holes, which are “easy to understand/derive\" by readers. </p>\n<p>So I think we could instead start with a simpler task, namely porting proofs from other ITPs, e.g. Isabelle, to Lean. This should be more feasible since contexts in ITPs are mostly explicit. We could think of the problem input as some Lean statement (manual input), and the statement’s proof to the goal but in Isabelle. The output will be the statement’s proof in Lean.</p>\n<p>As in <a href=\"https://arxiv.org/abs/2102.06203\">Jesse Han’s PACT paper</a>, we saw the usefulness of GPTs in providing Lean proof. We can further integrate Isabelle proof embedding into such a network to increase the proof success rate, and hopefully, it will realistically help with porting. This should also be possible as GPT is known to work well even when integrated with image embeddings.</p>\n<p>It might be a stretch, but if this works well enough, the network can be the exploration guidance module in <a href=\"https://doi.org/10.1007/978-3-030-53518-6_1\">Szegedy’s  A Promising Path Towards Autoformalization and General Artificial Intelligence</a>.</p>\n<p>So what do you think about the idea? I'm still new to everything, so please do correct me if I said something wrong.</p>",
        "id": 266985377,
        "sender_full_name": "Tung Tran",
        "timestamp": 1641413796
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 267349865,
        "sender_full_name": "Kunhao Zheng",
        "timestamp": 1641722220
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297668\">@Tung Tran</span>  I've been meaning to respond to your post for a while.  I think you are exploring the right ideas, but there are also a lot of \"devil in the details\" issues.  What you propose is a sort of ITP translation which is a well researched topic, but also a difficult area.</p>",
        "id": 268842367,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642771945
    },
    {
        "content": "<p>One way to translate from one ITP A to another B is to (1) align the logics (by starting with an ITP A with a weaker logic than B, or by adding axioms to B to make it stronger than A), (2) get the kernel level proofs from ITP A, and (3) automatically translate them into proofs of ITP B.  For example, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> translated all of MetaMath's <a href=\"http://set.mm\">set.mm</a> into Lean.  (<a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general/topic/Prime.20number.20theorem.20in.20lean\">#general &gt; Prime number theorem in lean</a>)  The catch (and this is huge!) is that the translation is a mess:</p>\n<ol>\n<li>The resulting Lean proofs are computer generated and don't look anything like idiomatic Lean.</li>\n<li>Every Metamath definition is duplicated.  For example, there are now two definitions of natural numbers, the translated MM definition and the Lean definition.</li>\n<li>There is no obvious way to check which definitions align, and proving they align is labor intensive and subtle.  (You can show that the MM definitions for natural number and Lean satisfy the same uniqueness property, namely they are initial.  This doesn't show they are equal, since in Lean, isomorphic types are rarely provably equal, but it does allow you to carefully transfer a <a href=\"http://set.mm\">set.mm</a> theorem about the MM natural numbers and it's operations, to a theorem just using the Lean the natural numbers and it's operations.   For example, Mario did this with <a href=\"#narrow/stream/113488-general/topic/Prime.20number.20theorem.20in.20lean/near/168472336\">Dirichlet's theorem</a>, giving a verified version in pure Lean---albiet with an ugly auto-translated MM proof.)</li>\n<li>Many definitions only partially align.  For example, it is possible different definitions of subtraction handle dividing by 0 differently.  Different definitions of limit might use very different notation and parameters.  (Lean's limits use filters.)  Groups are handled very differently in various ITPs.  This makes aligning even more challenging, and prevents say putting MM's Prime Number Theorem into a statement of pure Lean.</li>\n</ol>",
        "id": 268842382,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642771953
    },
    {
        "content": "<p>What about on the black-box ML side of things, like you propose?  Just throwing Isabelle training data into GPT-f would likely help GPT-f's ability to construct Lean theorems, but of course it is good to test this (and it brings up a bunch of questions about if such a system is auto-translating or just learning better representations through more similar data).   A more targeted strategy like you propose would also be interesting, and I encourage you too look at <a href=\"https://arxiv.org/abs/2006.03511\">Unsupervised Translation of Programming Languages</a> which uses unsupervised translation methods to translate C++ to Python and Python to C++.  It creates pretty good, idiomatic translations of simple functions.  But note it doesn't create translations of projects.  In particular, the functions are all \"self contained\" in that they only refer to other standard library functions in C++ and Python.  However, in ITPs, it is likely if one is trying to translate a theorem A in Isabelle, then A also probably depends on other lemmas and definitions which need to be translated.  Definitions are (for all the same reasons in auto-translation) very difficult to translate idiomatically since concepts don't perfectly align.  Also, it isn't necessarily clear when a lemma or definition needs to be translated verse it already existing in some form in the library.</p>",
        "id": 268842393,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642771959
    },
    {
        "content": "<p>Of course, these challenges are just that: challenges.  Hopefully, well designed ML systems can come along and help solve them.  I've been saying for a while (and you can find my musings here on Zulip) that this task is one ripe for ML to help solve.</p>",
        "id": 268842396,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642771961
    },
    {
        "content": "<p>Also see: <a href=\"https://www.sciencedirect.com/science/article/pii/S0747717118300348\">https://www.sciencedirect.com/science/article/pii/S0747717118300348</a></p>",
        "id": 268842579,
        "sender_full_name": "Jason Rute",
        "timestamp": 1642772053
    }
]