[
    {
        "content": "<p>I thought his was an interesting tweet thread:</p>\n<ul>\n<li><a href=\"https://twitter.com/TaliaRinger/status/1568516530153062402\">https://twitter.com/TaliaRinger/status/1568516530153062402</a></li>\n<li><a href=\"https://twitter.com/TaliaRinger/status/1568516797435084800\">https://twitter.com/TaliaRinger/status/1568516797435084800</a></li>\n<li><a href=\"https://twitter.com/TaliaRinger/status/1568517033595404288\">https://twitter.com/TaliaRinger/status/1568517033595404288</a></li>\n</ul>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/TaliaRinger/status/1568516530153062402\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/61c13706af6dbc999f7f6587de7982d82b686fcd/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313431373932313239353938383133373938352f704b4d52396e4d555f6e6f726d616c2e6a7067\"></a><p>When it comes to classical versus constructive logics, I want to reiterate that I think automation is currently easier in the former only because historically, people working on automation have focused on taking advantage of the benefits the former offer, but not the latter</p><span>- Talia Ringer 🌻🪬 (@TaliaRinger)</span></div></div><div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/TaliaRinger/status/1568516797435084800\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/61c13706af6dbc999f7f6587de7982d82b686fcd/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313431373932313239353938383133373938352f704b4d52396e4d555f6e6f726d616c2e6a7067\"></a><p>There are deep tradeoffs between these logics that make it easier to synthesize proofs from scratch in classical logics, but easier to reuse, repair, and generalize existing proofs to derive new proofs in constructive logics</p><span>- Talia Ringer 🌻🪬 (@TaliaRinger)</span></div></div><div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/TaliaRinger/status/1568517033595404288\"><img class=\"twitter-avatar\" src=\"https://uploads.zulipusercontent.net/61c13706af6dbc999f7f6587de7982d82b686fcd/68747470733a2f2f7062732e7477696d672e636f6d2f70726f66696c655f696d616765732f313431373932313239353938383133373938352f704b4d52396e4d555f6e6f726d616c2e6a7067\"></a><p>It's in my view a mistake to approach automation the same way for both kinds of logics, rather than to build automation that exploits the strengths of each</p><span>- Talia Ringer 🌻🪬 (@TaliaRinger)</span></div></div>",
        "id": 298117922,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662807087
    },
    {
        "content": "<p>It is interesting from the standpoint of building AI for theorem proving  of course.</p>",
        "id": 298117936,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662807097
    },
    {
        "content": "<p>But I also thought the line \"easier to reuse, repair, and generalize existing proofs to derive new proofs in constructive logics\" was interesting.  My (probably butchered) understanding is that Talia works on <a href=\"https://dependenttyp.es/pdf/repair.pdf\">proof repair</a>, the idea that we should be able automate fixing formal proofs if say the statement slightly changes or some downstream dependency changes.  Their methods of automation (if I understand correctly) exploit purely constructive proofs which don't use the axiom of choice, the law of excluded middle, function extentionality, uniqueness of identity proofs, (nor even the univalence axiom).  Now I don't know enough about this to understand the points, but I think it is an interesting discussion, since I'm sure Lean would like automated proof repair in the future, and Lean also relies heavily on some forms of classical logic (and has UIP built in).</p>",
        "id": 298117949,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662807106
    },
    {
        "content": "<p>Of course Talia's work I think is more focused on formal verification than formal mathematics.  Nonetheless, Lean 4 will also be very focused on formal verification of all the code written in Lean 4.  Leo has said that few people, even those interested in Lean 4 for its formal verification abilities, find that constructive logic is that necessary, but I think it will be interesting to see how this plays out.</p>",
        "id": 298117969,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662807116
    },
    {
        "content": "<p>Of course, it may be also that many proofs are constructive enough to easily repair since one doesn't go out of their way to jam in LEM where it doesn't naturally need to be, so I think it comes down to how essential constructive math is for proof repair.</p>",
        "id": 298117977,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662807119
    },
    {
        "content": "<p>Or it may be that there are other forms of classical proof repair that just haven't be found yet.  I think Talia's work was also focused on term proofs instead of tactic proofs (but I could be wrong).  Terminal <code>simp</code>s are one example of self-repairing tactics.  Also, I still think that ML could go a long way in this area since it is really a question of making simple fixes to a proof which are obvious to say a human (and Talia seems to agree at least in part, given their current research focus).  ML may blunt some of the constructive/classical, term-proof/tactic-proof pain, but maybe I'm being naive or overly optimistic.  (I'd be interested in Talia's thoughts on this, but I think they run in different online forum circles. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 298120196,
        "sender_full_name": "Jason Rute",
        "timestamp": 1662808030
    },
    {
        "content": "<p>Talia's AITP talk starts at 2:57:30 or so at <a href=\"http://grid01.ciirc.cvut.cz/~mptp/zoomaitp/2022-09-06/video1597589493.mp4\">this video link</a>.</p>",
        "id": 298123955,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1662809955
    }
]