[
    {
        "content": "<p>It is well known that</p>\n<ol>\n<li>There are many different ITPs.</li>\n<li>Each have their own libraries, some covering certain areas of mathematics more than others.</li>\n<li>It is very difficult (near impossible) to use a theorem from one ITP library in another.</li>\n</ol>",
        "id": 230267747,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755736
    },
    {
        "content": "<p>I know there have been projects to transpile the theorems from one ITP into another, for example <a href=\"https://arxiv.org/pdf/1910.10703.pdf\">Mario’s project to transpile MetaMath’s Dirichlet’s theorem into Lean</a>.  There have also been projects to put all ITP theorems into a common framework.</p>",
        "id": 230267757,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755745
    },
    {
        "content": "<p>There however are a few problems with such approaches:</p>\n<ol>\n<li>It is only possible to directly transpile from one ITP to another if the logic of the source ITP is weaker than the logic of the target ITP (possibly through the addition of axioms).  </li>\n<li>The translations aren’t much use without alignment.  For example, a transpilation of <a href=\"http://us.metamath.org/mpegif/1p1e2.html\">Metamath’s</a> <code>(1 + 1) = 2</code> into Lean would be something of the form <code>mm.nat_add mm.one mm.one = (mm.two : mm.nat)</code>.  For this to be useful, one would have to also prove in Lean that <code>mm.nat = nat</code>, <code>mm.one = 1</code>, etc.  (Or worst, prove that <code>mm.nat</code> is just <em>isomorphic</em> to <code>nat</code>, so it would be even more work to transfer results.)</li>\n<li>The translations and alignments would be both ugly and brittle.  They wouldn’t be worth putting into say <code>mathlib</code>.</li>\n</ol>",
        "id": 230267763,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755754
    },
    {
        "content": "<p>Here is my (possibly rhetorical) question:</p>",
        "id": 230267776,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755763
    },
    {
        "content": "<p><strong>Is machine learning able to do ITP translation in a more robust way?</strong></p>",
        "id": 230267781,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755772
    },
    {
        "content": "<p>It seems to me that we have the technology currently to solve many parts of this problem, if not the whole problem.   Can we put all the parts together? Do we have enough data?</p>",
        "id": 230267787,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755784
    },
    {
        "content": "<p><strong>Machine Translation:</strong> Facebook AI’s recent <a href=\"https://ai.facebook.com/blog/deep-learning-to-translate-between-programming-languages/\">TransCoder</a> uses ML translation models to accurately translate between C++, Python, and Java. These models are nice in that they work on unaligned corpora.  Programming languages (and ITPs) share a lot of keywords which help to build such a translator.  (Here is a <a href=\"https://www.youtube.com/watch?v=xTzFJIknh7E\">nice video on how it works</a>, and an <a href=\"https://www.youtube.com/watch?v=trG8n6jtalU&amp;t=130s\">interview with the authors</a>.)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"trG8n6jtalU\" href=\"https://www.youtube.com/watch?v=trG8n6jtalU&amp;t=130s\"><img src=\"https://i.ytimg.com/vi/trG8n6jtalU/default.jpg\"></a></div><div class=\"youtube-video message_inline_image\"><a data-id=\"xTzFJIknh7E\" href=\"https://www.youtube.com/watch?v=xTzFJIknh7E\"><img src=\"https://i.ytimg.com/vi/xTzFJIknh7E/default.jpg\"></a></div>",
        "id": 230267810,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755793
    },
    {
        "content": "<p>It is not unreasonable, <em>assuming equivalent vocabulary exists in both ITPs</em>, to think that such a system could accurately translate the statement of a theorem, e.g. <a href=\"http://www.cse.unsw.edu.au/~kleing/top100/#90\">Stirling’s Formula</a>, from, say, Isabelle code</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>fact ∼ (λn. sqrt (2*pi*n) * (n / exp 1) ^ n :: real)\n</code></pre></div>\n<p>into Lean code</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"n\">filter.tendsto</span> <span class=\"o\">(</span><span class=\"bp\">λ</span> <span class=\"o\">(</span><span class=\"n\">n</span> <span class=\"o\">:</span> <span class=\"n\">ℕ</span><span class=\"o\">),</span> <span class=\"bp\">↑</span><span class=\"o\">(</span><span class=\"n\">n.factorial</span><span class=\"o\">)</span> <span class=\"bp\">-</span> <span class=\"n\">real.sqrt</span> <span class=\"o\">(</span><span class=\"mi\">2</span> <span class=\"bp\">*</span> <span class=\"n\">π</span> <span class=\"bp\">*</span> <span class=\"bp\">↑</span><span class=\"n\">n</span><span class=\"o\">)</span> <span class=\"bp\">*</span> <span class=\"o\">(</span><span class=\"bp\">↑</span><span class=\"n\">n</span> <span class=\"bp\">/</span> <span class=\"n\">real.exp</span> <span class=\"mi\">1</span><span class=\"o\">)</span> <span class=\"bp\">^</span> <span class=\"n\">n</span><span class=\"o\">)</span> <span class=\"n\">filter.at_top</span> <span class=\"o\">(</span><span class=\"bp\">𝓝</span> <span class=\"mi\">0</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>For short proofs, it might even be able to translate not only the theorem statement (and statement of the lemmas leading up to the theorem) but also the proofs as well.  However, that is more questionable.</p>",
        "id": 230267812,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755802
    },
    {
        "content": "<p>Similarly, we should be able to translate definitions (and maybe even notation?) from one ITP to another.</p>",
        "id": 230267819,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755810
    },
    {
        "content": "<p>It should be noted, however, that ITP libraries have 1/1000th of the data used to train TransCoder, so that is definitely a consideration.</p>",
        "id": 230267823,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755818
    },
    {
        "content": "<p><strong>Neural theorem proving</strong><br>\nAs it is well known now, there are a number of neural and machine learning theorem provers for most of the ITPs.</p>",
        "id": 230267826,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755826
    },
    {
        "content": "<p>As we translate lemmas from one ITP to another, we generate candidate lemmas in the target ITP, but we can’t be sure they are correct.  First, we must elaborate the new theorem statements to make sure they type check.  If they do, then we can use a neural theorem prover to try to find proofs.  Depending on the setup and the prover, we can even use other proposed lemmas as premises.  (For example, if the Isabelle library uses LemmaA to prove LemmaB, then we could try to use the Lean translation of LemmaA as a premise in the proof of the Lean translation of LemmaB.)  This way we can both generate an outline of a new area of math in Lean as well as start to fill in the proofs.</p>",
        "id": 230267830,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755835
    },
    {
        "content": "<p><strong>Reinforcement Learning of Theorem Proving</strong> It has been repeatedly shown that one can improve (or even train from scratch) a neural theorem prover with only statements of theorems.  Our translations (even if not all are correct), would be great candidates for such a reinforcement learning loop.  We would be effectively doubling (or more!) the size of our theorem training data.  Also, some libraries have a lot of simple theorems, e.g. arithmetic facts, identities, and real function inequalities.  These would make good training data.</p>",
        "id": 230267859,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755843
    },
    {
        "content": "<p><strong>Co-training</strong> It has been shown that training on multiple related tasks can improve a model more than training on just one task at a time.  Possibly one could get benefits out of training on all the ITPs at once, both for translation and theorem proving.  Also, theorem proving, and similar tasks, would help our model learn the semantics of the symbols, thereby making the translation better.</p>",
        "id": 230267872,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755850
    },
    {
        "content": "<p><strong>Clustering and alignment</strong> The same techniques for machine translation would also help to align theorems and definitions across libraries, which is of independent value.  It can also be used to cluster similar theorems both within and across libraries.</p>",
        "id": 230267875,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755857
    },
    {
        "content": "<p><strong>So many questions</strong></p>",
        "id": 230267888,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755866
    },
    {
        "content": "<p>There are still many questions, but unlike auto-formalization (which seems further from happening, and will require many major research breakthroughs) this seems more likely to being on the edge of possibility:</p>\n<ul>\n<li>Would this be useful to ITP library users if it was done?</li>\n<li>How much theorem data is needed?  Are there ways to get around data scarcity, such as co-training on related tasks, or pre-training the models?</li>\n<li>How would the model handle definitions which are not in the library?  For example, take the <a href=\"http://www.cse.unsw.edu.au/~kleing/top100/#5\">Isabelle version of the Prime Number Theorem</a>, <code>(λx. pi x * ln (real x) / real x) ⇢ 1</code> .   The prime-counting function <code>pi: nat -&gt; real</code> doesn’t exist in Lean (as far as I know), but it wouldn’t be difficult to define it.  More subtly, Lean doesn’t use the same sort of notation for convergence.  Ideally, one would not want a direct translation, but one in the Lean style.  (One idea is that one would translate not only a theorem, but all of the definitions used in that theorem, etc, but this requires a lot of thought to get right.)</li>\n<li>Would the translation be into fully elaborated Lean code or into human-style Lean source code?  Would it generate just theorem statements or whole Lean file sketches filled with <code>sorry</code>s?</li>\n<li>Would it make sense to also have a natural English mathematics as one of the languages being translated?  One could use arXiv, wikipedia, proof-wiki, etc.  The idea here is that the vocabulary of ITPs is borrowed from natural language math.  However, the danger is that this starts to get into auto-formalization which is much harder problem.</li>\n<li>How can type checking be used to improve the translations?   (It seems to me that one of TransCoder’s largest opportunities for improvement is by rewarding the agent for translations which both (1) compile, and (2) produce the same results.  Something similar can be done in theorem proving.)</li>\n<li>Since there should be many theorems which actually align perfectly between libraries, should we do this in multiple steps?  (1) Train a model to propose matching theorems between libraries, (2) have a human sort through the proposals for exact matches, (3) add those aligned examples to the training data.</li>\n<li>To make this project a reality, how much ITP engineering would have to happen and is there enough motivation to do it?  </li>\n<li>To be clear, to just naively generate proposed translations of all theorems for all pairs of ITPs would require almost no ITP engineering (assuming there is enough data to run something like TransCoder), since the theorem data already exists and we know how to extract it.  However, to check that the translations type-check, or running a neural theorem prover on the translations would require significant ITP integration, only some of which currently exists for the various ITPs?</li>\n</ul>",
        "id": 230267895,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755874
    },
    {
        "content": "<p>This is really just me publicly brainstorming, but if say Facebook AI, OpenAI, Google AI, or DeepMind (or an academic lab) wanted to pursue this project, I’d personally be quite ecstatic <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 230267900,
        "sender_full_name": "Jason Rute",
        "timestamp": 1615755879
    },
    {
        "content": "<p>I guess it would be interesting to be able to, in the middle of a Lean proof, say \"please port this goal to Isabelle/HOL and then try sledgehammer on it\". I don't think the fact that the logic is different should affect things here -- for basic concepts like sets and functions everything is going to be essentially the same.</p>",
        "id": 230276085,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615761702
    },
    {
        "content": "<p>This is not quite the same problem, but it would be definitely reduce my skepticism of this stuff if machine learning was able to convert between much simpler proof formats used in the SAT community.  e.g. automatically going between <a href=\"https://www.cs.utexas.edu/~marijn/publications/lrat.pdf\">LRAT</a> and <a href=\"https://arxiv.org/abs/1610.06229\">DRAT</a> proofs.</p>\n<p>I know virtually nothing about ML, but this problem seems challenging.  Another, more industrially relevant problems would be using ML to optimize combinatorial logic, e.g., to reduce the size or depth of terms.  My intuition is that these problems would be easier than reliable automation to do translations between higher level logics, and to translate not just definitions and proofs, but also translate tactics.</p>",
        "id": 230296444,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1615785437
    }
]