[
    {
        "content": "<p>Dear Colleagues,</p>\n<p>We're hiring up to five new faculty in computer science at the University of Virginia, including in software engineering, and including formal methods, even to include applications of formalized abstract mathematics in software engineering. We've got an exceptional environment for researchers in this area, including formal methods in CPS, verification of properties of deep neural networks at scale, and grounding programming languages concepts and methods in formalized mathematics of physical systems. If you have graduating PhD students are are just looking at new opportunities, please don't hesitate to contact me. I'm running the software engineering and languages part of our search. My email is <a href=\"mailto:sullivan@virginia.edu\">sullivan@virginia.edu</a>. Here also is a short version of our longer ad with a link to the whole story. Thank you.</p>\n<p>Kevin Sullivan<br>\n============</p>\n<p>Title: Five Tenure-Track Faculty Positions in CS at the University of Virginia </p>\n<p>The Department of Computer Science at the University of Virginia seeks 5 tenured or tenure-track faculty at all ranks with preference given to Artificial Intelligence and Machine Learning, Cyber-Physical Systems, Software Engineering, Systems, and Theory. Qualifications include an outstanding record of scholarship, an awarded or expected doctorate by the start date in computer science or equivalent, and a commitment to student mentoring, undergraduate and graduate teaching excellence, diversity, and professional service. Rank is dependent upon experience and qualifications.  </p>\n<p>Review of applications will begin on December 1, 2021 <br>\nPlease apply online at <a href=\"https://uva.wd1.myworkdayjobs.com/en-US/UVAJobs/job/Charlottesville-VA/Open-Rank-Faculty-Position-in-Computer-Science_R0028993\">https://uva.wd1.myworkdayjobs.com/en-US/UVAJobs/job/Charlottesville-VA/Open-Rank-Faculty-Position-in-Computer-Science_R0028993</a></p>",
        "id": 257575776,
        "sender_full_name": "Kevin Sullivan",
        "timestamp": 1634233428
    }
]