[
    {
        "content": "<p>This is a full-time program management position at Microsoft Research Redmond for working on Lean!<br>\n<a href=\"https://careers.microsoft.com/us/en/job/1225394/Senior-Program-Manager\">https://careers.microsoft.com/us/en/job/1225394/Senior-Program-Manager</a><br>\nFrom the link above:</p>\n<p>Come join a creative and passionate group of people who are working to revolutionize mathematics! We’re a team within Microsoft Research focused on powering formal mathematics with Lean, an open-source mathematical language and theorem proving platform. We’re looking for a Senior Program Manager with technical evangelism experience to join us.</p>\n<h1>Responsibilities</h1>\n<p>As a key member of our team, you’ll work with researchers, mathematicians, engineers, and writers to drive, evangelize, and support the Lean platform. As the Lean champion, you’ll bring the Lean user’s voice into every conversation. You’ll evangelize the platform with the user community and our academic and organizational partners. </p>\n<ul>\n<li>Partner within Microsoft Research and across university collaborators and the Lean user community to refine, drive, and deliver the roadmap. </li>\n<li>Translate ideas into reality by writing quality specifications and driving results throughout the development lifecycle.</li>\n<li>Engage with the user community to address questions and to develop new features. </li>\n<li>Expand the existing community by championing Lean. Present and promote the platform at conferences, workshops, and hackathons.</li>\n<li>Drive targeted engagements: Identify potential academic partnerships, define deliverables, and manage grants and honorariums. </li>\n<li>Drive feature development, ensuring implementation is aligned with goals and positioning. Demonstrate good judgment and earn trust by helping the team make tradeoffs based on requirements and operational excellence of the platform. </li>\n<li>Actively manage and maintain the backlog, prioritization, and the communication needed to assure features launch on time.</li>\n<li>Create educational artifacts, such as demos and code samples.</li>\n</ul>",
        "id": 265209814,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1639684102
    }
]