[
    {
        "content": "<p>The group of André Platzer, the Alexander von Humboldt Professor for Logic of Autonomous Dynamical Systems, in the Department of Informatics at KIT is recruiting a PhD student or postdoc (TVL E13, full-time). Our research develops the logical foundations for cyber-physical systems and practical theorem proving tools for analyzing and correctly building such systems, including the theorem prover KeYmaera X, verified runtime monitoring ModelPlex, verified compilation, and verified safe machine learning techniques. Our techniques are used to analyze the safety of autonomous cars, airplanes and collision avoidance protocols in aerospace applications, robotics, and train control.</p>\n<p>Key requirements for successful applications:</p>\n<ul>\n<li>Strong demonstrable commitment to research.</li>\n<li>Strong background in logic, formal methods, theorem proving, or programming language theory.</li>\n<li>Strong background in mathematics, physics, or engineering.</li>\n<li>Excellent M.Sc. degree in computer science, mathematics or related subjects.</li>\n<li>Proficiency in English, excellent speaking and writing skills.</li>\n<li>Experience in software development projects is a plus.</li>\n</ul>\n<p>The successful candidate is able to quickly get into new research areas and will be responsible for actively engaging in novel research questions, publishing and communicating research results, advising junior students, assisting in research grants, implementation of research results in formal methods tools, and demonstrating their applicability in cyber-physical systems applications.</p>\n<p>Faculty / Division:<br>\nAlexander von Humboldt Professor on Logic of Autonomous Dynamical Systems</p>\n<p>Institute:<br>\nInstitute of Information Security and Dependability (KASTEL)</p>\n<p>Starting Date: Immediately</p>\n<p>Contact Person: André Platzer <a href=\"https://lfcps.org/pub/job-ad.html\">https://lfcps.org/pub/job-ad.html</a></p>",
        "id": 289522633,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1657747208
    }
]