[
    {
        "content": "<h1>Work with me on the Yatima + Lean ecosystem</h1>\n<p>In Yatima Inc we want a verifiable and decentralized software future.<br>\nThat is why we want to leverage Lean to build an entire ecosystem of provable software.</p>\n<p>Our funding and application area is from the blockchain economy like Filecoin.<br>\nWe are committed to ensure that our technology will lead to social good and environmental sustainability.</p>\n<p>Everything we are making is open source. Good software comes from good communities. We are committed to giving back<br>\nbecause this would not be possible without the community in the first place.</p>\n<p>You are not on the clock. We do not monitor when you work. There is no timetables to submit.<br>\nYour work will be based around independence and asynchronous communication. </p>\n<h2>What will you do?</h2>\n<ul>\n<li>Build usefull libraries for the Lean + Yatima ecosystem (Http.lean, Parsec.lean, Nix.lean, Radiya.lean, ...).</li>\n<li>Support developement of the Yatima platform and parachain.</li>\n<li>Integrate Lean with WASM.</li>\n<li>Work on our Lean compatible kernel Radiya (Radyia.lean, <a href=\"http://radyia.rs\">radyia.rs</a>).</li>\n</ul>\n<h2>Who are you?</h2>\n<ul>\n<li>Independent. Can work without supervision and manage your own time.</li>\n<li>Curios and passionate about programming and theory.</li>\n<li>Interested in open source and decentralization.</li>\n<li>Capable of independently learning new skills to complete tasks.</li>\n</ul>\n<h2>What do we offer?</h2>\n<ul>\n<li>A fully remote contractor position with freedom to manage your own time and tasks.</li>\n<li>A competitive salary.</li>\n<li>Ability to work on cutting edge technology which may shape the future of computing.</li>\n<li>A collaborative, flat structured team of like minded engineers.</li>\n</ul>\n<h2>Contact</h2>\n<p>If you are interested contact me here or on email <a href=\"mailto:anders@yatima.io\">anders@yatima.io</a> <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> and we will take it from there. Including your CV is nice.</p>",
        "id": 277736188,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1649081435
    }
]