[
    {
        "content": "<p>Is there a code that proves Alexander's theorem from  knot theory</p>",
        "id": 320058671,
        "sender_full_name": "Michael Wahlberg",
        "timestamp": 1673173826
    },
    {
        "content": "<p>Hey! We are still pretty far from knot theory, but discussions are happening.</p>",
        "id": 320058801,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673173924
    },
    {
        "content": "<p>Also,  do we canonically have a definition of grids in Lean4 / Lean3</p>",
        "id": 320061483,
        "sender_full_name": "Michael Wahlberg",
        "timestamp": 1673175752
    },
    {
        "content": "<p>Pretty sure that no we don't</p>",
        "id": 320064556,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673177715
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> do you have a vision of knot theory in lean?</p>",
        "id": 320069413,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1673180708
    },
    {
        "content": "<p>I think knot theory doesn't actually need particularly careful design ahead of time. There are <em>many</em> ways to represent knots, and we would eventually want all of them, and none need to be especially privileged. If someone wants to write the definition of the Alexander polynomial in terms of grid diagrams, or the Jones polynomial in terms of planar diagrams (PD notation), then either of those are wonderful even in isolation.</p>\n<p>Later there will be theorems connecting them, and eventually connecting them to \"actual\" knots and Reidemeister moves.</p>",
        "id": 320141732,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1673232252
    },
    {
        "content": "<p>I had a go a while back at defining the Jones polynomial, and ended up unhappy with several different attempts at it... There is the usual tension that one wants things dependently typed (e.g. by the size of the boundary of a tangle, or even the named endpoints around the boundary of tangle) but then nothing works smoothly. :-)</p>",
        "id": 320141861,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1673232407
    },
    {
        "content": "<p><a href=\"#narrow/stream/113489-new-members/topic/knot.20theory\">Prior discussion</a></p>",
        "id": 320151100,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1673241960
    }
]