[
    {
        "content": "<p>For a little while now I've been looking at the implementation of the mathematics necessary to implement the constructions of code-based cryptography (and so necessarily coding theory and specifically linear codes). I wanted to check what specific to this we already had in mathlib. As far as I can tell, not lots?</p>",
        "id": 284600260,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654084427
    },
    {
        "content": "<p>(It feels like it would be substantially easier to focus on linear codes or at the least fixed-length codes rather than general coding theory.)</p>",
        "id": 284600402,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654084514
    },
    {
        "content": "<p>I'm interested in getting to the point where some of the bleeding-edge innovations that exist in code-based cryptography are relatively easy to formalise.</p>",
        "id": 284600456,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654084553
    },
    {
        "content": "<p>As you know, there is loads of linear algebra, but besides that, I don't think we have much in the direction of coding theory.</p>",
        "id": 284601963,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1654085421
    },
    {
        "content": "<p>Aye, the extensive linear algebra support is what makes this even a viable proposition.</p>",
        "id": 284607644,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654088544
    },
    {
        "content": "<p>I've been thinking again about this. The standard definition of a linear code of length n and dimension k is a k-dimensional subspace over n-tuples of a finite field. But I'm not quite sure of the best way to define that as a type.</p>",
        "id": 285393392,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654695866
    },
    {
        "content": "<p>Specifically I'm unsure about how to bundle in the information about the dimension.</p>",
        "id": 285393448,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654695887
    },
    {
        "content": "<p>You can also define it as the image of a matrix of rank k from k-tuples to n-tuples, and I guess this is also true over rings instead of a field which comes up in some applications.</p>",
        "id": 285393608,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654695937
    },
    {
        "content": "<p>But that matrix isn't unique.</p>",
        "id": 285393634,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654695949
    },
    {
        "content": "<p>Would appreciate some thoughts from people with experience of what kinds of definitions work well in Lean/mathlib.</p>",
        "id": 285393969,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696086
    },
    {
        "content": "<p>If you only care about the subspace and not the basis then why not just encode it as a pair consisting of a term of type <code>submodule F (fin n -&gt; F)</code> and a proof that the term has dimension <code>k</code>? Are you sure you want <code>k</code> to be part of the data?</p>",
        "id": 285393978,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696089
    },
    {
        "content": "<p>Well that's actually exactly what I had (though I mean, I guess that implicitly has k as a parameter?)</p>",
        "id": 285394431,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696259
    },
    {
        "content": "<p>But there's a number of ways I can think of having \"proof that the dimension is k\" some of which seem easier to work with than others</p>",
        "id": 285394479,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696289
    },
    {
        "content": "<p>Like do I want to state it in terms of finrank? Or doi want to say the there exists some non-singular linear map from ^k to ^n of which it is the image?</p>",
        "id": 285394682,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696359
    },
    {
        "content": "<p>Because I'm not clear on your applications I don't know if you want <code>code F</code> or <code>code F n</code> or <code>code F n k</code>. If you have <code>C : code F</code> then you can have <code>C.length : nat</code> and <code>C.dimension : nat</code>. If you have <code>C : code F n k</code> then different things become easier/harder. Mathematically it's \"all the same\", so perhaps the definition should be informed by what you want to do with these things. For example would it be convenient if two codes with different dimensions have the same type, for some reason, or does this buy you nothing? It all depends on what you're doing I guess.</p>",
        "id": 285394935,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696466
    },
    {
        "content": "<p>Essentially \"coding theory\", specifically linear error-correcting codes.</p>",
        "id": 285395014,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696501
    },
    {
        "content": "<p>So what are the key definitions and theorems which you envisage formalising? Perhaps that informs the answer.</p>",
        "id": 285395076,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696530
    },
    {
        "content": "<p>Conceptually two codes with different dimensions should probably be of different type</p>",
        "id": 285395091,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696536
    },
    {
        "content": "<p>Yeah so this is a good question - in general \"all of coding theory\" is too much for one person but I'd like to get to the point when I can state and prove standard results about Goppa codes, for instance.</p>",
        "id": 285395212,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696579
    },
    {
        "content": "<p>There's a number of constructions you can do to combine codes which might be illustratative</p>",
        "id": 285395278,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696612
    },
    {
        "content": "<p>The alg geom Goppa codes which use curves over finite fields, or the easier ones?</p>",
        "id": 285395319,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696629
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/KVIjo0aGkKGDg6ZPXKi5Bibi/4247d89a-3cdb-4f6a-b331-7f6c6c0d42de.jpg\">4247d89a-3cdb-4f6a-b331-7f6c6c0d42de.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/KVIjo0aGkKGDg6ZPXKi5Bibi/4247d89a-3cdb-4f6a-b331-7f6c6c0d42de.jpg\" title=\"4247d89a-3cdb-4f6a-b331-7f6c6c0d42de.jpg\"><img src=\"/user_uploads/3121/KVIjo0aGkKGDg6ZPXKi5Bibi/4247d89a-3cdb-4f6a-b331-7f6c6c0d42de.jpg\"></a></div>",
        "id": 285395322,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696630
    },
    {
        "content": "<p>The easier ones aye though I don't purely want to develop a theory of binary codes</p>",
        "id": 285395392,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696659
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/DXSGEqB-npbCuj1sUmCDSXZl/d1a90021-d238-44f8-8a57-96c86ae9b49a.jpg\">d1a90021-d238-44f8-8a57-96c86ae9b49a.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/DXSGEqB-npbCuj1sUmCDSXZl/d1a90021-d238-44f8-8a57-96c86ae9b49a.jpg\" title=\"d1a90021-d238-44f8-8a57-96c86ae9b49a.jpg\"><img src=\"/user_uploads/3121/DXSGEqB-npbCuj1sUmCDSXZl/d1a90021-d238-44f8-8a57-96c86ae9b49a.jpg\"></a></div>",
        "id": 285395440,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696678
    },
    {
        "content": "<p>This is the book I'm referring to: <a href=\"https://link.springer.com/book/10.1007/3-540-31703-1\">https://link.springer.com/book/10.1007/3-540-31703-1</a></p>",
        "id": 285395614,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696744
    },
    {
        "content": "<p>That construction of a \"diagonal concatenation\" has notation (C_0, C_1) but depends essentially on a choice of basis for the codes in question.</p>",
        "id": 285395618,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696746
    },
    {
        "content": "<p>Yes. I think the claim implicitly is that the choice of basis doesn't matter, it generates the same code?</p>",
        "id": 285395709,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696783
    },
    {
        "content": "<p>I think that's easily seen to be false?</p>",
        "id": 285395769,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696803
    },
    {
        "content": "<p>Possibly the same code up to linear isometry - sometimes people can be slightly vague about this.</p>",
        "id": 285395805,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696804
    },
    {
        "content": "<p>Sometimes a code isn't dependent on a choice of basis, sometimes it's defined with its generator matrix, sometimes it's defined as the kernel of a parity check matrix</p>",
        "id": 285396091,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654696917
    },
    {
        "content": "<p>I'm not an expert, but my reading of your screenshot is \"choose a basis (b1,...,bk) and (c1,...,ck) for your two codes, and then the space spanned by basis (b1,c1),...,(bk,ck) is the diagonal concatenation\", and this will clearly change if you change your basis.</p>",
        "id": 285396130,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654696924
    },
    {
        "content": "<blockquote>\n<p>Possibly the same code up to linear isometry</p>\n</blockquote>\n<p>OK so now you have introduced what look like three distinct concepts to me: (1) a subspace of F^n of dimension k (2) a subspace of F^n of dimension k equipped with a basis (3) a subspace of F^n of dimension k except that two subspaces are thought of as equal if they are equivalent in the sense of some kind of  linear isometry. Only one of these can be a <code>code</code> I guess. Do you want a <code>based_code</code> as well?</p>",
        "id": 285396526,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697074
    },
    {
        "content": "<p>Hmm - I thought about this but probably not? You want to be able to form propositions like \"this matrix G is a generator for code C\" though</p>",
        "id": 285396628,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697126
    },
    {
        "content": "<p>There's a notion of a code having a systematic form - \"every code C is linearly isometric to a code C' such that C' has a generator matrix of the form (Identity_n-k | A), for A a k by k matrix\".</p>",
        "id": 285396887,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697244
    },
    {
        "content": "<p>A generator matrix is just another way of thinking about a basis; you can't make that diagonal concatenation construction without having one though. So why not let <code>code n k</code> be a k-dimensional subspace of <code>fin n -&gt; F</code>, and then mimic the <code>basis</code> API in mathlib to do generator matrices?</p>",
        "id": 285396910,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697258
    },
    {
        "content": "<p>Generator matrices are probably better thought of as linear maps because we also care about their kernels.</p>",
        "id": 285397033,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697303
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"330967\">Wrenna Robson</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Coding.20theory.20and.20code-based.20crypography/near/285396887\">said</a>:</p>\n<blockquote>\n<p>There's a notion of a code having a systematic form - \"every code C is linearly isometric to a code C' such that C' has a generator matrix of the form (Identity_n-k | A), for A a k by k matrix\".</p>\n</blockquote>\n<p>Right -- that's just <code>code</code> language for some statement in linear algebra which we'll have already (basis of a subspace extends to basis of the whole space).</p>",
        "id": 285397057,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697317
    },
    {
        "content": "<p>Because there's a concept of the dual code (which is just the orthogonal space), and every generator matrix for C is a parity check matrix for its dual.</p>",
        "id": 285397121,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697358
    },
    {
        "content": "<p>Let me again stress that I'm no expert but we have vector spaces and we have bases, and it sounds to me like you can mimic what this looks like to make codes and based codes (or a basis for a code or a generator matrix for a code or whatever you want to call it).</p>",
        "id": 285397137,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697364
    },
    {
        "content": "<p>Yes I think so - really it's just linear algebra! - but there's a number of specific theorems which are either existing results with different names or more exotic things that only work in this specific context.</p>",
        "id": 285397244,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697412
    },
    {
        "content": "<p>How would you define \"k-dimensional subspace\"?</p>",
        "id": 285397301,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697436
    },
    {
        "content": "<p>Remark; if I've understood the material correctly, then the dual code will change when you make a linear isometry.</p>",
        "id": 285397325,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697448
    },
    {
        "content": "<p>possibly. A linear isometry between two codes C C' here btw is defined as a linear isometry on fin n -&gt; k which maps C into C' (so it preserves all distances).</p>",
        "id": 285397479,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697516
    },
    {
        "content": "<p>This is all under the Hamming metric usually although in some contexts more abstract metrics are involved - I'm ignoring that though.</p>",
        "id": 285397569,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697541
    },
    {
        "content": "<p>aah then I withdraw my claim :-)</p>",
        "id": 285397575,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697543
    },
    {
        "content": "<p>yes - in a sense I think that's part of why the definition is like that...</p>",
        "id": 285397646,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697573
    },
    {
        "content": "<p>I am a fool -- of course \"isometry\" will preserve distances. I would just make some random design decision and then get going. Start with <code>code n k</code> being a structure with two fields, the submodule and the proof it's got dimension k, and then try making examples and proving lemmas about them; you'll soon find out whether you've made the right decision.</p>",
        "id": 285397762,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697625
    },
    {
        "content": "<p>I think that this might reflect my formalisation technique, and I'm well aware that there are others that do things very differently. For example I had no idea about the \"best\" way to formalise schemes, but rather than spend any time trying to figure it out I just tried a random way with a couple of undergrads and we learnt from my mistakes. It took three goes to get it right. The same is happening with group cohomology right now, with a debate still running (search for recent posts by Amelia Livingston) about what the correct definition is, but I already supervised not one but two projects (one bachelors, one masters) both of which claimed to define group cohomology! I firmly believe in a \"try something and see\" approach.</p>",
        "id": 285398157,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654697796
    },
    {
        "content": "<p>Yeah I just - I did do this, I did start, I ran into some issues so I'm asking! As I say it's \"proof that it has dimension k\" that I'm really asking about.</p>",
        "id": 285398591,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654697993
    },
    {
        "content": "<p>I don't know the best (= best supported by the API) approach to that. Whenever I deal with finrank it seems oddly hard to work with.</p>",
        "id": 285398720,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654698036
    },
    {
        "content": "<p>I've been playing around defining and proving stuff in this area for a little while but every time I try and just make this basic definitions I seem to run aground into things. I suspect it would be easier with someone who also worked in this stuff to bounce ideas off but I don't have that luxury.</p>",
        "id": 285398969,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654698145
    },
    {
        "content": "<p>if \"finrank F C = k\" is the \"right\" choice I can work with that but my experience is definitely that there's a lot of pitfalls one can make, and I can think of several other definitions that might also work fine</p>",
        "id": 285400101,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1654698624
    },
    {
        "content": "<p>I think it's definitely morally the right choice, because you know a priori that the subspace is finite-dimensional. However there's a world of difference between that assertion and \"I have all the API I need\" :-) If you're missing API then you could try and farm it out, or just sorry it.</p>",
        "id": 285406670,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654701173
    },
    {
        "content": "<p>Morally the right choice is good enough for me!</p>",
        "id": 286357886,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655388736
    },
    {
        "content": "<p>Fwiw, there is a close connection to matroid theory here (codes are ‘represented matroids’, where the represented matroid is the one whose independent sets are the lin. Ind. sets of columns in the parity check matrix) and the matroid probably wants to have the dimension after the colon.</p>\n<p>But it’s you doing the work, not me!</p>",
        "id": 287036138,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1655895338
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329425\">@Peter Nelson</span> can you say more about this?</p>",
        "id": 287693134,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656409756
    },
    {
        "content": "<p>(I don't know anything about metroids.)</p>",
        "id": 287693889,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656410198
    },
    {
        "content": "<p>FWIW there is some debate whether or not a particular representation should be attached to a code or not, or whether it should be \"matrix-agnostic\".</p>",
        "id": 287693936,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656410239
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"303889\">@Alena Gusakov</span> gave a <a href=\"https://www.youtube.com/watch?v=A7b7dRvXOxg&amp;list=PLVZep5wTamMmqv34JnrNC2AgjfPoh_LN8&amp;index=8\">talk on formalising matroid theory</a> in the London Learning Lean seminar series.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"A7b7dRvXOxg\" href=\"https://www.youtube.com/watch?v=A7b7dRvXOxg&amp;list=PLVZep5wTamMmqv34JnrNC2AgjfPoh_LN8&amp;index=8\"><img src=\"https://uploads.zulipusercontent.net/ba74655f1eb017cf74c6ed0bdc187d3dcb3629e0/68747470733a2f2f692e7974696d672e636f6d2f76692f41376237645276584f78672f64656661756c742e6a7067\"></a></div>",
        "id": 287701660,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1656415281
    },
    {
        "content": "<p>I certainly like the matrix-agnostic approach. </p>\n<p>A matroid is an abstract system of ‘independent sets’ in a type, and when linearly represented, matroids are essentially linear codes. See Alena’s talk or mine on the same topic from Lean Together last year (on mobile - don’t have the link handy).</p>\n<p>My view on the colon makes sense even for codes though - because of the finite dimensionality, there is a canonical correspondence between a code and the dual of its dual. It is easy to set this correspondence up as equality if a code is a ‘subspace of F^(fin n), but if it is a ‘k-dimensional subspace of F^(fin n)’ then the dual code is an ‘n-(n-k)-dimensional subspace of F^(fin n)’, which is not equal because n-(n-k) is not defeq to k. This an an annoyance, but maybe there are advantages that make it worth it.</p>",
        "id": 287712760,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1656421591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"329425\">@Peter Nelson</span>: <a href=\"https://www.youtube.com/watch?v=FzJuoXy5cG0\">Formalising matroids</a> at Lean Together 2021<br>\n<a href=\"https://www.youtube.com/watch?v=FzJuoXy5cG0\">https://www.youtube.com/watch?v=FzJuoXy5cG0</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"FzJuoXy5cG0\" href=\"https://www.youtube.com/watch?v=FzJuoXy5cG0\"><img src=\"https://uploads.zulipusercontent.net/53780ab34c27675870288522fe4332d6a0f25896/68747470733a2f2f692e7974696d672e636f6d2f76692f467a4a756f5879356347302f64656661756c742e6a7067\"></a></div>",
        "id": 287714729,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1656422527
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"329425\">Peter Nelson</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Coding.20theory.20and.20code-based.20crypography/near/287712760\">said</a>:</p>\n<blockquote>\n<p>I certainly like the matrix-agnostic approach. </p>\n<p>A matroid is an abstract system of ‘independent sets’ in a type, and when linearly represented, matroids are essentially linear codes. See Alena’s talk or mine on the same topic from Lean Together last year (on mobile - don’t have the link handy).</p>\n<p>My view on the colon makes sense even for codes though - because of the finite dimensionality, there is a canonical correspondence between a code and the dual of its dual. It is easy to set this correspondence up as equality if a code is a ‘subspace of F^(fin n), but if it is a ‘k-dimensional subspace of F^(fin n)’ then the dual code is an ‘n-(n-k)-dimensional subspace of F^(fin n)’, which is not equal because n-(n-k) is not defeq to k. This an an annoyance, but maybe there are advantages that make it worth it.</p>\n</blockquote>\n<p>Interesting. I wasn't sure how essential the finite-dimensionality truly was to the essential definitions (the trick is finding the right level of generality).</p>\n<p>What did you mean by \"my view on the colon\"?</p>",
        "id": 287765085,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656444830
    },
    {
        "content": "<p>I meant that I much prefer <code>linear_code (n : nat) := (...)</code>, where the dimension <code>d</code> is either a field of the definition or a function of the code defined externally, to <code>linear_code (n d : nat)</code> where the dimension <code>d</code> is tied up before the colon. This is because a <code>linear_code 6 2</code> isn't propeq to the dual dual code, a <code>linear_code 6 (6-(6-2))</code>, where they really are 'the same' mathematically. (Obviously we make sacrifices like that all the time with things like order duality, but here it might not be necessary at all)</p>",
        "id": 287962675,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1656551890
    },
    {
        "content": "<p>I like this. The reason I wasn't necessarily going to do it is that a) I thought it might make associating it with a generator/parity-check matrix harder (but I take your point re: types), b) there are operations on codes which seem to only work for codes of the same dimension.</p>",
        "id": 288001411,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656582567
    },
    {
        "content": "<p>One option would be to have two (three?) different types: <code>linear_code n</code>, which is the type of linear codes of length n, and <code>linear_code_generated by n k</code>, which has a field G (where G is an k by n matrix) and a proof that G has full rank, or whatever and we understand that to mean the linear code generated by a given generator matrix (and I suppose you could have a similar thing for parity matrices).</p>",
        "id": 288002000,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656582803
    },
    {
        "content": "<p>This corresponds to the notion that you can define a linear code abstractly as a subspace, or concretely as the image of a generating matrix or as the kernel of a parity matrix.</p>",
        "id": 288002127,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656582868
    },
    {
        "content": "<p>By the way, do you think the Hamming metric should be pre-associated to the overall space? Does it only make sense to talk about codes with respect to a specific metric?</p>",
        "id": 288002275,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656582946
    },
    {
        "content": "<p>Yeah, I don’t know much about the operations that care about the dimension - maybe that’s where the tradeoffs lie.</p>\n<p>It seems natural to me to have the generator matrix -&gt; code construction be a function, rather than having the matrix as a field, since that way, you can meaningfully state that <code>code_generated_by A = code_generated_by B</code> for distinct matrices A and B, rather than having that statement fail to typecheck. </p>\n<p>Does the matrix need to have full row rank? I know it’s conventional, but taking the row space of an arbitrary matrix as the code it generates works fine enough. If you want to talk about full-rank generators, you can always use that later.</p>\n<p>I don’t know enough about the design goals to say anything sensible about metrics.</p>",
        "id": 288006663,
        "sender_full_name": "Peter Nelson",
        "timestamp": 1656585247
    },
    {
        "content": "<p>No, maybe it doesn't need full row rank.</p>",
        "id": 288034717,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656598760
    },
    {
        "content": "<p>Essentially the final design goal that I have is: I would like to be able to describe the constructions used in code-based cryptography with (relative) ease.</p>",
        "id": 288034801,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656598800
    },
    {
        "content": "<p>But because I would want to use the Hamming metric at least some of the time, I might want the vector space which is \"n-tuples with the Hamming metric\", because it isn't going to be correct to define the Hamming metric for all n-tuples (sometimes you want other metrics!)</p>",
        "id": 288035075,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656598906
    },
    {
        "content": "<p>But there are other metrics you use sometimes in a cryptography context, at the very least.</p>",
        "id": 288035115,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656598923
    }
]