[
    {
        "content": "<p>6 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"217875\" href=\"/#narrow/stream/217875-Is-there-code-for-X.3F/topic/Characterisation.20of.20connectedness.20using.20continuous.20maps\">#Is there code for X? &gt; Characterisation of connectedness using continuous maps</a> by <span class=\"user-mention silent\" data-user-id=\"224323\">Junyan Xu</span>.</p>",
        "id": 305863606,
        "sender_full_name": "Notification Bot",
        "timestamp": 1666630425
    },
    {
        "content": "<p>As a data point, here is an excerpt from Conway's <em>A Course in Functional Analysis</em>, Appendix A.2. He did not introduce the ≤ notation but his use of \"larger\" of \"smaller\" is consistent with the subset order. You're welcome to provide your references!<br>\n<a href=\"/user_uploads/3121/nS-ZRzLc0ubxJNpztH_F8-V7/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/nS-ZRzLc0ubxJNpztH_F8-V7/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/nS-ZRzLc0ubxJNpztH_F8-V7/image.png\"></a></div>",
        "id": 305863947,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1666630540
    },
    {
        "content": "<p>Thanks, this excerpt is indeed a very nice argument in favor of mathlib's convention, both through the way he explicitly mentions there are several coexisting convention and the way he very carefully uses the reversed inclusion symbol <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>⊇</mo></mrow><annotation encoding=\"application/x-tex\">\\supseteq</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.7719em;vertical-align:-0.136em;\"></span><span class=\"mrel\">⊇</span></span></span></span></p>",
        "id": 305887549,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1666635542
    },
    {
        "content": "<p>Thanks for your input, but note that he didn't mention coexisting notations, but only coexisting nomenclature. In mathlib <code>≥</code> represents <code>ge</code> which means `greater than or equal to\", and I see no difference between \"greater\" and \"larger\", so Conway's use of the word \"larger\" is consistent with the subset order but not the current default, the superset order. I wouldn't exclude the possibility that some authors use ≤ (or another notation of the same directionality) to mean ⊇ in the context of topologies, so you're welcome to provide another data point!</p>",
        "id": 305891588,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1666636978
    },
    {
        "content": "<p>I'm tired of this discussion and I have actual work to do. I've never seen <code>≤</code> used in this context so there is no trouble at all, and our convention simply works better for the way we do topology in mathlib, which is very suitable for formalization and does not exist on paper as far as we know.  Maybe we could redefine <code>topological_space X</code> to be a function from <code>X</code> to <code>filter X</code> satisfying the appropriate axiom so that you find the ordering more natural but I don't have time for this. The ordering we use are already fully consistent from filter to uniform spaces through topologies. I really don't see the point of inverting one order relation in the middle of this chain.</p>",
        "id": 305893379,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1666637699
    },
    {
        "content": "<p>From a categorical perspective there's no choice to be made, the forgetful fibration Top -&gt; Set has fibers that are posets, and the least (resp. greatest) elements of these posets are the discrete (resp. indiscrete) topologies.</p>",
        "id": 305895854,
        "sender_full_name": "Reid Barton",
        "timestamp": 1666638531
    },
    {
        "content": "<p>So mathlib has bought into the categorical perspective, where the existence of arrows X -&gt; Y is another way of saying X &lt;= Y.</p>",
        "id": 305896172,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1666638623
    }
]