[
    {
        "content": "<p>Are factorization algebras in Lean? </p>\n<p>I heard that Perfectoid spaces made it in, and some fairly tricky proofs were successfully formalized at Scholze's behest. It seems like it should be possible to include factorization and pre-factorization algebras (co-sheafy) and vertex algebras (complex analytic and power series). During my thesis, we spent a lot of time unpacking and parsing a theorem of Costello-Gwilliam regarding conditions necessary to extract a vertex algebra from a prefactorization algebras satisfying certain technical conditions. To my surprise, it appears Daniel Bruegmann has organized this procedure quite nicely in a preprint (5/18/21, <a href=\"https://arxiv.org/pdf/2012.12214.pdf\">https://arxiv.org/pdf/2012.12214.pdf</a>). </p>\n<p>This backwards compatibility seems like a good goal.</p>",
        "id": 243258394,
        "sender_full_name": "Jackson Walters",
        "timestamp": 1624121611
    },
    {
        "content": "<p>Hi! I don't think I've heard about factorization algebras before. So they are probably not formalized in Lean.</p>",
        "id": 243258546,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1624121792
    },
    {
        "content": "<p>Note that all the perfectoid and liquid stuff is in separate libraries that are not very well suited to build upon. We are trying to move stuff into the main library mathlib. But mathlib doesn't have any perfectoid or liquid maths at the moment.</p>",
        "id": 243258571,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1624121855
    },
    {
        "content": "<p>Hello! These are objects used to formalize aspects of perturbative QFTs first written down by Kevin Costello and Owen Gwilliam in the teens. A book has now been published (<a href=\"https://people.math.umass.edu/~gwilliam/vol1may8.pdf\">https://people.math.umass.edu/~gwilliam/vol1may8.pdf</a>).</p>",
        "id": 243258657,
        "sender_full_name": "Jackson Walters",
        "timestamp": 1624121952
    },
    {
        "content": "<p>Speaking broadly, what would be the dependencies? Some people have been doing physics related formalization work in Lean. But I don't think QFTs have been done.</p>",
        "id": 243258714,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1624122006
    },
    {
        "content": "<p>Factorization algebras are quite distinct from perfectoid spaces. They appear in areas at the intersection of geometry, topology, and physics, broadly speaking. The dependencies would be at least include monoidal categories and topological vector spaces. Common examples are typically something <em>like</em> a co-sheaf assigning, like, the Chevalley-Eilenberg complex to open sets. I'm certainly not an expert, and it's been a bit since I was immersed in this, but know someone in the community and thought I should throw it out here.</p>",
        "id": 243258827,
        "sender_full_name": "Jackson Walters",
        "timestamp": 1624122202
    },
    {
        "content": "<p>We have <a href=\"https://leanprover-community.github.io/mathlib_docs/find/category_theory.monoidal_category\">docs#category_theory.monoidal_category</a> and related constructions</p>",
        "id": 243258876,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1624122266
    },
    {
        "content": "<p>We also have topological vector space.</p>",
        "id": 243258914,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1624122334
    },
    {
        "content": "<p>We also have (Grothendieck) topologies. So it seems most ingredients would be there.</p>",
        "id": 243258935,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1624122352
    },
    {
        "content": "<p>Looking briefly at the link above, it seems to me that a good starting point is to formalize the definition of an operad.</p>",
        "id": 243258989,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1624122391
    },
    {
        "content": "<p>Assuming the relevant homological algebra and dg vector space language (derived geometry) is there, along with multicategories (a benign generalization of categories), it appears doable to at least define them.</p>",
        "id": 243259440,
        "sender_full_name": "Jackson Walters",
        "timestamp": 1624122915
    },
    {
        "content": "<p>I'm sure the community will be very keen to help if you want to make a little project formalising the definition of an operad in Lean. <a href=\"https://leanprover-community.github.io/install/project.html#creating-a-lean-project\">Here</a> are the instructions on how to create a new Lean project on your computer, and the Zulip helpline is open 24/7. If you get it working you can learn about the PR process and getting it into mathlib. PS Kevin Costello was a former colleague of mine at Imperial.</p>",
        "id": 243262944,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1624127527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"240862\">@Oliver Nash</span> <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> the section on operads in the pdf link above, p232 onwards, might interest you. It's not often you see someone talking about associative algebras and Lie algebras at the same time.</p>",
        "id": 243263095,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1624127819
    },
    {
        "content": "<p>Very cool, that sounds doable. I'll consider it as I move through the natural numbers game tutorial. Me and the faithful assistant here just proved associativity, which was oddly thrilling. Thanks for the pointers, it does sound fun to try to get it working. That's awesome. I knew one of Kevin's students, Brian Williams, a bit, and attended one or two conferences with Costello and co. A prof. at BU, Takashi Kimura, is well versed in operad theory and physics. Universal enveloping algebras are pretty rad.</p>",
        "id": 243280658,
        "sender_full_name": "Jackson Walters",
        "timestamp": 1624154781
    },
    {
        "content": "<p>I'd love to stuff in this direction in Lean. Long ago I wrote a paper \"blob homology\" which is in some sense an alternative to factorization algebras --- both more general (more interesting stuff can live on boundaries) and less general (stronger assumptions about duality / rotational invariance). So of course I've kept in mind the past few years how far off that all is... So far my answer has been \"very\". :-) But it's good to work towards.</p>",
        "id": 243297737,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1624186322
    },
    {
        "content": "<p>Looking back at my conversation with Scholze in Dec 2020, he asked how far off proving things about Ext groups of condensed abelian groups in Lean was, and I said \"very\". This doesn't mean it's impossible though! It just means that you have to do some work :-) Having ambitious and hard goals is an essential part of moving any theory forward.</p>",
        "id": 243298931,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1624188542
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/217875-Is-there.20code.20for.20X.3F/topic/Factorization.20algebras/near/243263095\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"240862\">Oliver Nash</span> <span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> the section on operads in the pdf link above, p232 onwards, might interest you. It's not often you see someone talking about associative algebras and Lie algebras at the same time.</p>\n</blockquote>\n<p>Thanks, yes it is interesting though I was a little sad to see this on page 240:<br>\n\"It might surprise the reader that we neveruse their representation theory or almost any aspects emphasized in textbooks onLie theory. \" <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span></p>",
        "id": 243354766,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1624265664
    }
]