[
    {
        "content": "<p>There is a formal verification of llvm written in Coq &lt;<a href=\"https://github.com/vellvm/vellvm/\">https://github.com/vellvm/vellvm/</a>&gt;. I wonder whether similar efforts exist in Lean. If not, I plan on writing a Lean version myself (first by translating vellvm), which would be a great way of learning both LLVM and formal verification.</p>",
        "id": 298955938,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663244148
    },
    {
        "content": "<p>No, there isn't anything like that in lean. FYI LLVM is huge and I strongly doubt any claim that it's been formalized</p>",
        "id": 298956299,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663244286
    },
    {
        "content": "<blockquote>\n<p>Vellvm is an ongoing project aiming at the formal verification in the Coq proof assistant of a compilation infrastructure inspired by the LLVM compiler.</p>\n</blockquote>",
        "id": 298956322,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663244292
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Formal.20verification.20of.20LLVM.3F/near/298956299\">said</a>:</p>\n<blockquote>\n<p>No, there isn't anything like that in lean. FYI LLVM is huge and I strongly doubt any claim that it's been formalized</p>\n</blockquote>\n<p>You're right. Thanks a lot.</p>",
        "id": 298956431,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663244336
    },
    {
        "content": "<p>I think the great advantage of formal verification is that there is no need for debugging. So any code written is work done. Although LLVM is large, it's much easier to write in formal language than maintaining in C++. I believe in the future, people shall rewrite it using a language that can both do formal verification and also do system-level programming.</p>",
        "id": 298956752,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663244432
    },
    {
        "content": "<p>You're speaking to the choir (I did a whole <a href=\"https://digama0.github.io/mm0/thesis.pdf\">PhD</a> on this topic), but when it comes to translating an existing large C++ project it's a very uphill battle. Before you could even prove anything you would first have to figure out what the invariants of the code are and why all that C++ code satisfies those invariants. This is an extremely hard problem in practice, because it is poorly documented and in many cases not well understood even by the authors of the code. Not to mention it's obviously untrue in some places, which is why there are bugs in it</p>",
        "id": 298957751,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663244816
    },
    {
        "content": "<p>There is a reason vellvm is \"inspired by\" LLVM and not literally LLVM</p>",
        "id": 298957826,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663244846
    },
    {
        "content": "<p>Indeed. You're right. So I'm not eager to put C++ dominance to an end.</p>",
        "id": 298959942,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663245619
    },
    {
        "content": "<p>But I don't believe LLVM will be there forever. I'm thinking of Rust compilation, it's slow partially because of LLVM. I would argue that formal verification will (maybe taking many decades) eventually be an essential part of a future compiler framework.</p>",
        "id": 298960243,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663245709
    },
    {
        "content": "<p>My interests in this is to learn things and mature the design of my own programming language (for my PhD).</p>",
        "id": 298960483,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663245793
    },
    {
        "content": "<p>I just wonder which is more difficult, this or verify proof of Fermat's last theorem.</p>",
        "id": 298960541,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663245820
    },
    {
        "content": "<p>That's a very interesting question. My money is on FLT being easier than LLVM</p>",
        "id": 298964506,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663247196
    },
    {
        "content": "<p>but then again, CS projects often have more human capital to throw at the problem</p>",
        "id": 298964587,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663247223
    },
    {
        "content": "<p>Indeed. And there are more people known LLVM or can learn it than FLT. So hard to say.</p>",
        "id": 298966319,
        "sender_full_name": "Xiyu Zhai",
        "timestamp": 1663247858
    }
]