[
    {
        "content": "<p>Have we got some well-defined class referred to informally as \"a complete archimedean ordered field\" structure on an ID (say), and some equiv between <code>is_CAOF X</code> and <code>X \\equiv R</code>? I think the last time I asked this the answer was that it was partly there.</p>",
        "id": 209411808,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1599582819
    },
    {
        "content": "<p>It seems to still be partly here, or more specifically, here: <a href=\"https://github.com/leanprover-community/mathlib/issues/3292\">#3292</a></p>",
        "id": 209412571,
        "sender_full_name": "Reid Barton",
        "timestamp": 1599583219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127136\">@Alex J. Best</span> what is the situation with this? I'd like this stuff done for a forthcoming blog post (and hence am motivated to work on it myself)</p>",
        "id": 209412986,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1599583443
    },
    {
        "content": "<p>I haven't had much lean time recently. I think the code is in good shape there are some comments Johan left on the pr that need adressing and some things in mathlib have changed since I last checked out that branch. I have marked it as please adopt so if you have motivation to do any of these things please go ahead! The only major mathematical thing was to prove uniqueness of the constructed map. I.e. there is only one order preserving ring hom between two of these fields. And a real cast to from the reals to these fields could be defined.</p>",
        "id": 209413336,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1599583629
    },
    {
        "content": "<p>I would love to fix it at some point soon but have no immediate plans to do so unfortunately.</p>",
        "id": 209413385,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1599583662
    },
    {
        "content": "<p>That's fine, I just wanted to check that the conflict wasn't some fatal thing or whatever</p>",
        "id": 209413506,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1599583712
    },
    {
        "content": "<p>Oh no not at all. Most comments are small it just needs some TLC</p>",
        "id": 209413565,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1599583740
    }
]