[
    {
        "content": "<p>Is there any prior work on a <code>show</code> tactic with <code>⊢</code>; i.e. one which could match (reordering goals) and unify hypotheses? This could make my proofs much more readable.  Or is there another way to accomplish the same thing?</p>",
        "id": 269172355,
        "sender_full_name": "David A",
        "timestamp": 1643058145
    },
    {
        "content": "<p>What leads you to using <code>show</code> that much? Presentation style? because it's barely used in mathlib.</p>",
        "id": 269172448,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1643058198
    },
    {
        "content": "<p>The case I'm hitting now uses <code>split_ifs</code> over a fairly large if/else tree. I'd like to be able to annotate each proof branch with what hypotheses have been introduced, and potentially clean up those hypotheses. But I run into this in other cases too; I'd hardly call <code>split_ifs</code> common in my code.</p>",
        "id": 269173130,
        "sender_full_name": "David A",
        "timestamp": 1643058516
    },
    {
        "content": "<p>I don't think it works for <code>split_ifs</code>, but the <code>case</code> tactic is nice for when these are generated from <code>induction</code> or such like</p>",
        "id": 269173268,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1643058605
    },
    {
        "content": "<p>it's worth trying to see if it works but I doub tit</p>",
        "id": 269173276,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1643058612
    },
    {
        "content": "<p>Actually, a better reason is: after an <code>rcases</code> or <code>rintro</code> with multiple <code>|</code> to show which branch we're in. And usually what I'm doing is dispatching all but one of the cases with one-liners, but there's no reason the \"interesting\" case will be last. I need to reorder them but the only difference between the cases is what's been introduced.</p>",
        "id": 269173296,
        "sender_full_name": "David A",
        "timestamp": 1643058622
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310413\">David A</span> <a href=\"#narrow/stream/217875-Is-there.20code.20for.20X.3F/topic/show.20with.20turnstile/near/269173296\">said</a>:</p>\n<blockquote>\n<p>there's no reason the \"interesting\" case will be last.</p>\n</blockquote>\n<p>Surprisingly, there is. But it's quite an art to get your definitions to spit out the hardest case last.</p>",
        "id": 269173414,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1643058717
    }
]