[
    {
        "content": "<p>On the wiki, the top trivial target is </p>\n<blockquote>\n<p>Duality<br>\northogonality This should be a definition together with at least basic lemmas about the orthogonal of the bottom and top subspaces, of an intersection, union, sum.</p>\n</blockquote>\n<p>I am checking in to see if </p>\n<ol>\n<li>this is already done but I have missed it</li>\n<li>clarify: the wiki defines the annihilator of an arbitrary set in a vector space and mentions the orthogonal complement is isomorphic to the annihilator in the finite dimensional case.  Following wikipedia, the approach would be to define annihilator for general R-modules, prove general lemmas, then specialize and link up to orthogonality, etc. However, I got the impression from the mathlib github wiki that a definition of orthogonal complement is the desired thing. No mention of annihilator of a set there.</li>\n</ol>",
        "id": 273589485,
        "sender_full_name": "Justin Thomas",
        "timestamp": 1646108603
    },
    {
        "content": "<p>update: found definition <code>dual_annihilator</code> in <code>linear_algebra/dual.lean</code></p>",
        "id": 273590498,
        "sender_full_name": "Justin Thomas",
        "timestamp": 1646109683
    },
    {
        "content": "<p>This is indeed the definition that we are talking about now. So we could simply edit undergrad.yaml to mention it. However it would be nice to add a couple more basic lemmas. For instance I see <a href=\"https://leanprover-community.github.io/mathlib_docs/find/submodule.dual_annihilator_sup_eq_inf_dual_annihilator\">docs#submodule.dual_annihilator_sup_eq_inf_dual_annihilator</a> but this is only for two subspaces, and I don't see the dual of top or bottom. And then indeed there is extra credit for linking this with bilinear algebra (for instance scalar products), maybe asking <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> for help.</p>",
        "id": 273609938,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1646126096
    },
    {
        "content": "<p>Do we need an intermediate \"definition exist but obvious lemmas missing\" state for the yaml file?</p>",
        "id": 273692357,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1646161031
    },
    {
        "content": "<p>For instance, the recent annihilating polynomials PR doesn't address everything in the wikipedia page introduction, but at least provides the definition</p>",
        "id": 273692522,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1646161091
    }
]