[
    {
        "content": "<p>Is there a tactic that does what is usually meant by wlog in math papers? More precisely, assuming the goal is to show some property of a function <code>f</code>, saying <code>suffices (f 0 = 0) generalizing f</code> would split the situation into</p>\n<ul>\n<li>the current one with the additional assumption <code>f 0 = 0</code></li>\n<li>a new situation with an additional assumption saying \"for every function with <code>g 0 = 0</code> plus all the other assumptions on <code>f</code> transported into assumptions on <code>g</code>, the corresponding goal holds\" (and then your job is to massage <code>f</code> into <code>g</code> satisfying the assumption and use the lemma).</li>\n</ul>\n<p>So, something a little bit similar to <code>suffices</code> but that would generate an intermediate lemma. I'm guessing that this can be done using a mixture of <code>suffices</code> and <code>revert</code>, and of course when the separate lemma is of more general use it is always possible to state it explicitly, but it would be useful as a standalone tactic.</p>",
        "id": 270700351,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1643973424
    },
    {
        "content": "<p>See this thread: <a href=\"#narrow/stream/113488-general/topic/wlog.20tactic.20.3A.20documentation.2Fhowto.3F\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/wlog.20tactic.20.3A.20documentation.2Fhowto.3F</a></p>",
        "id": 270702386,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1643974566
    },
    {
        "content": "<p>I'd like to get one version or the other into mathlib for sure!</p>",
        "id": 270702620,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1643974741
    },
    {
        "content": "<p>Ah, thanks, I had missed that thread and indeed <code>wlog'</code> described there does what I am asking for, it I understand it right. I will try to give it a try...</p>",
        "id": 270706252,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1643977071
    },
    {
        "content": "<p>... yep, that's exactly what I had in mind. It would certainly be useful to have it in mathlib!</p>",
        "id": 270706703,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1643977362
    }
]