[
    {
        "content": "<p>I see that a <code>Conv</code> version of <code>congr</code> is already implemented. Since most of the code is there this is better suited to someone more familiar with the main developments. <br>\nThanks <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> for your help. I will take this as a learning experience and make a fresh start on something else soon.</p>",
        "id": 276295801,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1648019957
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266304\">Siddhartha Gadgil</span> has marked this topic as resolved.</p>",
        "id": 276295806,
        "sender_full_name": "Notification Bot",
        "timestamp": 1648019962
    },
    {
        "content": "<p>The hope is that we can somehow mix and match the pieces that are already in lean 4 for doing congr stuff to get a tactic that acts like lean 3 <code>congr</code></p>",
        "id": 276296090,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1648020276
    },
    {
        "content": "<p>but it is true that it is not easy to jump into this code and find the right things to call</p>",
        "id": 276296119,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1648020326
    },
    {
        "content": "<p>Yes, it does indeed look that way. But my familiarity with <code>simp</code> and related stuff is low, so not the right thing for me to take on right now.</p>",
        "id": 276296441,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1648020629
    },
    {
        "content": "<p>The <code>Conv.congr</code> code is a lot simpler, but it doesn't seem to use congr lemmas, and it does not traverse into the head of an application like in your <code>f x = g y</code> example</p>",
        "id": 276296455,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1648020645
    },
    {
        "content": "<p>I see. I will read the code a bit more and perhaps continue on this. Part of the reason for making a fresh start was that I had made the mistake of doing everything on my master branch, which would entangle this with other pull requests.</p>",
        "id": 276297060,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1648021255
    },
    {
        "content": "<p>I have a fresh clone, and I will pull in what I did in a branch. If things are promising after my studying the code a bit, I will resume this.</p>",
        "id": 276297129,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1648021318
    }
]