[
    {
        "content": "<p>Hi everyone! After successfully porting a rather trivial file in <a href=\"https://github.com/leanprover-community/mathlib4/pull/582\">mathlib4#582</a>, I started working on a port of <code>control.basic</code> (yes, I'm starting from files low in the priority queue in order not to block too much people while I learn how to port efficiently), and I have a few small questions:</p>\n<ul>\n<li>if I understand correctly, simp attributes can no longer be used in the file where they are declared, is that right? If so, what is the expected solution for that? To be more explicit, I'm thinking about <a href=\"https://leanprover-community.github.io/mathlib_docs/find/simp_attr.functor_norm\">docs#simp_attr.functor_norm</a>, which is used multiple times in <code>control.basic</code> (note: it also seems to be used in <code>control.functor</code>, so it looks like some transitive import through <code>tactic</code> is ignored by the <code>port_status</code> script). Should I create an intermediate file just for introducing the simp attribute?</li>\n<li>what is the current attitude regarding small mismatches in the order of implicit arguments? Most of the <code>dubious translation</code> messages from <code>mathport</code> seem to be reporting this sort of inconsistencies, and I'm not sure if we want to fix them or consider that we only need to ensure the order of explicit arguments</li>\n<li>more specific to <code>control.basic</code>: the <a href=\"https://leanprover-community.github.io/mathlib_docs/find/fish\">docs#fish</a> operator is already defined in the core library as <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Bind.KleisliRight#doc\">docs4#Bind.KleisliRight</a>, and the precedence issue mentioned in <a href=\"https://github.com/leanprover-community/mathlib3port/blob/6b8613f2d840e5fe39d283f8dd76ef0d11c92474/Mathbin/Control/Basic.lean#L129\">this comment</a> seems to no longer apply, so I'll just be removing the definition. Should I change the names of the following lemmas to replace <code>fish</code> by <code>KleisliRight</code>?</li>\n</ul>",
        "id": 309438285,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1668335715
    },
    {
        "content": "<p>I opened a WIP PR as <a href=\"https://github.com/leanprover-community/mathlib4/pull/588\">mathlib4#588</a> if anyone wants to have a look</p>",
        "id": 309439608,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1668336604
    },
    {
        "content": "<p>After a porting PR is merged, should I as the author update the port status from</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>No: PR mathlib4#585\n</code></pre></div>\n<p>to</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>Yes: PR mathlib4#585\n</code></pre></div>\n<p>?  Or is this something that should be left to the porting leaders?</p>\n<p>Same question about how to \"verify\" that the file is ported.</p>",
        "id": 309921996,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1668450030
    },
    {
        "content": "<p>Yes, it's helpful if you check that, although I'm trying to remember to do it as I <code>bors merge</code> as well. It's still a bit of a mess, sadly.</p>",
        "id": 310077839,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668458485
    },
    {
        "content": "<p>The verification step has so far not been happening at all. :-(</p>",
        "id": 310077904,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668458512
    },
    {
        "content": "<p>OK, I made the update for that one, and I will keep an eye out for any announcements about changes to the workflow :)</p>",
        "id": 310079768,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1668459230
    }
]