[
    {
        "content": "<p>In an <a href=\"https://github.com/leanprover/doc-gen4/issues/99\">issue</a> on the doc-gen4 repo, <span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> and I have been discussion how to deal with the left sidebar display of names which are both a folder and a file.  For instance<br>\n<a href=\"https://github.com/leanprover-community/mathlib4/tree/master/Mathlib\">Mathlib the folder</a> vs <a href=\"https://github.com/leanprover-community/mathlib4/blob/master/Mathlib.lean\">Mathlib the file</a><br>\n<a href=\"https://github.com/leanprover-community/mathlib4/tree/master/Mathlib/Tactic/Linarith\">Mathlib.Tactic.Linarith the folder</a> vs <a href=\"https://github.com/leanprover-community/mathlib4/blob/master/Mathlib/Tactic/Linarith.lean\">Mathlib.Tactic.Linarith the file</a><br>\nUsually the situation is that the file represents the default things from the folder that one would want to import somewhere else.</p>\n<p>Currently these are displayed in the left sidebar of the docs by making the folder name a hyperlink to the associated file.  This has the problem that the screen real-estate to click through to the contents of the folder becomes very small: just the tiny <code>▸</code> next to the folder name.  This is particularly awkward in the case of Mathlib itself and other top-level folders, because it means that navigating to any file in Mathlib requires first finding the tiny <code>▸</code> on the homepage and clicking it.</p>\n<p>I proposed just deleting the docs pages associated to folder-namesake files, but Henrik points out that </p>\n<ul>\n<li>in small projects, the repository-namesake file might actually contain content</li>\n<li>even in the typical situation where a folder-namesake file is just a list of imports (and therefore the associated docs page is completely empty), that list of imports still generates useful information in the right sidebar (Imports/Imported by)</li>\n</ul>\n<p>So let's discuss. I would like a solution in which the folder gets more screen real estate than the file.  The best display I can currently think of is</p>\n<p>▸ Mathlib (<a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib.html\">file</a>)</p>\n<p>Maybe we could also systematically put comments in such files, like we did in <a href=\"https://github.com/leanprover-community/mathlib/blob/master/src/algebra/ring/default.lean\">default files</a> in mathlib3, so that they don't show up completely empty in the docs.</p>\n<p><a href=\"https://github.com/leanprover/doc-gen4/issues/101\">Another issue I opened</a> would help a little bit here, by circumventing this problem in the case I encounter most often (Mathlib itself).</p>",
        "id": 316788020,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1671469155
    },
    {
        "content": "<p>Is it sufficient to make the file doc always expand the folder in the sidebar?</p>",
        "id": 317844489,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1671979636
    },
    {
        "content": "<p>That way if you misclick you still get the expanded thing</p>",
        "id": 317844506,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1671979653
    },
    {
        "content": "<p>I was planning to implement Heather's solution once std4 and mathlib4 are compatible again but we can also do that if the majority thinks it would be better.</p>",
        "id": 317854646,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671985618
    },
    {
        "content": "<p>I think Eric's solution would be fine, but in that case we should have a convention of writing documentation in import-only files, so that users don't get confused by the <a href=\"https://leanprover-community.github.io/mathlib4_docs/Mathlib/Tactic/Linarith.html\">blank pages</a> that turn up in these cases.</p>\n<p>I also still think that it would be fine to drop any import-only file from the documentation, even though technically this results in a loss of information (its imports and what it's imported by).  Compare <code>linarith</code> in mathlib3: as far as I can tell there's no docs page for <br>\n<a href=\"https://github.com/leanprover-community/mathlib/blob/master/src/tactic/linarith/default.lean\">https://github.com/leanprover-community/mathlib/blob/master/src/tactic/linarith/default.lean</a><br>\nand so it's not documented anywhere what you get when you <code>import tactic.linarith</code>.</p>",
        "id": 318029137,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1672110279
    },
    {
        "content": "<p>I was working on a lean 3 patch to fix the missing default files in doc-gen; right now we cant detect files from within lean that dont have either docstrings or declarations.</p>",
        "id": 318158800,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1672174830
    }
]