[
    {
        "content": "<p>I don't know whether anyone else would be interested in this, but I think it might be neat if we had a option to ask the import-graph script to add the next n (I only care about n=1) dependencies below the --to node. The reason for this is that if I port a file, I can look whether that port immediately makes another file portable and then it is easier to port multiple files at once.</p>",
        "id": 311225859,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669014388
    },
    {
        "content": "<p>As an alternative, this information is already available in the docs; you can click on \"Imported by\" on the right sidebar. But I agree that this would be a useful extension to the script.</p>",
        "id": 311226531,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1669014784
    },
    {
        "content": "<p>but \"imported by\" does not tell you whether the other dependencies are ported yet</p>",
        "id": 311226570,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669014816
    },
    {
        "content": "<p>I guess I could run the script for every file in \"imported by\", but this is a bit more tedious</p>",
        "id": 311226814,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669014960
    },
    {
        "content": "<p>I'm not sure I understand what you want. Do you want to add only one level of edges beyond the given nodes or also all the ancestors of the successors of the given node?</p>",
        "id": 311228275,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1669015848
    },
    {
        "content": "<p>I am not too interested in seeing what the ancestors are (I am afraid that is too messy). Ideally they are not shown, but the successors are colored depending on their portability once the --to node is green.</p>",
        "id": 311228751,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669016100
    },
    {
        "content": "<p>i.e., all successors that only depend on --to and already ported files are blue, and if there exists an unported ancestor that is not --to then it is white</p>",
        "id": 311228973,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669016206
    },
    {
        "content": "<p>Ok, the difficult part is to come up with a name for the command line option trigerring this behavior</p>",
        "id": 311235468,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1669019290
    },
    {
        "content": "<p>I am really bad with naming things, but maybe \"--show-children\"?</p>",
        "id": 311238685,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1669020632
    }
]