[
    {
        "content": "<p>Mathlib4 now has a directory for docs; I'd like to see what people think about docs in languages other than English.  If there's interest, the best setup I could come up with is adding a <code>README.md</code> in <code>/docs</code> that links to external repos :</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"c1\">-- README.md:</span>\n<span class=\"n\">Dutch</span> <span class=\"o\">:</span> <span class=\"bp\">&lt;</span><span class=\"n\">link</span> <span class=\"n\">to</span> <span class=\"n\">Dutch</span> <span class=\"n\">doc</span> <span class=\"n\">repo</span><span class=\"bp\">&gt;</span>\n<span class=\"n\">Thai</span><span class=\"o\">:</span> <span class=\"bp\">&lt;</span><span class=\"n\">link</span> <span class=\"n\">to</span> <span class=\"n\">Thai</span> <span class=\"n\">doc</span> <span class=\"n\">repo</span><span class=\"bp\">&gt;</span>\n<span class=\"bp\">...</span><span class=\"n\">rest</span>\n</code></pre></div>\n<p>This seems like the best option since it doesn't impose any additional maintenance overhead on mathlib, the maintainers can add/swap/remove links in a pinch, and the respective communities can manage their repos in the manner they see fit.</p>",
        "id": 259292520,
        "sender_full_name": "Chris B",
        "timestamp": 1635362281
    },
    {
        "content": "<p>It seems at this point the additional maintenance overhead for other language documentation is zero. How likely is this to change? Couldn't we just accept PRs into mathlib4 itself?</p>",
        "id": 259305085,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1635368136
    },
    {
        "content": "<p>I'm not sure what the long term plans are for mathlib4 docs, but if it's  something similar to the mathlib3 <code>docs</code> then the kind of thing I'm envisioning is that a document (e.g. the install instructions) changes and you end up with n pull requests with fixes for n languages. The mathlib3 <code>docs</code> files don't seem super dynamic though so that might be a concern.</p>",
        "id": 259306443,
        "sender_full_name": "Chris B",
        "timestamp": 1635368764
    },
    {
        "content": "<p>I guess the other extreme is that you might only get PRs for some of the languages, in which case docs that look official  since they're in the repo might end up out of sync.</p>",
        "id": 259306698,
        "sender_full_name": "Chris B",
        "timestamp": 1635368911
    },
    {
        "content": "<p>I'm a native English speaker so this isn't like a burning issue for me; if everyone's more comfortable waiting to see if there's a more organic demand I'm good with that too.</p>",
        "id": 259307220,
        "sender_full_name": "Chris B",
        "timestamp": 1635369182
    },
    {
        "content": "<p>I don't see how we could get forces for that.</p>",
        "id": 259307409,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1635369269
    },
    {
        "content": "<p>One year and a half ago I made sure the natural number game could be translated (setting up a translation infrastructure). But nobody did the actual translation work. It would be <em>much</em> more useful than translating mathlib docs since it would allow young people to play the game (In France we have huge difficulties to get students to read English before PhD basically)</p>",
        "id": 259307614,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1635369375
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/287929-mathlib4/topic/International.20docs/near/259307409\">said</a>:</p>\n<blockquote>\n<p>I don't see how we could get forces for that.</p>\n</blockquote>\n<p>I didn't mean to insinuate that this should be anyone's responsibility. The idea was more like what the Rust team did, which was to tell volunteers \"if you give us a completed translation we'll make it available to visitors\". I was just thinking about a folder of markdown docs, but if you're talking about like .ftl files with a structure then yeah that's going to be more work.</p>",
        "id": 259308787,
        "sender_full_name": "Chris B",
        "timestamp": 1635369864
    },
    {
        "content": "<p>I think we're still slightly below Rust in terms of number of users...</p>",
        "id": 259309001,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1635369984
    },
    {
        "content": "<p>I'm pretty sure I don't know any Rust user that isn't also a Lean user, but I've been told they exist.</p>",
        "id": 259309067,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1635370022
    }
]