[
    {
        "content": "<p>is mathlib made only by the community or is it mainly supported by the official lean staff. the whole documentation and information is on the leanprover community website</p>",
        "id": 267013498,
        "sender_full_name": "crab",
        "timestamp": 1641430122
    },
    {
        "content": "<p><code>mathlib</code> is being mainly maintained by the lean community including both computer scientists and mathematicians that are students, professors, postdocs etc.</p>\n<p><code>mathlib4</code> (which I assume you are asking about since you are in the mathlib4 stream) is a project that is doing experiments for when the original mathlib eventually gets ported from Lean 3 to Lean 4, it's not an official Lean project either but Gabriel (who is at least part of the official Lean org on Github, dunno whether that is considered \"official Lean staff\") has written large amounts of code in it.</p>",
        "id": 267014012,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1641430603
    },
    {
        "content": "<p>There isn't really any such thing as \"official lean staff\", although there are a few paid positions with enough freedom to permit working on lean nearly full time</p>",
        "id": 267015360,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1641431846
    },
    {
        "content": "<p>Furthermore, mathlib has always been somewhat separate from lean core development, and it has always been a volunteer project. (Things are starting to change lately, there is more support from MS now than there has been in the past, but it's still fairly independent and there is no one on the MS payroll who works on mathlib full time AFAIK.)</p>",
        "id": 267015534,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1641432053
    },
    {
        "content": "<p>I see. this makes sense. I hope to contribute to mathlib one day</p>",
        "id": 267017619,
        "sender_full_name": "crab",
        "timestamp": 1641434443
    }
]