[
    {
        "content": "<p>I often get a prompt from Lean and from <code>lake</code> to run <code>lake update</code>. However, my understanding is that the only occasion where one should run this command is when bumping mathlib. Can we turn off those warnings for mathlib to avoid many people accidentally running <code>lake update</code>?</p>",
        "id": 319825845,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673025992
    },
    {
        "content": "<p>Or is the consensus that these warnings will appear way less once Lean 4 has stabilised?</p>",
        "id": 319825931,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673026021
    },
    {
        "content": "<p>It's not really about stability of Lean 4 but of mathlib4 dependencies. Which of course should get more stable as well. It would also be possible to suppress this by making Lake more like Nix' <code>--override-input</code>, storing both the original and current source of a dependency in the manifest so that it can detect whether someone changed the lakefile or manifest and warn only in the former case.</p>",
        "id": 319833880,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1673028626
    },
    {
        "content": "<p>In fact Nix auto-updates the lockfile when it detects that the equivalent of the lakefile has changed, which I think is the right call</p>",
        "id": 319834281,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1673028756
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 319835891,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1673029316
    },
    {
        "content": "<blockquote>\n<p>storing both the original and current source of a dependency in the manifest so that it can detect whether someone changed the lakefile or manifest and warn only in the former case.</p>\n</blockquote>\n<p>Ah, I didn't realize that this was for --override-input, clever.</p>",
        "id": 319836190,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1673029419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> The current warning is a windows-only bug.  The <code>lake-manifest.json</code> says the packages directory is <code>./lake-packages</code>, while on windows we get <code>.\\lake-packages</code>.</p>",
        "id": 319836496,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1673029507
    },
    {
        "content": "<p>Ahah. So I assume this will eventually get fixed.</p>",
        "id": 319840566,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673030838
    }
]