[
    {
        "content": "<p>Can someone review <a href=\"https://github.com/leanprover-community/mathlib4/pull/588\">mathlib4#588</a>? It's now at the top of the list of files which unlock the most stuff. I co-authored it with Anatole, so I shouldn't review it.</p>",
        "id": 311452688,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669059048
    },
    {
        "content": "<p>there's still a lot of <code>ₓ</code>s in the #aligns - I thought this wasn't wanted?</p>",
        "id": 311492892,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1669073218
    },
    {
        "content": "<p>I can add notes for these, but the first three are just orders of implicit arguments (actually the third one might also be that <code>Seq.seq</code> and <code>has_seq.seq</code> have different types, but this is known and expected). If you look at the translation error for <code>Sum.bind</code> it seems that mathport got it wrong, it shouldn't be dubious. If you want to look at the dubious translation errors, see commit: 41b163554e4c5dca5ea9e09b27ef475cafe61606</p>",
        "id": 311494944,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669074478
    },
    {
        "content": "<p>sorry, I'm still new to the porting process; so should these be left in if the aligns are still mildly dubious? I thought they were autogenerated by mathport and were meant to be all taken out before the file was \"ported\"</p>",
        "id": 311495113,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1669074582
    },
    {
        "content": "<p>No, the purpose of the <code>ₓ</code> is to indicate that the type of the mathlib3 version and the mathlib4 version don't match. This is just a marker for mathport so that in future references to this declaration it knows to use the mathlib4 type. I don't think the <code>ₓ</code> is ever added automatically by mathport (I could be wrong here), it just suggest to the user to use it.</p>",
        "id": 311495403,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669074761
    },
    {
        "content": "<p>So, the <code>ₓ</code> <em>should</em> stay in when the translation is dubious, but it's good to indicate for future reference why it was marked as dubious (this requires human assessment).</p>",
        "id": 311495562,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669074855
    },
    {
        "content": "<p>I see! I think it'd be good to add the explanations in.</p>",
        "id": 311496117,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1669075183
    },
    {
        "content": "<p>Yeah, I think that every <code>\\_x</code> that gets left in should probably have a comment.</p>",
        "id": 311496323,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1669075253
    },
    {
        "content": "<p>(and if mathport reports a dubious translation, but it actually looks okay, just remove the <code>\\_x</code>.)</p>",
        "id": 311496368,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1669075272
    },
    {
        "content": "<p>I had added comments, but I need to be done for the evening.</p>",
        "id": 311496538,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669075338
    }
]