[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> I think having the <code>Lib4</code> directory (and fake package) is confusing now that we have separate stand-alone packages that download the releases. It also seems annoying to require two separate repos for <code>leanbin</code> and <code>mathbin</code>. I just pushed a commit to my fork that addresses these: <a href=\"https://github.com/dselsam/mathport/commit/ad83ed70e9e0480d082dce6c0cd0d6a500656cc6\">https://github.com/dselsam/mathport/commit/ad83ed70e9e0480d082dce6c0cd0d6a500656cc6</a> Now the mathport outputs are just placed directly in the otherwise-empty <code>Outputs/[lean|math]bin/[oleans|src]</code>, and <code>Lean4Packages/[lean|math]bin</code> contains the lakefiles that download the releases from the web. Note: the <code>Lean4Packages</code> lakefiles are still pointing to my \"test\" release because they are expecting the oleans in the tar file to be top-level rather than inside <code>build/lib</code>. I changed <code>make tarballs</code> accordingly: <a href=\"https://github.com/dselsam/mathport/blob/master/Makefile#L103-L107\">https://github.com/dselsam/mathport/blob/master/Makefile#L103-L107</a> but didn't change the github action. Thoughts?</p>",
        "id": 261164599,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1636652727
    },
    {
        "content": "<p>Yes, this is definitely better.</p>",
        "id": 261184249,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636664605
    },
    {
        "content": "<p>OK I pushed the commit to <code>leanprover-community</code>. I didn't change the CI branch though -- will it automatically use the master branch for the action? Does it need to be a separate branch or should the action go into master eventually?</p>",
        "id": 261191760,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1636670114
    },
    {
        "content": "<p>Note that doing this has the disadvantage of now creating a copy of this monolithic mathport report for each of <code>leanbin</code> and <code>mathbin</code>. At least with the current way Lake resolves sources.</p>",
        "id": 261195338,
        "sender_full_name": "Mac",
        "timestamp": 1636672848
    },
    {
        "content": "<p>No, the CI branch should eventually be merged. I need to fix up the workflow file first, however. Currently it is set to run on every push to a pull request.</p>",
        "id": 261196367,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636673901
    },
    {
        "content": "<p>It should probably instead run on every commit to master.</p>",
        "id": 261196406,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636673971
    }
]