[
    {
        "content": "<p>I'm currently extending Aesop with the ability to generate proof scripts, which would make use of mathlib's <code>on_goal</code> tactic. This is a problem because I can't depend on mathlib. I think I can work around this by defining my own <code>aesop_on_goal</code> and using that instead of <code>on_goal</code> whenever <code>on_goal</code> is not available (which I can presumably detect).</p>\n<p>But it made me think: many of the tactics in mathlib are quite general-purpose and will also be useful for people who don't use mathlib. So should they be split out into a separate package (maybe <code>std</code>, maybe a new <code>std-tactics</code>)?</p>",
        "id": 306263273,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1666797208
    },
    {
        "content": "<p>Just wondering, why can't you depend on mathlib?  I'm sorry if I missed a previous discussion here.</p>",
        "id": 306263582,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1666797278
    },
    {
        "content": "<p>Because Aesop is supposed to be used in mathlib. So the alternative is really to move it into mathlib. That would also be fine with me, but if we want to move to a less monolithic ecosystem, it would be nice if tactics which are not intrinsically tied to mathlib aren't bundled with it.</p>",
        "id": 306264771,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1666797612
    },
    {
        "content": "<p>I see.  Speaking just for myself, I'd certainly be happy to have it in mathlib.</p>\n<p>In any case, during the current phase with mathlib4 changing very fast, it might be easier to keep a monolith ...</p>",
        "id": 306265288,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1666797756
    },
    {
        "content": "<p>That's fair. Splitting off a separate <code>std-tactics</code>, which would presumably depend on <code>std</code>, would be an issue with the current infrastructure.</p>\n<p>Actually, now that I think about it, you can already use Aesop together with mathlib4 only if the two packages agree on which <code>std</code> commit they depend on.</p>",
        "id": 306268358,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1666798490
    },
    {
        "content": "<p>I think we should first port mathlib, and then think about splitting things into packages. Doing both at once sounds like extra complications to me.</p>",
        "id": 306268361,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1666798491
    },
    {
        "content": "<p><code>on_goal</code> seems to fit nicely in <code>std</code> itself to me, its a tactic that shouldn't need mathematical background and is quite general purpose, maybe <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> should be the one to move it though</p>",
        "id": 306271931,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1666799484
    },
    {
        "content": "<p>Yes, <code>on_goal</code> should go in <code>std</code>. Feel free to open a thread on the <a class=\"stream\" data-stream-id=\"348111\" href=\"/#narrow/stream/348111-std4\">#std4</a> stream whenever you have a request to move something from mathlib4 to std4.</p>",
        "id": 306358323,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1666832906
    }
]