[
    {
        "content": "<p>I’ve been thinking about <code>pi_instance_derive_field</code> (which is a component of <code>pi_instance</code>) and <code>pi_instance</code>, which I’ve claimed on the tactic porting doc, and I think there might be a couple chances to improve them:</p>\n<p>1) <code>pi_instance_derive_field</code> <em>only</em> ever occurs after <code>refine_struct</code>. This seems like a chance to write a better tactic—why not simply give (the new version of) <code>pi_instance</code> an optional argument, so that we don’t need to have a boilerplate <code>refine</code> beforehand? (Plus, then there’s only one concept floating around, instead of two separate-but-related ones.)</p>\n<p>(Note: this accounts for about 1/2-2/3 of the uses of <code>refine_struct</code> in mathlib, depending on how you count, so while it’s significant, we still need <code>refine_struct</code> functionality separately!)</p>",
        "id": 311081495,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668902726
    },
    {
        "content": "<p>2) <code>Π</code> as syntax for dependent function types is going away in Lean 4. As such, I think we should rename <code>pi_instance</code>. Also, many mathematicians don’t use or know the term “pi type”, and given that <code>pi_instance</code> is documented as “Automation for creating instances of <em>mathematical</em> structures for pi types”, it would be nice for it to be mathematician-friendly.</p>\n<p>A couple options I can think of are</p>\n<ul>\n<li><code>fromPointwise</code></li>\n<li><code>instanceFromPointwise</code></li>\n</ul>\n<p>since that’s roughly what this tactic does: take a pointwise definition of a structure and lift that structure to the function type. The notion of something being “defined pointwise” is pretty familiar to mathematicians, and so maybe this tactic could benefit from a name that involved “pointwise” somehow. :)</p>",
        "id": 311081648,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668902841
    },
    {
        "content": "<p>Just wanted to see if people think these are good ideas and if I should enact them in the port! :)</p>",
        "id": 311081864,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668903058
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"548935\">@Thomas Murrills</span> , as you know we are trying to avoid major refactors at this time. If it is possible, we would like to stick to the implementation as it exists, at least for backward compatibility purposes. Renaming <code>Pi</code> at this point seems like a bad idea given the number of places it shows up in various ways in mathlib. There also isn't a suitable replacement; <code>forall</code> is the name used in the lean 4 sources for this operator but this is confusing from a mathematical perspective to apply to any dependent function type. I think we should just stick to using <code>Pi</code> when referring to the dependent function type in theorem names and tactic names.</p>",
        "id": 311086022,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668906822
    },
    {
        "content": "<p>Re: (1), I don't think it's necessarily always a good idea to combine tactics together, although this can certainly be done as a macro in lean 4 if it is easier to use that way. Note that <code>pi_instance_derive_field</code> is not even an interactive tactic in lean 3 (it is a direct call to <code>tactic.pi_instance_derive_field</code>), which indicates that making it easy to write is not a top priority in mathlib. If however it is more difficult to write the tactics separately rather than together, (and this doesn't involve duplicating all the code of <code>refine_struct</code>,) then it is reasonable to consider combining them for that reason.</p>",
        "id": 311086355,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668907188
    },
    {
        "content": "<p>Re: renaming: Ah, I see. I only meant to suggest the rename of <code>pi_instance</code>, and I wasn’t aware the use of <code>pi</code> was so widespread in names! :) But I can see how renaming one might mean we want to rename them all, and how that would be very difficult…</p>",
        "id": 311086521,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668907336
    },
    {
        "content": "<p>Re (2), the situation is that <code>pi_instance</code> itself is pretty much just an application of <code>refine_struct</code> followed by <code>pi_instance_derive_field</code> on every goal. It’s not that I expect it to be difficult to write them separately, but just that it would be easy to combine these (just have the optional argument to <code>pi_instance</code> get passed to the internal <code>refine_struct</code>, instead of depending on and replicating the internals of <code>pi_instance</code> everywhere). (That said, it might in fact be easier to write them together. I’ll find out soon!)</p>\n<p>Though, I see how this might introduce complication in porting. There are 60-something instances of <code>pi_instance_derive_field</code> in mathlib, all of exactly the form <code>refine_struct &lt;partial structure&gt;; tactic.pi_instance_derive_field</code> which would have to become <code>piInstance &lt;partial structure&gt;</code> instead of <code>refine &lt;partial structure&gt; &lt;;&gt; piInstanceDeriveField</code>, and informing everyone porting of this could be a headache. (Unless <code>piInstanceDeriveField</code> had a docstring in mathlib4 that informed porters of the above? or unless it was done via something in synport, which is another headache. Either way, I’ll do whatever you (and/or others) advise here! :) )</p>",
        "id": 311088400,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668909552
    },
    {
        "content": "<p>this can be done trivially in synport if required</p>",
        "id": 311089207,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668910392
    },
    {
        "content": "<p>I don't think the user-side expression of the code is that important</p>",
        "id": 311089216,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668910414
    }
]