[
    {
        "content": "<p>I'm would like to try and port <code>Data.RBTree.Init</code>. Should it go in <code>Mathlib</code> or <code>Std</code>?</p>",
        "id": 309174515,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1668166480
    },
    {
        "content": "<p>probably mathlib4, we can move parts to Std4 later on</p>",
        "id": 309174690,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1668166568
    },
    {
        "content": "<p>It seems like I do not have the permission to write to a non-master branch. Is it still standard to work on an non-master branch? If so, can someone grant the right to me? Thanks!</p>",
        "id": 309175658,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1668166994
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"439483\">@Andrew Yang</span> note that there's also <a href=\"https://leanprover-community.github.io/mathlib4_docs/Std/Data/RBMap/Basic.html\">https://leanprover-community.github.io/mathlib4_docs/Std/Data/RBMap/Basic.html</a> in std4, so I'm not sure what (if anything) still needs porting</p>",
        "id": 309179873,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1668168740
    },
    {
        "content": "<p>Oh I didn't notice that. But that rbtree is (syntactically) different than the <a href=\"https://leanprover-community.github.io/mathlib_docs/find/rbtree\">docs#rbtree</a> in mathlib3, and we should probably do something to appease mathport? Is it possible to align them in this case?</p>",
        "id": 309180835,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1668169164
    },
    {
        "content": "<p>I think a suitable \"port\" of the <code>data.rbtree</code> is: make a list of all the theorems about rbtree that don't yet exist in <code>Std.Data.RBMap</code>, open an issue for them on <code>std4</code>, and then remove everything from the module except for <code>#align</code>s if possible (if the types are too different, just leave them unaligned). <code>Std.Data.RBMap</code> intends to completely replace that directory.</p>",
        "id": 309191810,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668173003
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"439483\">@Andrew Yang</span>, I've given you permissions for mathlib4.</p>",
        "id": 309265664,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668203979
    },
    {
        "content": "<p>I PR'd the RBTree.Init file a couple hours ago, thinking it'd be a simple job, but this thread showed me that it's a bit of a nonstandard endeavour :) I followed <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>'s recommended approach trying to align the contents with the corresponding ones from std4, maybe someone can have a look if things make sense in there: <a href=\"https://github.com/leanprover-community/mathlib4/pull/1246\">https://github.com/leanprover-community/mathlib4/pull/1246</a></p>",
        "id": 318274861,
        "sender_full_name": "Lukas Miaskiwskyi",
        "timestamp": 1672240960
    },
    {
        "content": "<p>Note: I have an incomplete port of the rbtree files in progress, although it is a relatively low priority so I'm not actively working on it now. As for the <code>#align</code>s, most of them need to have <code>\\_x</code> because they aren't exact defeq ports, and for something like <code>depth</code> which is more than a little different (such that it would not be reasonable to ask someone porting a downstream file to migrate from one definition to the other) it should either be <code>#noalign</code>ed or <code>#align</code>ed to a <code>depth'</code> function that is defined as it is in mathlib3.</p>",
        "id": 318276027,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1672241381
    }
]