[
    {
        "content": "<p>I'd like to port a part of <code>order.bounded_order</code> but we're not ready for all of it yet I don't think, so I made a Lean 3 PR splitting the file <a href=\"https://github.com/leanprover-community/mathlib/pull/17730\">#17730</a> from one 2000 line file into four smaller files. I then noticed that <span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span> had actually made a mathlib4 PR <a href=\"https://github.com/leanprover-community/mathlib4/pull/697\">mathlib4#697</a> about this file so I thought that it was best not to add to the confusion andI closed the mathlib3 PR. But now I realise that actually there is plenty of work to be done on the mathlib4 PR, and I'm not even sure that we're going to be able to port all of it (this was the reason I wanted to split the file in mathlib3, well, that and the fact that I've never liked files with &gt; 1000 lines and this file has 2000 lines). Right now the work put into the mathlib4 PR would not be wasted because only the first part of the file compiles (about the first 500 lines) and I left all these lines in <code>order.bounded_order</code> in the mathlib3 PR; in fact I split the file precisely at the point where the mathlib4 version stops compiling. So I am currently minded to get the mathlib3 PR pushed through and then this will make the mathlib4 port easier. Does anyone have any comments on this plan?</p>",
        "id": 312479341,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1669560414
    },
    {
        "content": "<p>I was very confused that github claimed you linked to this zulip message 14 hours ago :)</p>\n<p>I'm looking how far I got in the port, but I certainly wouldn't mind if you made it easier</p>",
        "id": 312480317,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1669560894
    },
    {
        "content": "<p>I concur, splitting would be good.</p>",
        "id": 312480412,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669560949
    },
    {
        "content": "<p>Scratch that, I need to step out and won't have time to look further for a few hours at least. Do whatever makes sense and feel free to take over the mathlib4 pr or not, as you prefer</p>",
        "id": 312480625,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1669561064
    },
    {
        "content": "<p>Well right now the mathlib4 file is clean up to the bit where it starts going on about PropCat and then it's just a copy of the mathlib3port version and full of errors, so let's maybe go for the split.</p>",
        "id": 312480805,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1669561158
    },
    {
        "content": "<p>Updated <a href=\"https://github.com/leanprover-community/mathlib4/pull/697\">mathlib4#697</a> to match</p>",
        "id": 312512310,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1669578792
    },
    {
        "content": "<p>oh how have you done that? Just manually deleted the stuff I moved?</p>",
        "id": 312512646,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1669579030
    },
    {
        "content": "<p>Yeah</p>",
        "id": 312512770,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1669579120
    }
]