[
    {
        "content": "<p>What exactly is involved in verifying a ported file against a commit in mathlib? The <code>port-status</code> script says that a bunch of files haven't yet been verified. Is this verification process something the author of the ported file needs to do, or should it be anyone? I'm happy to go around verifying ports.</p>",
        "id": 310300616,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668549503
    },
    {
        "content": "<p>That would be amazing.</p>",
        "id": 310314983,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556129
    },
    {
        "content": "<p>Currently there is no process, because no one has ever done it. :-)</p>",
        "id": 310315003,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556143
    },
    {
        "content": "<p>But the idea could be:</p>",
        "id": 310315020,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556151
    },
    {
        "content": "<ul>\n<li>open up mathlib at today's master</li>\n<li>open up a fully ported file in mathlib4 in a side by side window</li>\n<li>scroll through the two, making sure nothing has been missed, or at least that any significant changes are marked with <code>-- Porting note: ...</code></li>\n<li>if you find anything bad, either make a mathlib4 PR to fix it, or raise it here</li>\n<li>if you don't find anything bad, edit the <a href=\"https://github.com/leanprover-community/mathlib/wiki/mathlib4-port-status\">#port-status</a> wiki to add the git sha for today's mathlib master</li>\n</ul>",
        "id": 310315183,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556243
    },
    {
        "content": "<p>The process just described sounds almost as hard as doing the port in the first place. I think we should instead review the diff between the mathlib version that was ported, and the latest version, and look for equivalents of new things in mathlib4</p>",
        "id": 310315571,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668556464
    },
    {
        "content": "<p>The problem is that for now we have no record of the mathlib version that was ported. :-(</p>",
        "id": 310315637,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556508
    },
    {
        "content": "<p>You can make some inferences from the date that the file was ported</p>",
        "id": 310315670,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668556534
    },
    {
        "content": "<p>Sounds good. It will definitely be a bit approximate, but I agree it's too painful to do \"properly\".</p>",
        "id": 310315773,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556584
    },
    {
        "content": "<p>it's not trivial to diff mathlib and mathlib4 directly because theorems might be entirely gone (having been upstreamed)</p>",
        "id": 310315804,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668556616
    },
    {
        "content": "<p>How about we try to fill in best guesses of git sha's today-ish, and then we'll be ready to write some automation that reports changes in mathlib after those sha's.</p>",
        "id": 310315856,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556651
    },
    {
        "content": "<p>one thing that is a bit closer to a diff (in the \"set subtraction\" sense) of mathlib  - mathlib4 is the post-port contents of the mathport file</p>",
        "id": 310315975,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668556707
    },
    {
        "content": "<p>So how about this as an imperfect-but-doable-today plan:</p>\n<ul>\n<li>for each ported file in <a href=\"https://github.com/leanprover-community/mathlib/wiki/mathlib4-port-status\">#port-status</a> with a mathlib4 PR number, but no sha</li>\n<li>look up the date that PR was opened</li>\n<li>take the first mathlib sha from that date, and put it in <a href=\"https://github.com/leanprover-community/mathlib/wiki/mathlib4-port-status\">#port-status</a></li>\n<li>decide that any discrepancies that slipped in will come out in wash as we continue porting</li>\n</ul>",
        "id": 310316061,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668556774
    },
    {
        "content": "<p>Okay, I can do that tonight.</p>",
        "id": 310319381,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668558705
    },
    {
        "content": "<p>When I was finishing up porting a file, I went to mathlib3, looked at the history of the relevant file, checked that I'd ported the last one or two PRs to that file, and then just said that I'd ported the version of the file corresponding to the last commit which touched that file.</p>",
        "id": 310324879,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1668562659
    },
    {
        "content": "<p>Okay, I've added all the SHAs. Unfortunately, now the <code>port-status</code> script says that all these files have been modified since the commit at which they were verified (presumably because of adding the mathlib4 synchronization label in almost all cases).</p>",
        "id": 310336676,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668572666
    },
    {
        "content": "<p>Okay, but now we just need to script that shows the diffs in mathlib3 between the recorded commit and master.</p>",
        "id": 310337286,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668573038
    },
    {
        "content": "<p>And that will let us quickly verify that we haven't really missed anything.</p>",
        "id": 310337309,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668573048
    },
    {
        "content": "<p>Sure, but presumably we don't want it continually bugging us and making it look like there's things that have changed when they haven't changed meaningfully.</p>",
        "id": 310337431,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668573156
    },
    {
        "content": "<p>yeah, the bot needs to detect synchronized message changes (which is one of the reasons I don't like the message, you have to syncronize the synchronization)</p>",
        "id": 310337591,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668573336
    },
    {
        "content": "<p>it could be organized by a tag, or by just ignoring lines with specific content</p>",
        "id": 310337660,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668573393
    },
    {
        "content": "<p>A real hack that could potentially cause false negatives is to just see if the diff is smaller than 5 lines.</p>",
        "id": 310337698,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668573453
    },
    {
        "content": "<p>yeah no</p>",
        "id": 310337715,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668573481
    },
    {
        "content": "<p>checking if the diff contains <code>SYNCHRONIZED</code> is probably less likely to have a false negative</p>",
        "id": 310337764,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1668573501
    },
    {
        "content": "<p>The conjunction of those two conditions is probably sufficient to guarantee no false negatives.</p>",
        "id": 310338216,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1668573913
    }
]