[
    {
        "content": "<p>If I try to look at my branch of mathlib4 as a remote repository in VS code, I can't seem to start the lean server. I get told I have \"no default \"lean-toolchain\" in this folder or any parent folder\", and if I try to select the toolchain via command palette &gt; Lean 4: Select Toolchain, I see \"Error: elan toolchain list returned no output\". If I further try to specify the path exactly by using the root directory of the nightly in <code>.elan/toolchains/</code>, I get the same errors as before.</p>\n<p>Does anyone else have this issue or know how to fix it?</p>",
        "id": 310530014,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668647392
    },
    {
        "content": "<p>Works fine for me. Can you run <code>elan</code> in an ssh shell on the remote host?</p>",
        "id": 310534322,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668651074
    },
    {
        "content": "<p>hmm, I'm not on a remote host—I'm using github remote repositories in VS code (it might be an extension? not sure if it's integrated into VS code or not)</p>",
        "id": 310534590,
        "sender_full_name": "Thomas Murrills",
        "timestamp": 1668651308
    },
    {
        "content": "<p>Oh, sorry, I misunderstood. I haven't used that.</p>",
        "id": 310535675,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1668652220
    },
    {
        "content": "<p>I think most vscode extensions that do nontrivial things have to be explicitly rewritten to support remote repositories. <br>\nJust looking at <a href=\"https://code.visualstudio.com/api/extension-guides/virtual-workspaces#review-that-the-extension-code-is-ready-for-virtual-resources\">https://code.visualstudio.com/api/extension-guides/virtual-workspaces#review-that-the-extension-code-is-ready-for-virtual-resources</a> and the current extension it seems this would be nontrivial, if possible at all!</p>",
        "id": 310613545,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1668693228
    }
]