[
    {
        "content": "<p>Currently, the <code>intro</code> and <code>intros</code> tactics are very similar but not identical. <code>intros</code> takes a list of <code>ident &lt;|&gt; \"_\"</code> while <code>intro</code> takes a list of <code>term</code> and can do pattern matching, and even for a list of identifiers they have different behavior in the empty case - <code>intros</code> will introduce until it can't anymore and <code>intro</code> will introduce one unnamed argument, equivalent to <code>intro _</code>.</p>\n<p>I propose that we either remove <code>intros</code> entirely or make it a synonym of <code>intro</code>. To recover the behavior of <code>intros</code> with no arguments I suggest we make <code>intro x y z ..</code> introduce variables <code>x</code> <code>y</code> <code>z</code> and then keep introducing <code>_</code> arguments until it can't anymore. So <code>intro ..</code> will replace the old <code>intros</code>.</p>\n<p>This syntax also makes sense in <code>fun</code>: <code>fun .. =&gt; e</code> means the same as <code>fun _ _ _ =&gt; e</code> for as many <code>_</code> as there are binders (up to reducible unfolding).</p>\n<p>Thoughts? I am willing to do the implementation work but this is a fairly visible user-facing change so I wanted to get people's impressions first.</p>",
        "id": 301361608,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1664421982
    },
    {
        "content": "<p>The fewer tactic variants I have to teach people, the better! It's already a bit annoying in lean 3 that I feel obliged to teach intro and rintro.</p>",
        "id": 301376246,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1664433364
    },
    {
        "content": "<p>I'd love it! Even better if it could support the <code>rintro</code> syntax too</p>",
        "id": 301378609,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1664434592
    },
    {
        "content": "<p>I very much agree that it would be wonderful to have only one tactic instead of <code>intro</code>, <code>intros</code>, <code>rintro</code>,  <code>rintros</code>.</p>",
        "id": 301403663,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1664444670
    },
    {
        "content": "<p>Of course in Lean 4 this \"one tactic\" is very much undefined. There could be one word <code>intro</code> and many different <code>elab</code> rules hooking it to different things, but the dream is that users could pretend this is \"one tactic\".</p>",
        "id": 301403849,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1664444750
    }
]