[
    {
        "content": "<p>I am planning on renaming <code>package.lean</code> to something more generic in preparation for generalizing Lake beyond just building package targets. I also want to do this now, while Lake is in its early stages, when such a change is unlikely to cause much pain.</p>\n<p>Currently, the two names I have in mind are the basic<code>lakefie.lean</code> and the more thematic, but esoteric <code>watershed.lean</code>. I am also considering using the later name instead for an eventual lockfile for Lake (i.e., <code>watershed.json</code> would instead be the JSON lockfile).  I would like to know what name the Lean community would prefer. Alternatively, if anyone has another idea for a name feel free to suggest it!</p>",
        "id": 254898622,
        "sender_full_name": "Mac",
        "timestamp": 1632632108
    },
    {
        "content": "<p>Why <code>lakefie</code>? Or did you mean <code>lakefile</code>?</p>",
        "id": 254904483,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1632637663
    },
    {
        "content": "<p>I think that <code>watershed.lean</code> is too \"clever\". I would never know that it is a package configuration and would think it is a source file in the project. <code>lakefile.lean</code> is more likely to be connected to \"makefile\".</p>",
        "id": 254907440,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1632640302
    },
    {
        "content": "<p>Also, is it lowercase on purpose? Most lean files have capital names, and <code>Makefile</code> is also traditionally capitalized</p>",
        "id": 254907518,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1632640340
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> Yep, my bad. <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 254939320,
        "sender_full_name": "Mac",
        "timestamp": 1632670058
    },
    {
        "content": "<p>It should be named after what it is supposed to describe. It could use a metaphor to do so (cargo, crate, ...), but I think lake does not necessarily lend itself well to elaborate metaphors (port, harbour, marina, ...?). Something like workspace.lean would make sense if the result of invoking lake would be a working setup potentially consisting of several packages, which all are build and made available for working in VSCode. Otherwise build.lean and setup.lean would come to mind.</p>",
        "id": 254939744,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1632670419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>, <span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span> Yeah I was worried the name <code>watershed</code> may be a bit too \"clever\"</p>",
        "id": 254939854,
        "sender_full_name": "Mac",
        "timestamp": 1632670502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> Also, yes, the lower case is on purpose to make it clear that it is <em>not</em> a normal Lean module.</p>",
        "id": 254939880,
        "sender_full_name": "Mac",
        "timestamp": 1632670537
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> I don't have any immediate association of watershed related to packaging / building, the rust ecosystem is clever in that sense because they have a whole industrial metaphor going on.</p>",
        "id": 254940000,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1632670638
    },
    {
        "content": "<p>reservoir?</p>",
        "id": 254941424,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1632671967
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span> really? I would never consider Rust's metaphors intuitive -- in the sense that I would naturally relate them to the relevant concepts in software packaging. They are cute/clever though. As such, I think Ruby's gem metaphors (gem, facet, etc.) -- which are not remotely connected to physical packaging -- work just as well.</p>",
        "id": 254947428,
        "sender_full_name": "Mac",
        "timestamp": 1632677377
    },
    {
        "content": "<p>Anyway, I was already leaning towards the more generic <code>lakefile.lean</code> and this discussion seems to be heading in that direction. Is that a fair assessment?</p>",
        "id": 254947585,
        "sender_full_name": "Mac",
        "timestamp": 1632677504
    },
    {
        "content": "<p>I did a git clone of the Lean4 source. I followed the build instructions in the Lean manual. The build stopped with errors at stage1. I have a console log. Where / How should I post it?</p>",
        "id": 293886803,
        "sender_full_name": "Tim Daly",
        "timestamp": 1660739144
    },
    {
        "content": "<p>Don't post anything else in this thread, which is about something else. Create a new thread in the <a class=\"stream\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4\">#lean4</a> stream with an appropriate title and ask there.</p>",
        "id": 293887743,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1660739577
    }
]