[
    {
        "content": "<p>We had a discussion about the naming convention a while ago, but looking at the results it seems we still managed to end up with a divergence between mathlib4 and lean4 naming in attributes: mathlib4 is using snake case attribute names and lean4 is using camel case.</p>\n<p>Currently, lean4 uses snake case for commands and tactics, with the reasoning that this is the syntax for \"keyword-like\" things, while functions and local variable identifiers are camel cased. So are attributes \"keyword-like\" or \"function-like\"? Some attributes are parsed by custom parsers in the <code>attr</code> class, so these certainly do function as keywords, but many are \"simple attributes\" which use the <code>ident</code> parser. But users generally can't tell which is which so basing a naming convention on that doesn't sound like a good idea. Also, attributes are always highlighted purple like keywords, which is why I would advocate for snake casing attributes.</p>\n<p>On the other hand, any change will be rather disruptive at this point. I would suggest making deprecated aliases for all the renamed attributes and keeping them around for at least one stable release, to help people migrate.</p>",
        "id": 292225373,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659750380
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/270676-lean4/topic/.5BRFC.5D.20Attribute.20naming.20convention/near/292225373\">said</a>:</p>\n<blockquote>\n<p>Also, attributes are always highlighted purple like keywords, which is why I would advocate for snake casing attributes.</p>\n</blockquote>\n<p>Huh? For me (on Windows VSCode), attributes are highlighted entirely differently from other keywords (in red rather than the usual blue).</p>",
        "id": 292235486,
        "sender_full_name": "Mac",
        "timestamp": 1659764887
    },
    {
        "content": "<p>I tried a couple different themes and they all use keyword color for attributes. What do you see if you turn on \"Developer: Inspect Editor Tokens and Scopes\"? I see <code>storage.modifier.lean4, source.lean4</code> textmate scopes on e.g. <code>inline</code> in <code>@[inline] def foo := 1</code></p>",
        "id": 292235898,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659765586
    },
    {
        "content": "<p>this is not the same as for <code>def</code> and the <code>simp</code> tactic, which have a semantic token <code>keyword.other</code>, so it is conceivable you have a theme that distinguishes them</p>",
        "id": 292236072,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659765727
    },
    {
        "content": "<p>oh fun: since the <code>simp</code> attribute is a <code>syntax</code>, it is highlighted as <code>keyword</code>, so in some themes like \"Material Theme\" or \"solarized light\" there is a visible difference between <code>inline</code> and <code>simp</code> in <code>@[inline, simp] def foo := 1</code></p>",
        "id": 292236302,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659765978
    },
    {
        "content": "<p>what theme are you using <span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> ?</p>",
        "id": 292236308,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659766005
    },
    {
        "content": "<p>In any case, I would also propose to adjust the semantic highlighting so that all attributes are keyword-highlighted, rather than just the ones that don't use <code>Attr.simple</code></p>",
        "id": 292236381,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659766101
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/270676-lean4/topic/.5BRFC.5D.20Attribute.20naming.20convention/near/292235898\">said</a>:</p>\n<blockquote>\n<p>I tried a couple different themes and they all use keyword color for attributes.</p>\n</blockquote>\n<p>You are right. My brain was just apparently on the fritz and I somehow misremembered (and did not double check).</p>",
        "id": 292276582,
        "sender_full_name": "Mac",
        "timestamp": 1659816572
    }
]