[
    {
        "content": "<p>Many modern general purpose programming languages allow you to use functions before they're declared in the file. It's slightly annoying having to wrap functions in a mutual block to accomplish this in Lean 4. It would be nice if instead of  having to opt into a mutual block, we could opt <strong>out</strong> of it instead, maybe with something like <code>not mutual ... end</code> Is something like this possible? Is it on the roadmap?</p>",
        "id": 313434063,
        "sender_full_name": "Cole Shepherd",
        "timestamp": 1669962429
    },
    {
        "content": "<p>From a theorem proving perspective it sounds sort of scary. At least in Lean 3, in all of mathlib there is just one file (outside of tactics) that uses <code>mutual</code>.</p>",
        "id": 313447520,
        "sender_full_name": "Reid Barton",
        "timestamp": 1669969530
    },
    {
        "content": "<p>I'm not sure what the impact would be on files full of ordinary non-mutual definitions. At a minimum, Lean would have to determine whether there is in fact mutual recursion going on, which sounds problematic in the presence of tactics that inspect the environment (e.g. <code>simp</code>)</p>",
        "id": 313447802,
        "sender_full_name": "Reid Barton",
        "timestamp": 1669969664
    },
    {
        "content": "<p>One issue with large scale mutual blocks is that it breaks incremental compilation. Currently the server adds \"snapshots\" after every command, and when you make an edit halfway down the file compilation is restarted only from the snapshot corresponding to the beginning of the current command. With a full-file mutual block, this method breaks completely: changing a definition at the bottom of the file could cause name resolution at the top of the file to break or resolve to something else, so you have to do the entire file at once.</p>",
        "id": 313450783,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1669970870
    },
    {
        "content": "<p>One of the most painful current aspects of <code>mutual</code> blocks is that they have to be processed by the server in one block, meaning that elaboration takes N times longer; this N is the number of declarations in the block so if the whole file is mutual then that's basically not interactive at all, it's just calling a batch compiler and displaying the results.</p>",
        "id": 313451248,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1669971038
    },
    {
        "content": "<p>Yeah, at that point we would need a completely different compiler architecture</p>",
        "id": 313451442,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1669971120
    }
]