[
    {
        "content": "<p>I am currently new to Lean, and am playing around in Lean4. I am yet to understand, but playing around is fun. Currently, I have Lean on my home PC, and I use VS Code. I pulled the nightly release, and all has been well (since I am yet to do anything beyond proving true != false haha).</p>\n<p>I wondered if there is any other way I can use lean, other than in VS Code. I am a uni student and spend a lot of time on my iPad, and I would enjoy having some way to access a Lean environment. I don't suppose there are any notebook tools or anything?</p>\n<p>I have heard of Code-Server, and use it on and off; however, it doesn't have the lean4 extensions, so it doesn't work (afaik). Any suggestion on alternate ways I can continue to play around while not on my main PC? Thanks!</p>",
        "id": 252961137,
        "sender_full_name": "Phillip",
        "timestamp": 1631424907
    },
    {
        "content": "<p>If you can find the vsix, you can install the extension directly on <code>code-server</code> similar to vs code. (There is some hesitancy about whether the terms of use of the vs code extension library prohibit downloading vsix files for use in non-vs code editors or just to keep non-vs code editors from using the vs code extension library as a back-end.) </p>\n<p>Another option is GitPod. I believe there are people with Lean4 GitPod experience around here: eg <a href=\"https://github.com/IPDSnelting/tba-2021/blob/master/.gitpod.yml\">https://github.com/IPDSnelting/tba-2021/blob/master/.gitpod.yml</a> The PWA experience with GitPod is not great YMMV.</p>",
        "id": 253108697,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1631546810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"306577\">@Matthew Ballard</span> Both the <a href=\"https://open-vsx.org/extension/jroesch/lean\">lean</a> and <a href=\"https://open-vsx.org/extension/leanprover/lean4\">lean4</a> extensions are available through <a href=\"https://open-vsx.org/?search=lean&amp;category=&amp;sortBy=relevance&amp;sortOrder=desc\">Open VSX</a>, which is specifically designed not to have the licensing concerns you mentioned.</p>",
        "id": 253144359,
        "sender_full_name": "Mac",
        "timestamp": 1631560750
    },
    {
        "content": "<p>Thanks. Last I checked. This wasn’t the case.</p>",
        "id": 253145941,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1631561288
    }
]