[
    {
        "content": "<p>By the way, I would be interested to hear about your reasons for preferring to turn them off. This feature is still somewhat in an experimentation phase.</p>",
        "id": 271549935,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1644571813
    },
    {
        "content": "<p>Basically to protect myself from my own negligence. I just had a constructor using some <code>x</code> intended as an autobound variable, but actually I had in another imported file some <code>def x := ...</code>, so the <code>x</code> was actually referring to that rather than being a variable. And because of this I spent some time not understanding why an induction case complained about a wrong number of arguments.</p>",
        "id": 271551250,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1644572453
    },
    {
        "content": "<p>But I think it's a nice feature and can make code more readable in some situations, but requires some discipline on the part of the programmer which I just wanted to skip when just playing around and doing experiments</p>",
        "id": 271551509,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1644572597
    },
    {
        "content": "<p>Hah, that is exactly the anticipated failure case, yes. Semantic highlighting should warn you about it, but you first have to be aware of it doing that of course.</p>",
        "id": 271551537,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1644572613
    },
    {
        "content": "<p>Perhaps we should try to find a more noticeable highlighting for implicits specifically <a href=\"/user_uploads/3121/1rQo5puF13hDQKNVDJQhDxAW/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/1rQo5puF13hDQKNVDJQhDxAW/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/1rQo5puF13hDQKNVDJQhDxAW/image.png\"></a></div>",
        "id": 271553218,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1644573518
    },
    {
        "content": "<p>Oh, I see now. Yes, I certainly didn't notice or think of the difference in highlighting in that moment :)</p>",
        "id": 271554463,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1644574130
    }
]