[
    {
        "content": "<p>Hello, I am a new user thinking about learning more about Lean. Should I learn Lean 3 or Lean 4? More precisely, if I learn Lean 3 now, are there any breaking changes coming in Lean 4 that I will have to unlearn / relearn? Thanks!</p>",
        "id": 296530917,
        "sender_full_name": "Jorge Fernandez-de-Cossio-Diaz",
        "timestamp": 1662017381
    },
    {
        "content": "<p>Welcome! What is your background / what do you want to do? More on the CS side of things or the maths side?</p>",
        "id": 296531179,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1662017501
    },
    {
        "content": "<p>For CS stuff, just start with Lean 4. For maths, stick with Lean 3 for now.<br>\nThere are plenty of breaking changes, though.</p>",
        "id": 296531326,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1662017552
    },
    {
        "content": "<p>Thanks! Well I am just interested in Lean for curiosity really, I want to understand what it can do. So no CS or math specific. I just want to follow some tutorials.</p>",
        "id": 296572151,
        "sender_full_name": "Jorge Fernandez-de-Cossio-Diaz",
        "timestamp": 1662034150
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 296576935,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1662035881
    },
    {
        "content": "<p>Very very broadly speaking, Lean 4 allows you to state and prove theorems like in Coq and write functional programs like in Haskell. You can even write programs and prove theorems about them.</p>\n<p>It also allows you to expand its own syntax via metaprogramming such that you can even define your own language within it.</p>\n<p>There's also a powerful infoview which shows you the precise context of wherever you place your cursor at.</p>\n<p>If you're just curious about what it can do, I'd suggest picking up Lean 4 because it can do even more than Lean 3.</p>",
        "id": 296585727,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1662038817
    },
    {
        "content": "<p>Ok thanks! I'll try Lean 4 then.</p>",
        "id": 296685841,
        "sender_full_name": "Jorge Fernandez-de-Cossio-Diaz",
        "timestamp": 1662060501
    }
]