[
    {
        "content": "<p>I'm trying to have two local Lean packages. One is a library and the other is a program. I want them to be in different folder, managed by different git repositories. In the program lakefile I use <code>require MyLib from \"..\"/\"my-lib\"</code> and it works just fine in VSCode. Then I <code>lake build</code> and there is no complain. But when I try to run the executable then it complains about \"unknown package MyLib\".</p>",
        "id": 300184192,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1663860007
    },
    {
        "content": "<p>Building a Lean executable will not include all the .olean files in the binary, or make them available in any other way. I assume you are already calling <code>initSearchPath</code>, you need to pass the path to MyLib to it manually</p>",
        "id": 300184706,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1663860189
    },
    {
        "content": "<p>Thanks, that was enough to get me going. But one day I'll have to understand this for real.</p>",
        "id": 300185979,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1663860592
    },
    {
        "content": "<p>Is there any documentation for simple use cases like? I can't find the string \"initSearchPath\" in the lake README.</p>",
        "id": 300186337,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1663860695
    },
    {
        "content": "<p>Building a Lean <em>metaprogram</em>, something that reads and analyzes/manipulates Lean programs and proofs, is far from a simple use case. The most appropriate place to document this would probably be in the metaprogramming book, but I don't see it there yet.</p>",
        "id": 300187010,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1663860874
    },
    {
        "content": "<p>I guess I probably don't need this then, because I'm not trying to do something complicated.</p>",
        "id": 300189190,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1663861503
    },
    {
        "content": "<p>Now I'm a bit confused. You should only get that error <em>from your program</em> if you're trying to do something complicated/\"meta\".</p>",
        "id": 300189579,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1663861622
    },
    {
        "content": "<p>To be honest, I don't quite remember what I'm doing. I'm resuming work on a project that I abandoned for one month because term started and then I had a conference deadline <span aria-label=\"flushed\" class=\"emoji emoji-1f633\" role=\"img\" title=\"flushed\">:flushed:</span></p>",
        "id": 300190341,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1663861855
    }
]