[
    {
        "content": "<p>I'm a new comer and I had a question: Can I use Lean 4 without Mathlib4?</p>\n<p>I asked because I found that some basic theorems are not in Lean, but in Mathlib.</p>\n<p>example 1. <a href=\"https://github.com/leanprover-community/mathlib4/blob/c56001bae38730606b855196acdd52d334971977/Mathlib/Data/Nat/Basic.lean#L78\">min_comm</a><br>\nexample 2. <a href=\"https://github.com/leanprover-community/mathlib4/blob/c68d91daedfbdb9b9a56fa770df495684e7f8aec/Mathlib/Init/Algebra/Order.lean\">Order.lean</a></p>\n<p>Lean has <a href=\"https://github.com/leanprover/lean4/blob/master/src/Init/Data/Ord.lean\">Ord.lean</a> but it doesn't have <code>Preorder</code>, PartialOrder`, etc.</p>\n<p>My guess is that Lean 4 can be used without Mathlib4. If so, can I add some theorems to Nat (e.g., min_comm)? Is such contribution welcomed?</p>",
        "id": 277047576,
        "sender_full_name": "Casavaca",
        "timestamp": 1648578847
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"489928\">@Casavaca</span> Yes, you are correct. Lean 4 can be used without Mathlib 4. Recall that Lean 4 and Lake are implemented in Lean itself, and most of the repos at <a href=\"https://github.com/topics/lean4\">https://github.com/topics/lean4</a> do not depend on Mathlib 4.</p>\n<blockquote>\n<p>If so, can I add some theorems to Nat (e.g., min_comm)? Is such contribution welcomed?</p>\n</blockquote>\n<p>I think it is not a good time for this kind of contribution. People are working hard to port Mathlib to Lean 4, and trying to refactor it (e.g., moving stuff to the core repo) while doing the porting will probably create unnecessary headaches. </p>\n<p>That being said, after the porting, we want to organize things better and make sure Lean is a great system for mathematicians, computer scientists, and software developers. The mono-repo approach used in Mathlib is working great for formal mathematics, but it is not ideal for people interested in using Lean as a programming language and having basic theorems like the one you mentioned available.</p>\n<p>For now, I would suggest you keep this theorem in your own repo if you want to avoid Mathlib 4 as a dependency.</p>",
        "id": 277048440,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1648579319
    }
]