[
    {
        "content": "<p>In the lean manual, sections 6 and 7 (expressions and declarations) make no sense whatsoever. They are poorly made, with no syntax highlighting and use copy-pasted examples from lean 3.</p>",
        "id": 270140494,
        "sender_full_name": "J. O.",
        "timestamp": 1643681645
    },
    {
        "content": "<p>I know the manual is wip, but the other sections are much cleaner and better. I wonder what is the cause for this “discrepancy”</p>",
        "id": 270140587,
        "sender_full_name": "J. O.",
        "timestamp": 1643681753
    },
    {
        "content": "<p>Lean 4 is not stable yet, so I think the manual can't be prioritized yet</p>",
        "id": 270142412,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1643683211
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"451983\">Arthur Paulino</span> <a href=\"#narrow/stream/270676-lean4/topic/Chapters.20that.20make.20no.20sense/near/270142412\">said</a>:</p>\n<blockquote>\n<p>Lean 4 is not stable yet, so I think the manual can't be prioritized yet</p>\n</blockquote>\n<p>But that isn’t my concern. I’m wondering why those two extremely long sections are badly written. They should give a good gist, and not really complicated explanations. Honestly, i feel like those sections could be taken out completely, as they are explained more thourohly in other places</p>",
        "id": 270145003,
        "sender_full_name": "J. O.",
        "timestamp": 1643685323
    },
    {
        "content": "<p><strong>tl;dr</strong>: something is not done because no one (including you!) did it.</p>\n<p>While a few people are actually paid to work on Lean, lots of stuff that happens around Lean is a community effort done by people who are not paid to work on Lean. And those who are paid to work on Lean answer to their bosses, not to you (or me). If some day MS will sell Lean 4 tech support to customers, then paying customers will have rights to ask for better manual/language/whatever.</p>",
        "id": 270160842,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1643698397
    },
    {
        "content": "<p>(Honestly I am perpetually shocked that Lean's documentation is as good as it is - it's first and foremost a research project, but its documentation is better than a lot of commercial software!)</p>",
        "id": 270168301,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1643704157
    },
    {
        "content": "<p>And dont get me wrong, I think the manual is really good, except for some parts</p>",
        "id": 270198811,
        "sender_full_name": "J. O.",
        "timestamp": 1643717889
    },
    {
        "content": "<p>thats all</p>",
        "id": 270198818,
        "sender_full_name": "J. O.",
        "timestamp": 1643717891
    }
]