[
    {
        "content": "<p>I am just wondering how far off it is to be able to build web servers in Lean 4, or perhaps produce code that can be used by, say, Rust based web servers... Where would it make most sense to use it? (I am having to build a web server right now, so I am looking around...).</p>",
        "id": 222704765,
        "sender_full_name": "Henry Story",
        "timestamp": 1610622976
    },
    {
        "content": "<p><a href=\"https://youtu.be/TgHISG-81wM?t=2932\">https://youtu.be/TgHISG-81wM?t=2932</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"TgHISG-81wM\" href=\"https://youtu.be/TgHISG-81wM?t=2932\"><img src=\"https://i.ytimg.com/vi/TgHISG-81wM/default.jpg\"></a></div>",
        "id": 222705809,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1610623774
    },
    {
        "content": "<p>Thanks that is very interesting. I just looked at it again. (Had seen in 2 months ago).</p>",
        "id": 222710918,
        "sender_full_name": "Henry Story",
        "timestamp": 1610627966
    },
    {
        "content": "<p>My use case is that I need to write an implementation of <a href=\"https://www.nytimes.com/2021/01/10/technology/tim-berners-lee-privacy-internet.html\">Tim Berners-Lee's Solid Server</a>, especially the access control part, which requires integrating RDF parsers and reasoning  ( in Category Theory RDF graphs are Functors from <a href=\"https://arxiv.org/abs/1706.00526\">Bicategories of Relations to Rel</a>, and reasoning are natural transformations (I think)). Though these need to be extended to quads... That means one has to fetch data from the worldwide data store called the World Wide Web, check access control rules for each resource, verify credentials, etc... One needs HTTP/2.0 for efficiency, and a number of other things.</p>",
        "id": 222711578,
        "sender_full_name": "Henry Story",
        "timestamp": 1610628365
    },
    {
        "content": "<p>As lean compiles to C I guess integration with Rust would be the easiest.</p>",
        "id": 222713788,
        "sender_full_name": "Henry Story",
        "timestamp": 1610629629
    },
    {
        "content": "<p>That raises the question as to what type of work would be best done in Lean, and what would be best left to Rust. I guess that will develop over time, as Lean evolves.</p>",
        "id": 222717848,
        "sender_full_name": "Henry Story",
        "timestamp": 1610631710
    },
    {
        "content": "<p>I have very little Rust experience, but I'd be interested in seeing what you learn from this.   It's somewhat tedious but otherwise straightforward to create Lean APIs that  invoke existing C/C++ code with some glue code interacting with the Lean runtime C API.</p>",
        "id": 222789821,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1610661180
    },
    {
        "content": "<p>RDF parsers and general web tools are going to be more fully developed in Rust than in Lean 4. probably even more developed in the more popular languages like javascript or python rather than rust, if you aren't set on rust per se.</p>",
        "id": 222797042,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1610664709
    },
    {
        "content": "<p>my suggestion is to do as much as you can in rust and then pop over to lean if some component (functors? bicategories? i dunno what that stuff is for but maybe lean is extra good at it) is a lot easier to do in lean</p>",
        "id": 222797245,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1610664817
    },
    {
        "content": "<p>There is some interesting work indeed on Rust and RDF see eg. <a href=\"https://openreview.net/forum?id=CXLmXMb2TJ\">WasmTree: Web Assembly for the Semantic Web</a>, which points to where things are going I think. </p>\n<p>(I am coming from Scala/Scala-JS background which I know well, but as I am on a new project, there is potential to switch, so I am looking around.  Rust  also has HTTP/2.0 implementations which must have been a lot of work to implement. The Scala Akka framework is only now finishing support for those.)</p>\n<p>Also am very intrigued by what the future holds for programming using proof assistants, especially with HoTT allowing one to transport proofs between types. As I am building a security platform, being able to produce proofs of the correctness of the code,  would be very advantageous.</p>",
        "id": 222816525,
        "sender_full_name": "Henry Story",
        "timestamp": 1610682038
    }
]