[
    {
        "content": "<p>When using type classes for overloaded notation, I'd like to be able to provide custom error messages for intentionally-missing instances.</p>\n<p>For instance, if I have a type of positive numbers, then it would be nice to make it so that attempting to synthesize an <code>OfNat Positive Nat.zero</code> gives a message like <code>0 is not positive</code> instead of <code>failed to synthesize instance OfNat Positive 0</code>.</p>\n<p>In Haskell, there's the <code>TypeError</code> constraint that causes GHC to fail with a given message. If Lean had it, then I could write something like:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">instance</span> <span class=\"o\">[</span><span class=\"n\">Fail</span> <span class=\"s2\">\"0 is not positive\"</span><span class=\"o\">]</span> <span class=\"o\">:</span> <span class=\"n\">OfNat</span> <span class=\"n\">Positive</span> <span class=\"mi\">0</span> <span class=\"n\">where</span>\n  <span class=\"n\">ofNat</span> <span class=\"o\">:=</span> <span class=\"n\">Fail.failed</span>\n</code></pre></div>\n<p>Here, <code>failed</code> is intended to make use of some evidence that <code>Fail</code> is uninhabited to discharge obligations in the instance.</p>\n<p>Alternatively, I could imagine some way to add a custom hook through the metaprogramming API.</p>\n<p>Is there some way to do what I'm thinking of here?</p>",
        "id": 291425551,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1659182867
    },
    {
        "content": "<p>There is to my knowledge no way to do this right now, although I do think it sounds like a good idea.</p>",
        "id": 291425825,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1659183269
    },
    {
        "content": "<p>What if there was another way to find the instance? Would the failure take precedence?</p>",
        "id": 291427364,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659185457
    },
    {
        "content": "<p>I would expect that the Lean would follow the usual instance search rules, including rules like \"later takes precedence over earlier\". If the final result ended up being <code>Fail</code>, then failure would be snatched from the jaws of victory.</p>\n<p>This would allow things like improved default error messages in cases when an instance is missing, without it getting in the way of user definitions. For example, one could rewrite \"failed to synthesize instance OfNat Foo 42\" with \"Can't interpret the numeric literal 42 as a Foo because no OfNat Foo 42 instance was found\".</p>\n<p>On the other hand, my main concern was finding out whether something like this exists already - I take this to mean that it doesn't :-)</p>",
        "id": 291427634,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1659185779
    },
    {
        "content": "<blockquote>\n<p>For example, one could rewrite \"failed to synthesize instance OfNat Foo 42\" with \"Can't interpret the numeric literal 42 as a Foo because no OfNat Foo 42 instance was found\".</p>\n</blockquote>\n<p>That message is actually just a fancy way to explain the type of the goal, so I think you could do this without <code>Fail</code>, you would just need some kind of unexpander setup on the final error message</p>",
        "id": 291427940,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659186179
    },
    {
        "content": "<p>That's a good point. Can you point me to any examples I can grep for in the source? I haven't written an unexpander yet :-)</p>",
        "id": 291428045,
        "sender_full_name": "David Thrane Christiansen",
        "timestamp": 1659186343
    },
    {
        "content": "<p>If <code>Fail</code> acts like a real instance, then I would worry about it getting spuriously picked in unrelated searches. For example, we want to prove <code>Inhabited (Fin 1)</code>, so we use an instance saying <code>OfNat (Fin 1) ?n |- Inhabited (Fin 1)</code> (this would be a bad idea but let's just say this exists), and then <code>Fail |- OfNat (Fin 1) 2</code> matches and you miss the other instance which directly proves <code>Inhabited (Fin 1)</code></p>",
        "id": 291428094,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659186373
    },
    {
        "content": "<p>If that fail instance hadn't been provided it would have found the normal instance</p>",
        "id": 291428105,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659186399
    },
    {
        "content": "<p>I actually was just suggesting a possible way to implement this. There is currently no support for customizing the type class failure error message</p>",
        "id": 291428185,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659186501
    },
    {
        "content": "<p>The idea would be that it calls <code>throwTypeclassFailure ty</code> given the type of the goal, and this is a user extensible function so you can say e.g. if <code>ty = OfNat (Fin m) n</code> and <code>m &lt; n</code> then <code>throwError \"{n} is not a member of `Fin {m}`\"</code></p>",
        "id": 291428289,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659186660
    }
]