[
    {
        "content": "<p>I'm having some fun formalizing Music Theory in Lean 4 <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> <br>\nIf you're interested: <a href=\"https://github.com/arthurpaulino/LeanMusic\">https://github.com/arthurpaulino/LeanMusic</a></p>",
        "id": 266450318,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640890972
    },
    {
        "content": "<p>Maybe this is already what you're thinking, but one goal you could have that's in that general direction is to formalize so-called \"musical set theory\" (that's the theory of musical sets, by the way, not set theory that's musical). There are something you could prove about properties of different sets of pitch classes and how they're acted upon by the group generated by inversion and transposition. You can do the same with tone rows (permutations of the 12 pitch classes), but its group has other operations reversing the pitches in time.</p>",
        "id": 266451082,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1640891700
    },
    {
        "content": "<p>This is only part of the theory for some specific kinds of 20th century music, but it seems particularly well-suited for formalization.</p>",
        "id": 266451225,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1640891840
    },
    {
        "content": "<p>I'm definitely going to check that out. But from what you described, it's very similar to what I have in mind. I want to have some results about equivalence of scales, definition of chords and their inversions, harmonic fields and their relationships with chords.<br>\nI also want to reach the point of proving that, for instance, every M7+ chord is in two different harmonic fields etc. This is for melody/harmony.</p>\n<p>There's also an entertaining amount of arithmetic involved in rhythm and bar signatures. But I will think about it later</p>",
        "id": 266453228,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640893370
    },
    {
        "content": "<p>Musical set theory doesn't care too much about triadic harmony, but it can't hurt developing it for all the different equivalences.</p>\n<p>If you also do \"pointed musical sets,\" which is some math-inspired terminology I just made up for a musical set along with a chosen pitch class in it, then you can use that chosen pitch class as the root of the chord, which is important for chord identification.</p>",
        "id": 266453876,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1640894041
    },
    {
        "content": "<p>Do you have some references on musical set theory?</p>",
        "id": 266454676,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640894748
    },
    {
        "content": "<p>There are some places where I hardcoded \"12\". I can see how this theory can be generalized for any amount of different pitches</p>",
        "id": 266455257,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640895287
    },
    {
        "content": "<p>You're formalizing 12 EDO (equal division of the octave). Here is one possible entry point into alternative scales: <a href=\"https://en.xen.wiki/w/Main_Page\">https://en.xen.wiki/w/Main_Page</a> (the xenharmonic wiki)</p>",
        "id": 266455655,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1640895695
    },
    {
        "content": "<p>(For example, <a href=\"https://en.wikipedia.org/wiki/53_equal_temperament\">53 EDO</a> has a better approximation of the 3/2 frequency ratio (a perfect fifth) than 12 EDO, and it has a good, if a bit flat, 5/4 ratio (a just major third). I believe Newton noticed this when studying convergents of logarithms, though he wasn't the first.)</p>",
        "id": 266456061,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1640896085
    },
    {
        "content": "<p>Mother god, by seeing the impossibility to prove a theorem I was able to notice a bug in a function that I wasn't able to catch with tests <span aria-label=\"open mouth\" class=\"emoji emoji-1f62e\" role=\"img\" title=\"open mouth\">:open_mouth:</span></p>",
        "id": 266467459,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640907926
    }
]