[
    {
        "content": "<p>Does anyone have a best practice guideline for using Lean 4 with Gitpod? This used to work:<br>\n<a href=\"https://github.com/avigad/lamr\">https://github.com/avigad/lamr</a><br>\nBut now it gives the message:</p>\n<p>info: downloading component 'lean'<br>\n  error: binary package was not provided for 'linux'</p>\n<p>I can fix it by typing <code>elan self update</code> and then <code>lake build</code> in the terminal and then restarting the server. But if I try adding <code>lean self update</code> to the <code>init</code> portion of the <code>.yml</code> file, it doesn't work.</p>\n<p>As a fallback, I suppose I can delete the line that fetches elan and let the Lean 4 extension do it. But it would be nice to do <code>lake build</code> in the <code>init</code> section, because Gitpod will prebuild the image with that and make loading faster.</p>",
        "id": 307433205,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1667350802
    },
    {
        "content": "<p>Update: updating elan in the Dockerfile (instead of the yml file) seems to have done the trick! So, never mind (unless someone has a better solution).</p>",
        "id": 307434204,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1667351454
    },
    {
        "content": "<p>Any change to the Dockerfile probably would have been sufficient because it would invalidate the cached image. You can also do so manually without editing the file, <a href=\"https://www.gitpod.io/docs/configure/workspaces/workspace-image#manually-rebuild-a-workspace-image\">https://www.gitpod.io/docs/configure/workspaces/workspace-image#manually-rebuild-a-workspace-image</a></p>",
        "id": 307476004,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1667379221
    },
    {
        "content": "<p>Wanting to get a little experience with Lean 4, I recently watched Scott's tutorial on porting things to Lean 4. I started following the instructions but I stopped when it got to the point where I had to actually install Lean 4, because it was telling me I would have to update elan, and I was afraid that would interfere with my Rosetta installation of elan. Is there a way of working on mathlib4 through Gitpod?</p>",
        "id": 307494097,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1667385632
    },
    {
        "content": "<p>Is there a reason that video is unlisted by the way <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> ? I thought it was a good tutorial on the porting process.</p>",
        "id": 307495958,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1667386260
    },
    {
        "content": "<p>Only that it seemed likely to quickly become outdated. I don't mind if it is switched to public so people can find it on the leanprover-community YouTube page. I'm away from a computer at that moment but if I remember tomorrow I'll change the setting.</p>",
        "id": 307496383,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1667386429
    },
    {
        "content": "<p>I’ve found packing more instructions in the Dockerfile than in the bespoke config files (either GitPod or Codespaces) to generally be better.</p>",
        "id": 307499919,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1667387733
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"282271\">Bolton Bailey</span> <a href=\"#narrow/stream/270676-lean4/topic/Gitpod/near/307494097\">said</a>:</p>\n<blockquote>\n<p>because it was telling me I would have to update elan, and I was afraid that would interfere with my Rosetta installation of elan</p>\n</blockquote>\n<p>I'm not aware of anything that could go wrong with that fwiw. You should not need a second elan.</p>",
        "id": 307501819,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1667388460
    }
]