[
    {
        "content": "<p>In Lean 3 I really loved the fact that if I wanted to import continuous functions but I have no idea what the actual name of the import is, but I can remember that it involves <code>continuity</code> or <code>continuous</code> or something, then I can just type <code>import continu</code>, press ctrl-space, and see all the possible valid mathlib imports; from there it's really easy to spot that <code>import topology.continuous_function.basic</code> is what I want.</p>\n<p>In Lean 4 I can't get this to work. I wanted to import <code>whatsnew</code> and I knew the import was Import something.something.whatsnew or something like that, maybe in Std or mathlib, but I am old and stupid and I can't remember exactly where it is or how to capitalise it, so I type <code>import whatsnew</code> and press ctrl-space and I get nothing. Is there another trick? I just have to switch to the searchbar and search all of mathlib for whatsnew and then switch back and type in whatever I found manually. Hardly the end of the world, but the Lean 3 version was cooler :-)</p>",
        "id": 314346313,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670369048
    },
    {
        "content": "<p>When we do regular programming in other languages quite often there is a code action that automatically searches through the available names from other files and suggests you to import this and that file. It'd be pretty cool if we could have a code action like that in the future.</p>",
        "id": 314346758,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1670369280
    },
    {
        "content": "<p>Auto-completion for imports is not implemented yet but <a href=\"https://github.com/leanprover/lean4/pull/1884\">lean4#1884</a> made some headway towards it.</p>",
        "id": 314351170,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1670371384
    },
    {
        "content": "<p>Also, when what you're looking for is not a specific import but a declaration in <em>some</em> import, workspace symbol search (<code>Ctrl-T</code>) can show you the file name it's defined in</p>",
        "id": 314446123,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1670416879
    }
]