[
    {
        "content": "<p>I've run into a specific Lean 4 bug a few times but so far failed to minimize it, in fact the locations where the bug appears have always been places where I build concrete instances of complex dependent types, so it sort of resists minimization. Therefore I'm posting here in the hope that someone could either offer some guidance on how to minimize it, or look at my code directly. (Sorry, it's really not small.)</p>\n<p>The symptom is that definitions fail to compile with \"(kernel) function expected\". The (expected) function that is displayed in the message is actually an object with a <code>CoeFun</code> instance, i.e. there is some situation where Lean forgets to use this instance and outputs a raw function application instead. Unfortunately, the failure is always quite a few layers of abstraction away from the code where the function application (via <code>CoeFun</code>) actually happens.</p>\n<p>It seems that at least two ingredients are required for the bug to occur:</p>\n<ul>\n<li>The code where the function application happens is used as part of a parameter <code>x</code> of a dependent type <code>T (x : ...)</code>. The definition where the failure occurs receives an instance of <code>T x</code> and then uses the value of <code>x</code> as part of the definition.</li>\n<li>Apparently, the bug only occurs if <code>x</code> involves sufficiently complex structures/classes. I find this part especially hard to pinpoint, but now at least I have a single commit that triggers the bug at a specific location, and the change that triggered it was essentially just a refactoring that moves fields between structures and classes.</li>\n</ul>\n<p>Anyway, I have committed the broken state to master in my repo at <a href=\"https://github.com/SReichelt/universe-abstractions\">https://github.com/SReichelt/universe-abstractions</a>. The failing definitions are <a href=\"https://github.com/SReichelt/universe-abstractions/blob/3f7bae7fee593af6f571a87a053b632980e60860/UniverseAbstractions/Instances/HomUniverses/Type.lean#L125\">https://github.com/SReichelt/universe-abstractions/blob/3f7bae7fee593af6f571a87a053b632980e60860/UniverseAbstractions/Instances/HomUniverses/Type.lean#L125</a> and a few following ones. Any help would be appreciated, thanks!</p>",
        "id": 268924689,
        "sender_full_name": "Sebastian Reichelt",
        "timestamp": 1642813056
    },
    {
        "content": "<p>I've managed to reduce it to 1150 self-contained lines: <a href=\"https://gist.github.com/SReichelt/70a75eb4a7e8b899294d8b1a72c1833a\">https://gist.github.com/SReichelt/70a75eb4a7e8b899294d8b1a72c1833a</a><br>\nSome further simplifications made the bug disappear, but I feel that I could reduce it a lot further if I had a better handle on the cause of this bug. Any ideas?</p>",
        "id": 268962256,
        "sender_full_name": "Sebastian Reichelt",
        "timestamp": 1642864439
    },
    {
        "content": "<p>Oh, I found a workaround: <a href=\"https://gist.github.com/SReichelt/70a75eb4a7e8b899294d8b1a72c1833a#file-kernelfunctionexpected-lean-L705\">https://gist.github.com/SReichelt/70a75eb4a7e8b899294d8b1a72c1833a#file-kernelfunctionexpected-lean-L705</a><br>\nI suppose that could give a hint about the nature of the bug as well.</p>",
        "id": 268969272,
        "sender_full_name": "Sebastian Reichelt",
        "timestamp": 1642873984
    }
]