[
    {
        "content": "<p>I hear  that under some formal systems proof equivalence is well-defined by normal form equality, so I was wondering if we can equate Lean4 programs in any way?   Also is variable substitution permutations (of all \"variable symbols\" including type variables and possibly even constants &amp; other symbols) plus normal form an even stronger equality?</p>",
        "id": 268225810,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1642392698
    },
    {
        "content": "<p>AFAIK, equality of proofs is given by Lean's underlying calculus (<a href=\"https://github.com/digama0/lean-type-theory/releases/tag/v1.0\">#leantt</a>) - it defines a notion of \"definitional equality\" and states that all proofs of the same proposition are definitionally equal. <br>\nFor programs, i.e. functions, Lean allows us to equate them by \"function extensionalty\", using the <code>funext</code> axiom. It states that two functions which agree on all inputs are equal. <br>\nJudging from your question, this is probably rather unsatisfactory for you though <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> So if you want to go more in the direction of directly comparing terms, Lean's <code>Expr</code> type might be interesting for you.</p>",
        "id": 268239278,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1642407501
    },
    {
        "content": "<p>There does exist the so called weak head normal form (or <code>whnf</code> in code) for the <code>Expr</code> type but its job is not to always show equality of all <code>Expr</code> terms (if they are equal that is), only for a select subset.</p>",
        "id": 268239435,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1642407621
    },
    {
        "content": "<p>I would also not be surprised if writing such a program is in fact impossible since this would be equivalent to a solver for any <code>=</code> proposition right? Seems unlikely to me that a general program for this does exist and if it exists it probably runs in infeasible time.</p>",
        "id": 268239617,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1642407747
    },
    {
        "content": "<p>The <code>#reduce</code> function can be used to compute the normal form of any lean term. It is not impossible, but it definitely has galactic complexity bounds. The status of strong normalization in lean is a little unclear though. It is mostly true for CIC-like systems, but false for proofs in <code>Prop</code> because of proof irrelevance (there is a recent counterexample by Coquand and Abel); it is still open for VM-style evaluation where proofs are skipped but other data types are computed until normalization.</p>",
        "id": 268284406,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1642433083
    },
    {
        "content": "<p>It's not equivalent to solving <code>=</code> propositions, this is certainly undecidable. The normal forms of <code>a + (b + c)</code> and <code>(a + b) + c</code> are not the same, even though they are provably (propositionally) equal (where <code>a,b,c : nat</code>)</p>",
        "id": 268284710,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1642433220
    }
]