[
    {
        "content": "<p>I've been following the steps of the nix setup guide, but I keep getting the following error message once I try to run any nix command in the setup package:<br>\n<code>error: getting status of '/nix/store/0ccnxa25whszw7mgbgyzdm4nqc0zwnm8-source/lean': No such file or directory</code></p>\n<p>I'm relatively proficient with nix itself, but I don't know all that much about flakes, only that I've been having issues with other flakes that used <code>eachDefaultSystem</code> before, since it doesn't include <code>aarch64-darwin</code>. I've tried many different things, including trying to inspect the derivation with <code>nix show-derivation</code> and setting my system to <code>x86_64-darwin</code> in some ways locally for the lean shell, but I always just get this error message, without any extra information of where it's coming from.</p>\n<p>Any ideas on what I could be doing to fix this, that don't involve setting my system to <code>x86_64</code> globally?</p>",
        "id": 299548733,
        "sender_full_name": "Andre Knispel",
        "timestamp": 1663588155
    },
    {
        "content": "<p>Mmh, I haven't seen this error before. But you should usually get more context using <code>--show-trace</code></p>",
        "id": 299549406,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1663588491
    },
    {
        "content": "<p>Good point, usually nix reminds me of that but it didn't this time. But it actually also doesn't print anything else</p>",
        "id": 299550847,
        "sender_full_name": "Andre Knispel",
        "timestamp": 1663589031
    },
    {
        "content": "<p>I get the feeling that this is a very early failure, since I poked it in many ways and I couldn't get any other information out of it</p>",
        "id": 299551079,
        "sender_full_name": "Andre Knispel",
        "timestamp": 1663589131
    },
    {
        "content": "<p>In fact, even derivations that don't exist just give that error message. For example if I run <code>nix build .#abc</code></p>",
        "id": 299552046,
        "sender_full_name": "Andre Knispel",
        "timestamp": 1663589519
    }
]