[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> I am having some trouble using a lake project that includes a custom C++ target. </p>\n<ul>\n<li>Calling the C++ function in the Lean package from <code>main</code> works</li>\n<li>Calling the C++ function in the Lean package from the interpreter fails</li>\n<li>In a separate project, importing the first project and calling the C++ function from the interpreter also fails</li>\n</ul>\n<p>I am guessing these are expected. What is the recommended setup so that e.g. a tactic can be called that wraps C++ code?</p>",
        "id": 253619310,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1631813585
    },
    {
        "content": "<p>Also, is it possible to create a \"fake\" <code>lake</code> project? Specifically, I would like to \"wrap\" the binport <code>.olean</code>s in such a way that it is easy to depend on them from downstream lake projects.</p>",
        "id": 253622576,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1631814886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"230999\">@Daniel Selsam</span> my understanding is that in order to use C/C++ functions with interpreted Lean, you need to provide the library in question as a plugin to Lean (and, on non-Windows systems add it to <code>LD_PRELOAD</code>). Have you tried that? There was some useful discussion on how to do this in your  <a href=\"#narrow/stream/270676-lean4/topic/mwe.3A.20plugin.3F/near/240193098\"><code>mwe: plugin?</code></a> thread.</p>",
        "id": 253630054,
        "sender_full_name": "Mac",
        "timestamp": 1631817751
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"230999\">Daniel Selsam</span> <a href=\"#narrow/stream/270676-lean4/topic/lake/near/253622576\">said</a>:</p>\n<blockquote>\n<p>Also, is it possible to create a \"fake\" <code>lake</code> project? Specifically, I would like to \"wrap\" the binport <code>.olean</code>s in such a way that it is easy to depend on them from downstream lake projects.</p>\n</blockquote>\n<p>This is kind of a weird use case for the current  Lean package-focused Lake. When Lake eventually becomes more dynamic and can be used for arbitrary targets, this will probably be better supported. </p>\n<p>However, you could conceivable accomplish this with the current Lake by outputting the produced <code>.olean</code> files in the <code>build/lib</code> directory of the package (so that get included in dependent packages <code>LEAN_PATH</code>) and  even include the build process for porting <code>.olean</code> files in the <code>extraDepsTarget</code> so that it occurs ever time the package is built.  However, you would still need to give Lake a dummy module root to build (though it doesn't need to actually contain anything).</p>",
        "id": 253631640,
        "sender_full_name": "Mac",
        "timestamp": 1631818378
    },
    {
        "content": "<p>Example added at <a href=\"https://github.com/leanprover/lake/tree/a875ccfd9db5619f2eb7610102df00a0dddd65ee/examples/main\"><code>examples/main</code></a>.</p>",
        "id": 253635344,
        "sender_full_name": "Mac",
        "timestamp": 1631819752
    },
    {
        "content": "<p>Also, fyi, all the Lake package configuration options are now documented at the bottom of the <a href=\"https://github.com/leanprover/lake#configuration-options\">README</a> (and in the code itself).</p>",
        "id": 253636205,
        "sender_full_name": "Mac",
        "timestamp": 1631820106
    },
    {
        "content": "<p>On Linux / macOS relying on LD_PRELOAD can be avoided using a patch along the lines of <a href=\"https://github.com/leanprover/lean4/pull/665\">https://github.com/leanprover/lean4/pull/665</a>, that is by making the dynamic library handles part of the state of the interpreter. The way I've implemented it there is kind of a hack, but it eliminates the need for LD_PRELOAD.</p>",
        "id": 253653848,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631827621
    },
    {
        "content": "<p>I personally would like to see Bazel build definitions for Lean, that gives you package management and multi-language compatibility for free.</p>",
        "id": 253654387,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631827884
    },
    {
        "content": "<p>Unfortunately Bazel does not support the kind of dynamic dependency management that is necessary to connect Lean build units according to their <code>import</code> statements AFAIK. Same with Meson.</p>",
        "id": 253655045,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1631828188
    },
    {
        "content": "<p>Aren't lean build dependencies structured just like C/C++ build dependencies? You have some <code>#include</code> statements and that implies a dependency order</p>",
        "id": 253655645,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1631828551
    },
    {
        "content": "<p>No, you (usually) don't compile headers before including them</p>",
        "id": 253655833,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1631828653
    },
    {
        "content": "<p>It is true that one can't dynamically create new dependencies, but I don't see how that would be a major obstacle. BUILD files are typically written in a relatively small granularity and specifying all inputs and dependencies explicitly.</p>",
        "id": 253655835,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631828655
    },
    {
        "content": "<p>Exactly, who'd want to do that for a Lean project?</p>",
        "id": 253655891,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1631828704
    },
    {
        "content": "<p>If one had a lean_library rule, it wouldn't really matter if that used <code>lean --deps</code> internally.</p>",
        "id": 253655943,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631828732
    },
    {
        "content": "<p>Because all the other benefits of Bazel far outweigh the tediousness of doing that, at least for projects involving C++, external dependencies etc.</p>",
        "id": 253656051,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631828780
    },
    {
        "content": "<p>and lean --deps would only be used to figure out a much smaller dag (on files in the current library).</p>",
        "id": 253658292,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631829984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span> the goal of Lake is to create a similar build system, but with features more appropriate for Lean. The need for dynamic dependencies is just one such feature. There is also integration with the Lean server / widgets / plugins that needs to be considered.</p>\n<p>While adapting a more mature system like Bazel certainly does have its advantages, it also means that end-users need to familiarize themselves with two languages and once again have a working dev environment. The current plan is to work towards needing no external dependencies for basic Lean use (not even a MSYS2 shell on Windows, for instance) and Bazel would be a step in the opposite direction.</p>\n<p>It also means it would be much harder to adapt the build system as needed as Lean 4 evolves. However, I imagine an interop between Bazel and Lake/Lean would be more than welcome if someone (like you) wanted to take on the project themselves.</p>",
        "id": 253663970,
        "sender_full_name": "Mac",
        "timestamp": 1631833238
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> I understand that rationale. Lake seems like a great step towards making Lean usable with minimal dependencies and across platforms. Bazel is unfortunately not a lightweight dependency and other alternatives like please are niche. For the specific use case of integrating with C++/other languages it (or gn / meson) still feels preferable, since otherwise you either maintain two build systems or end up implementing the n-th C++ build system.</p>",
        "id": 253665304,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631834074
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span>  true, though Ideally the only C++ code one should be writing with Lean should be bindings. In which case, the library you are binding to should ideally already have a built dynamic/static library to link to and thus one should only be compiling the glue code, which should hopefully not be that complex to build. Though, admittedly, that is a lot of \"shoulds\".</p>",
        "id": 253665725,
        "sender_full_name": "Mac",
        "timestamp": 1631834366
    },
    {
        "content": "<p>Honestly,  the more hear from you, <span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span>, the more curious I am as to what you are writing that has inspired all these stated complications. I thought my LLVM bindings were are rather complex project for beta Lean 4, but whatever you are doing  sounds so much more so.</p>",
        "id": 253666405,
        "sender_full_name": "Mac",
        "timestamp": 1631834831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> well maybe I should be a bit more specific. For what I'm doing right now with Lean simply writing C++ binding code is sufficient. I want to use the bindings interactively (hence the plugin). I'm now experimenting with transformations in the IR and have done a simple modifications to the C backend / interpreter to support Float32 (mostly to understand how hard it would be to add additional unboxed datatypes).  The next step would involve emitting to MLIR, which would probably be on the level of complexity of your really nice LLVM bindings.</p>\n<p>At work we use one build system (waf...) for C/C++, Python, Rust, System Verilog, VHDL, manage external dependencies with Spack and deploy to Singularity containers and several embedded hardware platforms / FPGAs / simulated ASICs (a lot of our code is open source <a href=\"https://github.com/electronicvisions\">https://github.com/electronicvisions</a>). We end up autogenerating bindings for (almost) all C++ code using libclang. In principle since Lean compiles to C it would be possible to deploy it at any level of this stack (<a href=\"https://github.com/GaloisInc/lean4-balance-car\">https://github.com/GaloisInc/lean4-balance-car</a> is a cool example). </p>\n<p>Of course for greenfield projects and to build an open source library ecosystem a package manager like Lake is more appropriate.</p>",
        "id": 253672429,
        "sender_full_name": "Christian Pehle",
        "timestamp": 1631839311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span> That's really cool! </p>\n<p>I also am especially interested in your work on adding more unboxed data types to the IR. If such a thing is feasible, it would be quite cool to do something similar in Papyrus (e.g., for arbitrary precision LLVM Integers and the various float datatypes).</p>",
        "id": 253675345,
        "sender_full_name": "Mac",
        "timestamp": 1631841665
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> <span class=\"user-mention\" data-user-id=\"130511\">@Christian Pehle</span> Thanks to both of you, I was able to get my plugin use-case working.</p>",
        "id": 253675735,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1631841984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"230999\">Daniel Selsam</span> <a href=\"#narrow/stream/270676-lean4/topic/lake/near/253622576\">said</a>:</p>\n<blockquote>\n<p>Also, is it possible to create a \"fake\" <code>lake</code> project? Specifically, I would like to \"wrap\" the binport <code>.olean</code>s in such a way that it is easy to depend on them from downstream lake projects.</p>\n</blockquote>\n<p>A side effect of the the module globs that <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>  suggested (which are now in Lake master) is that you can now configure a package with no modules. So, a fake lake project like this should be fully possible now.</p>",
        "id": 254637378,
        "sender_full_name": "Mac",
        "timestamp": 1632447777
    }
]