[
    {
        "content": "<p>Currently, lake will print out the command it uses to compile every file. This is useful in some circumstances, but it makes it more difficult to spot warnings and errors and I have started piping the output through grep so that don't have to hunt for the actual warnings in a sea of text. I would propose that the current output be hidden behind a <code>-v</code>/<code>--verbose</code> flag, and the default behavior should be to skip those lines but print anything that lean has to say.</p>\n<p>In the future, it might be better to get a more ncurses-style status view, similar to what lean 3 does (but less buggy on long file names). That way you can at least see progress through the files.</p>",
        "id": 290978454,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1658886965
    },
    {
        "content": "<p>I was going to ask for the same thing!</p>",
        "id": 290978557,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1658887083
    },
    {
        "content": "<p>This is on the the TODO list, and I hope to get around to it. Unfortunately, I only have two weeks left in my internship before I have to switch back to focus on my dissertation research. Thus, I am not sure whether I will have the time. I do hope to still sporadically update Lake in the Fall, so hopefully this won't be on the list for another whole year.</p>",
        "id": 291001311,
        "sender_full_name": "Mac",
        "timestamp": 1658908826
    },
    {
        "content": "<p>The <code>-v</code> change should be a small one (just gate the print behind a conditional). I can try to make a PR if you don't have the time</p>",
        "id": 291002112,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1658909435
    },
    {
        "content": "<p>resurrecting this, I'd love to have less verbose output from lake, seems an easy way to get a huge UX improvement</p>",
        "id": 299829456,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1663700921
    },
    {
        "content": "<p>This should have landed already</p>",
        "id": 299829493,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663700937
    },
    {
        "content": "<p>I'm getting messages like <code>Building Foo.Bar</code>, is that not your experience?</p>",
        "id": 299829536,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663700956
    },
    {
        "content": "<p><code>Lake version 4.0.0 (Lean version 4.0.0-nightly-2022-09-15)</code></p>",
        "id": 299829704,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663700990
    },
    {
        "content": "<p>Oh, wait, you're right -- lake gives relatively minimal output. I was thinking of the language server error messages at the top of files when their dependencies don't compile, which have nothing to do with lake</p>",
        "id": 299830196,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1663701148
    },
    {
        "content": "<p>That's <a href=\"https://github.com/leanprover/lean4/pull/1438\">lean4#1438</a></p>",
        "id": 299830358,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1663701206
    }
]