[
    {
        "content": "<p>This issue was brought up in general <a href=\"#narrow/stream/113488-general/topic/algorithm.20for.20avoiding.20having.20my.20hard.20drive.20wiped\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/algorithm.20for.20avoiding.20having.20my.20hard.20drive.20wiped</a>, now what kevin is talking about is most likely a pretty common use case among people that teach with Lean. And for mathematicians it's probably a little bit much to ask them to setup some external sanboxing themselves even if we explain exactly how to do it. My alternative idea would be, that we introduce a flag that can be set in the lakefile which basically makes the build system use seccomp before loading any sort of user code, filtering as many system calls as possible without breaking it. Ideally we could thus lock in the process that is running user code to the point where everything it can do is maybe some printing to stdout or something.</p>\n<p>Does this seem doable/reasonable? I'm not entirely familiar with how the LSP and compilation work internally so maybe it actually needs some calls with destructive power that we can simply not seccomp? But if its doable it would be as simple as switching a boolean in lakefile.lean.</p>",
        "id": 270914951,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1644185633
    },
    {
        "content": "<p>At first gloss, I see a few problems with this:</p>\n<ol>\n<li><code>seccomp</code> is not cross-platform (i.e., it is Linux-specific), Lake is, so we would need something equivalent for Windows</li>\n<li>I am not sure how you could feasibly restrict the abilities of the <code>lean</code> process so as to make it secure. In order to compile the file, the <code>lean</code> process needs to be able read, write, memory map, (and, I think, even execute) files so that it can import modules and output the build results. As such, it would be powerful enough to act maliciously as well (e.g., wipe whatever files the user running <code>lake</code> has access to).</li>\n</ol>",
        "id": 270931544,
        "sender_full_name": "Mac",
        "timestamp": 1644208262
    },
    {
        "content": "<p>Does Linux have something equivalent to OpenBSDs <code>unveil</code> that would restrict file related system calls to certain directories/files? That way these destructive system calls would not matter.</p>",
        "id": 271016612,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1644256499
    },
    {
        "content": "<p>I'm not sure if you want to write a seccomp sandbox yourself, but it's fairly easy to wrap lake using bubblewrap (only allowing write access to the current directory, but you might also want to consider making <code>.git</code> read-only for obvious security reasons):</p>\n<div class=\"codehilite\" data-code-language=\"Bash\"><pre><span></span><code>bwrap --proc /proc --dev /dev <span class=\"se\">\\</span>\n  --ro-bind /nix<span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  --ro-bind <span class=\"nv\">$HOME</span>/.elan<span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  --bind <span class=\"nv\">$PWD</span><span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  --ro-bind /run/current-system<span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  --ro-bind /run/systemd<span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  --ro-bind /etc<span class=\"o\">{</span>,<span class=\"o\">}</span> <span class=\"se\">\\</span>\n  lake build\n</code></pre></div>",
        "id": 271017147,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1644256687
    }
]