[
    {
        "content": "<p>Do I understand correctly that lake new/init always fills Main.lean with \"hello world?\". Or is there a way to ask lake to create a \"neutral\" project, i.e. one with an empty Main?</p>",
        "id": 321320614,
        "sender_full_name": "Rudolf Meijer",
        "timestamp": 1673687960
    },
    {
        "content": "<p>Yes, it always puts the hello world in. You can always just delete the content of the file if you are past the hello world stage</p>",
        "id": 321322347,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673688787
    },
    {
        "content": "<p>an empty file is kind of hard to use as a starting point, because you could put anything in there, it's not even obviously lean code at that point</p>",
        "id": 321322459,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673688843
    },
    {
        "content": "<p>(also it's nice to know that your setup is working in the sense you can interact with the hello world definition)</p>",
        "id": 321380414,
        "sender_full_name": "James Gallicchio",
        "timestamp": 1673713222
    },
    {
        "content": "<p>Understood. Subsidiary question: the Std that I have pulled in one project's lakefile, is that also valid for other projects, or do I have to pull Std in each project?</p>",
        "id": 321386665,
        "sender_full_name": "Rudolf Meijer",
        "timestamp": 1673716189
    },
    {
        "content": "<p>different projects are completely independent, you have to put the dependency in each project you want to use it in</p>",
        "id": 321392731,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673719566
    },
    {
        "content": "<p>You can point multiple projects to the same <code>lake-packages</code> directory if you are worried about using too much space, although if you have different versions of dependencies in different projects then you might end up bouncing between the versions</p>",
        "id": 321392849,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673719658
    },
    {
        "content": "<p>Thx</p>",
        "id": 321397543,
        "sender_full_name": "Rudolf Meijer",
        "timestamp": 1673722419
    }
]