[
    {
        "content": "<p>I pushed the new guide up tonight: <a href=\"https://agentultra.github.io/lean-4-hackers/\">https://agentultra.github.io/lean-4-hackers/</a></p>\n<p>It's still a work in progress! I'm a <em>push early, push often</em> kind of person. I'll be adding more content following the style of the Lean 3 for Hackers guide with some new programs and different takes.</p>\n<p>Thank you to the Lean community and the developers <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span> Your enthusiasm and expertise are inspiring!</p>",
        "id": 261451747,
        "sender_full_name": "James King",
        "timestamp": 1636944182
    },
    {
        "content": "<p>Nice! Two comments:</p>\n<ul>\n<li>One should install <code>leanprover/lean4:nightly</code>, <code>stable</code> is very outdated at the moment.</li>\n<li>We are moving away from <code>leanpkg</code>, so the instructions would ideally point people towards <code>lake</code>. It has the same sort of command structure, but it's a different build system.</li>\n</ul>",
        "id": 261452112,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1636944799
    },
    {
        "content": "<p>Oh sweet, thanks for the update!</p>",
        "id": 261452124,
        "sender_full_name": "James King",
        "timestamp": 1636944830
    },
    {
        "content": "<p>Updated the guide and added a new section. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 261591036,
        "sender_full_name": "James King",
        "timestamp": 1637030480
    },
    {
        "content": "<p>A couple of comments:</p>\n<ul>\n<li>You say \"Note that the .gitignore file may need to be modified to contain: ...\". Lake always adds '/build' to the '.gitignore' file so I don't think that modification is ever necessary.</li>\n<li>Might also mention the 'lakefile.lean' and 'lean-toolchain' files created by Lake.</li>\n<li>I am using a MacOS so I don't know if this is system dependent, but all three build folders have '.trace' files in them. Possibly worth mentioning them if not system specific. I have no idea what they are for.</li>\n</ul>",
        "id": 261612487,
        "sender_full_name": "Paul  Chisholm",
        "timestamp": 1637053128
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"220270\">@James King</span> You should also include stuff about the nix setup. I'm all in for that and use nix for building all software. Nix offers a plug and play experience for any software project which is really nice. It builds all packages deterministically and content addressed which means caching and distribution of builds is super easy.<br>\nTake a lot at the experimental template I set up here <a href=\"https://github.com/yatima-inc/nix-utils/tree/main/templates/lean-package\">https://github.com/yatima-inc/nix-utils/tree/main/templates/lean-package</a><br>\nMore work is needed, but this is a working deterministic build system</p>",
        "id": 261846059,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637181839
    },
    {
        "content": "<p>To be honest, I'd prefer to keep discussion of nix out of any getting started and new user guides.</p>",
        "id": 261848550,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1637182910
    },
    {
        "content": "<p>In my understanding, nix is great until you have aspirations to work on all platforms. The Lean ecosystem needs to work painlessly on windows and macos, and hopefully all getting started guides can be written as platform agnostically as possible</p>",
        "id": 261848563,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1637182914
    },
    {
        "content": "<p>Yeah. There is nothing about nix that is very platform dependent really, but the windows support is not good (WSL is no problem though). MacOS support is okay for many things I think. I use NixOS myself.</p>",
        "id": 261849726,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637183429
    },
    {
        "content": "<p>Nix should in theory be the best platform agnostic build tool, but not enough effort has been put into this yet</p>",
        "id": 261849853,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637183497
    },
    {
        "content": "<p>I have never used nix, but it is not clear to me what advantage it brings for people who don't want to move their entire development process into its framework. Installing stuff works just fine for me, I don't have configuration bugs on a regular basis so repeatable builds is only a problem for software distributors and CI maintainers, not me (unless I hit on a configuration bug of course)</p>",
        "id": 261850355,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1637183756
    },
    {
        "content": "<p>If nix is a \"build tool\" then why should users need to care about it? If they just get the resulting executable then no build process is needed</p>",
        "id": 261850600,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1637183881
    },
    {
        "content": "<p>if you mean the build process for lean projects, that's managed by lake not nix</p>",
        "id": 261850714,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1637183922
    },
    {
        "content": "<p>There is a nix build as well which works very fine. I use this for all my lean projects.<br>\nYou need to try it to experience the benefits. It is not perfect, but since I started using it I've never wanted to go back.<br>\nNix is just as nice for one package as it is for the entire system. <br>\nIt is not about installing stuff as much as providing a very configurable content addressed environment. Usually you express all dependencies in a file.<br>\nIt has been especially useful for FFI since it can load and build any package.</p>",
        "id": 261851658,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637184347
    },
    {
        "content": "<p>The thing nix does that for example lake doesn't is provide the content addresses lean binary and Lean packages for the build which can be set to any value. You don't need elan because nix provides lean already.</p>",
        "id": 261852076,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637184544
    },
    {
        "content": "<p>I'd consider adding a separate page off the main one for nix at least. I'm not a nix user myself but I know quite a few hackers who are. A PR would be more than welcome as I'm not sure I should be writing about nix. :)</p>",
        "id": 261869178,
        "sender_full_name": "James King",
        "timestamp": 1637194060
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"433842\">Anders Christiansen Sørby</span> <a href=\"#narrow/stream/270676-lean4/topic/lean.204.20hackers/near/261852076\">said</a>:</p>\n<blockquote>\n<p>The thing nix does that for example lake doesn't is provide the content addresses lean binary and Lean packages for the build which can be set to any value. You don't need elan because nix provides lean already.</p>\n</blockquote>\n<p>I do not get this statement. Currently, everything lake builds and uses <em>is</em> content addressed -- that is what  the <code>.trace</code> file is  -- the content hash for fetching the target in question.</p>",
        "id": 261882926,
        "sender_full_name": "Mac",
        "timestamp": 1637207311
    },
    {
        "content": "<p>Also, even without Lake, every Lean package is content addressed because they are Git repositories and thus the commit hash serves as a content address.</p>",
        "id": 261882959,
        "sender_full_name": "Mac",
        "timestamp": 1637207393
    },
    {
        "content": "<blockquote>\n<p>To be honest, I'd prefer to keep discussion of nix out of any getting started and new user guides.</p>\n</blockquote>\n<p>I can only agree with this statement.  The nix build is a wonderful tech demo.  I would have never thought that you could use nix on this level of granularity and that it would be as fast as Sebastian made it.</p>\n<p>That said, it splits the ecosystem.  The nix build configuration is completely separate from the lake one.  You effectively need to maintain (and test) two build configurations.  Otherwise we get into a wonderful version of hell: \"yes we have a formalization of reals and a formalization of linear algebra.  But one uses nix and the other uses lake, so no you can't use them together.\"</p>\n<p>I think that the nix build should only be used in production once we have a reliable lake2nix tool.  And then the lakefile should always come first.</p>",
        "id": 261905500,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1637228854
    },
    {
        "content": "<blockquote>\n<p>which means caching and distribution of builds is super easy.</p>\n</blockquote>\n<p>While this sounds like a neat solution on first glance, I don't think this will work for formalized mathematics (where we have multi-hour build times).  For the current programming projects this is much less of a necessity.  Who needs caching if a fresh build only takes a minute?</p>\n<p>The reason I don't think it will work for math is because nix (by design) only reuses the cache if it was produced by the same Lean binary, with the same dependencies, etc.  (Fun fact: changing a comment in the build script for the glibc package will rebuild all of nixpkgs.)  In particular, this means you can't reuse the cache from Linux/amd64 on Darwin/aarch64 (even though both are supported by nixpkgs).  Even ignoring windows, this means we need to build mathlib a couple of times, once for each architecture.<br>\nThis is simply unacceptable, we are already at the limit of CI capacity.  Compiling mathlib multiple times is out of the question.</p>",
        "id": 261906375,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1637229466
    },
    {
        "content": "<p>At least not nightly (or even PRly) builds. I guess we could build a monthly nix cache, or so.</p>",
        "id": 261906698,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1637229642
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/270676-lean4/topic/lean.204.20hackers/near/261906375\">said</a>:</p>\n<blockquote>\n<p>In particular, this means you can't reuse the cache from Linux/amd64 on Darwin/aarch64 (even though both are supported by nixpkgs).</p>\n</blockquote>\n<p>I'm not volunteering <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> , but I have long wondered what a general solution to this issue could look like. Perhaps with content addressing activated, one could simply tell Nix \"yeah, this derivation for macOS will definitely be realised into this store path produced by the Linux derivation, just trust me on that\". I don't think Cachix supports storing and querying the realisation map yet though, it's still early days regarding CA.</p>",
        "id": 261910750,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1637232192
    },
    {
        "content": "<p>And then every month or so you might want to <code>--check</code> that invariant on the actual platforms</p>",
        "id": 261911040,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1637232399
    },
    {
        "content": "<p>I see your points. Didn't mean to hijack this as a nix discussion. Let's continue in the \"Nix builds\" topic.</p>",
        "id": 261914007,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1637234238
    },
    {
        "content": "<blockquote>\n<p>one could simply tell Nix \"yeah, this derivation for macOS will definitely be realised into this store path produced by the Linux derivation, just trust me on that\"</p>\n</blockquote>\n<p>I don't think such an option would ever make it past Eelco.  He's already super unhappy about the cargo-vendor stuff (i.e., that we use a fixed-output derivation for the automatically generated vendor directory, instead of checksums for the individual upstream tarballs).  Intentional impurity seems even less likely to be accepted.</p>",
        "id": 261915972,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1637235696
    },
    {
        "content": "<p>Alright, updated the guide again and added our first real-world program: an implementation of the <code>wc</code> program in Lean 4. <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 262257220,
        "sender_full_name": "James King",
        "timestamp": 1637524327
    },
    {
        "content": "<p>Hey folks. I was wondering if a contribution for supporting Ninja as the generator would be accepted. Currently, only the Unix Makefiles generator is supported. (Related question: I noticed files under <code>stage0/</code> being marked as auto-generated, and they largely seem to be the same as the files under <code>src/</code> -- how do I trigger that generation?)</p>",
        "id": 262407547,
        "sender_full_name": "Varun Gandhi",
        "timestamp": 1637636783
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459441\">@Varun Gandhi</span> The Lean devs are very pragmatic, so an additional generator is only likely to be accepted if the benefit of adding it outweighs the burden of code review and build breakage and maintenance. What would the benefit of Ninja be? Note that Lean already builds on all supported platforms (with MinGW on Windows).</p>\n<p>For updating <code>stage0/</code>, you can use <code>scripts/update-stage0</code>. Lean 4 is a self-compiling compiler, and the <code>stage0/</code> files serve to <a href=\"https://en.wikipedia.org/wiki/Bootstrapping_(compilers)\">bootstrap</a> it.</p>",
        "id": 262408615,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1637638132
    },
    {
        "content": "<p>The benefits of Ninja are (1) faster incremental builds, especially when working on leaf-y files, (2) <code>ninjatracing</code> (<a href=\"https://github.com/nico/ninjatracing\">https://github.com/nico/ninjatracing</a>) to profile builds and (3) built-in functionality to query targets via different subtools.</p>\n<p>As an example, I did some preliminary measurements with Clang (files recompiled/total files), since that is a project I'm familiar with:</p>\n<ul>\n<li>When changing a leafy file (e.g. 20/4300): 3.7s (Ninja) vs 7.0s (Make) -- To me, this is the most compelling point.</li>\n<li>When changing a file much deeper (600/4300), or doing a full build (4300/4300): They're about the same with Ninja being 1~2% faster. This is not a big deal IMO: the key bit is Ninja is not slower.<br>\nWhen I worked on Swiftc, we did not support make at all, because ninja is ~better along nearly all dimensions, with the incremental builds being the biggest win.</li>\n</ul>\n<p>That said, I haven't actually implemented the change for Lean (I wanted to ask first), so I don't know how much the incremental build benefits will carry over.</p>\n<p>Thanks for the pointer in the code.</p>",
        "id": 262415891,
        "sender_full_name": "Varun Gandhi",
        "timestamp": 1637646627
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459441\">@Varun Gandhi</span> the problem with this idea  is that primary bottleneck for the Lean dev build is not the CMake build but the rather the bootstrap Lean build which would be unaffected by the change in the CMake generator.</p>",
        "id": 262418821,
        "sender_full_name": "Mac",
        "timestamp": 1637650335
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span>   : Just to make sure I'm correctly understanding what you're saying, the slow part of incremental builds is due to <code>src/lean.mk.in</code>, is that right?</p>",
        "id": 262538726,
        "sender_full_name": "Varun Gandhi",
        "timestamp": 1637719372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"459441\">@Varun Gandhi</span> yes, though it is more due to the inefficiency of Lean builds (due to transitive import dependencies) than the Makefile / make itself</p>",
        "id": 262548954,
        "sender_full_name": "Mac",
        "timestamp": 1637733126
    },
    {
        "content": "<p>Updated the <code>WordCount</code> example program and benchmarks, thanks for all of the feedback from here and on Github and Reddit. <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 262957625,
        "sender_full_name": "James King",
        "timestamp": 1638147084
    }
]