[
    {
        "content": "<p>How do people (plan to?) answer the question \"is X already implemented by someone in Lean4\"? (I know I may be asking this a bit prematurely, but figured why the hell not =)</p>\n<p>In my particular case, I'm tempted to start building a package for declarative command line argument parsing (perhaps like Rust's <a href=\"https://docs.rs/clap/2.33.3/clap/\">clap</a> or Haskell's <a href=\"https://hackage.haskell.org/package/optparse-applicative\">optparse-applicative</a>)... but it would be nice to know if someone else has started down this path already just in case =)</p>",
        "id": 222482439,
        "sender_full_name": "Andrew Kent",
        "timestamp": 1610479840
    },
    {
        "content": "<p>It's probably a bit early to invest time in building a leanpkg index or anything similarly fancy :) , but it would be great to have something like <a href=\"https://leanprover-community.github.io/lean_projects.html\">https://leanprover-community.github.io/lean_projects.html</a> for Lean 4 projects!</p>",
        "id": 222757612,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1610647601
    },
    {
        "content": "<p>If everyone tags their Lean 4 repos with <code>lean4</code> on GitHub, we would get a crude directory here: <a href=\"https://github.com/topics/lean4\">https://github.com/topics/lean4</a></p>",
        "id": 222765262,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1610650737
    },
    {
        "content": "<p>Could we add a separate stream for discussing the growing lean4 package ecosystem? #lean4-packages for example. Would be nice to have a place  to coordinate and discuss and ask for contributions.</p>",
        "id": 279662886,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1650538114
    },
    {
        "content": "<p>Since this is not at all a priority in Lean 4 development right now the efforts regarding this will most likely be only by a few individuals so it'll probably fit just nicely in here.</p>",
        "id": 279663205,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1650538353
    },
    {
        "content": "<p>Sure. I just didn't want to spam the lean4 stream more than necessary.</p>",
        "id": 279667132,
        "sender_full_name": "Anders Christiansen Sørby",
        "timestamp": 1650540844
    }
]