[
    {
        "content": "<p>We've got an initial version of our Lean4-controlled self-balancing car up and running for anyone interested: <a href=\"https://github.com/galoisinc/lean4-balance-car\">https://github.com/galoisinc/lean4-balance-car</a></p>\n<p>This was a small proof-of-concept exercise to show Lean programs controlling a real robotics platform which requires low latency and accurate calculations (less the robot tip over)---it did not involve anything more exotic like modeling the real world physics, proving properties about the controller, etc.</p>",
        "id": 227702720,
        "sender_full_name": "Andrew Kent",
        "timestamp": 1614215207
    },
    {
        "content": "<p>The video is cool!</p>",
        "id": 227703104,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614215454
    },
    {
        "content": "<p>I should say a bit more about the longer term goals at Galois.  In general, I think it'd be really great to see Lean 4 being treated as a practical, if esoteric, programming language.</p>\n<p>The idea would be, we just write programs using Lean instead of some other language.  If there are particular parts that we want to at some point show correct or reason about, we don't have to rewrite the component in a theorem prover to get started -- it's already in a formal language.  We may have to modify it a bit to make the code pure or isolate the most critical parts, but we can keep using the Lean code as the actual implementation.</p>\n<p>There might be some overlap with mathlib where perhaps enough of mathematics is formalized that mathematicians feel comfortable with formalizing the bits of the problem or proof they really care about using existing work, and then use Lean's theorem proving capabilities first to show those parts are good.</p>",
        "id": 227876687,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1614309898
    },
    {
        "content": "<p>My impression is that what the Lean developers would like right now is just a whole bunch of random code doing random things written in Lean 4, so they can figure out what works and what doesn't. This is a never-ending quest of course -- look at C++, it's used by a gazillion people and they've been tweaking the language for decades and still continue to tweak it, presumably because of requests from the user base. This is why I decided to try to (slowly) do filters in Lean 4, because the maths is all fresh in my head from teaching it and it would just be a neat way to check that things work out. Of course they worked out very smoothly in Lean 3 so I am not expecting any surprises.</p>",
        "id": 227901972,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614331375
    },
    {
        "content": "<p>I thought I'd mention here.  We just put out this <a href=\"https://galois.com/blog/2021/03/real-time-robotics-control-in-the-lean-language/\">blog post</a> describing the robotics experiments we've done so far.   It's a bit aspirational at the moment, but I've also created a Real-time Systems Zulip channel here in case people have questions or other efforts involving Lean in real-time systems.</p>",
        "id": 232514325,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1617147570
    }
]