[
    {
        "content": "<p>Hello,<br>\nI'm sure this question has been asked before but I can't find an answer.</p>\n<p>Would you advise a beginner to use lean 3 or lean 4?<br>\nThanks</p>",
        "id": 315113403,
        "sender_full_name": "tica",
        "timestamp": 1670696475
    },
    {
        "content": "<p>That depends on your topic of interest. Are you a computer scientists that wants to do functional programming and a bit of proving? Or are you a mathematician that is exclusively interested in proving.</p>\n<p>If you fall in the first category definitely Lean 4. If you fall in the second category Lean 3 is probably the better choice due to the already available mathlib with tons of formalized mathematics already done for you. There is however ongoing work to port it to Lean 4 and sooner or later everyone will switch to Lean 4 so if you're content with not doing too advanced things for now you can also stay with Lean 4 already while the team is busy porting.</p>",
        "id": 315113978,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1670696813
    },
    {
        "content": "<p>It is mainly for doing algorithm proofs or verifying implementations and doing math.</p>\n<p>I program mainly in C and I do not intend to write my programs in lean.</p>",
        "id": 315114414,
        "sender_full_name": "tica",
        "timestamp": 1670697070
    },
    {
        "content": "<p>doing algorithm proofs in lean generally involves writing the code in lean, since you can't prove properties about an extern function</p>",
        "id": 315114543,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1670697137
    },
    {
        "content": "<p>Yes I know.<br>\nI mean my final code will be written in another language but I will use lean to verify that the math and logic of my algorithms are correct.</p>",
        "id": 315115425,
        "sender_full_name": "tica",
        "timestamp": 1670697756
    },
    {
        "content": "<p>It will only be a few months until mathlib has been ported to Lean 4 and then Lean 3 will be end of life.</p>",
        "id": 315115955,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670698152
    },
    {
        "content": "<p>Ok thanks you <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 315116498,
        "sender_full_name": "tica",
        "timestamp": 1670698521
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/270676-lean4/topic/lean.203.20or.20lean.204/near/315115955\">said</a>:</p>\n<blockquote>\n<p>It will only be a few months until mathlib has been ported to Lean 4 and then Lean 3 will be end of life.</p>\n</blockquote>\n<p>Oh, great, good to know.</p>\n<p>I'm in a similar situation and want to start learning now. I'm comfortable with Haskell other standard programming languages so getting used to that side of things will not be an issue.</p>\n<p>But I intend to use Lean for mathematics, mostly for logic, basic category theory, and a study of relational structures. Would you say that that part of Lean 4 is ready already?</p>",
        "id": 317622860,
        "sender_full_name": "Tomáš Jakl",
        "timestamp": 1671820597
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"573474\">@Tomáš Jakl</span> I think it's <em>almost ready</em>. In a couple of weeks, those basics should be ported.</p>",
        "id": 317643550,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671830877
    }
]