[
    {
        "content": "<p>In VSCode Lean Infoview, I am getting this message:  The Lean Server has stopped processing this file:  Server process for file:///... crashed, likely due to a stack overflow or a bug.<br>\nAnyone know what's causing this?<br>\nMy project consists of two files.  One file contains a bunch of tactic definitions and examples testing those tactics.  That file seems to work just fine.  The other file is the Main file, and all it contains is an import command to import the file with the tactic definitions.  When  I try to view the Main file, I get the error message.</p>",
        "id": 294343940,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1660935060
    },
    {
        "content": "<p>Can you share a minimal repro and your OS platform details?</p>",
        "id": 294353465,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1660939094
    },
    {
        "content": "<p>It's a MacBook Pro, MacOS Monterey 12.5.1.  (I just update the OS this morning; perhaps that's relevant.)<br>\nLean toolchain is leanprover/lean4:nightly (default)<br>\nLean (version 4.0.0-nightly-2022-08-16, commit 37ba0df5841b, Release)<br>\nVSCode is Version 1.70.2.<br>\nNot sure what you mean by \"minimal repro\".  The file with the tactic definitions is about 1000 lines.  The file that is causing the error is one line--the import command.</p>",
        "id": 294354173,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1660939344
    },
    {
        "content": "<p>Perhaps I don't understand how packages work.  I just tried copying the contents of the large file and saving them in a new file (in the same folder as the other files).  Then I changed the import command to import the new file rather than the old one.  Now I get the error \"unknown package (name of new file)\".  I assumed that import would simply read in any file I named, but perhaps that's not how it works.<br>\nPerhaps my project is configured wrong somehow?</p>",
        "id": 294356699,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1660940337
    },
    {
        "content": "<p>Yeah, I've been confused about that before also.  The way packages work is like this:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"n\">lake</span> <span class=\"n\">new</span> <span class=\"n\">Sample</span>\n</code></pre></div>\n<p>now I have a folder named \"Sample\" containing a \"package\" of that name and I can load that folder into VS code and everything is good.  Notice \"Main.lean\" can import the library named \"Sample\" and that in this case \"Sample\" is just \"Sample.lean\" right now - a very simple single file library.  The lakefile.lean builds this \"Sample\" library because of this line:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"n\">lean_lib</span> <span class=\"n\">Sample</span> <span class=\"o\">{</span>\n  <span class=\"c1\">-- add library configuration options here</span>\n<span class=\"o\">}</span>\n</code></pre></div>\n<p>Now if you want to add more files to this library can't just add more files at the top level of your package, instead you have to create a folder named \"Sample\" and put the files in there.  So let's say I do that and add a Hello.lean containing <code>def hello := \"friend\"</code> then  I'll have this structure:</p>\n<p><a href=\"/user_uploads/3121/pDPA2t917u1Yn6E0UNKowyMt/image.png\">image.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/pDPA2t917u1Yn6E0UNKowyMt/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/pDPA2t917u1Yn6E0UNKowyMt/image.png\"></a></div><p>and the convention then is to change the top level <code>Sample.lean</code> so it contains this: <code>import Sample.Hello</code> and now when you <code>#eval main</code> you will see <code>Hello, friend!</code>.  Now Main.lean could also skip <code>Sample.lean</code> and go straight to Hello with this import: <code>import Sample.Hello</code>.</p>",
        "id": 294375352,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1660951075
    },
    {
        "content": "<p>My package was set up slightly differently--perhaps it was created by an earlier version of lake.  I created a new package and copied my tactic definitions into it, and things seem to be working now.<br>\nCan I change the setup?   I have no use for the Main file--I'm not interested in executing a program, I want to prove theorems, and I want to put my theorems in several files with more meaningful names than \"Main\".  Can I delete Main and create other files for my theorems?  If I do, do I have to remove these lines from lakefile.lean:<br>\n@[defaultTarget]<br>\nlean_exe hTPI {<br>\n  root := `Main<br>\n}<br>\nDo I have to have a library file whose name is the same as the name of the package?  I'd rather use a different name for my file of tactic definitions.  If I put that file inside the appropriate folder, as you did in your example with the the file Hello.lean, can I get rid of the library file at the top level?  If so, should I delete these lines from lakefile.lean:<br>\nlean_lib HTPI {<br>\n  -- add library configuration options here<br>\n}<br>\nOr do those lines also identify the name of the folder where additional library files are to be found?  Or is the name of the folder taken from the \"package\" entry in lakefile.lean?</p>",
        "id": 294379203,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1660954946
    },
    {
        "content": "<p>Yes, Lean recently moved from lake 3.3 to lake 4.0 and with that came some breaking changes, so rebuilding your lake packages from scratch is probably a good thing to do.   So to answer your question, absolutely, Lake can build just a library and no executable program, in fact, <code>lake new Foo lib</code> will do exactly that so you can see what the template is, basically you just remove the <code>lean_exe</code> target and move the <code>@[defaultTarget]</code> to your <code>lean_lib</code> target and you are good to go.  And yes, you can also specify multiple lean_lib targets like your <code>HDPI</code> target, and this way you can break up your code into multiple libraries, each in a separate folder.  One library can import the other library no problem.</p>",
        "id": 294389359,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1660966827
    },
    {
        "content": "<p>But if you lookat how <a href=\"https://github.com/leanprover-community/mathlib4\">mathlib4</a> is organized, there is only one folder (and only one library) but lots of sub-folders inside that so you can also organize your code that way.</p>",
        "id": 294389419,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1660966930
    },
    {
        "content": "<p>Thanks Chris.  I think I've got my package set up the way I want it now.</p>",
        "id": 294474653,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1661022756
    }
]