[
    {
        "content": "<p>Has anyone successfully compiled a universal binary on macOS (or know whether doing so is possible at the minute)?</p>\n<p>I tried <code>rm -rf build/release &amp;&amp; mkdir -p build/release &amp;&amp; cd build/release &amp;&amp; cmake -DCMAKE_OSX_ARCHITECTURES='arm64;x86_64' -DCMAKE_INSTALL_PREFIX=/opt/lean4/nightly/ ../.. &amp;&amp; make -j4 SDKROOT=$(xcrun --sdk macosx --show-sdk-path)</code>, where <code>CMAKE_OSX_ARCHITECTURES</code> was I thought how to do so, but the resulting binaries are not universal.</p>",
        "id": 271508457,
        "sender_full_name": "Julian Berman",
        "timestamp": 1644534692
    },
    {
        "content": "<p>We do many steps such as linking outside of CMake via <code>leanc</code> directly, so I'm not surprised it doesn't work out of the box. But I don't really know how universal binaries are created. Only that our release tarballs are already big enough that it doesn't seem desirable.</p>",
        "id": 271544288,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1644568253
    },
    {
        "content": "<p>Aha, thanks. OK, will try to see if it's easy to dig through the non-cmake bits to add it, I've already needed to do slightly similar things previously to add <code>-fPIC</code> for compiling on Android so maybe doing so won't be too hard. And yeah I definitely am not suggesting release builds be universal.</p>",
        "id": 271567834,
        "sender_full_name": "Julian Berman",
        "timestamp": 1644582052
    },
    {
        "content": "<p>I am curious if there is any progress on this. Am I correct in believing it would allow building of M1 binaries on x86 runners?</p>",
        "id": 273249070,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1645805941
    },
    {
        "content": "<p>Universal binaries should not make that any easier (probably harder, as by the above) compared to standard cross-compilation. If we want full-featured cross-compiled Lean releases, the first step would be to cross-compile LLVM itself (using our custom build flags) so that we can bundle it... I didn't feel like tackling that particular mountain just yet.</p>",
        "id": 273249834,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1645806329
    }
]