[
    {
        "content": "<p>Lean 4 in its core is already functional and made in Lean 4.<br>\nThe problem is in the front-end and backend.</p>\n<p>In the front-end, because Lean 4 is made to work using LSP, some of the code is written in TypeScript or JavaScript.<br>\nProgramming languages such as Hazel are made using a reactive programming language framework (ReasonML in OCaml).</p>\n<p>In the backend,  I think that the CakeML approach is one of the best. They implemented a silver CPU in HOL.</p>\n<p>I don't know how hard is to implement both of them in Lean, but I would like to know if there is something being made in this direction.</p>",
        "id": 269515684,
        "sender_full_name": "Guilherme Silva",
        "timestamp": 1643248404
    },
    {
        "content": "<p>FWIW, the front-end is really mostly not implemented in the front-end. The typescript part is a thin wrapper around messages that are created in the lean 4 core.</p>",
        "id": 269518152,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1643250660
    },
    {
        "content": "<p>I think that in Lean 3, they developed a small framework to use Lean code in VS Code.</p>\n<p>Maybe, with one framework like that, this typescript wrapper will no longer be necessary.</p>",
        "id": 269520212,
        "sender_full_name": "Guilherme Silva",
        "timestamp": 1643252858
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"143232\">Guilherme Silva</span> <a href=\"#narrow/stream/270676-lean4/topic/Making.20Lean.204.20compiler.20more.20functional.20and.20monolith/near/269515684\">said</a>:</p>\n<blockquote>\n<p>The problem is in the front-end and backend.</p>\n</blockquote>\n<p>What is the \"problem in the front end and backend\"? VScode requires users to write their extensions (or at least the part that touches VScode) in typescript.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"143232\">Guilherme Silva</span> <a href=\"#narrow/stream/270676-lean4/topic/Making.20Lean.204.20compiler.20more.20functional.20and.20monolith/near/269515684\">said</a>:</p>\n<blockquote>\n<p>In the backend,  I think that the CakeML approach is one of the best. They implemented a silver CPU in HOL.</p>\n</blockquote>\n<p>The best at what? I'm sure it's very cool, but a custom ISA for a specific model of FPGA doesn't sound super practical.</p>",
        "id": 269529756,
        "sender_full_name": "Chris B",
        "timestamp": 1643263627
    },
    {
        "content": "<p>A formal model of the processor can help to have fewer bugs, to debug and test the binary code generated.<br>\nAnother advantage is to make verified optimizations.</p>",
        "id": 269629575,
        "sender_full_name": "Guilherme Silva",
        "timestamp": 1643313689
    },
    {
        "content": "<p>I don't think there's anything stopping someone from writing a verified compiler for Lean (other than it being a moving target for now), but the developers have said they're not interested in doing it themselves, or at least Leo de Moura has. Mario Carneiro's metamath zero is going after this level of depth, you might find it appealing: <a href=\"https://github.com/digama0/mm0\">https://github.com/digama0/mm0</a>.</p>",
        "id": 269632980,
        "sender_full_name": "Chris B",
        "timestamp": 1643315314
    },
    {
        "content": "<p>the target is far less moving if you look at kernel terms. There are multiple type checkers for it. And all the fancy stuff happens in lean syntax, elaboration, etc. The kernel is not changing when the language changes.</p>",
        "id": 269648780,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1643321996
    },
    {
        "content": "<p>FWIW, while watching <a href=\"https://www.youtube.com/watch?v=3ixaLQQNCFk\">https://www.youtube.com/watch?v=3ixaLQQNCFk</a> I couldnt stop thinking whether WebAssembly, having a formally defined semantic and being language independent (among many other interesting properties), could be a great compilation target for Lean.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"3ixaLQQNCFk\" href=\"https://www.youtube.com/watch?v=3ixaLQQNCFk\"><img src=\"https://uploads.zulipusercontent.net/c62924d79bd96fdf2ae8128f4f1811ee07a4e40e/68747470733a2f2f692e7974696d672e636f6d2f76692f336978614c51514e43466b2f64656661756c742e6a7067\"></a></div>",
        "id": 269754675,
        "sender_full_name": "Yuri de Wit",
        "timestamp": 1643384253
    },
    {
        "content": "<p>By the way, with the mention of <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>'s MM0 project, if I understand it correctly, it would be able to serve as a verified (external) type checker for any kernel-level proof in any theorem prover's logic, including Lean's.  The idea being as follows:</p>\n<ul>\n<li>One writes a specification file, which is short, human-readable, and machine-readable, which details the rules of the logical system.</li>\n<li>One converts the kernel proof into an MM0 format which has two parts: (a) A human and machine readable part which includes the (elaborated) definitions and theorem statements.  (b) A machine readable part containing the kernel proofs.</li>\n<li>MM0 checks a kernel proof against that specification.</li>\n<li>MM0 also has (or will have) a proof that the byte code of its checker will follow the specification given to it.</li>\n<li>Therefore if the specification is correct (checked by a human), the definitions and theorems are translated correctly to the MM0 format (checked by a human), and Mario finishes verifying the verifier, then the byte code (barring hardware errors) will correctly check the proof.</li>\n</ul>\n<p>(Someone can correct me if I'm wrong on the details here.)</p>",
        "id": 269864048,
        "sender_full_name": "Jason Rute",
        "timestamp": 1643462618
    },
    {
        "content": "<p>Also, whenever someone mentions verifying a theorem prover, I feel compelled to mention that there are actually two ways to verify a theorem prover:</p>\n<ol>\n<li>Verify that the checker follows the rules of the logic.</li>\n<li>Verify that the rules of the logic are consistent (including any axioms used).</li>\n</ol>\n<p>MM0's goal as I understand is the first, but it could in theory also be used for the second.</p>",
        "id": 269864056,
        "sender_full_name": "Jason Rute",
        "timestamp": 1643462631
    },
    {
        "content": "<p>Yes, you could use MM0 for metatheory reasoning, but that's not a current goal. Full proof translations often make metatheory reasoning more accessible, however, since it is only a minor tweak to the exporter to produce theorems in a deep embedding, and then you can prove general theorems about things in the deep embedding like soundness.</p>",
        "id": 269864229,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1643462833
    }
]