[
    {
        "content": "<p>Does anyone have a good name for what Lake should call the combination of <code>olean</code> and <code>ilean</code> (and potentially whatever other binary blobs <code>lean</code> produces from a module)?</p>\n<p>I am currently calling them the Lean module binaries (or <code>leanBin</code> in code), but I feel that is a bit verbose and also obtuse. One alternative I came up with is <code>iolean</code> (combining the names), but I feel that may quickly become outdated if the module system changes again and even more binary blobs are created.</p>\n<p>Suggestions?</p>",
        "id": 288121219,
        "sender_full_name": "Mac",
        "timestamp": 1656651724
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 288126439,
        "sender_full_name": "Mac",
        "timestamp": 1656656781
    },
    {
        "content": "<p>Are you referring fully generally to all compilation artefacts, or are there any compilation artefacts that you're not trying to name this way?</p>",
        "id": 288129876,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1656659405
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"117987\">@Patrick Stevens</span> I am trying to give a general name to binary artifacts Lean expects in the <code>LEAN_PATH</code> that a produced by <code>lean</code> (e.g., <code>olean</code> and <code>ilean</code> files for now). Notably this excludes the actual compiled code (e.g., the <code>c</code> file `lean produces). This name will be used generally for such artifacts generated for any module.</p>",
        "id": 288131745,
        "sender_full_name": "Mac",
        "timestamp": 1656660707
    },
    {
        "content": "<p>Maybe adhere to Lean's own way of generalizing names and say <code>._lean</code>. It will include any other auxiliary file that may be generated in the future</p>",
        "id": 288151056,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1656671780
    }
]