[
    {
        "content": "<p>I'm using plain elan + Emacs for Lean 4 development. When I open a Core file in e.g. <code>~/.elan/toolchains/leanprover-lean4-nightly-2021-05-04/</code>, LSP hangs indefinitely in the \"starting\" state. This is fixed if I <code>elan override set leanprover/lean4:nightly-2021-05-04</code> in the toolchain directory, so it seems like elan/LSP can't figure out which Lean executable to use here. Is this an issue in VSCode as well? Should elan automatically set an override for these toolchain directories?</p>",
        "id": 240861953,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1622486849
    },
    {
        "content": "<p>Did you open it as a workspace? I usually select <code>[n]o</code> when <code>lsp-mode</code> asks me for an installed stdlib, which should prevent the LSP from being started. It's a bit more explicit in VS Code, you need to open <code>src/</code> as a folder (and there's a known issue with multiple workspaces).</p>",
        "id": 240863164,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1622487854
    },
    {
        "content": "<p>I'm open to a PR for defaulting elan in those directories. I wonder why it wasn't done in rustup.</p>",
        "id": 240863194,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1622487892
    },
    {
        "content": "<p>That's the next issue (which I just discovered): I'd like to have the stdlib as a workspace so that go-to-definition works. But each time I open a different stdlib file, it asks me for the workspace root again. I'll experiment a bit, see if that can be fixed.</p>",
        "id": 240869108,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1622493246
    },
    {
        "content": "<p>Maybe it's opening the wrong folder as a namespace? As I said, it should be <code>src/</code>. Not sure if we can give <code>lsp-mode</code> any hints there.</p>",
        "id": 240869298,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1622493454
    },
    {
        "content": "<p>The workspace issue is now fixed for me. I think this was because I had my <code>.elan</code> behind a symlink, so LSP may have thought that the files I opened weren't in a subdirectory of the workspace dir. Don't know how much work it would be to have LSP auto-configure the workspace, but if I need to do it only once, it's not much of a hassle. Thanks for helping with the debugging by the way!</p>",
        "id": 240871528,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1622495637
    }
]