[
    {
        "content": "<p>It's kind of similar to the emacs situation I suspect. In theory it's possible for people who're running neovim in a browser, otherwise slightly less so</p>",
        "id": 224713792,
        "sender_full_name": "Julian Berman",
        "timestamp": 1612179391
    },
    {
        "content": "<p>Mwahaha I have something resembling a persistent goal state / infoview working: <a href=\"https://asciinema.org/a/wRxhTBpr6sPt1Y9w7x2dBCzRZ\">https://asciinema.org/a/wRxhTBpr6sPt1Y9w7x2dBCzRZ</a> (the annoying part is mostly now figuring out how to make it work for lean 3 and lean4 simultaneously)</p>",
        "id": 233387266,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617742667
    },
    {
        "content": "<p>Being able to use Lean in vim would be so awesome! But I'm afraid Ed's widgets killed that hope...</p>",
        "id": 233389532,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1617743189
    },
    {
        "content": "<p>So I still have not looked at how widgets are implemented, nor certainly talked to Ed, so I could be talking total nonsense (in fact that's likely). But to get something like widgets working outside of a browser I think basically they'd need to have their own DOM essentially</p>",
        "id": 233391135,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617743599
    },
    {
        "content": "<p>What I know from Python-land is we have things like urwid: <a href=\"http://urwid.org/\">http://urwid.org/</a></p>",
        "id": 233391200,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617743619
    },
    {
        "content": "<p>Which is a library you can use to basically support layout of dynamic elements. And when you render those in a browser they render via the DOM in that environment, but then they can be asked to render in other environments, like terminals, and when you render them there you get alternate implementations</p>",
        "id": 233391474,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617743698
    },
    {
        "content": "<p>But yeah that's way beyond anything I've looked at so far certainly.</p>",
        "id": 233391564,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617743721
    },
    {
        "content": "<p>Clearly also I haven't implemented the most important feature, my thing still says <code>no goals</code> instead of <code>goals accomplished &lt;giant boom&gt;</code>. I guess I should fix that before <code>v1.0.0</code>.</p>",
        "id": 233392809,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617744085
    },
    {
        "content": "<p>What are widgets? Is this a Lean 4 specific feature?</p>\n<p>I've used lean-mode in Emacs with little hassle thankfully, and I hope it remains this way when mathlib moves on to Lean 4.</p>",
        "id": 233591353,
        "sender_full_name": "Brandon Bocanegra",
        "timestamp": 1617847649
    },
    {
        "content": "<p>They're actually Lean 3 only at the minute I think. As for what they are, there's a good talk on them at I think the last Lean Together, one sec lemme see if I can find it.</p>",
        "id": 233592096,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617848299
    },
    {
        "content": "<p>Here: <a href=\"https://www.youtube.com/watch?v=8NUBQEZYuis\">https://www.youtube.com/watch?v=8NUBQEZYuis</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"8NUBQEZYuis\" href=\"https://www.youtube.com/watch?v=8NUBQEZYuis\"><img src=\"https://i.ytimg.com/vi/8NUBQEZYuis/default.jpg\"></a></div>",
        "id": 233592106,
        "sender_full_name": "Julian Berman",
        "timestamp": 1617848314
    },
    {
        "content": "<p>I see, thanks. I'd just like to comment on the remarks made around 5:53 of the video.</p>\n<p>For an emacs solution: Emacs 28 has support for xwidgets, which allows you to essentially embed modern web browsers. Version 28 is not a stable release yet, but it should be out sometime this year.</p>\n<p>Neovim support sounds tricky, but it's probably doable with great effort.</p>",
        "id": 233757819,
        "sender_full_name": "Brandon Bocanegra",
        "timestamp": 1617934017
    }
]