[
    {
        "content": "<p>The number of Lean 4 package continues growing. Now it's a good time to have a package registry for Lean 4, and that's what I'm working on. The registry is hosted on the GitHub Pages <a href=\"https://xubaiw.github.io/reservoir-index/\">https://xubaiw.github.io/reservoir-index/</a>, with the <a href=\"https://github.com/xubaiw/reservoir-index\">index repo</a> and <a href=\"https://github.com/xubaiw/Reservoir.lean\">source code</a>. The style of user interface follows that of lean4 homepage and doc-gen.</p>\n<p><strong>The functionality is quite incomplete now</strong>, and it's barely nothing more than a list, but I cannot wait to put it here to see if people have some nice ideas about package registry and even help write some part of the code. So this zulip topic may also be used for feature discussion.</p>\n<p>I also wonder if there is possibility to transfer these repos to leanprover to make them the \"official\" registry after implementing some basic features.</p>",
        "id": 273111669,
        "sender_full_name": "Xubai Wang",
        "timestamp": 1645719575
    },
    {
        "content": "<p>The registry will try to call github search api periodically to update itself (through pull request), but users can manually add their package information to the index repo.</p>",
        "id": 273112073,
        "sender_full_name": "Xubai Wang",
        "timestamp": 1645719730
    },
    {
        "content": "<p>In browser dark mode, I can't read anything:<br>\n<a href=\"/user_uploads/3121/vqOQX1EzwKEciOto0JYtOC4O/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/vqOQX1EzwKEciOto0JYtOC4O/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/vqOQX1EzwKEciOto0JYtOC4O/image.png\"></a></div>",
        "id": 273112174,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1645719777
    },
    {
        "content": "<p>It works well with my Dark Reader dynamic mode. But yeah, surely, dark mode support will be added to my to-do list.</p>",
        "id": 273112541,
        "sender_full_name": "Xubai Wang",
        "timestamp": 1645719941
    },
    {
        "content": "<p>I also plans to add documentation rendering to it, using doc-gen4, so it will also play the role of <a href=\"http://docs.rs\">docs.rs</a>.</p>\n<p>And then a version picking facility is very important, as we no longer have \"version\" in lake, and have to rely on the git commit message. People will be able to search through the commit messages easily to find the hash they want.</p>",
        "id": 273113358,
        "sender_full_name": "Xubai Wang",
        "timestamp": 1645720269
    },
    {
        "content": "<p>The navigation input on top of the page for now does filtering only, but in my idea it should be more flexible and have more diverse functionality.</p>",
        "id": 273113868,
        "sender_full_name": "Xubai Wang",
        "timestamp": 1645720471
    }
]