[
    {
        "content": "<p>Reading <a href=\"https://github.com/leanprover/lake#adding-dependencies\">lake's readme</a> I've noticed that there isn't a way to pin the version of a package dependency (of course, because the notion of a version hasn't been defined). But it got me thinking of ways to workaround this and avoid building things that can break just because someone changed a dependency package. That said, my two solutions are:</p>\n<ul>\n<li>State a <code>commit</code> (hash) along with <code>name</code> and <code>src</code> in the <code>dependencies</code> field or</li>\n<li>State a <code>tag</code> instead</li>\n</ul>\n<p>First option requires nothing from package developers and the second option requires a certain degree of organization when building packages because then you'd have to release and push tags to your repo.</p>\n<p>Both options would work, but second is less chaotic and Git allows you to <a href=\"https://stackoverflow.com/a/21699307\">clone specific tags</a> from repositories.</p>\n<p>What do you think?</p>",
        "id": 263434407,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638450806
    },
    {
        "content": "<p>We typically just refer to the revision: <a href=\"https://github.com/leanprover-community/mathport/blob/073d0d511ad36ee196d7b9d72f147a796540b8ce/lakefile.lean#L12\">https://github.com/leanprover-community/mathport/blob/073d0d511ad36ee196d7b9d72f147a796540b8ce/lakefile.lean#L12</a></p>",
        "id": 263435964,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1638451470
    },
    {
        "content": "<p>As you've noticed, you should never point the dependency at a branch.</p>",
        "id": 263435994,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1638451484
    },
    {
        "content": "<p>The notion of a version has been purposely defined by <span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> to be a commit hash, there was a rather lengthy discussion about this a few weeks ago.</p>",
        "id": 263436336,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1638451629
    },
    {
        "content": "<p>Do you guys think there could be a way of benefiting from semantic versioning? It explicitly says \"this version fixes bugs\", this version adds new things\" and \"this version breaks stuff\"</p>\n<p>(And I think tags can be used with this level of explainability)</p>",
        "id": 263436623,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638451753
    },
    {
        "content": "<p>This has also been discussed in the thread I just mentioned, I'll dig it out...</p>",
        "id": 263436688,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1638451786
    },
    {
        "content": "<p><a href=\"#narrow/stream/270676-lean4/topic/.5BRFC.5D.20name.2Fversion.20package.20fields/near/254114011\">https://leanprover.zulipchat.com/#narrow/stream/270676-lean4/topic/.5BRFC.5D.20name.2Fversion.20package.20fields/near/254114011</a></p>",
        "id": 263436800,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1638451828
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/270676-lean4/topic/package.20versioning.20and.20dependency.20pinning/near/263435964\">said</a>:</p>\n<blockquote>\n<p>We typically just refer to the revision: <a href=\"https://github.com/leanprover-community/mathport/blob/073d0d511ad36ee196d7b9d72f147a796540b8ce/lakefile.lean#L12\">https://github.com/leanprover-community/mathport/blob/073d0d511ad36ee196d7b9d72f147a796540b8ce/lakefile.lean#L12</a></p>\n</blockquote>\n<p>Hm, if that's an option then adding it to the readme would be nice</p>",
        "id": 263440060,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638453416
    },
    {
        "content": "<p>Can I PR it? Or should someone else do it?</p>",
        "id": 263440138,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638453447
    },
    {
        "content": "<p>I don't think that semantic versions are (easily) possible or useful for lean. The issue is basically the same as with <code>private</code>: almost anything can be a breaking change (even whitespace changes!), so semantic versions lose their main draw. You can try to have a semver-like versioning scheme, based on \"morally\" breaking changes, but it is hard to make it mean anything rigorous.</p>",
        "id": 263459684,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1638461030
    },
    {
        "content": "<p>To add on to what <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> said, a Lean semver requires the API designer to specify what is considered the \"public interface\" (i.e., what changes qualify as breaking). Some of this could be incorporated into the code itself with attributes (ala Rust), but some of it would have to just be written out. Without specification, changing virtually anything in a codebase can be considered breaking in Lean.</p>",
        "id": 263466131,
        "sender_full_name": "Mac",
        "timestamp": 1638463620
    },
    {
        "content": "<p>In the thread Henrik mentioned, <span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> <a href=\"#narrow/stream/270676-lean4/topic/.5BRFC.5D.20name.2Fversion.20package.20fields/near/254207923\">describes</a> the problem with semver quite nicely:</p>\n<blockquote>\n<p>And also it's just impossible :) (and I'm a proponent of semver personally by the way) -- but no one ever does what you're supposed to in semver, which is define what your public API actually <em>is</em> -- and it's not just types and interfaces. For Python I put some notes here: <a href=\"https://regret.readthedocs.io/en/stable/before-you-deprecate/#document-your-public-api\">https://regret.readthedocs.io/en/stable/before-you-deprecate/#document-your-public-api</a> which are things no one I know of ever really specifies, and even those who try of course will come to some scenario where it's unclear</p>\n</blockquote>",
        "id": 263466464,
        "sender_full_name": "Mac",
        "timestamp": 1638463742
    },
    {
        "content": "<p>More on <code>src</code>: Is it possible to define dependency sources with SSH URLs instead of HTTPS? I'm thinking in the context of companies who'd try to use Lean and need to develop internal (non-public) packages</p>",
        "id": 263466737,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638463843
    },
    {
        "content": "<p>Ah, I think it should be fine: <a href=\"https://github.com/leanprover/lake/blob/6dd609db18ed681f21f0f5e4f492dad678a2d67b/Lake/Util/Git.lean#L35\">https://github.com/leanprover/lake/blob/6dd609db18ed681f21f0f5e4f492dad678a2d67b/Lake/Util/Git.lean#L35</a></p>",
        "id": 263468252,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638464421
    },
    {
        "content": "<p>There are problems with traditional versioning, but I'm not sure that pinning dependencies to a specific commit is the answer. What do you do if you have two dependencies A and B and both depend on C, but on a different commit? If A and B exchange types from C, I think you're out of luck, even with source code available. Traditional versioning solves (well, addresses) this problem by letting A and B give some wiggle room so that they can hopefully agree on a version of C. Any alternative scheme must be able to solve this problem as well (if Lean is to become even moderately big).</p>\n<p>I don't have a satisfying answer either; defeq and metaprogramming do create additional problems and versioning doesn't work amazingly well even in 'normal' languages. But I feel like a practical, scalable scheme is more likely to be found by refining existing approaches to versioning, rather than by giving up on them altogether.</p>",
        "id": 263487041,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1638472501
    },
    {
        "content": "<p>The root cause of issues like this is that C made a breaking change in the first place, otherwise you could build both A and B against whichever version of C is later. From what I saw in the Haskell world, the PVP (basically Haskell's version of SemVer) seemed to do more harm than good because it reduced the perceived costs of breaking changes (\"it's fine, just have to increment the major version number\").</p>",
        "id": 263488733,
        "sender_full_name": "Reid Barton",
        "timestamp": 1638473281
    },
    {
        "content": "<p>What I see happening in practice with Python is that packages that are extremely useful also have good versioning management. matplotlib, scipy, numpy, pandas, sklearn, keras etc and even the Python API itself. The version window does help a lot.</p>",
        "id": 263494756,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638476165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256311\">Jannis Limperg</span> <a href=\"#narrow/stream/270676-lean4/topic/package.20versioning.20and.20dependency.20pinning/near/263487041\">said</a>:</p>\n<blockquote>\n<p>There are problems with traditional versioning, but I'm not sure that pinning dependencies to a specific commit is the answer. What do you do if you have two dependencies A and B and both depend on C, but on a different commit? If A and B exchange types from C, I think you're out of luck, even with source code available. Traditional versioning solves (well, addresses) this problem by letting A and B give some wiggle room so that they can hopefully agree on a version of C.</p>\n</blockquote>\n<p>The problem is that, in Lean, there is a lot of granularity as to what can constitute a \"breaking change\". In standard imperative programming languages, this tends to boil down to just signature changes of functions in the API (e.g., adding, removing, and modifying functions). Also most consumers of a library will care little about how functions are implemented so changes can be made there without effecting the vast majority of consumers.</p>\n<p>In Lean, however, any library that reasons about another can (and likely will) break on any change to relevant functions (i.e., there are virtually no non-breaking changes for such libraries). Furthermore, Lean introduces a number of new concepts that can introduce breakage: (i) type-level changes like adding, deleting, modifying type class instances;  changing definition reducibility; (ii) proof-level changes like adding or deleting <code>@[simp]</code> lemmas or changing tactic implementations, (iii) syntax changes (including adding/removing keywords), etc.</p>\n<p>In my opinion, flexible versioning for Lean would probably want to move away from version numbers altogether and instead work at a metaprogramming level by specifying or inferring relevant changes in the code itself. </p>\n<p>In the short term, my expectation is that Lean packages will be versioned much more like programming languages, OSes, or large projects like LLVM. That is, have few infrequently released stable versions (e.g., represented as tags in the repository). Stable versions of dependent packages will then target either a single such release or a small set of releases. potentially even with different code for each supported release. </p>\n<p>I don't see small frequent releases being compatible with the way dependency chains currently work in Lean (except for unstable bleeding edge development).  It is just too likely that even a minor version discrepancy with little change in a sufficiently large dependency chain will cause breakage.</p>",
        "id": 263499175,
        "sender_full_name": "Mac",
        "timestamp": 1638478582
    },
    {
        "content": "<p>In hindsight, I believe it was a mistake to export the definitional unfoldings from a module by default if one wants to support a big, mature ecosystem of packages at some point, though Lean is certainly in good company among other provers in that regard. As has been mentioned, there are many creative ways to break a module's interface in Lean, but this one is probably the worst offender. There is a part in the module system issue about reigning in delta reduction by default afair, though it is relatively clear that there will also be a way to opt back into the current behavior.</p>\n<p>I don't see why if all you're doing is programming in Lean, the experience of managing the dependency graph should be considerably worse than in other programming languages. Maybe there is in fact a different way from semantic versioning, one that may be a better fit for Lean, but until that is proven it seems to amount to wishful thinking to me. The only language I know of that has some interesting fresh ideas in that direction is Unison.</p>",
        "id": 263508541,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1638483975
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110024\">Sebastian Ullrich</span> <a href=\"#narrow/stream/270676-lean4/topic/package.20versioning.20and.20dependency.20pinning/near/263508541\">said</a>:</p>\n<blockquote>\n<p>I don't see why if all you're doing is programming in Lean, the experience of managing the dependency graph should be considerably worse than in other programming languages.</p>\n</blockquote>\n<p>One big problem Lean faces is transitive dependencies, which complicates matters. One of the ways in which manner scripting language package managers (like NPM) get away from dependency hell is by peer packages to depend on different versions of the same package, something that is not possible in Lean.</p>\n<p>You are right, though, If people are just doing ordinary programming in Lean with no extra bells and whistles, the usual CS approach to versions should work fine. I just suspect users will end up doing all kinds of metaprogramming shenanigans that will ended breaking the simple model. I mean most of the packages written thus far are doing some kind of black magic (be it proofs, FFI, and/or metaprogramming -- all of which complicate dependency management).</p>",
        "id": 263511821,
        "sender_full_name": "Mac",
        "timestamp": 1638486012
    },
    {
        "content": "<p>Mac, I think this is a perfectly fine plan short-term. Long-term I don't think you can forgo minor versions or some equivalent mechanism (and I think we agree on this). People don't want to wait 6 months for minor bugfixes, particularly security-relevant ones, and conversely you can't have a new 'major version' with potentially arbitrary breakage every 3 months.</p>\n<p>Perhaps it would be interesting to distinguish between compile-time and runtime breakage. Compile-time breakage is in a sense more benign because it can be detected automatically and the tooling can try a bunch of versions until it finds a working one. So versioning can maybe be imprecise in this regard. I think it's also likely that much potential breakage never actually manifests because people avoid the most likely causes (or because, as Sebastian suggests, the worst offenders get reined in on the language side). So maybe optimistic versioning could work. Major versions would then have to announce only changes that are either very likely to break consumers (to avoid the tools churning through obviously-incompatible versions) or that silently change runtime semantics.</p>\n<p>Reid, my personal impression is that PVP gets a lot of flak despite working okayish with a large package database. But I've never been deep into that stuff, so maybe my impression is wrong. What you suggest, I think, amounts to 'immutable packaging' where you can't change published packages in any breaking way, so if you break something, you publish a new package (i.e. the major version becomes part of the package name: <code>containers-1</code> etc). I think this would give people an incentive to break things less frequently, but it also means that consumers can't accept multiple major versions any more, even if the breakage doesn't concern them.</p>",
        "id": 263512641,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1638486477
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"256311\">Jannis Limperg</span> <a href=\"#narrow/stream/270676-lean4/topic/package.20versioning.20and.20dependency.20pinning/near/263512641\">said</a>:</p>\n<blockquote>\n<p>People don't want to wait 6 months for minor bugfixes, particularly security-relevant ones, and conversely you can't have a new 'major version' with potentially arbitrary breakage every 3 months.</p>\n</blockquote>\n<p>Slight tangent, but you might be surprised at how often security related bugfixes <em>don't</em> get patched in small releases. Some colleagues and I wrote a <a href=\"https://ieeexplore.ieee.org/abstract/document/9438561\">paper</a> about research we did in  finding and testing micropatches for CVEs/ We found that a significant problem was that many CVE bugfixes were not released as micropatches but rather with full releases with major breaking changes and that some fixes were not officially packaged in a new release even <em>years</em> after the bug had been reported and patched in the codebase.</p>\n<p>Also, my thought was not that small <em>patch</em> releases would cease to exist, but more that <em>minor</em> releases would disappear. That is, that the only two common types of releases would be earth-shattering major version releases and tiny bugfixes. However, this is merely my concern, it may be that this does not occur in practice and my worries were groundless, and I be happy about that. <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 263514443,
        "sender_full_name": "Mac",
        "timestamp": 1638487466
    },
    {
        "content": "<p>May I open a PR mentioning that it's possible to refer to a particular commit hash <a href=\"https://github.com/leanprover/lake#adding-dependencies\">here</a>?</p>",
        "id": 263521844,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638492876
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"451983\">@Arthur Paulino</span> you most certainly can. Lake has much more lax PR rules than Lean proper. I am more than happy to look through anything one might wish to propose (at least at the moment -- there may be a time where this eventually becomes infeasible -- but this is certainly not the case yet).</p>",
        "id": 263522721,
        "sender_full_name": "Mac",
        "timestamp": 1638493474
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> <a href=\"https://github.com/leanprover/lake/pull/37\">https://github.com/leanprover/lake/pull/37</a></p>",
        "id": 263527030,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1638496927
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315577\">Mac</span> <a href=\"#narrow/stream/270676-lean4/topic/package.20versioning.20and.20dependency.20pinning/near/263514443\">said</a>:</p>\n<blockquote>\n<p>Slight tangent, but you might be surprised at how often security related bugfixes <em>don't</em> get patched in small releases. Some colleagues and I wrote a <a href=\"https://ieeexplore.ieee.org/abstract/document/9438561\">paper</a> about research we did in  finding and testing micropatches for CVEs/ We found that a significant problem was that many CVE bugfixes were not released as micropatches but rather with full releases with major breaking changes and that some fixes were not officially packaged in a new release even <em>years</em> after the bug had been reported and patched in the codebase.</p>\n</blockquote>\n<p>Very interesting, thanks! Not too surprising that people are a little cavalier with security issues. :(</p>",
        "id": 263554252,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1638524004
    }
]