[
    {
        "content": "<p>I'm sure this is well-known by now, but did you know that <code>Expr.abstract</code> is unsafe and should probably never be used (if the expression could contain a metavariable)?  This has to do with the way metavariables and free variables interact: let's say you have a term <code>?m + y</code> and you want to abstract the free variable <code>y</code>.  In Lean 3 you would want the result <code>?m[#0] + #0</code> (containing the beloved delayed abstraction macro).  In Lean 4, this is done differently: a new metavariable <code>?n</code> is created, and the result should be <code>?n #0 + #0</code> (adding the assignment <code>?m := ?n y</code>).</p>\n<p>However, <code>Expr.abstract</code> completely ignores this situation and you get <code>?m + #0</code> as the result.  This is bad because the instantiated expression can still contain the free variable <code>y</code> even though you thought that you abstracted it away!  (Side note: the <code>expr.abstract_locals</code> function in Lean 3 has exactly the same issue.  This explains many mysterious \"failed to add declaration to environment, it contains local constants\" errors...)</p>\n<p>The correct replacement is called <code>Lean.MetavarContext.MkBinding.abstractRange</code>, and it's of course private.  If you want to create a lambda or a forall, you can use the higher-level functions <code>mkLambdaFVars</code> and <code>mkForallFVars</code>, resp.  But please be aware that these functions will not always create lambdas or foralls, despite their name.  Sometimes they will also create lets, and sometimes they will also do nothing.</p>",
        "id": 239378044,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1621408925
    },
    {
        "content": "<p>I suggest creating an mwe and a github issue for how this be solved best in lean 4. It is possible that abstract should handle the case. If abstractRange is private, then it's quite possible that this is a bug.</p>",
        "id": 239382217,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1621411258
    },
    {
        "content": "<p>Expr.abstract can't handle that case since it needs to create a new metavariable.  For that it needs access to the metavariable context.</p>",
        "id": 239382468,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1621411383
    },
    {
        "content": "<p>Probably worth clarifying what \"unsafe\" means here. I guess you mean \"will produce incorrect results in tactics using it, which will later be caught by the kernel\", not \"memory unsafe\" or \"allows you to prove false\"</p>",
        "id": 239383652,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1621412020
    }
]