[
    {
        "content": "<p>Is there a way to take something in the IO monad and run it on a \"fake\" world by filling out the relevant stubs for filesystem and environment interaction?</p>",
        "id": 231088174,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616187098
    },
    {
        "content": "<p>There is not. We had a big monad class for IO operations in Lean 3, but no-one ever used it, and I think it was incomplete and/or hard to use anyway. It's much better to define a class of all operations you're interested in yourself and then give a pure and an IO instantiation.</p>",
        "id": 231088486,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616187259
    },
    {
        "content": "<p>Er, my use-case for this is that I want to reuse the Lean compiler/frontend but run Lean in a sandbox where it's allowed to read from the environment and the filesystem and the current state of Lean, but where any write operations (to any of these) are replaced by no-ops.  Is the current implementation of lean sufficiently parametric that I can do this?</p>",
        "id": 231089251,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616187627
    },
    {
        "content": "<p>That sounds like a curious use case. Is it supposed to be sound? Lean programs can do arbitrary FFI, as well as break memory safety. I always imagined that if someone wanted to sandbox building Lean dependencies or something like that, they would do it from the outside with a proper sandbox.</p>",
        "id": 231098342,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616192995
    },
    {
        "content": "<p>It doesn't need to be sound, just best-effort.  My goal is to port my bug test-case minimizer from being a python script that works with Coq to bring a Lean program that works on Lean files.  It won't be very effective if running a Lean script twice is different from running it once, so I'd like to isolate the effects as best I can.  But it's not too important.  (And I have many other problems to solve first, such as how to execute the lean program successfully in the first place...)</p>",
        "id": 231112315,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616204381
    },
    {
        "content": "<p>Do you need to deal with a Lean program that modifies files?  Could you just reset the files on a case-by-case basis?  The other options I would consider if running the program in a container or attaching to the Lean process at startup with ptrace and intercepting all the calls to <code>write</code> and other system calls.</p>",
        "id": 231113247,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1616205452
    },
    {
        "content": "<p>Ideally the minimizer would work on any file that you give it.  But, no, it doesn't need to work on programs that modify files</p>",
        "id": 231146383,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616246661
    },
    {
        "content": "<p>Yeah, I would suggest to postpone that particular feature :) . But now I'm curious, does Coq provide something like that?</p>",
        "id": 231146869,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616247277
    },
    {
        "content": "<p>Very few operations in Coq write to disk, none of them set the environment, and you can only read from disk to load a file.  So it's pretty hard to make a non-idempotent operations involving the file system.  As far as the state of the prover is concerned, I just spawn a new process for every run.  (Btw, this is going to be an issue: I will need a way to contain the effects of things like <code>set_option pp.all true</code>, etc, so that they're reset before re-reading the file.)</p>",
        "id": 231159119,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616261143
    },
    {
        "content": "<p>What do you mean by \"reset\"? They are not global mutable state.</p>",
        "id": 231159193,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616261203
    },
    {
        "content": "<p>Ah, okay, that's good to know.  But it seems like some state things are stored globally, e.g., the result of <code>Lean.initSearchPath</code>.  Is there a way to change the search-path (or anything else like that) from within a Lean program?</p>",
        "id": 231219371,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616336734
    },
    {
        "content": "<blockquote>\n<p>Is there a way to change the search-path (or anything else like that) from within a Lean program?</p>\n</blockquote>\n<p>Yes, you can call <code>initSearchPath</code> at any point (again)</p>",
        "id": 231219813,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616337245
    },
    {
        "content": "<p>That IORef might be a remnant of the cmdline driver that is still implemented in C++</p>",
        "id": 231219855,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616337286
    },
    {
        "content": "<p>So if I run <code>runFrontend</code> on a program that does some <code>import</code>s and then does <code>#eval Elab.initSearchPath (Option.some foo)</code> and then does some more imports (presumably with the new search path?), then won't I be starting out in a different state the second time I call <code>runFrontend</code>, because the internal <code>initSearchPath</code> will have modified the search path for <code>import</code>?</p>",
        "id": 231311370,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616420511
    },
    {
        "content": "<p>Or will there be two different levels of search paths, then, and there's no way to modify the outer one from the inner context?</p>",
        "id": 231311557,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616420570
    },
    {
        "content": "<p>I see, yes, in that case the second run would see the updated search path of the first run. Is that a practical concern? It sounds unlikely unless you run the test case minimizer on itself (or similar programs) :) .</p>",
        "id": 231312289,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616420833
    },
    {
        "content": "<p>It's probably not very likely, but I wouldn't be surprised if it happens at some point.  (And if I hit a bug when writing the test-case minimizer, it would be nice to be able to run it on itself.)</p>",
        "id": 231314745,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616421762
    },
    {
        "content": "<p>Another useful thing here would be to be able to run the minimizer in a mode optimized for long-running files, where instead of starting the execution from scratch at each run, the minimizer kept a cache of the execution state after each prefix of the document, and then resumed lean from the longest prefix that it had cached.  (I assume that Lean might optimize things for linear usage, so perhaps it only makes sense to do this when the program takes \"long enough\" to run, or to have it be a command-line switch, but it would still be a nice thing to allow.)  But this only works if I can handle <code>FrontendM</code> in a more pure way</p>",
        "id": 231315255,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616421961
    },
    {
        "content": "<p>That is how the language server works: <a href=\"https://github.com/leanprover/lean4/blob/master/src/Lean/Server/Snapshots.lean\">https://github.com/leanprover/lean4/blob/master/src/Lean/Server/Snapshots.lean</a></p>",
        "id": 231315976,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616422226
    },
    {
        "content": "<p>Btw, the minimizer will not <em>actually</em> contain any <code>#eval</code> modifying global state, will it? I really don't think such programs are a practical concern since they will confuse the language server as well and should be avoided at all cost.</p>",
        "id": 231316278,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616422351
    },
    {
        "content": "<blockquote>\n<p>That is how the language server works:</p>\n</blockquote>\n<p>Ah, neat, thanks!</p>",
        "id": 231316405,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616422406
    },
    {
        "content": "<blockquote>\n<p>Btw, the minimizer will not <em>actually</em> contain any <code>#eval</code> modifying global state, will it? I really don't think such programs are a practical concern since they will confuse the language server as well and should be avoided at all cost.</p>\n</blockquote>\n<p>Usually, no.  However, in the very rare case that there is a bug in how Lean executes programs in <code>#eval</code> and I hit this bug only on certain inputs to the minimizer, I may run the minimizer using <code>#eval</code> to exhibit the bug and then run the minimizer on this file that itself calls the minimizer via <code>#eval</code>.</p>",
        "id": 231316863,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616422587
    },
    {
        "content": "<p>And, er, I was hopping to be able to write a test-suite for the minimizer in Lean, and I think the most effective way to do this would be with a bunch of <code>#eval</code> commands that invoke the minimizer...</p>",
        "id": 231316977,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616422638
    },
    {
        "content": "<p>I suppose I can write add a switch that disables the call to <code>initSearchPath</code>, though</p>",
        "id": 231317055,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616422677
    },
    {
        "content": "<p>Alright, I concede that running the minimizer on the test suite of a minimizer could run into this issue <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span> . But even then, the result will probably be deterministic after all since you will most likely always call <code>initSearchPath</code> before the corresponding <code>importModules</code> call.</p>",
        "id": 231317664,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616422905
    },
    {
        "content": "<p>Note that processing a Lean file multiple times in the same process is a bit fiddly anyway since imports have to be unloaded manually and unsafely: <a href=\"https://github.com/leanprover/lean4/blob/master/src/Lean/Environment.lean#L594-L597\">https://github.com/leanprover/lean4/blob/master/src/Lean/Environment.lean#L594-L597</a>. This is hard to do correctly e.g. in the presence of async tasks, but for your specific purpose I don't think that should be an issue.</p>",
        "id": 231318164,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616423093
    },
    {
        "content": "<p>Hm, will Lean handle this automatically for me, if I use the interface in Lean.Server.Snapshots?  Or do I have to do something special to fiddle with imports?  Also, how do I get my first snapshot?  There doesn't seem to be a version of <code>compileCmdsAfter</code> which doesn't ask for a starting <code>Snapshot</code>...</p>",
        "id": 231321133,
        "sender_full_name": "Jason Gross",
        "timestamp": 1616424132
    },
    {
        "content": "<p>The initial snapshot is created here: <a href=\"https://github.com/leanprover/lean4/blob/3749213e08285d3a139da6cf04b30b5e38ed6179/src/Lean/Server/FileWorker.lean#L204\">https://github.com/leanprover/lean4/blob/3749213e08285d3a139da6cf04b30b5e38ed6179/src/Lean/Server/FileWorker.lean#L204</a><br>\nThat function also shows how to use <code>leanpkg</code> to get at the <code>LEAN_PATH</code>.</p>",
        "id": 231321684,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616424347
    },
    {
        "content": "<p>We actually have a separate server process per file, which we restart when the imports have changed. Much easier than manually stopping all spawned tasks.</p>",
        "id": 231322088,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616424486
    }
]