[
    {
        "content": "<p>The command name \"refresh file dependencies\" is apparently quite unintuitive and unclear about what it does.  For example <span class=\"user-mention\" data-user-id=\"434989\">@Chris Lovett</span> never realized that it actually restarts the file worker, and that this is the main purpose of the command.</p>\n<p>Should we rename it to \"restart file worker\" or even \"restart file\"?</p>",
        "id": 288769528,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657177202
    },
    {
        "content": "<p>How about \"Reload File\"? That way it nicely parallels with VSCode developer command of \"Reload Window\" as they do parallel things (\"Reload File\" reloads the worker without restarting the Lean server and  \"Reload Window\" reloads the window without restarting VSCode).</p>",
        "id": 288771909,
        "sender_full_name": "Mac",
        "timestamp": 1657179158
    },
    {
        "content": "<p>(I was also surprised to discover that it restarted the worker if it broke. I had originally thought it just reset the internal Lean environment without restarting the process. Furthermore, had I not known -- due to working with the elaborator -- that it was impossible to reimport modules without resetting the environment, I would have thought it would have done just the reimporting i.e. without resetting the environment.)</p>",
        "id": 288772247,
        "sender_full_name": "Mac",
        "timestamp": 1657179428
    },
    {
        "content": "<p>Right, there's three commands here (with current names):</p>\n<ul>\n<li>\"Reload Window\" (restarts VSCode)</li>\n<li>\"Restart Server\" (restarts the Lean server)</li>\n<li>\"Refresh File Dependencies\" (restarts the file worker)</li>\n</ul>\n<p>I think it's better to use \"restart\" instead of \"reload\" because it's consistent with other extensions.  All of the extensions I have installed here use \"restart server\" (\"Rust: Restart the Rust server\", \"ccls: Restart language server\", \"TypeScript: Restart TS Server\", etc.).</p>",
        "id": 288772276,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657179449
    },
    {
        "content": "<p>Fyi in emacs we call it:</p>\n<ul>\n<li>lsp-workspace-restart (restarts the Lean server)</li>\n<li>lean4-refresh-file-dependencies (restarts the file worker)</li>\n</ul>\n<p>for restarting emacs on the spot we don't really have something afaik.</p>",
        "id": 288772600,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1657179719
    },
    {
        "content": "<p>When it comes to the renaming, I think there are two conflicting desires. If the problem a user has is that some imports updates are not registered, the command \"Refresh File Dependencies\" sticks out as a solution to that problem (whereas \"Restart File\" does not necessarily do so -- after all, it is conceptually possible to restart the worker <em>without</em> rebuilding/refreshing the dependencies). On the other hand, if the file is broken (i.e., the elaborator hit some bug and crashed), \"Restart File\" sticks out as a solution but \"Refresh File Dependencies\" does not.</p>",
        "id": 288772605,
        "sender_full_name": "Mac",
        "timestamp": 1657179720
    },
    {
        "content": "<p>Also, as an aside, since we are talking about resetting the server and elaborator bugs, does anyone know why / know how to fix a file where features like semantic highlighting and hovers is broken and/or error indicators are not updating (i.e., generally the info tree appears broken) but the info view is not? Resetting the file worker via \"Refresh File Dependencies\" works in that it updates the file (error indicators move to where they should be), but the file still remains non-interactive (e.g., no hovers, often no highlighting, and further changes will not update indicators).</p>",
        "id": 288773026,
        "sender_full_name": "Mac",
        "timestamp": 1657180029
    },
    {
        "content": "<p>I think that's <a href=\"https://github.com/leanprover/lean4/issues/1219\">https://github.com/leanprover/lean4/issues/1219</a></p>",
        "id": 288773147,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657180142
    },
    {
        "content": "<p>Yeah, that seems like it, as when my problem occurs in a given file, it continues to occur in the same file for the rest of eternity (<strong>EDIT:</strong> double checked, it does appear that issue does disappear at the very least after a system restart). But it only happens in certain files and without any clear reason why it does.</p>",
        "id": 288773277,
        "sender_full_name": "Mac",
        "timestamp": 1657180256
    },
    {
        "content": "<p>Back to the names.  We could also have both commands (\"refresh file deps\" &amp; \"restart file\") if this helps people find it.  But fact is that the command restarts the file worker; that the dependencies are recompiled is very much a side effect.</p>",
        "id": 288773428,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657180387
    },
    {
        "content": "<p>I think that is reasonable (also, sorry for side-tracking the thread).</p>",
        "id": 288773547,
        "sender_full_name": "Mac",
        "timestamp": 1657180459
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/vscode-lean4/pull/213\">https://github.com/leanprover/vscode-lean4/pull/213</a></p>",
        "id": 288776932,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657182799
    },
    {
        "content": "<p>Talking about \"file workers\" seems somewhat implementation-detaily to me, is there some reason an end user cares about that?</p>",
        "id": 288779734,
        "sender_full_name": "Julian Berman",
        "timestamp": 1657184358
    },
    {
        "content": "<p>I don't mean to further bikeshed the change, seems good to me, just want to make sure I'm not missing something</p>",
        "id": 288779774,
        "sender_full_name": "Julian Berman",
        "timestamp": 1657184376
    },
    {
        "content": "<p>Presumably an end user cares strictly about \"my lean looks stuck\" or \"my imports aren't up to date\" right? Not the fact that Lean happens to use one process per file.</p>",
        "id": 288779919,
        "sender_full_name": "Julian Berman",
        "timestamp": 1657184443
    },
    {
        "content": "<p>If we have a restart command, then it must be clear what it restarts.  The end user can also observe what is restarted by watching the orange bars.  So I think it is very much relevant for the end user, because it answers the question \"what will be covered in the orange bars of hell once I press this button\".</p>",
        "id": 288781082,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657185225
    },
    {
        "content": "<p>The \"file worker\" terminology is a bit technical, that's why I left it out and simply called it \"restart file\".</p>",
        "id": 288781165,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657185246
    },
    {
        "content": "<p>It's still mentioned in the <code>restartFile</code> description, which is what <span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> might have been referring to</p>",
        "id": 288781232,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1657185300
    },
    {
        "content": "<p>Oops, I've just copy&amp;pasted that from the refreshFileDependencies description.  Fixed now.</p>",
        "id": 288781492,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1657185452
    }
]