[
    {
        "content": "<p>Let me continue the semantic highlighting color theme customization in a separate thread from <a href=\"#narrow/stream/270676-lean4/topic/dumb.20questions/near/294943835\">https://leanprover.zulipchat.com/#narrow/stream/270676-lean4/topic/dumb.20questions/near/294943835</a>.</p>",
        "id": 294953396,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1661292661
    },
    {
        "content": "<p>I propose the following text to add somewhere in the manual:</p>",
        "id": 294953416,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1661292673
    },
    {
        "content": "<p>The Lean language server provides semantic highlighting information to editors. In order to benefit from this in VSCode, you may need to activate the \"Editor &gt; Semantic Highlighting\" option in the preferences (this is translates to <code>\"editor.semanticHighlighting.enabled\": true,</code><br>\nin <code>settings.json</code>). The default option here is to let your color theme decides whether it activates semantic highlighting (the default themes Dark+ and Light+ do activate it for instance).</p>\n<p>However this may be insufficient if your color theme does not distinguish enough syntax categories or distinguishes them very subtly. For instance the default Light+ theme uses color <code>#001080</code> for variables. This is awfully close to <code>#000000</code> that is used as the default text color. This makes it very easy to miss an accidental use of <a href=\"https://leanprover.github.io/lean4/doc/autobound.html\">auto bound implicit arguments</a>. For instance in</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">def</span> <span class=\"n\">my_id</span> <span class=\"o\">(</span><span class=\"n\">n</span> <span class=\"o\">:</span> <span class=\"n\">nat</span><span class=\"o\">)</span> <span class=\"o\">:=</span> <span class=\"n\">n</span>\n</code></pre></div>\n<p>maybe <code>nat</code> is a typo and <code>Nat</code> was intended. If your color theme is good enough then you should see that <code>n</code> and <code>nat</code> have the same color since they are both marked as variables by semantic highlighting. If you rather write <code>(n : Nat)</code> then <code>n</code> keeps its variable color but <code>Nat</code> gets the default text color.</p>\n<p>If you use such a bad theme, you can fix things by modifying the <code>Semantic Token Color Customizations</code> configuration. This cannot be done directly in the preferences dialog but you can click on \"Edit in settings.json\" to directly edit the settings file. Beware that you must save this file (in the same way you save any file opened in VSCode) before seeing any effect in other tabs or VSCode windows.</p>\n<p>In the main config object, you can add something like</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"s2\">\"editor.semanticTokenColorCustomizations\"</span><span class=\"o\">:</span> <span class=\"o\">{</span>\n        <span class=\"s2\">\"[Default Light+]\"</span><span class=\"o\">:</span> <span class=\"o\">{</span><span class=\"s2\">\"rules\"</span><span class=\"o\">:</span> <span class=\"o\">{</span><span class=\"s2\">\"function\"</span><span class=\"o\">:</span> <span class=\"s2\">\"#ff0000\"</span><span class=\"o\">,</span> <span class=\"s2\">\"property\"</span><span class=\"o\">:</span> <span class=\"s2\">\"#00ff00\"</span><span class=\"o\">,</span> <span class=\"s2\">\"variable\"</span><span class=\"o\">:</span> <span class=\"s2\">\"#ff00ff\"</span><span class=\"o\">}}</span>\n    <span class=\"o\">},</span>\n</code></pre></div>\n<p>The colors in this example are not meant to be nice but to be easy to spot in your file when testing. Of course you need to replace <code>Default Light+</code> with the name of your theme, and you can customize several themes if you use several themes. VSCode will display small colored boxes next to the HTML color specifications. Hovering on top of a color specification opens a convenient color picker dialog.</p>\n<p>In order to understand what <code>function</code>, <code>property</code> and <code>variable</code> mean in the above example, the easiest path is to open a Lean file and ask VSCode about its classification of various bits of your file. Open the command palette with Ctrl-shift-p (or ⌘-shift-p on a Mac) and search for \"Inspect Editor Tokens and Scopes\" (typing the word \"tokens\" should be enough to see it). You can then click on any word in your file and look if there is a \"semantic token type\" line in the displayed information.</p>",
        "id": 294953547,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1661292750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> Thanks for writing it. It is great. <br>\nWe can create a new IDE section with tips and tricks for customizing editors. Another option is to add it here: <a href=\"https://leanprover.github.io/lean4/doc/autobound.html#auto-bound-implicit-arguments\">https://leanprover.github.io/lean4/doc/autobound.html#auto-bound-implicit-arguments</a><br>\nSuggestions are welcome.</p>",
        "id": 294975585,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1661312257
    },
    {
        "content": "<p>I think a new section is better. Interrupting the auto-implicit section would be too disrupting (but we can put a link there).</p>",
        "id": 294989291,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1661323969
    }
]