[
    {
        "content": "<p>I was wondering if there's a backlog or some requests for features for the lean4 extension. One thing I noticed, playing around with lean 4 is that the extension is really not on the same level as the lean 3 one (unsurprisingly). And it is something that, I think, creates unnecessary barriers for trying out lean 4.</p>\n<p>E.g. the proof state could be visible more broadly, doc comments on hover, possibly a more powerful go to definition (at an import), stuff like that.</p>",
        "id": 231026265,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1616162291
    },
    {
        "content": "<p>Doc comments on hover should already work. Better go to definition is on the Lean side, <a href=\"https://github.com/leanprover/lean4/issues/287\">https://github.com/leanprover/lean4/issues/287</a></p>",
        "id": 231032230,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616164588
    },
    {
        "content": "<p>What do you mean by \"visible more broadly\"? If you have simple suggestions to enhance the UI or UX, I think we're all ears. Otherwise \"do at least as well as Lean 3\" is of course already a goal.</p>",
        "id": 231032587,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616164719
    },
    {
        "content": "<p>well a obvious one would be to show the proof state not only in tactic mode but also in term mode.</p>",
        "id": 231037043,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1616166230
    },
    {
        "content": "<p>One thing I'd like to be able to do and I don't currently have a good way with lean 4, I think is this.</p>\n<p>How do I know what the proof state is after a tactic ran? In lean 3, I'd do a hack like this: <code>{ split, left, right, simp, tautology, }</code> notice the trailing <code>,</code>. It allows me to see the state after a tactic has finished. </p>\n<p>To be honest, I didn't like it in lean 3 either, but at least I could tell what the tactic did. </p>\n<p>Do you think we could build something that makes it easy to know what the state after the tactic is?</p>",
        "id": 231216170,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1616332966
    },
    {
        "content": "<p>The state shown in the info view <em>is</em> the one after running the tactic</p>",
        "id": 231216251,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616333072
    },
    {
        "content": "<p>Conversely, it is not possible to view the initial state of a tactic proof branch (with at least one succeeding tactic) without editing the file, though we can fix that by showing it on <code>by</code>, <code>=&gt;</code>, etc.</p>",
        "id": 231216573,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1616333504
    },
    {
        "content": "<p>ok, right. I think my terrible hack so far was <code>by {}</code> and then I'd see the result on the closing brace or something. Either way, seeing both would be really nice.</p>",
        "id": 231216890,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1616333878
    }
]