[
    {
        "content": "<p>What's the magic with <code>StateRefT</code>? Where is it defined? I cannot jump to its definition and <code>#check StateRefT</code> fails. Is it a keyword?</p>",
        "id": 292507604,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1659999255
    },
    {
        "content": "<p>It is basically <code>StateT</code>, except it uses a pointer instead of a product type for efficiency reasons. I think these may be less important these days than they were when <code>StateRefT</code> was introduced.</p>",
        "id": 292508289,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1659999740
    },
    {
        "content": "<p>The reason you can't click on <code>StateRefT</code> is because it's actually a macro over <code>StateRefT'</code> which hides an extra type parameter</p>",
        "id": 292517253,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1660007763
    },
    {
        "content": "<p>although, last I checked you can click on macros too</p>",
        "id": 292517259,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1660007779
    },
    {
        "content": "<p>goto ref still doesn't work on StateRefT, I just run into this also, Mario had to point me to the macro.  I guess from now on if F12 doesn't find the identifier I have to do a find all for \"identifier\" to see if it's in a macro.  Sometimes that has to be \" identifier \" because sometimes it's a notation with a space around it...</p>",
        "id": 301137390,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1664323395
    },
    {
        "content": "<p>the notations almost never have a space before them, so <code>\"identifier</code> works well for me</p>",
        "id": 301137753,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1664323623
    },
    {
        "content": "<p>but yes, there is a bug to be tracked down here - go to def should work for macros</p>",
        "id": 301137796,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1664323646
    },
    {
        "content": "<p>I think this is just the standard issue that go-to-definition only works if you <code>import Lean</code> (at least it works for me with that import).</p>",
        "id": 301143653,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1664327955
    }
]