[
    {
        "content": "<p>While writing <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=BoundedRandom#doc\">docs4#BoundedRandom</a> (which was originally implemented using sets that only have elements within a certain range: <a href=\"https://leanprover-community.github.io/mathlib_docs/find/bounded_random\">docs#bounded_random</a>) I started wondering when to use a subtype vs a set. I can see that you want to use a set when e.g. defining a subgroup because you'd have to be polymorphic over whatever is the property of the subtype as well which is just unnecessary when you can use a set. But when the property is known like in this case, when and why should I use a subtype over a set or a set over a subtype?</p>",
        "id": 275091311,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1647083658
    },
    {
        "content": "<p>One is a type, one is a term. This helps sometimes.</p>",
        "id": 275091759,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1647084307
    },
    {
        "content": "<p>Ignoring the dependent types, this reduces to the design question of whether you want to pass around multiple arguments and return values or bundle them up into a structure. There's more freedom when you keep things separate, but it can be more convenient conglomerating them, if in practice the things really do tend to be passed around together. One example: do you have a function take a pair? or two values? Relatedly: do you have the theorem take a proof of an <code>And</code> or two proofs? (In mathlib, almost no theorems take an <code>And</code>, but many do take a custom <code>And</code> via a <code>Prop</code>-valued structure.)</p>\n<p>For sets vs subtypes, it's a question of whether you pass around two things or one thing.  One way to think about it is that there are a bunch of functions that only take one value, and by using <code>Subtype.mk</code> you can effectively make them take two (the term and a proof that a predicate holds for it).</p>\n<p>Maybe an example is the theorems about nonzero natural numbers. The theorems are generally stated using <code>n : Nat</code> and <code>h : n ≠ 0</code>, but they could also be stated using <code>n' : {n : Nat // n ≠ 0}</code>. However, these would be less applicable because you can't <code>rw</code> with them if the natural numbers aren't literally bundled with their <code>≠ 0</code> proofs like this.</p>",
        "id": 275113305,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1647113710
    },
    {
        "content": "<p>Lean has a handful of built-in (non)-dependent pairs:</p>\n<ul>\n<li><code>And</code> for <code>Prop</code>/<code>Prop</code> (non-dependent, <code>Prop</code>-valued)</li>\n<li><code>Prod</code> for <code>Type</code>/<code>Type</code> (non-dependent)</li>\n<li><code>Exists</code> for <code>Sort</code>/<code>Prop</code> (dependent, <code>Prop</code>-valued)</li>\n<li><code>Sigma</code> for <code>Type</code>/<code>Type</code> (dependent)</li>\n<li><code>PSigma</code> for <code>Sort</code>/<code>Sort</code> (dependent)<br>\nI tend to think of them as being for when you sort of would want a custom two-field <code>structure</code>, but for whatever reason it's not worth all the effort of doing so.</li>\n</ul>",
        "id": 275113311,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1647113718
    }
]