[
    {
        "content": "<p>I just installed lean (via WSL) and have it working in terminal, but after installing the Lean package in VS Code I'm getting \"Unable to start the lean server process: Error: spawn lean ENOENT --- The lean.executablePath \"lean\" may be incorrect, make sure it is a valid lean executab;e</p>\n<p>I've added \"C:\\Users\\Chris\\.elan\\bin\\lean\" (the response to which lean in git bash) to my system path</p>",
        "id": 252052555,
        "sender_full_name": "Chris Mascioli",
        "timestamp": 1630820584
    },
    {
        "content": "<p>I also made WSL the default profile and lean works inside the terminal in VSCode</p>",
        "id": 252052751,
        "sender_full_name": "Chris Mascioli",
        "timestamp": 1630820860
    },
    {
        "content": "<p>Resolved, installed 'lean4' instead of 'lean' as the VSCode extension</p>",
        "id": 252053724,
        "sender_full_name": "Chris Mascioli",
        "timestamp": 1630822049
    },
    {
        "content": "<p>Three times this month I have seen students with ENOENT errors in VS Code when trying to use Lean 3 projects. One just sent me a screenshot:<br>\n<a href=\"/user_uploads/3121/kldXCH0CeAqX43nxkUbfm2eU/ENOENT.png\">ENOENT.png</a> <br>\nRight now the solution seems to be \"random fiddling and hope that the error goes away\" and sometimes it does. This is when attempting to run Lean 3 projects, sometimes on systems which seem to otherwise work fine (<code>lean -v</code> works fine from the command line etc). Can anyone guess a potential diagnosis? The executable is just <code>lean</code> for the problems I've seen.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/kldXCH0CeAqX43nxkUbfm2eU/ENOENT.png\" title=\"ENOENT.png\"><img src=\"/user_uploads/3121/kldXCH0CeAqX43nxkUbfm2eU/ENOENT.png\"></a></div>",
        "id": 303609816,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665575265
    },
    {
        "content": "<p>I think with the lean3 extension you have to have your PATH setup right, whereas the lean4 extension does not require that.  The lean4 extension looks in the default elan install location and if it finds lean there then it uses it without you having to mess with your PATH.  So perhaps the lean3 extension could do something similar...</p>",
        "id": 303964861,
        "sender_full_name": "Chris Lovett",
        "timestamp": 1665724455
    },
    {
        "content": "<p>Everyone I've talked to has said that the problem has gone away after a reboot btw</p>",
        "id": 303978169,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665733489
    },
    {
        "content": "<p>Any commonalities in operating system for them?</p>",
        "id": 304031198,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665753926
    },
    {
        "content": "<p>Not sure it's what's happening, but perhaps worth mentioning ENOENT can lie a bit -- it means \"the executable isn't found\", but if <code>lean</code> indeed exists, you can also get ENOENT (at least on macos) if e.g. the <code>cwd</code> that is being used to execute the process itself doesn't exist.</p>",
        "id": 304031390,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665753981
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover/vscode-lean/blob/79c91c31f3a33cfb205380f45ebba9d6954d8a31/src/server.ts#L107-L109\">https://github.com/leanprover/vscode-lean/blob/79c91c31f3a33cfb205380f45ebba9d6954d8a31/src/server.ts#L107-L109</a> it looks like is where that message gets raised.. which I think is saying the original error message is also present there unchanged, so that's.. not helpful to diagnose it seems.</p>",
        "id": 304031767,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665754106
    }
]