[
    {
        "content": "<p>I've been wondering about this question, but I don't know enough about this in order to answer myself. Does Lean 4 introduce any modifications to Lean 3 at the level of the type theory? Or more precisely, does the theory and the consistency proof, as described in Mario's thesis, apply \"as is\" also to Lean 4?</p>",
        "id": 271422395,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1644495136
    },
    {
        "content": "<p>AFAIK it's not exactly the same, as nested inductives have been pushed into the kernel to some extent in Lean 4 (I might be wrong about this though).</p>",
        "id": 271426463,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1644497740
    },
    {
        "content": "<p>So I'm guessing the inductive specifications in Mario's thesis are a bit less expressive than what Lean supports now.</p>",
        "id": 271426749,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1644497887
    },
    {
        "content": "<p>Yes, primitive mutual inductives, structure eta, and <code>reduceBool/Nat</code> are the big changes. I'm intending to write all of them down some time soon.</p>",
        "id": 271456181,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1644510504
    },
    {
        "content": "<p>Structure eta should be relatively easy to add to the theory; it was actually already using some aspects of structure eta to make the reduction to W types work. Primitive mutual/nested inductives should not be fundamentally harder, the tricky bit is getting the exact rules that the kernel uses. <code>reduceBool/Nat</code> is kind of hopeless, we can't prove anything about consistency in the presence of it</p>",
        "id": 271457095,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644510890
    },
    {
        "content": "<p>actually that's not quite true, we just have to assume all the <code>reduceBool</code> applications are consistent with the model's notion of equality</p>",
        "id": 271457209,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644510941
    },
    {
        "content": "<p>still it's not as self-contained of a claim as one would like</p>",
        "id": 271457259,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644510960
    },
    {
        "content": "<p>IIRC, <code>reduceBool</code> was never intended to be used for formalized mathematics anyhow.  It's perfectly reasonable to exclude it from the theory, i.e., treat it the same as <code>sorry</code>.</p>",
        "id": 271457443,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1644511040
    },
    {
        "content": "<p>Hm, <a href=\"https://github.com/leanprover/lean4/blob/master/src/Init/Core.lean#L1038\">here</a> is says (about <code>reduceBool</code>): “This feature is useful for performing proofs by reflection.”<br>\nIs this not still the plan?</p>",
        "id": 271540367,
        "sender_full_name": "Ulrik Buchholtz",
        "timestamp": 1644565172
    },
    {
        "content": "<p>I think it depends on how much trust you are willing to give the overall system</p>",
        "id": 271541248,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644565975
    },
    {
        "content": "<p>some applications have more \"trust budget\" than others</p>",
        "id": 271541260,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644565991
    },
    {
        "content": "<p>For anything where we want to be able to prove a big theorem and then look at <code>#print axioms</code> and be convinced that it worked, or anything where we want the proof to be exportable to external verifiers, I think <code>reduceBool</code> is not suitable</p>",
        "id": 271541338,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644566065
    },
    {
        "content": "<p>For big proofs where significant computation or verification of programs is part of the task (like the original Appel &amp; Haken proof of 4-color theorem), I think <code>reduceBool</code> is a good way to incorporate the result in a formal system and prove what can be proved while trusting the computer for the part that would be otherwise infeasible</p>",
        "id": 271541496,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644566230
    },
    {
        "content": "<p>I think there are also some low hanging fruits in making <code>reduceBool</code> more auditable, for example gathering a list of all <code>implementedBy</code> functions that are transitively reachable by the inputs to <code>reduceBool</code></p>",
        "id": 271541612,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644566332
    },
    {
        "content": "<p>The mathematical community nowadays are in general completely accepting of unverified computational proofs if the problem is clearly far too big to be done by hand. For example the proof of ternary Goldbach is \"here's hundreds of pages of hard maths dealing with N&gt;10^30 and if anyone found a mistake then this would be regarded as a catastrophe until it was fixed, and for N&lt;10^30 we wrote some bespoke code (which relied on another verification of binary Goldbach for N&lt;10^18 which we just assumed) and we ran it once and maybe nobody else looked at it, and it printed \"yes\" at the end\"</p>",
        "id": 271543063,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644567410
    },
    {
        "content": "<p>Sounds to me like <code>reduceBool</code> (and GMP) is acceptable for one half of the proof but not the other</p>",
        "id": 271543221,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644567509
    },
    {
        "content": "<p>Thanks. It's an interesting choice to limit reflection to “large-scale reflection” (contra ssreflect!). And even if the trust is slightly smaller for results proved using <code>reduceBool</code> than not, it should still be many orders of magnitude better than for something done with C-code hacked together by mathematicians and which only ran once.</p>",
        "id": 271543838,
        "sender_full_name": "Ulrik Buchholtz",
        "timestamp": 1644567957
    },
    {
        "content": "<p>And slower ;-)</p>",
        "id": 271543955,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644568031
    },
    {
        "content": "<p>It won't be much slower though, that's the point--maybe the name is a bit misleading in that it it suggests <code>#reduce</code>, but reduction is exactly what it avoids.</p>",
        "id": 271567083,
        "sender_full_name": "Reid Barton",
        "timestamp": 1644581592
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> pointed out above, <code>reduceBool</code> was never intended to be used for formalized mathematics. We added this feature for users that do not mind large trusted code bases which contain many bugs. For example, many software verification tools trust complex SMT solvers like CVC5 and Z3. <code>reduceBool</code> dramatically increases the size of the trusted code base. The Lean compiler is a complex piece of software, and contains many bugs and corner cases that can be exploited to prove <code>False</code>. <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> <code>reduceBool</code> is way more dramatic and using <code>GMP</code> in the kernel. <code>GMP</code> is heavily tested, implements a clear specification/functionality, and can be replaced with many other (heavily tested) packages that implement the same functionality. In the future, it is even feasible to replace it with a verified version. On the other hand, <code>reduceBool</code> relies on the Lean compiler, a new piece of software implementing a much more complex specification/functionality. We have only one Lean compiler at this point, and it is infeasible to verify it right now.<br>\nI deeply regret adding the <code>reduceBool</code> feature, the intended user never used it, and it generates a lot of confusion, and recurrent theads. I thought the warning at <code>reduceBool</code> would make it clear this is a unsafe feature. I will try to make it clear how dangerous this feature is, and will add the following example to the documentation <a href=\"https://github.com/leanprover/lean4/blob/master/tests/lean/run/nativeReflBackdoor.lean\">https://github.com/leanprover/lean4/blob/master/tests/lean/run/nativeReflBackdoor.lean</a><br>\n<span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> Making <code>reduceBool</code> more auditable is a good thing, but it is not enough. I am assuming you are trying to address this issue <a href=\"https://github.com/leanprover/lean4/blob/master/src/Init/Core.lean#L1050-L1052\">https://github.com/leanprover/lean4/blob/master/src/Init/Core.lean#L1050-L1052</a>, this is good, but we would still be trusting the Lean compiler, a complex piece of software. <br>\nFinally, recall that any development using <code>reduceBool</code> will be much harder to check using an external type checker. Malicious users may exploit bugs in the Lean compiler, and inject invalid proofs in big descentralized and cooperative projects like Mathlib.</p>",
        "id": 271582803,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1644589090
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112857\">Leonardo de Moura</span> <a href=\"#narrow/stream/270676-lean4/topic/Type.20theory.20of.20lean.204/near/271582803\">said</a>:</p>\n<blockquote>\n<p>I deeply regret adding the <code>reduceBool</code> feature, the intended user never used it, and it generates a lot of confusion, and recurrent theads. I thought the warning at <code>reduceBool</code> would make it clear this is a unsafe feature.</p>\n</blockquote>\n<p>I would like to make a brief comment in defense of <code>reduceBool</code>/<code>nativeDecide</code>. While not useful (and often counterproductive) for mathematics, it is quite nice for software verification -- especially for quick and dirty proofs about small snippets of code. It allows one to write proofs of functionality for algorithms that would otherwise be very difficult to reason about in Lean, including those using <code>partial</code> and <code>extern</code> functions (e.g., <code>String</code> utilities, FFI code). I think that when Lean moves past the mathport phase into the more general programming phase there is hope that <code>reduceBool</code> may move from being often a liability to a significant benefit.</p>",
        "id": 271629676,
        "sender_full_name": "Mac",
        "timestamp": 1644609887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112857\">@Leonardo de Moura</span> It's true that the lean compiler is large and complex, but for some reason or another most folks have a blind spot for compiler correctness, and worrying about / defending against bugs in the compiler itself is on the paranoid end of the spectrum. But perhaps more to the point, once you take away the extension points the compiler is at least a bounded thing that you can audit without regard to the thing being compiled. But the extension points make this kind of auditing insufficient, and <code>implementedBy</code> has all the ease of use and power of an added axiom, as your test case evidences.</p>\n<p>Besides <code>implementedBy</code> and <code>extern</code>, what other extension points are there in the compiler? The only one that comes to mind is <code>csimp</code>. This one at least uses provable equalities, but an auditing tool would still need to track down uses of <code>csimp</code> lemmas in called functions to find out which axioms were involved in the proofs of these equalities as well (since you could use <code>implementedBy</code> to redirect the compiler to a different definition which is <code>csimp</code>'d by <code>sorry</code> and you could lose track of the <code>sorry</code> dependence if you aren't careful).</p>\n<p>I agree with Mac that <code>reduceBool</code> is not a mistake: it definitely has use cases, and I think we should encourage a more graded notion of trust in formal methods more generally, as long as we are upfront about what we are trusting. I think this discussion has helped to answer the question of what mathlib4 should do with regard to use of <code>reduceBool</code>: it should be banned in most of the library, except possibly for a clearly marked subfolder for theorems that require this dependency.</p>",
        "id": 271659046,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644627651
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> </p>\n<blockquote>\n<p>for some reason or another most folks have a blind spot for compiler correctness, and worrying about / defending against bugs in the compiler itself is on the paranoid end of the spectrum.</p>\n</blockquote>\n<p>I agree with the statement only for compilers that are heavily used and tested like gcc, clang, ghc. This is not the case for the Lean compiler. Even these heavily tested compilers have many corner-case bugs that can be exploited by adversarial users.</p>\n<blockquote>\n<p>But perhaps more to the point, once you take away the extension points the compiler is at least a bounded thing that you can audit without regard to the thing being compiled.</p>\n</blockquote>\n<p>Who is going to do the audit? It is a lot of work, there is also the runtime that contains low-level C code.</p>\n<p>Another issue is that we lose the capability of checking Lean developments with external type checkers. The external type checkers would have to implement an efficient <code>reduceBool</code> which is a lot of work. I don't want to give up that. </p>\n<p>Note that by the same token, one could \"audit\" and then trust SMT solvers, but I think this is a recipe for getting a bunch of proofs of <code>False</code>.</p>\n<blockquote>\n<p>I agree with Mac that reduceBool is not a mistake: it definitely has use cases, and I think we should encourage a more graded notion of trust in formal methods more generally</p>\n</blockquote>\n<p>This is really subtle, and it is hard to communicate to users how much they are sacrificing when they use <code>reduceBool</code>. <br>\nI think Lean has a really good track record for soundness, and the last thing I want is to jeopardize that. Imagine the following \"disaster scenario\", a really important result is proved in Lean, but it is due to a bug in the runtime or compiler. </p>\n<blockquote>\n<p>I think this discussion has helped to answer the question of what mathlib4 should do with regard to use of reduceBool: it should be banned in most of the library, except possibly for a clearly marked subfolder for theorems that require this dependency.</p>\n</blockquote>\n<p>Yes, I think it should be banned from Mathlib 4. It is fine for exploratory work, quick experiments, and software verification projects where none of the members are adversarial. </p>\n<p>That being said, I think we all want a better story for \"proof by reflection.\" We will work on that in the future. We can implement a much simpler compiler for this use case, and make sure it is feasible to verify it.</p>\n<blockquote>\n<p>Besides implementedBy and extern, what other extension points are there in the compiler?</p>\n</blockquote>\n<p>This is a low priority right now, but we will add support for tracking this kind of dependency (<code>csimp</code> included).</p>",
        "id": 271662890,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1644631796
    }
]