[
    {
        "content": "<p>Hey, there! I'm curious to know what more interesting  cases of <code>abbrev</code> command. On tutorial, the best advantage of using <code>abbrev</code> instead <code>def</code> is that the first overload automatically numerical values and second not. Is there better examples of when use <code>abbrev</code>? Thanks.</p>",
        "id": 307527601,
        "sender_full_name": "Isaac Marlon da Silva Lourenço",
        "timestamp": 1667397134
    },
    {
        "content": "<p>Using <code>abbrev</code> marks the definition as <code>@[reducible]</code>, which allows typeclass inference \"see through\"/unfold the definition (I don't understand typeclass inference well enough to explain what this means under the hood).</p>",
        "id": 307540773,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1667400251
    },
    {
        "content": "<p>There are roughly three ways you can define a type in terms of another type, each with different properties:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">inductive</span> <span class=\"n\">foo1</span>\n<span class=\"bp\">|</span> <span class=\"n\">mk</span> <span class=\"o\">(</span><span class=\"n\">val</span> <span class=\"o\">:</span> <span class=\"n\">Nat</span> <span class=\"bp\">→</span> <span class=\"n\">Nat</span><span class=\"o\">)</span>\n\n<span class=\"kd\">def</span> <span class=\"n\">foo2</span> <span class=\"o\">:=</span> <span class=\"n\">Nat</span> <span class=\"bp\">→</span> <span class=\"n\">Nat</span>\n\n<span class=\"n\">abbrev</span> <span class=\"n\">foo3</span> <span class=\"o\">:=</span> <span class=\"n\">Nat</span> <span class=\"bp\">→</span> <span class=\"n\">Nat</span>\n</code></pre></div>\n<p>The first, <code>foo1</code>, is to create a completely new inductive type (note that you can also use <code>structure</code> for this, which has the same relevant properties). This example creates a type that's isomorphic to <code>Nat -&gt; Nat</code>, but Lean considers it to be completely different from <code>Nat -&gt; Nat</code> itself. Nothing about <code>Nat -&gt; Nat</code> carries over, and you can't use it interchangably with <code>Nat -&gt; Nat</code> in any way.</p>\n<p>The second, <code>foo2</code>, is to create a plain definition that is a synonym for the type. A big difference between <code>foo2</code> and <code>foo1</code> is that Lean can see that <code>foo2</code> is definitionally equal to <code>Nat -&gt; Nat</code>, so you can use terms of <code>foo2</code> or <code>Nat -&gt; Nat</code> mostly interchangably. A big difference is that you do not get any typeclass instances of <code>Nat -&gt; Nat</code> for <code>foo2</code> terms. You can manually carry ones you are interested in over though. The reason for this is that, like Marcus says, typeclass inference doesn't expand definitions when they have the default reducibility setting.</p>\n<p>The third, <code>foo3</code>, is to create an <code>abbrev</code> definition that is a synonym for the type. This is just a <code>def</code>, but it has the added feature that typeclass inference will expand it while doing typeclass search. Abbreviations are meant to stand for exactly what they are a synonym for.</p>",
        "id": 307545468,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1667401480
    },
    {
        "content": "<p>If you're familiar with Haskell, this is similar to defining type synonyms using <code>data</code> vs <code>newtype</code> vs <code>type</code>, but there's the difference that a <code>newtype</code> in Haskell is not definitionally equal to the type it's wrapping.</p>",
        "id": 307546482,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1667401706
    }
]