[
    {
        "content": "<p>What would it mean to have a verified Lean 4 compiler? What is there to be proved in such context?</p>",
        "id": 272033791,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1644957131
    },
    {
        "content": "<p><a href=\"https://compcert.org/\">CompCert</a></p>",
        "id": 272034611,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1644957574
    },
    {
        "content": "<p>You might also like the <a href=\"https://en.wikipedia.org/wiki/Rainbow_Series\">Rainbow Series</a> I have not herd of them being referenced much any more but the basic ideas still hold true.</p>",
        "id": 272034867,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1644957708
    },
    {
        "content": "<blockquote>\n<p>Semantic preservation ‍ The formal verification of CompCert consists in proving the following theorem, which we take as the high-level specification of a correct compiler:</p>\n</blockquote>\n<blockquote>\n<p>Semantic preservation theorem:<br>\nFor all source programs ‍S and compiler-generated code ‍C,<br>\nif the compiler, applied to the source S, produces the code C,<br>\nwithout reporting a compile-time error,<br>\nthen the observable behavior of C improves on one of the allowed observable behaviors of ‍S.</p>\n</blockquote>\n<p>Then it says:</p>\n<blockquote>\n<p>Second, the compiler is allowed to select one of the possible behaviors of the source program. The ‍C language has some nondeterminism in expression evaluation order; different orders can result in several different observable behaviors. By choosing an evaluation order of its liking, the compiler implements one of these valid observable behaviors.</p>\n</blockquote>\n<p>So there must be a formal description of \"observable behavior\". What would be a practical example for a Lean 4 compiler?</p>",
        "id": 272036006,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1644958313
    },
    {
        "content": "<p>For Lean 4's IR, <a href=\"https://leanprover.github.io/papers/beans_appendix.pdf\">the appendix of Counting Immutable Beans</a> may be of interest</p>",
        "id": 272036622,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1644958593
    },
    {
        "content": "<p>But note that this is really just one step in the compilation pipeline</p>",
        "id": 272036739,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1644958647
    },
    {
        "content": "<p>I personally believe it would be quite hard to verify the entire lean compiler, you can certainly prove stuff about parts of it like e.g. the linked counting beans proof but due do its self extending nature anyone can basically add more to the lean semantics as they wish. SO even if we proved a certain compiler correct it would not be <em>that</em> useful in reality I think</p>",
        "id": 272036747,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1644958651
    },
    {
        "content": "<p>But I'm certainly not a compiler verification person so maybe I'm totally wrong on this,</p>",
        "id": 272036908,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1644958724
    },
    {
        "content": "<p>... FWIW I spent more or less my entire BSc thesis formalizing only theorem 9 in that appendix, and I didn't quite finish the proof entirely :-)<br>\nLean 3 has progressed quite a bit since then, though.</p>",
        "id": 272037399,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1644958927
    },
    {
        "content": "<p>Huh I did conside donig that as an exercise but seems like it's much harder than expected, thanks for warning me :p</p>",
        "id": 272037493,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1644958973
    },
    {
        "content": "<p>I learned Lean with that project, so it's likely that you'll do much better than me.</p>",
        "id": 272037761,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1644959069
    },
    {
        "content": "<p>I see, thanks for the input everyone <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 272038359,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1644959322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"395550\">@Henrik Böving</span> Yes, it would be hard to verify the entire Lean compiler. BTW, for me \"compiler\" is referring to the Lean code generator that converts kernel terms/declarations into executable code. </p>\n<blockquote>\n<p>its self extending nature anyone can basically add more to the lean semantics as they wish.</p>\n</blockquote>\n<p>The kernel terms/declarations are fixed, we have no plans to extend them, and users cannot extend the kernel.<br>\nAll user notations and extensions can be viewed as syntax sugar for the actual terms/declarations that are accepted by the kernel.</p>",
        "id": 272038885,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1644959560
    },
    {
        "content": "<p>The book \"Program Logics for Certified Compilers\" might also be of interest. There's a chapter called \"how to specify a compiler\", and a section on the operational semantics and memory model of compcert.</p>",
        "id": 272045447,
        "sender_full_name": "Chris B",
        "timestamp": 1644963010
    },
    {
        "content": "<p>I think it's kind of expensive, but if you have access to a university library system it's available online through the Cambridge University Press.</p>",
        "id": 272045669,
        "sender_full_name": "Chris B",
        "timestamp": 1644963148
    },
    {
        "content": "<p>it would be pretty neat though, if Lean would be verified in itself it would be taking \"bootstrapping\" for compilers to a new level <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 272084681,
        "sender_full_name": "Andrés Goens",
        "timestamp": 1644999250
    },
    {
        "content": "<p>Maybe not lean itself, but perhaps a <a href=\"https://github.com/digama0/mm0\">simpler language, designed for the purpose...</a> <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 272085057,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1644999566
    },
    {
        "content": "<p>\"Program Logics for Certified Compilers\" (<a href=\"https://www.cs.princeton.edu/~appel/papers/plcc.pdf\">pdf</a>) is free from Andrew Appel's Princeton U. web page.</p>",
        "id": 272092422,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1645004308
    },
    {
        "content": "<p>On the topic of formally verified compilers for dependently typed languages, you might want to take a look at <a href=\"http://certicoq.org\">certicoq.org</a>. That project seeks to provide verified extraction from Coq to C. It uses the compcert C semantics, which means you get an \"end to end\" correctness property when using CertiCoq to generate the C code and compcert to compile it.</p>",
        "id": 272095985,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1645006307
    },
    {
        "content": "<p>With regards to bootstrapping, the current leader is probably CakeML, which provides a robust foundation for the Isabelle ecosystem</p>",
        "id": 272096156,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1645006401
    },
    {
        "content": "<p>In terms of porting Appel's framework to Lean, this is something Patrick Stach and I were heavily investing in circa Lean 2. We were targeting C++, not C, but we did manage to get some nontrivial stuff done (full port of indirection theory, full representation of C++ AST, tooling for getting the AST out of clang and into Lean, etc)</p>\n<p>One amusing anecdote: at the time, the checker for inductive type definitions did not scale extremely well. This made it hard for us to prototype our AST representation for C++. To make life easier, Stach wrote some tooling to generate the inductive type definitions based on a less verbose syntax. It made things go smoother so he called it \"vaso-lean\" Thankfully these perf issues are long since a thing of the past</p>",
        "id": 272097602,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1645007238
    }
]