[
    {
        "content": "<p>TL;DR Is it possible to get the nice VSCode lean-mode integration for a <a href=\"https://github.com/GaloisInc/reopt-vcg\">project</a> with non-standard structure? (E.g., no <code>leanpkg.toml</code>, complicated Makefile, etc) If so... any pointers and/or examples of this working somewhere? xD</p>\n<p>I was hoping I could do something like make sure for each of the project's pkgs <code>Foo</code> we include  an entry <code>:path/to/foo</code> in <code>LEAN_PATH</code> where a directory <code>Foo</code> resides and contains all of <code>Foo</code>'s <code>*.olean</code> files, and this would be enough to get all the type/documentation/etc info available when you visit the files... but so far I've only been able to get a <code>Loading...</code> message under a file's name in the <code>Lean Infoview</code> when I visit it and some orange vertical bars (which I assume indicate something is running in the background...?)</p>",
        "id": 236262983,
        "sender_full_name": "Andrew Kent",
        "timestamp": 1619481503
    },
    {
        "content": "<p>The server will call <code>leanpkg print-paths</code> when opening a file, but that should do exactly nothing if there is no <code>leanpkg.toml</code> (give it a try on the cmdline). For a manual setup, setting <code>LEAN_PATH</code> is the correct way, plus you will need <code>LEAN_SRC_PATH</code> in the same format (but pointing at the <code>.lean</code>s) for \"go to definition\". Not sure why it would hang, I'd have to give it a try. Does it print anything to the Output panel?</p>",
        "id": 236293567,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1619507800
    },
    {
        "content": "<p>Switching from relative to absolute file paths in <code>LEAN_PATH</code> got things working as expected <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>\n<p>(When using <em>relative</em> file paths instead of absolute file paths, the server/VSCode extension worked as expected <em>if</em> VSCode was launched by executing <code>code .</code> at the root of the project, but not if it was launched by executing <code>code path/to/file.lean</code>.)</p>",
        "id": 236376058,
        "sender_full_name": "Andrew Kent",
        "timestamp": 1619544007
    }
]