[
    {
        "content": "<p>How do you tell when you need to use <code>withContext</code>?  In some cases, it seems clear.  For example, the description of <code>getLocalDeclFromUserName</code> says that it returns the free variable's declaration \"in the current local context,\" so it seems clear that you need to set the local context before calling it.  But what about <code>elabTerm</code>?  The description says that it elaborates the syntax \"in the current <code>MVarContext</code>,\" but the syntax might contain references to free variables, so might it need access to the local context?  What about <code>unfoldDefinition</code>?  If it's being applied to an expression that contains <code>fvar</code>s, does it need access to the local context?  What about <code>inferType</code>?  Surely if an expression contains free variables, you need access to their local declarations to determine the type of the expression?  Is there some handy list of functions that have to go inside <code>withContext</code>?</p>",
        "id": 295517315,
        "sender_full_name": "Dan Velleman",
        "timestamp": 1661550114
    },
    {
        "content": "<p>Basically everything?</p>",
        "id": 295518206,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661550594
    },
    {
        "content": "<p>Most functions that are in <code>MetaM</code> are that way because they require some local context</p>",
        "id": 295518287,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661550625
    },
    {
        "content": "<p>so you should think about what context you are working on</p>",
        "id": 295518309,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661550643
    },
    {
        "content": "<p><code>unfoldDefinition</code> requires the context because it calls <code>whnf</code></p>",
        "id": 295518497,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661550749
    },
    {
        "content": "<p>Anything that handles an <code>Expr</code> is likely to need a local context</p>",
        "id": 295518768,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661550880
    }
]