[
    {
        "content": "<p>Hello, I am a beginner trying to work with lean as a hobby. I started with lean4. If I understand correctly, <a href=\"https://leanprover.github.io/theorem_proving_in_lean4/propositions_and_proofs.html#examples-of-propositional-validities\">It says here</a> that standard library has the basic theorems proven. But what exactly are the names? For example, if I wanted to use commutativity of And what is the name of the theorem already proven? And in general what is the method to find the name or statement of these well-known theorems? Sorry if this is a too obvious question.</p>",
        "id": 276774148,
        "sender_full_name": "Sabbir Rahman",
        "timestamp": 1648368237
    },
    {
        "content": "<p>There's a naming convention <a href=\"https://leanprover-community.github.io/contribute/naming.html\">#naming</a> which will tell you that in Lean 3 the theorem will be called either <code>and_comm</code> or <code>and.comm</code>, and you can use <code>#check</code> to find out which. If you want to do mathematics you should stick to lean 3 but if you are doing logic or more CS related stuff then I should think lean 4 is fine, although it has different naming conventions -- try adding some capital letters</p>",
        "id": 276780139,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1648375994
    },
    {
        "content": "<p>For Lean 4 what changes is: type names are in <code>PascalCase</code> and theorem names stay in <code>snek_case</code> so you if you want e.g. the theorem that for all natural numbers: <code>0 ≤ n</code> you wanna search for <code>Nat</code> and then what the naming convention makes out of this theorem, in this case <code>zero_le</code> so we end up with <code>Nat.zero_le</code></p>",
        "id": 276783108,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1648379914
    },
    {
        "content": "<p>If you want to peruse the Lean 4 library, you can take a look at the Init section of <a href=\"https://leanprover-community.github.io/mathlib4_docs/\">https://leanprover-community.github.io/mathlib4_docs/</a> (Before that existed, I'd look through <a href=\"https://github.com/leanprover/lean4/tree/master/src/Init\">the source code</a> directly, though I still do that to see how certain things are written.)</p>",
        "id": 276794698,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1648396644
    }
]