[
    {
        "content": "<p>I work with and around industrial controllers, and am very interested in using Lean either to run agents on such hardware (Modbus in, Modbus out, formally verified algorithms in between) or to at least prototype them before writing them in Rust.</p>",
        "id": 310691480,
        "sender_full_name": "Omri Schwarz",
        "timestamp": 1668716087
    },
    {
        "content": "<p>Dear all.</p>\n<p>Since I work on industrial controllers, I find myself looking at a very particular<br>\nfunction.</p>\n<p>It is piecewise linear. Monotonic. Has a negative Ymin and positive Ymax.<br>\nIt usually has a sigmoid shape. It has a limited number of inflection points.<br>\nIt runs through the origin. And it either has 0 discontinuities, or it has a horizontal<br>\nsegment hitting the origin, with one vertical discontinuity on either side.</p>\n<p>So let's call it the Noodleman Sigmoid. </p>\n<p>Noodleman Sigmoids are ubiquitous in industrial controllers. The input and output<br>\nis almost always Modbus registers, so it's quantized to some range of integers. THe<br>\nintent is to keep a process stable with negative feedback within the controller's capability.</p>\n<p>And the controllers will usually combine these Noodleman Sigmoids. Multiple inputs,<br>\neach with its own Noodleman Sigmoid, sometimes combined as a weighted sum. Or sometimes<br>\nthere's an inner sigmoid for one input, placed within the flat deadband of another<br>\nsigmoid for another input which takes over if the second input is outside its flat deadband.<br>\nSometimes you have to compose a Honig Sigmoid with another Noodleman Sigmoid.</p>\n<p>So, I wonder:</p>\n<ol>\n<li>\n<p>has any applied mathematician written any proofs for interesting properties of Noodleman Sigmoids?<br>\na. Are any of those proofs written in something like Coq, Lean, or Haskell?</p>\n</li>\n<li>\n<p>Is there any software library with a general implementation of Noodleman Sigmoids?<br>\n(partial answer: Rust has a linear interpolation function that can be roped into this space)</p>\n</li>\n</ol>",
        "id": 311455804,
        "sender_full_name": "Omri Schwarz",
        "timestamp": 1669059779
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"565465\">@Omri Schwarz</span> It sounds like Noodleman sigmoids are a made up term, so I'm not sure what you are expecting for (1). Libraries usually only have definitions for real definitions not hypothetical ones (I suppose they can hypothetically have hypothetical definitions). Can you be more concrete?</p>",
        "id": 311469786,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1669062819
    }
]