[
    {
        "content": "<p>Hi all, my name is Alexis Leroux-Lapierre and I am currently working with two other students (one being <span class=\"user-mention\" data-user-id=\"507101\">@Jérémie Turcotte</span> ) on adding some elementary propositions to the graph theory library. Currently, I've worked on the files connectivity and acyclic.</p>\n<p>My first goal was to prove the so-called \"forest theorem\" which states that for a finite acyclic graph G=(V,E), the number of connected components of G is equal to |V|-|E|. I've read and tried to follow the guidelines and I think my code would be ready to be reviewed. I've already been given write access to the github. I'll follow Scott Morrissons's tutorial to make a pr and I'll first try to add a couple of useful lemmas to the connectivity file before adding content to the acyclic file. Hopefully you enjoy what I came up with! </p>\n<p>If there's anything I'm not doing the right way, don't hesitate to tell me. I'm fairly new to this. </p>\n<p>Cheers!</p>",
        "id": 314544769,
        "sender_full_name": "Alexis Leroux-Lapierre",
        "timestamp": 1670442424
    },
    {
        "content": "<p>Quick question : My work on connectivity and acyclic depends highly on Jérémie's last pr (<a href=\"https://github.com/leanprover-community/mathlib/pull/17654\">#17654</a>). Can anyone confirm that I should wait for this pr to be merged before trying to pr anything myself? Or is there any magical github procedure that I can do? Again, I'm not a github wizard, so sorry if this sounds like a weird question.</p>",
        "id": 314576041,
        "sender_full_name": "Alexis Leroux-Lapierre",
        "timestamp": 1670454527
    },
    {
        "content": "<p>You can make a new branch from the PR's branch and hack away happily and even PR your work, although it can't be <em>merged</em> until the previous PR is merged.</p>",
        "id": 314578193,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670455742
    },
    {
        "content": "<p>Go ahead and make a PR. You can mark in the PR description that it depends on another one (this is mostly informational, but there's a bot that sends a message once a dependency is merged).</p>\n<p>You can add me as a reviewer. (I'm on vacation for the next week or so though <span aria-label=\"palm tree\" class=\"emoji emoji-1f334\" role=\"img\" title=\"palm tree\">:palm_tree:</span>)</p>",
        "id": 314603406,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1670475249
    }
]