[
    {
        "content": "<p>Hello! I am a new user and I would like to contribute to the library by implementing a proof for the Max-Flow Min-Cut theorem for flow networks. However, helpful people told me that there is no definition for flow networks. I was advised to use quivers. Is that the best way to approach the problem? If not, what other recommendation you would give me? Thank you!</p>",
        "id": 316055712,
        "sender_full_name": "Aleksandar Milchev",
        "timestamp": 1671114880
    },
    {
        "content": "<p>Last summer, <span class=\"user-mention\" data-user-id=\"434371\">@Justin Pearson</span> and I supervised two students who started on formalising this theorem, but as far as I know didn't complete it. If you are interested, I could put you in contact with them.</p>",
        "id": 316073616,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1671119285
    },
    {
        "content": "<p>Last year I managed to prove Menger's theorem for <code>simple_graph</code>, which is related, but the API around paths was not easy to use (for type-theoretic reasons, like e.g. the statement that a path stopped on its first hitting point of a set was equal to another path did not want to type-check). So the code is really a mess ...</p>",
        "id": 316087945,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1671122833
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"317890\">Julian Külshammer</span> <a href=\"#narrow/stream/252551-graph-theory/topic/Flow.20networks/near/316073616\">said</a>:</p>\n<blockquote>\n<p>Last summer, <span class=\"user-mention silent\" data-user-id=\"434371\">Justin Pearson</span> and I supervised two students who started on formalising this theorem, but as far as I know didn't complete it. If you are interested, I could put you in contact with them.</p>\n</blockquote>\n<p>That will be great, thank you!</p>",
        "id": 316119516,
        "sender_full_name": "Aleksandar Milchev",
        "timestamp": 1671131560
    }
]