[
    {
        "content": "<p>collectively, it seems like we've decided that \"directly carve this branch into PRs\" is not a good strategy</p>",
        "id": 206650852,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195375
    },
    {
        "content": "<p>but actually I never spent a serious amount of effort studying it, and also I somehow don't know who wrote it, <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span>  were you involved? (I guess I could go look at some file headers)</p>",
        "id": 206650882,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195432
    },
    {
        "content": "<p>I wasn't directly involved, you can talk to David or Johan if you'd like</p>",
        "id": 206650933,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1597195467
    },
    {
        "content": "<p>david wärn?</p>",
        "id": 206650939,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195481
    },
    {
        "content": "<p>Yeah</p>",
        "id": 206650969,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1597195509
    },
    {
        "content": "<p>I mostly tried to roll my own <code>simple_graph</code> because I thought their stuff looked too complicated. I’m much less of this opinion now.</p>",
        "id": 206657329,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597203925
    },
    {
        "content": "<p>(I still think the approach to paths is wrong, but I should revisit the basic graph types)</p>",
        "id": 206657378,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597203975
    },
    {
        "content": "<p>I think that they got stuck on a probabilistic method proof, if I remember correctly - it was why I tried the lower ramsey stuff in the first place</p>",
        "id": 206702836,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1597243219
    },
    {
        "content": "<p>There are some problems with the definition of multigraphs in the hedetniemi branch.  If I remember correctly, it the fact that it lacks proofs that the edge reversal equivalences are involutions.  I think it's worth using hedetniemi as a guide of what kinds of things should be added, though.</p>",
        "id": 206764046,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1597273905
    },
    {
        "content": "<p>With the recent momentum in graphs, is there interest in resuming/restarting this?</p>",
        "id": 210150109,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600185898
    },
    {
        "content": "<p>Which part exactly? There are a lot of partial projects on that branch. I’m personally not that invested in the namesake result</p>",
        "id": 210152851,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1600187251
    },
    {
        "content": "<p>I am interested in reviving your Ramsey proof, although I’m also perversely hoping that the standard mathlib proof of finite Ramsey will be infinite Ramsey + compactness</p>",
        "id": 210153296,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1600187437
    },
    {
        "content": "<p>I think the namesake result would be cool, partially for PR purposes and also because it's a recent bit of maths so it would be nice to have in mathlib</p>",
        "id": 210179328,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600198720
    },
    {
        "content": "<p>I was actually hoping for the same for finite Ramsey - my infinite Ramsey proof was cleaner than the finite version anyway</p>",
        "id": 210179402,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600198748
    },
    {
        "content": "<p>At some point over the next few days I want to get back to infinite Ramsey and hopefully simplify the proof, it's been a while since I wrote that so I imagine it could be improved</p>",
        "id": 210179477,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600198789
    },
    {
        "content": "<p>The problem with the Hedetniemi theorem is that I don't see how to get the random graph theory done.</p>",
        "id": 210179607,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1600198832
    },
    {
        "content": "<p>The other stuff shouldn't be so hard.</p>",
        "id": 210179627,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1600198840
    },
    {
        "content": "<p>Yeah - I think that part is manageable though, there's recently some improving counting API and I had a sketch Lean proof of a simpler random argument so I feel that since we have more people interested it should be doable</p>",
        "id": 210180744,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600199324
    },
    {
        "content": "<p>In particular the random graph arguments are closely related to things in other areas of combinatorics so I think there is some general interest in having it</p>",
        "id": 210180799,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600199356
    },
    {
        "content": "<p>I could get interested in random graph theory - not sure how long it'll take me to learn the relevant API though</p>",
        "id": 210187772,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1600202580
    },
    {
        "content": "<p>I think it's more about making the relevant API!</p>",
        "id": 210204911,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1600212724
    }
]