[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span> <span class=\"user-mention\" data-user-id=\"302826\">@Aaron Anderson</span> <span class=\"user-mention\" data-user-id=\"303889\">@Alena Gusakov</span> <span class=\"user-mention\" data-user-id=\"322118\">@Michael Hahn</span>  <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> ! there are several somewhat independent threads of development on graph theory with the intent to PR code to mathlib.</p>",
        "id": 206650381,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597194740
    },
    {
        "content": "<p>Michael has a repo with code copy-pasted from Kyle and Aaron's PR, which has useful local changes that haven't propagated back to the PR.<br>\nAnd Alena has code copied from michael's repo with the same properties.<br>\n(Both of these are my fault, really.)</p>",
        "id": 206650395,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597194767
    },
    {
        "content": "<p>(this one I might have the details wrong) Bhavik recently started proving freek 83 without knowing that aaron already has a working proof in the branch mathlib:freek_83_friendship_theorem</p>",
        "id": 206650517,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597194914
    },
    {
        "content": "<p>Yup, this is true</p>",
        "id": 206650588,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1597194976
    },
    {
        "content": "<p>Also, Michael and Alena are young and maybe not super skilled at coming up with the right places to ask questions</p>",
        "id": 206650629,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195067
    },
    {
        "content": "<p>Michael's in high school, Alena just finished undergrad but doesn't have any papers under her belt, but they're both good enough at writing lean code to be useful in projects like this</p>",
        "id": 206650679,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195102
    },
    {
        "content": "<p>some of you are older and want academic jobs, so you should be incentivized to want to practice some mentoring in this direction</p>",
        "id": 206650693,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195142
    },
    {
        "content": "<p>so part of the point of this stream is as a focal point for organization</p>",
        "id": 206650712,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195176
    },
    {
        "content": "<p>and part of the point is to provide a place to post half-formed questions or complaints or ideas (where \"complaint\" means \"complaint about parts of the API that are still far from polished)<br>\nat the very least, I am excited to move some of these conversations out of my private messages</p>",
        "id": 206650749,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195203
    },
    {
        "content": "<p>I should mention here as well that I've done a proof of infinite hypergraph ramsey's theorem a while ago, as well as a special case of finite ramsey's theorem too. I've also done some other basic graph theory things like the handshaking lemma, and a ton of other combinatorics in Lean, so I have a reasonably good idea about what works nicely and what doesn't. I also did something close to a lower ramsey bound to test if the probabilistic method is possible (it is)</p>",
        "id": 206650965,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1597195506
    },
    {
        "content": "<p>I think everyone in this stream has permissions to invite other people to this stream. All of the stream history is readable by new people that join. I think the correct policy is just like the one for mathlib, \"admit anyone who makes a believable claim that they want to contribute to graph theory PRs\"</p>",
        "id": 206651055,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597195628
    },
    {
        "content": "<p>Thanks for the invite!</p>",
        "id": 206653184,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1597198330
    },
    {
        "content": "<p>I made a post in <a class=\"stream\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general\">#general</a> about this stream, somewhat codifying the invite policy i laid out above</p>",
        "id": 206654021,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597199193
    },
    {
        "content": "<p>This stream is currently 8 people. I think if it ever got to 50, it should be public instead. (the true threshold is lower, 50 is just an upper bound)</p>",
        "id": 206654072,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1597199281
    },
    {
        "content": "<p>I've just started a branch at <code>mathlib:graph-stream</code> with a bunch of small definitions on top of my PRs.</p>",
        "id": 207487289,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597897276
    },
    {
        "content": "<p>My hope is that we can try to combine some of our definitions there, test which definitions fit together well, and find out what basic ideas are actually missing that we need to resolve in order to start proving interesting things.</p>",
        "id": 207487368,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597897355
    },
    {
        "content": "<p>Nice additions.  For some competition, I've ported most of the changes over to <code>mathlib:simple-graphs2</code>, including adjacency matrices. <a href=\"https://github.com/leanprover-community/mathlib/tree/simple_graphs2/src/combinatorics\">https://github.com/leanprover-community/mathlib/tree/simple_graphs2/src/combinatorics</a></p>\n<p>This branch has simple graphs, subgraphs, spanning subgraphs, and a uniform interface to interact with them. (No induction principles yet, though.)</p>\n<p>A few comments:</p>\n<ul>\n<li>I'm not sure why you defined <code>locally_finite</code> to be a class.  Maybe so you can type less when you define the <code>fintype.locally_finite</code> instance? It's better as a reducible definition.</li>\n<li>I would have thought a graph embedding means the image is any a subgraph, but according to your definition the image is an induced subgraph.  I've changed this in <code>simple-graphs2</code> to match the usual notion.</li>\n<li>The definition of graph colorings is incorrect, I think.  What you have is checking that a graph is an empty graph with up to k vertices.  (It would also be nice to let the coloring set be arbitrary, since there are some interesting theorems involving countably versus uncountably many colorings.)</li>\n<li>It seems you based the branch on an older version of <a href=\"https://github.com/leanprover-community/mathlib/issues/3458\">#3458</a>?</li>\n</ul>",
        "id": 207513335,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1597923945
    },
    {
        "content": "<p>I’ll look in more detail at what you’ve done, <span class=\"user-mention\" data-user-id=\"306601\">@Kyle Miller</span> , but I think I’d prefer if we work on the same branch, even if that means in different files, just so that we have a hope of comparing and combining things directly.</p>",
        "id": 207545606,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597942010
    },
    {
        "content": "<p>Does that sound reasonable, and which do you prefer we move to?</p>",
        "id": 207545686,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1597942054
    },
    {
        "content": "<p>I don't really understand why having everything in the same branch makes anything easier, since these are two branches in the same repository  (git has many ways to compare branches with each other and with <code>master</code>).  I'll be watching <code>mathlib:graph-stream</code> and incorporate ideas into <code>mathlib:simple_graphs2</code>, and I invite everyone to draw from the latter.</p>\n<p>I used the word \"competition\" here because one of the things we're collectively trying to work out is what the definition of a simple graph should be.  I believe strongly that we need to make sure derived objects like subgraphs should be graphs in their own right, in a way that generalizes to other combinatorial objects, and in the branch you created it seems you do not agree (that's probably not a fair characterization -- it would be nice to know what design constraints you feel are not being satisfied by <code>mathlib:simple_graphs2</code> or how you thought this branch might be incorporated or not into <code>mathlib:graph-stream</code> -- I know you know branch exists and has been undergoing active development.)</p>\n<p>For more discussion about subobjects, and for a variation on the <code>mathlib:simple_graphs2</code> approach, take a look at the topic about matroids in the #maths stream.  I'm thinking it's conceptually better to say a type has a way to interpret its terms as graphs, rather than saying a term of a type has a way to be interpreted as a graph, so I am considering switching the <code>mathlib:simple_graphs2</code> branch to this approach.  It opens up some possibilities involving extension of the <code>simple_graphs</code> typeclass.  (I want to emphasize that I'm not attached to any particular way of doing things, and whatever satisfies the design constraints in the end is OK with me.  Maybe this comes from my time as a software engineer, but in this prototyping stage I tend to think of code as something completely disposable -- my waffling on implementation serves to crystallize the constraints.)</p>\n<p>It would be nice if there were a way to let <code>(G : simple_graph W)</code> be an abbreviation for \"a graph-like object obtained in any way, having vertex type V\".  There just doesn't seem to be any way to do that except for writing something like <code>{α : Type v} [simple_graphs α] (G : α) {H : W = V G}</code>.  (There is probably some metaprogramming that could generalize statements like this, but it's not clear at this point whether this is a principled application of metaprogramming.)</p>\n<p>Anyway, right now we're pretty much at the second page of a GTM book on graph theory.  It would be nice to progressively go through and formalize a few more pages (or chapters!) to better see how to proceed <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 207673679,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1598037620
    },
    {
        "content": "<p>lol we maybe have all of Bollobas Page 2</p>",
        "id": 207682188,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1598042433
    },
    {
        "content": "<p>while you can compare between multiple branches in terms of what text they contain, you can't prove relations between definitions on different branches</p>",
        "id": 207682279,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1598042503
    },
    {
        "content": "<p>sure, you can rename files appropriately, merge the other branch into you, and then do whatever comparison you like</p>",
        "id": 207704682,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1598065960
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/tree/simple_graphs2\">branch#simple_graphs2</a><br>\n<a href=\"https://github.com/leanprover-community/mathlib/tree/graph-stream\">branch#graph-stream</a></p>",
        "id": 207746354,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1598138319
    },
    {
        "content": "<p>I pushed a little error fix that Kevin helped me out with</p>",
        "id": 207904253,
        "sender_full_name": "Alena Gusakov",
        "timestamp": 1598307666
    },
    {
        "content": "<p>Basically just got rid of the problem in <code>degree_le</code> where Lean didn't know why we were allowed to compare the degrees because it didn't know <code>degree (G'.in_subgraph hv)</code> is a fintype</p>",
        "id": 207904336,
        "sender_full_name": "Alena Gusakov",
        "timestamp": 1598307731
    },
    {
        "content": "<p>what branch did you push code to? can you make a new topic instead of using this very general one?</p>",
        "id": 207904391,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1598307794
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/tree/simple_graphs2\">branch#simple_graphs2</a></p>",
        "id": 207904407,
        "sender_full_name": "Alena Gusakov",
        "timestamp": 1598307817
    }
]