[
    {
        "content": "<p>I heard some discussions on flattening or not, and I figured I would expand on my position.</p>\n<p>First and foremost: I view the question as a <strong>false choice</strong>. One should not ask whether to flatten or not, as if making this choice is something one is forced to do.</p>\n<p>It should be obvious that there are many different classes of 'users' of a math library, from its own developers to very new users. Different classes of users will be best served with different <em>views</em> of the same information contained in the library. A certain class of developers (call them the 'architects') really will want to see a graph-oriented version of theories. These are the people who are most concerned with scalability and compositionality.  But when teaching certain things, that is awful, and one wants a fully flat theory. There are also needs for intermediate views: R-modules are one of the best-known situation where a mixture is a good idea. I've personally encountered such situations in category theory itself.</p>\n<p>To me, the most important feature is being able to easily have different views of the same information, and easily be able to switch between these views.</p>",
        "id": 221794994,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1609953625
    },
    {
        "content": "<p>In Leo's talk he pointed out that mathematicians make structures with many many fields and he was concerned about potential slow-down if it's internally stored as a flat structure.</p>",
        "id": 221795851,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609954010
    },
    {
        "content": "<p>Right! That is why I am quite careful to talk about <em>views</em>. System developers (like <span class=\"user-mention\" data-user-id=\"112857\">@Leonardo de Moura</span> ) should be given the freedom to store things internally as they see fit, as long as the users have ways of seeing the structures in a way that fits their mode of working.  </p>\n<p>To me, a library like mathlib is a repository of knowledge. One error is to think that the source for that library should match everyone's view of how that information should be created. Another error is to think that the internal representation of the system will match that as well.</p>\n<p>This is an extremely difficult problem. The more you actually leverage the structural information of mathematics in encoding mathematics, the harder you make it to get new people on board. But if you don't leverage such information, then you're basically forcing yourself to use a lot (<strong>a lot</strong>) of human effort to develop everything. Of course, it is also highly parallellizable.</p>\n<p>The meta-programming facilities in Lean 4 are extremely exciting to me, as they seem to give one the ability to do some of this in a structured, disciplined way.</p>",
        "id": 221799115,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1609955559
    },
    {
        "content": "<p>I wonder if we can learn from C++'s multiple inheritance and <code>virtual</code> base classes here? The parallel would be that <code>comm_group</code> holds internal references to where the <code>comm_monoid</code> and <code>group</code> instances are, but crucially both <code>comm_monoid</code> and <code>group</code> contain a reference to the same <code>monoid</code> data. So the data isn't flattened, but it also doesn't force us to pick one base structure to be special</p>",
        "id": 221806643,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1609959197
    },
    {
        "content": "<p>Better still, one can learn from Category Theory first - these things are pushouts (or pullbacks, if you're like me and prefer to work in the opposite category).  In some cases, you even have cartesian lifts.  All this extra structure helps you store things more effectively too.</p>\n<p>C++'s mechanisms for this are hopelessly broken. I would mostly learn what <em>not</em> to do from it.</p>",
        "id": 221810198,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1609960872
    },
    {
        "content": "<p>What type of hopeless breakage would I expect to see if I implemented the above class heirarchy in C++ multiple virtual inheritance then?</p>",
        "id": 221818793,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1609964957
    },
    {
        "content": "<p>I forget the exact details, sorry! The weirdnesses of C++ multiple inheritance are well documented \"out there\". Other languages handle things better. Scala is one. And various languages in the OBJ3 family too, including CASL.</p>",
        "id": 221823558,
        "sender_full_name": "Jacques Carette",
        "timestamp": 1609967156
    },
    {
        "content": "<p>One important issue with the way C++ implements multiple inheritance is that the user of the classes concerned have to pay attention to details that should be hidden from them. For instance, if class <code>C</code> inherits methods <code>foo</code> from both <code>A</code> and <code>B</code>, the user has to specify which version they want to  call with <code>x-&gt;A::foo()</code> or <code>x-&gt;B::foo()</code>. That should be handled by the designer of the API. Some programming techniques exist to circumvent the situation but the point  is that the C++ design of inheritance gets in the way</p>",
        "id": 221861913,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1610001751
    },
    {
        "content": "<p>As far as examples to consider, I particularly like the way Eiffel does things. When inheriting two methods with the same name, Eiffel forces you to resolve the ambiguity and rename one or both (if they cannot be merged)</p>",
        "id": 221861993,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1610001843
    },
    {
        "content": "<p>Meanwhile, lean3 doesn't inherit \"methods\" (projections) at all. Has this changed in lean4?</p>",
        "id": 221864902,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1610005648
    }
]