[
    {
        "content": "<p>In Bonn, we host \"Hausdorff schools\", which are weeklong workshops for phds and postdocs from around the world. See <a href=\"https://www.hsm.uni-bonn.de/events/hausdorff-schools/\">https://www.hsm.uni-bonn.de/events/hausdorff-schools/</a> for some current ones; we previously had one on the Emerton-Gee stack which I think was a big success. We are always looking for good applications for such workshops. Typically, there are ~3 organizers, and there doesn't need to be a Bonn connection. We are currently looking for proposals for 2022/23, a time when hopefully such things will be able to take place normally again. I wondered whether there'd be any interest in organizing such a school related to Lean? (It's not clear to me how feasible this is given how much this involves computers, but just wanted to air the idea. And I'd be happy to have the chance to attend and learn more.) [If anybody is reading this and has other good ideas for schools, we're always looking for good applications! <a href=\"https://www.hsm.uni-bonn.de/application/program-proposal/\">https://www.hsm.uni-bonn.de/application/program-proposal/</a> , proposals should be sent to Patrik Ferrari <a href=\"https://www.hsm.uni-bonn.de/about-hsm/management/\">https://www.hsm.uni-bonn.de/about-hsm/management/</a> ]</p>",
        "id": 228425220,
        "sender_full_name": "Peter Scholze",
        "timestamp": 1614697755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"369530\">@Peter Scholze</span> We are organising a workshop at ICERM in 2022, and some of us have submitted a proposal to MSRI for 2023. So we certainly like having in-person meetings.</p>",
        "id": 228426560,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1614698231
    },
    {
        "content": "<p>OK, Great! Well, please consider applying in Bonn, too, now or at any point in the future. (I'm also happy to be a local organizer in case that helps.)</p>",
        "id": 228427910,
        "sender_full_name": "Peter Scholze",
        "timestamp": 1614698704
    },
    {
        "content": "<p>The MSRI proposal is a summer school, so entirely aimed at PhD students. There's no reason Hausdorff couldn't be happening in the same year.</p>",
        "id": 228432139,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1614700108
    },
    {
        "content": "<p>But Hausdorff is also aimed at PhD's and postdocs, right?</p>",
        "id": 228432213,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1614700136
    },
    {
        "content": "<p>But certainly it could happen in the same year</p>",
        "id": 228432240,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1614700145
    },
    {
        "content": "<p>Yes, you're right. I was getting confused with Hausdorff trimesters.</p>",
        "id": 228432309,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1614700163
    },
    {
        "content": "<p>Those are very nice, we should have one. :-)</p>",
        "id": 228432332,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1614700171
    },
    {
        "content": "<p>Please apply, too! (But Hausdorff trimesters are obviously much more competitive than Hausdorff schools.)</p>",
        "id": 228432739,
        "sender_full_name": "Peter Scholze",
        "timestamp": 1614700305
    },
    {
        "content": "<p>Also, sorry that everything in Bonn is called \"Hausdorff\". I like to joke that just calling everything Hausdorff doesn't mean that you can actually distinguish any two things...</p>",
        "id": 228432906,
        "sender_full_name": "Peter Scholze",
        "timestamp": 1614700357
    },
    {
        "content": "<p>FWIW, I think we should host as many in person workshops as possible once this pandemic is over. People will certainly be eager to travel again! </p>\n<p>(Another option to keep on the radar is BIRS.)</p>",
        "id": 228434501,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1614700874
    },
    {
        "content": "<p>You mean Brrrrs (I organised something there once).</p>",
        "id": 228445417,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614704612
    },
    {
        "content": "<p>Here in Orsay everything is called Hadamard and we can't even make jokes out of it, we only get the resulting confusion.</p>",
        "id": 228447655,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1614705287
    },
    {
        "content": "<p>Aren't there even Hadamard postdocs in Ecole Polytechnique to make sure everyone is confused?</p>",
        "id": 228448408,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1614705521
    },
    {
        "content": "<p>Yes, because, although École polytechnique is <em>not</em> part of Université Paris-Saclay, both mathematics departments there (pure and and applied) are part of the Fondation mathématiques Jacques Hadamard, together with Orsay, IHES, Versailles and Évry. Isn't it wonderfully confusing?</p>",
        "id": 228449166,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1614705802
    },
    {
        "content": "<p>It's already nicely confusing for French people who have known this system for ages, so I can't even imagine what this is for foreign PhD students trying to apply for post-docs in France.</p>",
        "id": 228449523,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1614705909
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/267928-condensed-mathematics/topic/hausdorff.20school/near/228445417\">said</a>:</p>\n<blockquote>\n<p>You mean Brrrrs (I organised something there once).</p>\n</blockquote>\n<p>We're above freezing today in Edmonton! (although we just came out of 2 weeks of -20C or even lower...)</p>",
        "id": 228451821,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1614706630
    },
    {
        "content": "<p>But summer in Banff is very nice :)</p>",
        "id": 228451911,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1614706671
    }
]