[
    {
        "content": "<p>Filippo and I have recently been working on the fiddly real analysis involved to prove <a href=\"https://leanprover-community.github.io/liquid/sect0009.html#M-ses\">lemma 2.5.14</a> of <a href=\"https://leanprover-community.github.io/liquid/dep_graph_section_2.html\">the blueprint</a>. I've just finished the final <code>sorry</code> and pushed to master, which compiles, so if my understanding is correct then both the blue <code>M-ses</code> and <code>theta.bounded</code> ovals can now be turned green. For some reason the blueprint link to <code>theta.bounded</code> doesn't work for me, but the <code>M-ses</code> link does and links to a theorem in <code>laurent_measures/ses2</code> . This file compiles on master with no complaints about sorries either in the file or in imports, so I think we must have done it; however I've also just noticed that the <code>M-ses</code> link links to a random commit rather than <code>master</code>, so you can still see sorries in github if you click on the blueprint link.</p>\n<p>Also, the map we used to go from L_{r'}(S) to L_{r'}(S) is not multiplication by 2T-1 but by T^{-1} - 2, thus the blueprint is slightly incorrect. The latter map had better boundedness properties.</p>",
        "id": 281686671,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1652104104
    },
    {
        "content": "<p>We are currently fixing the blueprint around that point, so you should not worry too much for now. I hope to upgrade that very soon.</p>",
        "id": 281686793,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1652104167
    },
    {
        "content": "<p>A bit late, but see <a href=\"https://leanprover-community.github.io/liquid/dep_graph_section_2.html\">https://leanprover-community.github.io/liquid/dep_graph_section_2.html</a> for the update if you haven't found that link yet.</p>",
        "id": 281748297,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1652131653
    }
]