[
    {
        "content": "<p>Eventually my neighbourhood filter tends to that of Freiburg.<br>\nHenceforth I will have very good memories of this workshop.</p>\n<p>I couldn't say goodbye to everyone. But I really enjoyed this workshop! Kudos to Rob and Johannes. Thanks to Jasmin for getting a grant (-; I loved the talks, the hacking sessions were excellent. Thanks to all of you.<br>\nKeep up the good math!</p>",
        "id": 154916334,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1547212916
    },
    {
        "content": "<p>It was a pleasure meeting you in person and interacting with you!</p>",
        "id": 154922019,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1547218623
    },
    {
        "content": "<p>I'm also back at home, and very happy with my week in Amsterdam. Thanks everybody, especially Jasmin, Johannes and Rob!</p>",
        "id": 154946525,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1547240174
    },
    {
        "content": "<p>Thanks everybody for joining the meeting!</p>",
        "id": 154947780,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1547241420
    },
    {
        "content": "<p>Yes, thank you all for a wonderful week! Let's keep the momentum going. Hope to see you all again at Lean Together 2020.</p>",
        "id": 154979280,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1547290490
    },
    {
        "content": "<p>Great to meet you all, and thank you very much for the valuable talks and side discussions (and of course, thank you once again to the organisers for making it all happen!).</p>",
        "id": 154986668,
        "sender_full_name": "William Whistler",
        "timestamp": 1547304644
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> and <span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span> I think it would be good to update the schedule the agenda one last time in order to keep an accurate record of what was actually done (and maybe move it to a better format that this google doc).</p>",
        "id": 154999762,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1547327222
    },
    {
        "content": "<p>Did anyone think of taking notes of the more informal conversations?</p>",
        "id": 155002535,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1547332498
    },
    {
        "content": "<blockquote>\n<p>Did anyone think of taking notes of the more informal conversations?</p>\n</blockquote>\n<p>They'd be especially valuable since there doesn't seem to be any video recordings from the sessions of the last two days, for those of us that didn't manage to make it to Amsterdam for the conference</p>",
        "id": 155002800,
        "sender_full_name": "Amin Bandali",
        "timestamp": 1547332926
    },
    {
        "content": "<p>Which parts are inaccurate? Surprisingly, I thought we stayed fairly close to the suggested plan. I guess the Lean 4 discussion moved down a slot.</p>",
        "id": 155026014,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1547376840
    },
    {
        "content": "<p>I'm traveling until Wednesday and have a huge backlog of stuff to get through, but I can add reformatting the schedule to the list, unless anyone wants to do it faster. <span class=\"emoji emoji-1f609\" title=\"wink\">:wink:</span></p>",
        "id": 155026070,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1547376940
    },
    {
        "content": "<p>Friday was more according to schedule but I don't think <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span>'s and <span class=\"user-mention\" data-user-id=\"110193\">@Cyril Cohen</span>'s talks were on the schedule. Also, are their slides online?</p>",
        "id": 155085564,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1547474437
    },
    {
        "content": "<p>I would mention that the perfectoid slot on Thursday actually started with unification hints by Assia and Cyril, and the actual perfectoidy stuff was animated by Kevin. The documentation was Jeremy and I, not Kevin and I (Kevin talked of course, but he was not standing up). And the mathlib reorganization discussion was led by Johannes and Mario.</p>",
        "id": 155089843,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1547478124
    },
    {
        "content": "<p>Assia's Coq file and Cyril's Lean file are on the website.</p>",
        "id": 155090030,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1547478294
    }
]