[
    {
        "content": "<p>Assuming the actually Math IMO goes ahead this year, will the IMO Grand Challenge also happen?  If so, will there be formal rules at some point?  Here are some questions I have:</p>\n<p>Is there any consensus about what version of Lean will be used?  Lean 4, Lean 3 community (latest version?), or official Lean 3.4.2?  (Similar questions about mathlib.)  </p>\n<p>Is there any consensus about the form of the problems?  Can one expect that every proplem will be presented as a <code>prop</code> to prove?  (Or is it even up in the air whether every problem will be a <code>prop</code>? For example, will the agent ever need to supply a witness?)  Also, is there anything more specific about how certain problems will be presented?  Will there be examples of previous problems supplied?</p>\n<p>Is the thought still that this will be a community effort more than a competition?  If so, is anyone coordinating that effort?</p>\n<p>I know you, <span class=\"user-mention\" data-user-id=\"230999\">@Daniel Selsam</span> , were scheduled to talk at the postponed AITP this year. I assume more details would have been presented then.</p>",
        "id": 198511436,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590197527
    },
    {
        "content": "<p>The 2020 IMO is (currently?) postponed until September. <a href=\"https://imo2020.ru/\">https://imo2020.ru/</a></p>",
        "id": 198512534,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590199249
    },
    {
        "content": "<p>Sorry.  I should clarify.  I did see the IMO was postponed, but I’m still curious about the grand challenge itself.  It’s not clear to me that even with the delay if there is enough time.</p>",
        "id": 198517449,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590207689
    },
    {
        "content": "<p>My impression was that the grand challenge was not specifically directed at IMO 2020</p>",
        "id": 198517489,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1590207730
    },
    {
        "content": "<p>This was also my impression</p>",
        "id": 198522732,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590218140
    },
    {
        "content": "<p>I got the impression that it will happen over many years (until solved).  I'm not clear when it will start.</p>",
        "id": 198530630,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590232454
    },
    {
        "content": "<p>Oh, I see in a <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/F2F/near/175248777\">previous conversation</a> Daniel says that he doesn't \"expect any submissions until 2021 at the earliest\".</p>",
        "id": 198530701,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590232629
    },
    {
        "content": "<p>I guess I won't be submitting anything this year. <span aria-label=\"mischievous\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"mischievous\">:mischievous:</span></p>",
        "id": 198531392,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590233893
    }
]