[
    {
        "content": "<p>I did not have an opinion before, but I am starting to be in favor of a new repository for IMO questions</p>",
        "id": 213092984,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602542236
    },
    {
        "content": "<p>it just seems like in practice, most of my effort formalizing problems does not go into the actual formalization, it goes into making changes to satisfy code review</p>",
        "id": 213093012,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602542271
    },
    {
        "content": "<p>it's nice to add new lemmas to mathlib, but it doesn't seem necessary for the task of creating training data. in fact it might be harmful - for a realistic situation, you would be creating a proof that is not minimized by refactoring parts of it into mathlib</p>",
        "id": 213093134,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602542355
    },
    {
        "content": "<p>so you wouldn't want training data that was created by refactoring a proof partly into mathlib</p>",
        "id": 213093157,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602542374
    },
    {
        "content": "<p>but really, the key problem is that to train anything, we need data sets on the order of at least hundreds of instances. I think we should lower quality to increase throughput.</p>",
        "id": 213093434,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602542627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"238605\">Kevin Lacker</span> <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/new.20repo.20for.20IMO.20questions.20etc/near/213093012\">said</a>:</p>\n<blockquote>\n<p>it just seems like in practice, most of my effort formalizing problems does not go into the actual formalization, it goes into making changes to satisfy code review</p>\n</blockquote>\n<p>Do you expect this to be an ongoing cost, or for it to converge to zero as you get used to mathlib style?</p>",
        "id": 213093814,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1602542979
    },
    {
        "content": "<p>other people can feel free to chime in but it seems similarly bothersome for other people who are formalizing problems, looking at the pull requests</p>",
        "id": 213094049,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602543233
    },
    {
        "content": "<p>it isn't \"stylistic\" really. it's that, for mathlib the spirit is, we should find the absolute best proof out there. so if there is some way to rewrite 100 lines of the proof to make it 80 lines that works in a totally different way, let's do that. and basically I do not think we should try to do that with IMO problems because we are so short of having a useful amount of data there.</p>",
        "id": 213094732,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602543844
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"238605\">@Kevin Lacker</span>, a few thoughts (speaking only for myself and not anyone else involved with mathlib).  First, I have really enjoyed seeing your IMO PRs!  Like we were discussing <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/1962.20problem.201\">last week</a>, I think they often put a great spotlight on \"easy\" things mathlib is bad at doing, and I tend to see them as opportunities to think about why mathlib is bad at these easy things.</p>",
        "id": 213095122,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602544261
    },
    {
        "content": "<p>Secondly, I think you were frustrated by this comment in particular I made on <a href=\"https://github.com/leanprover-community/mathlib/issues/4518\">#4518</a></p>\n<blockquote>\n<p>Idea 1: factor out the pure algebraic lemma that <code>a ^ 2 + (2 * a ^ 2 - 1) ^ 2 + (4 * a ^ 3 - 3 * a) ^ 2 = 1</code> if and only if <code>(2 * a ^ 2 - 1) * (4 * a ^ 3 - 3 * a) = 0</code>. This lemma is a little nontrivial, since <code>a ^ 2 + (2 * a ^ 2 - 1) ^ 2 + (4 * a ^ 3 - 3 * a) ^ 2 = 1</code> is directly equivalent to <code>a * (2 * a ^ 2 - 1) * (4 * a ^ 3 - 3 * a) = 0</code>, so to cancel the <code>a</code> factor you have to notice the presence of a second <code>a</code> factor in the third term. If this step were being automated, it would be by showing that the ideals generated by the two expressions have the same Jacobson radical.</p>\n</blockquote>\n<p>and I am sorry if it seemed like I was doing this just to \"find the absolute best proof out there\" -- I was actually trying to figure out if there was a more automation-friendly proof!  Cf <a href=\"#narrow/stream/113488-general/topic/Equivalence.20of.20algebraic.20identities\">this discussion</a>.</p>",
        "id": 213095326,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602544483
    },
    {
        "content": "<p>I do think we should check that pull request in, but this is actually only the 3rd most inordinately-delayed-in-my-opinion of my pull requests</p>",
        "id": 213095458,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602544658
    },
    {
        "content": "<p>behind <a href=\"https://github.com/leanprover-community/mathlib/pull/4450\">https://github.com/leanprover-community/mathlib/pull/4450</a> and <a href=\"https://github.com/leanprover-community/mathlib/pull/4366\">https://github.com/leanprover-community/mathlib/pull/4366</a></p>",
        "id": 213095507,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602544687
    },
    {
        "content": "<p>so, I don't think it's just you. it's more like, on every pull request there are many comments that are not like \"this doesn't adhere to the style guide\" or \"this doesn't work\", but more like \"it is possible to write this part in 20 lines instead of 30 if you do it totally differently\"</p>",
        "id": 213095560,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602544798
    },
    {
        "content": "<p>most of my code here is actually getting discarded when reviewers rewrite it! i mean, it's getting better, certainly. but I wish that other people were submitting their own IMO formalizations with that energy, since we only have like, 6 of them</p>",
        "id": 213095639,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602544849
    },
    {
        "content": "<p>I didn't closely follow the content of those other PRs (even though I did a massive review for style on one of them), so I don't know the details, but am I correct that it was from one of these PRs that the new <code>norm_digits</code> tactic was inspired?  This seems like it will be useful for a lot of future IMO problems, and worth some delay.</p>",
        "id": 213095873,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602545148
    },
    {
        "content": "<p>But in general, to bring up here something I <a href=\"#narrow/stream/144837-PR-reviews/topic/.234518.20trig.20IMO.20problem\">wrote</a> in <a class=\"stream\" data-stream-id=\"144837\" href=\"/#narrow/stream/144837-PR-reviews\">#PR reviews</a> , I would be happy to explicitly introduce a different standard for the acceptance of IMO PRs than other PRs.  What do others think?</p>",
        "id": 213095942,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602545218
    },
    {
        "content": "<p>to me, the lean programming language offers something incredible - the knowledge that if code compiles, it must be correct. the logical thing to do is to accept the benefits of this magical power, and use it to stop worrying about golfing down to the lowest amount of lines possible, and accept anything that both meets the style guide and compiles. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213096169,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602545475
    },
    {
        "content": "<p>This all seems reasonable to me, for the <code>archive/imo</code> folder.  (Again, I hope lots of other people will chime in.).  I do think that if a reviewer can spot a reorganization into pieces, where one or more of those pieces could naturally be automated in the future (<code>norm_digits</code> tactic, Grobner basis tactic, interval arithmetic tactic, Sledgehammer-like tactic), then there is (possibly, if not overly burdensome) merit in reorganizing in that way.</p>",
        "id": 213096831,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602546163
    },
    {
        "content": "<p>I think actually getting a formalization of a solution to the original problem added to a repository is somehow not the most important part of formalizing IMO problems right now. There are several other things about it I think are at least as important:</p>\n<ul>\n<li>\n<p>Discovering gaps in mathlib and adding definitions to fill those gaps.</p>\n</li>\n<li>\n<p>Discovering gaps in mathlib and adding lemmas to fill those gaps. Many of those will be useful for non-olympiad formalizations as well. (Although you could go through chapter 2 of the IMO Compendium and formalize all the definitions and results there, inevitably that sort of thing misses lots of the too-trivial-to-state-in-textbooks lemmas that are useful for formalization.) In general, formalization seems to involve a very lemma-centric view of mathematics, where reusable lemmas can be more important than a \"main result\" that nothing will depend on.</p>\n</li>\n<li>\n<p>Discovering gaps in automation, where something obvious to humans, but that doesn't clearly take the form of a general lemma that can go in mathlib, takes a lot of Lean code. Again, better automation is likely to be more generally relevant.</p>\n</li>\n<li>\n<p>Learning generally how the length / difficulty of human solutions compares with that of formalizations in different areas, even if the differences don't clearly point to missing definitions, lemmas and automation. Having the formal proofs be cleaned up helps indicate the length difference is because of actual complexity in formalization rather than simply some proofs being more optimized than others.</p>\n</li>\n</ul>\n<p>The one way in which I think IMO PRs <em>should</em> be considered different from others is that if there are multiple, genuinely mathematically different approaches to a problem (as opposed to one just being a cleaned-up version of another), it makes sense to formalize all of them, to learn about all the above issues for each of the approaches, and so the fact that one approach might give a nicer formalization isn't a reason to exclude another approach (supposing each approach is given in a suitably cleaned-up form). (I like having lots of alternative solutions in general - hence the IMO 2019 shortlist including lots of them and ending up 100 pages long.)</p>",
        "id": 213099639,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1602549275
    },
    {
        "content": "<p>Even if you don't expect a problem to lead to new definitions/lemmas/automation in mathlib, of course \"it should be fun to formalize\" or \"I'll learn something myself by formalizing it\" are also good reasons for formalizing it (but reviewers may bring their own perspectives on what mathlib can gain from the proof).</p>",
        "id": 213101025,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1602550615
    },
    {
        "content": "<p>I am happy to loosen the standards for proofs of IMO problems a bit, and allow long/inefficient proofs if a simpler proof also exists.</p>\n<p>However, I think two things should still be satisfied:</p>\n<ul>\n<li>Basic lemmas that are clearly mathlib-worthy should be separated out and put into mathlib proper.</li>\n<li>Maintaining the proofs should not be much more effort than a typical mathlib proof. This means things like avoiding nonterminal simp/automation and no proofs that take a long time to compile.</li>\n</ul>",
        "id": 213101851,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1602551075
    },
    {
        "content": "<p>Will these formalizations end up useful as training material for an AI? I've no idea. Maybe an AI could also learn from PR reviews or the mathlib git history, not just the versions that end up in the mathlib archive. There are lots of things different people might hope to learn, or hope for mathlib as a whole to learn, or for a future AI to learn, from formalizing solutions to problems.</p>",
        "id": 213101890,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1602551113
    },
    {
        "content": "<p>I don't have much to add to what Heather, Joseph and Floris have already said, except that you should feel free to ask reviewers to implement their suggested changes if you don't feel up to it. The \"help-wanted\" tag is there for a reason!</p>",
        "id": 213102231,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1602551479
    },
    {
        "content": "<p>Maybe \"we have formalizations of all past IMO problems\" or \"all IMO &lt;some-recent-year&gt; problems\" would mean more olympiad people trying playing with formalization (or that Kevin Buzzard could successfully encourage more olympiad people to do so). But I think either of those is still some way off (more geometry and graph theory still needed in mathlib).</p>",
        "id": 213102325,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1602551583
    },
    {
        "content": "<p>I appreciate the chipping in from other people to get PRs submitted.</p>",
        "id": 213109764,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602561484
    },
    {
        "content": "<p>I still think we have a big problem - where \"we\" might not be the larger mathlib community, it might just be the people who would like to create a data set useful for AI IMO problem solving - that we are not really on track to have enough data to be useful within, say, a year and therefore we should figure out how to get more</p>",
        "id": 213110144,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602561953
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/new.20repo.20for.20IMO.20questions.20etc/near/213101890\">said</a>:</p>\n<blockquote>\n<p>Will these formalizations end up useful as training material for an AI? I've no idea. Maybe an AI could also learn from PR reviews or the mathlib git history, not just the versions that end up in the mathlib archive. There are lots of things different people might hope to learn, or hope for mathlib as a whole to learn, or for a future AI to learn, from formalizing solutions to problems.</p>\n</blockquote>\n<p>We do throw away an insane amount of useful git history by squashing PRs into mathlib. Like 37 \"wip\" commits... all gone.</p>",
        "id": 213114253,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1602568028
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238605\">@Kevin Lacker</span> I understand the frustration. But really, the hope is that by refactoring proofs, the workload will become easier for future problems, because you'll have reusable parts from earlier problems. I very much agree with what Joseph has said; in particular his point about multiple solutions. Until now, I hadn't really looked at it that way. But I guess there is nothing wrong with having 3 solutions in the file.<br>\nAnyhow, I hope that you will continue working with mathlib! And it's good to have this discussion!</p>",
        "id": 213114579,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1602568487
    },
    {
        "content": "<p>I don't know enough about AI to know what kind of data is best for training data. Is quantity the most important factor? Or should it also be deduplicated, refactored, designed, ...<br>\nI simply don't know.</p>",
        "id": 213114599,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1602568539
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238605\">@Kevin Lacker</span> maybe this point has been made already, but mathlib has two properties:</p>\n<p>1) It's <em>hard work</em> to write Lean code which is acceptable (as you're discovering)</p>\n<p>2) Conversely, it is maintained by a team of hard-working people, who ensure it always compiles, and this part of the job is made easier by contibutors keeping to stringent rules to make maintainers' lives easier.</p>\n<p>The moment you \"break away\" and start formalising things using less stringent criteria and your own rules, you run the risk of having a repo which compiles in 2020 and then is broken in 2021 and of no use to anyone. I speak as someone who spent 8 months of their life defining perfectoid spaces with Patrick and Johan, and now have a repo which is broken and no use to anyone because we didn't do the work you're complaining about. The alternative is much worse.</p>\n<p>The pain you're going through (and which we all go through -- I've had 5 line PR's which take a week or more to get accepted) is the price you currently pay for the privilege of having your code work forever in Lean 3. I've learnt the hard way that it's worth it.</p>",
        "id": 213116304,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602570845
    },
    {
        "content": "<p>The argument for \"doing it properly now\" is that the alternative is \"waste time not doing it properly now, and then refactor later\". The maintainers have a good eye for the correct level of generality that should be used in mathlib in order to be helpful for all.</p>",
        "id": 213118621,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602573185
    },
    {
        "content": "<p>Well, perhaps we can come to a happy medium by staying in <code>archive/imo</code> and also reviewers become slightly more lax in there</p>",
        "id": 213119900,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602574372
    },
    {
        "content": "<p>I would also add:</p>\n<ul>\n<li>Thank you very for your submissions <span class=\"user-mention\" data-user-id=\"238605\">@Kevin Lacker</span>. I personally really appreciate the time you've generously spent on these PRs!</li>\n<li>I've been contributing on and off for about a year and as far as I can tell (e.g., from the number of PRs arriving) the maintainers are busier than ever right now.</li>\n<li>I have come to enjoy the review process. The community always finds improvements that I missed and much of what I now know was taught to me this way.</li>\n<li>I don't have strong feelings on the separate repo question but my null hypothesis is that the natural time to split out the IMO material is when we have had an appropriately long / diverse sequence of solutions merged, of which sufficiently few also plugged gaps in <code>src</code>.</li>\n</ul>",
        "id": 213122707,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1602576277
    },
    {
        "content": "<p>I don't know anything about machine learning and automation, but I would be very surprised if the most efficient solution was to put as many low quality solutions as possible.</p>",
        "id": 213123081,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1602576588
    },
    {
        "content": "<p>that's kind of the modern trend in machine learning, as much low quality data as possible</p>",
        "id": 213124798,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602577731
    },
    {
        "content": "<p>Except we will never reach the quantity of data required there.</p>",
        "id": 213124888,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1602577796
    },
    {
        "content": "<p>perhaps we will have to auto-generate even larger amounts of lower-quality proofs. but that's sort of getting off topic</p>",
        "id": 213124969,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602577833
    },
    {
        "content": "<p>Since this is the IMO grand challenge stream, it may be worth recalling that Daniel doesn't plan to simply throw data to a neural network and hope. Did you watch the talk he gave a couple of weeks ago? He definitely wants something much more structured.</p>",
        "id": 213125059,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1602577915
    },
    {
        "content": "<p>well, we'll see what we have to work with</p>",
        "id": 213125185,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1602578011
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/new.20repo.20for.20IMO.20questions.20etc/near/213114253\">said</a>:</p>\n<blockquote>\n<p>We do throw away an insane amount of useful git history by squashing PRs into mathlib. Like 37 \"wip\" commits... all gone.</p>\n</blockquote>\n<p>One version of the history for each PR is available via <code>refs/pull</code> (see <code>git ls-remote</code> for all the refs available in the repository). But I'm not sure if there's any good way to get multiple versions of the history from GitHub for a PR that was rebased.</p>",
        "id": 213147619,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1602592926
    },
    {
        "content": "<p>rebasing makes it even worse... but it's good to know that the history isn't completely lost.</p>",
        "id": 213148037,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1602593132
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/stream/208328-IMO-grand-challenge/topic/new.20repo.20for.20IMO.20questions.20etc/near/213099639\">said</a>:</p>\n<blockquote>\n<p>The one way in which I think IMO PRs <em>should</em> be considered different from others is that if there are multiple, genuinely mathematically different approaches to a problem (as opposed to one just being a cleaned-up version of another), it makes sense to formalize all of them, to learn about all the above issues for each of the approaches, and so the fact that one approach might give a nicer formalization isn't a reason to exclude another approach (supposing each approach is given in a suitably cleaned-up form). </p>\n</blockquote>\n<p>How do you want to structure the IMO archive to allow for multiple solutions?  I have a variant solution to <a href=\"https://github.com/leanprover-community/mathlib/issues/4518\">#4518</a> which I would like to contribute (it's the solution sketched <a href=\"https://github.com/leanprover-community/mathlib/pull/4518#pullrequestreview-506238362\">here</a>).  Should I append it to the same file?</p>",
        "id": 213518128,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602823062
    },
    {
        "content": "<p>I think yes, multiple solutions in the same file.</p>",
        "id": 213518286,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1602823296
    },
    {
        "content": "<p>With lemma names like <code>imo1962_q4</code>, <code>imo1962_q4'</code> ?</p>",
        "id": 213518330,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1602823344
    }
]