[
    {
        "content": "<p>Hi, as part of their course on interactive theorem proving my students and I are working on formalizing IMO problems and solutions in Isabelle/HOL. It's not Lean, but I guess it might be interesting for people in this discussion forum. Our current work is available (<a href=\"https://github.com/filipmaric/IMO\">https://github.com/filipmaric/IMO</a>) and I hope that this repository grows over time (as students do their coursework). All files are written fully manually and I suppose that many steps in those proofs could be better automated - automating larger and larger parts of the proof might be a useful step towards your grand challenge.</p>",
        "id": 200260416,
        "sender_full_name": "Filip Marić",
        "timestamp": 1591722220
    },
    {
        "content": "<p>Hi, welcome! (I think that part of the \"challenge\" is that other provers can also make an attempt <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span>)</p>",
        "id": 200260570,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1591722299
    },
    {
        "content": "<p>How are you formalising geometry problems? Synthetically or with coordinates?</p>",
        "id": 200261049,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1591722541
    },
    {
        "content": "<p>Currently we skipped all geometry problems, as we were not aware of any synthetic geometry development that would suite our needs. Recently I have found out that there is a formalization of Tarski's geometry in Isabelle/HOL (ported from GeoCoq), so we might consider doing also some (synthetic) geometry.</p>",
        "id": 200261498,
        "sender_full_name": "Filip Marić",
        "timestamp": 1591722740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310361\">@Filip Marić</span> Welcome and thanks for sharing!</p>",
        "id": 200272308,
        "sender_full_name": "Daniel Selsam",
        "timestamp": 1591727979
    }
]