[
    {
        "content": "<p>So I don't know if this is best place to post this but I'm wondering if there are some sorts of informal style guidelines people like to follow for Lean? Best ways of writing definitions/proofs, that sort of thing. It seems like there are multiple ways of writing Lean proofs, which is true of regular math proofs too, but I wonder if there's more to it on the Lean side of things</p>",
        "id": 198464632,
        "sender_full_name": "Alena Gusakov",
        "timestamp": 1590165824
    },
    {
        "content": "<p>There are the mathlib contribution guidelines: <a href=\"https://leanprover-community.github.io/contribute/style.html\">style guide</a>, <a href=\"https://leanprover-community.github.io/contribute/naming.html\">naming conventions</a> and <a href=\"https://leanprover-community.github.io/contribute/doc.html\">documentation guidelines</a>.</p>",
        "id": 198465312,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1590166140
    },
    {
        "content": "<p>Ah, neat! Thank you!</p>",
        "id": 198465723,
        "sender_full_name": "Alena Gusakov",
        "timestamp": 1590166323
    },
    {
        "content": "<p>by the way \"metaprogramming\" refers to writing code that involves the <code>meta</code> keyword. This is how things like <code>finish</code>, <code>cc</code>, and <code>ring</code> are written.</p>",
        "id": 198466075,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1590166475
    },
    {
        "content": "<p>At the Xena project we don't have any style guidelines -- if it compiles, you won.</p>",
        "id": 198470989,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590168889
    },
    {
        "content": "<p>But those are just the introductory levels. When Xena advances to the boss levels (getting PRs merged in mathlib) it helps to have practice with the right techniques. :-)</p>",
        "id": 198513720,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1590201232
    },
    {
        "content": "<p>Can confirm getting PRs merged and making the linter happy is the real boss fight of lean</p>",
        "id": 198515139,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1590203604
    },
    {
        "content": "<p>Beyond that there's reviewing other people's PRs, and beyond that, convincing all the bright young things doing lovely maths in Lean to put in the effort to PR it all! :-)</p>",
        "id": 198519219,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1590210947
    },
    {
        "content": "<p>My take on it is that one way to find 5 people who will take it seriously and make good PRs is to tell 500 people about Lean</p>",
        "id": 198522862,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590218345
    },
    {
        "content": "<p>I am not sure I am capable of teaching things like good coding practice because at the end of the day I am not actually a good computer scientist</p>",
        "id": 198522929,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590218428
    }
]