[
    {
        "content": "<p>This event already had a decent amount of advertising, I think? Where do we need to advertise that it is moving online?</p>",
        "id": 197450233,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1589392018
    },
    {
        "content": "<p>I was thinking of announcing on the \"eager-gen\" mailing list, which is used for anything vaguely related to algebraic geometry and number theory in \"Europe\". Kevin and I know a lot of people on that list.</p>",
        "id": 197450351,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589392081
    },
    {
        "content": "<p>There is also a Dutch mailing list where I know a lot of people</p>",
        "id": 197450415,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589392097
    },
    {
        "content": "<p>Then there is <a href=\"http://mathseminars.org\">mathseminars.org</a></p>",
        "id": 197450433,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589392105
    },
    {
        "content": "<p>I saw one email about this this morning! Did you hit other mailing lists yet? I'm sure the <a href=\"http://resources.illc.uva.nl/LogicList/\">LOGIC list</a> would be interested. Dunno if you want to hit other proof assistant lists too.</p>",
        "id": 202068332,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1593163119
    },
    {
        "content": "<p>I only sent an email to the \"old\" participant list</p>",
        "id": 202068350,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1593163147
    },
    {
        "content": "<p>But the plan is to send announcements to other lists today</p>",
        "id": 202068365,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1593163159
    },
    {
        "content": "<p>The target is really general mathematicians. I have nothing against logicians but I certainly hope we won't have too many of them, as it would biased things in a direction which it totally different from what we have in mind.</p>",
        "id": 202068479,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1593163233
    },
    {
        "content": "<p>The same applies to users of other proofs assistants, especially since very few of them are mathematicians.</p>",
        "id": 202068513,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1593163265
    },
    {
        "content": "<p>I agree with what Patrick says. The people on the logic and foundations lists are in some sense not our target audience at all. The mathematical mailing lists I'm on however are specialised (eg number theory, algebraic geometry etc) so it's difficult to know whether to send it to them.</p>",
        "id": 202069104,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1593163691
    },
    {
        "content": "<p>My plan was to send it to such lists (like EAGER) anyway. Just apologize that it's not NT or AG directly, but that they're still the intended audience.</p>",
        "id": 202069155,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1593163750
    }
]