[
    {
        "content": "<p>If you want to be tutor in a pair/triple programming session during this workshop, please leave a ping here.<br>\nThe idea would be that one or two beginners try to write some lean code in an area that interests them.<br>\nThe tutor should judge whether the topic is suitable for the experience level of the participant. (Intermediate users could dabble in tactic writing, or tricky definitions, but beginners probably shouldn't.)</p>\n<p>A group can then start a video call with screen sharing, and discuss the code as they are writing it.</p>",
        "id": 201976934,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1593095647
    },
    {
        "content": "<p>When do these pair-programming sessions start? If it's anytime could I get someone for a bit before the 'first' talk to help define something? I'm pretty beginner</p>",
        "id": 203698823,
        "sender_full_name": "Danila Kurganov",
        "timestamp": 1594636110
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"255278\">@Danila Kurganov</span> Sure, please join Zoom</p>",
        "id": 203698844,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594636145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> I'm on the zoom, i'll wait until zoom things are fixed for this?</p>",
        "id": 203698951,
        "sender_full_name": "Danila Kurganov",
        "timestamp": 1594636224
    },
    {
        "content": "<p>The Zoom meeting for pair programming has started:<br>\nTopic: LftCM Pair Programming<br>\nTime: This is a recurring meeting Meet anytime</p>\n<p>Join Zoom Meeting<br>\n<a href=\"https://vu-live.zoom.us/j/99558325939?pwd=VnR6TWMwblRKeUE5a2k5cE81YlhTUT09\">https://vu-live.zoom.us/j/99558325939?pwd=VnR6TWMwblRKeUE5a2k5cE81YlhTUT09</a></p>\n<p>Meeting ID: 995 5832 5939<br>\nPassword: 649721</p>",
        "id": 203703800,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1594639955
    },
    {
        "content": "<p>I would be very grateful if someone knowing the formalization of perfectoid spaces pretty well can show me which lemmas need to deal with isomorphisms of localized rings, a problem that Kevin Buzzard highlighted in his Edinburgh talk on the project last year.  I am not sure what's the best way to find such lemmas: Use search tools in Lean? Other search tools? Just find my way through the code myself?</p>\n<p>Actually, Kevin's remarks prompted me to think about the usefulness of HoTT for problems like this. I started formalizing things in Lean 2, and now put the code on GitHub : <a href=\"https://github.com/theckl/HoTT-Case-Study\">https://github.com/theckl/HoTT-Case-Study</a> , together with an extensive Readme file about the details of the project and the philosophy behind it (including a suggestion how to use HoTT in fashionable mathematics!).</p>\n<p>Note that I am an Algebraic Geometer (from the primordial soup) usually working on problems (yet) far away from formalization. So I tick some of the boxes of the intended audience and hope that I am allowed to ask these HoTT-related questions in this conference, despite Johan's initial warning yesterday.</p>",
        "id": 203827730,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594730360
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"126734\">@Thomas Eckl</span> that's certainly allowed (-;</p>",
        "id": 203827895,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730455
    },
    {
        "content": "<p>But just maybe not during the Zoom talks (-;</p>",
        "id": 203828048,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730536
    },
    {
        "content": "<p>But I would love to talk about this <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 203828067,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730553
    },
    {
        "content": "<p>OK, sorry, and thanks. Let me know when there is a good time for you; I guess as one of the organizers you are quite busy ...</p>",
        "id": 203828297,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594730706
    },
    {
        "content": "<p>Yeah, that's certainly true</p>",
        "id": 203828306,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730718
    },
    {
        "content": "<p>Also, I think the schemes formalisation already contains the sort of \"problem/solution\" you are interested in</p>",
        "id": 203828322,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730742
    },
    {
        "content": "<p>So that might actually be a better use case</p>",
        "id": 203828335,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730754
    },
    {
        "content": "<p>I'm sure Kevin will be delighted to show you around, but he also has a talk tomorrow</p>",
        "id": 203828405,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730778
    },
    {
        "content": "<p>I can certainly wait until Thursday.</p>",
        "id": 203828485,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594730843
    },
    {
        "content": "<p>Cool!</p>",
        "id": 203828506,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1594730856
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> Thanks for your hint to the formalisation of schemes. I downloaded Ramon Fernandez Mir's project and used the search tools that you showed us on Wednesday - participating in the conference pays off! ;-) I think I know now where to find all the little lemmas on isomorphisms of localizations: not too surprisingly in the construction of the structure sheaf. </p>\n<p>I stiil would love to hear opinions of Lean 3 users on HoTT. Maybe we can arrange a meeting after the conference, when you are not so busy. Or is the modern way to discuss a chat in Zulip?</p>",
        "id": 204190028,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594980685
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> You liked my contribution above. Does it contain a particular topic that you are interested in?  I liked a lot your presentation on categories yesterday afternoon. This is getting close to a tool that you can use in actual research ...</p>",
        "id": 204190385,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594981057
    },
    {
        "content": "<p>Mostly it was just intended as a friendly welcome!</p>",
        "id": 204190458,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1594981127
    },
    {
        "content": "<p>I'm happy to see algebraic geometers using Lean. I'm not exactly a category theorist -- my background is in quantum topology / tensor categories / subfactors.</p>",
        "id": 204190476,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1594981165
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"126734\">@Thomas Eckl</span> I would be very interested to see a basic definition of algebraic geometry up to and including a definition of a scheme, and a proof that affine schemes are schemes, in a HoTT theory.</p>",
        "id": 204193107,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1594983522
    },
    {
        "content": "<p>If you want to go further, then there is an exercise in Hartshorne's book on algebraic geometry about gluing sheaves on open subsets of a topological space (basically showing that if the sheaves on the open subspaces agree on overlaps and the isomorphisms satisfy a cocycle condition then they can be glued to make a sheaf on the whole space which agrees with the original sheaves when restricted to the open subsets). Kenny Lau did this exercise in Lean and it was hard work, but possible.</p>",
        "id": 204193263,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1594983636
    },
    {
        "content": "<p>My original development of schemes had a huge design flaw which I worked around because I was determined to get it to work. I supervised Ramon's MSc project on schemes and he did it in a much better way, using universal properties of localisations rather than the concrete definition; this is somehow a crucial insight.</p>",
        "id": 204193327,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1594983713
    },
    {
        "content": "<p>I am still very unclear about whether my original approach would have worked much more easily in a HoTT theory, but I am not even sure that it is the right approach.</p>",
        "id": 204193403,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1594983757
    },
    {
        "content": "<p>I am not exactly sure what your original approach was, but I liked a lot Ramon's project. Maybe I can extend my little project on formalization to a complete formalization of schemes and thus comply with your wishes. But it may also very well happen that I have to admit the unsuitability of HoTT for such efforts - but then I should at least understand better why.</p>",
        "id": 204217101,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1594998395
    },
    {
        "content": "<p>This is the kind of question I would really have loved to talk to Voevodsky about :-(</p>",
        "id": 204229801,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1595004273
    }
]