[
    {
        "content": "<p>I've created an issue (<a href=\"https://github.com/leanprover-community/mathlib/issues/4013\">#4013</a>) for tracking properties of ring homomorphisms. There is a lot of relatively low-hanging fruit here, I think.</p>",
        "id": 208645559,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1598937087
    },
    {
        "content": "<p>Let me second what Johan's saying. If we want to define etale cohomology of schemes we will need to know a bunch of basic facts about etale morphisms of schemes, and these will all be deduced from basic facts about etale morphisms of rings.</p>\n<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> because these are predicates, might one argue that it \"doesn't matter too much\" which definition one uses?</p>\n<p>I don't like this use of \"finite\"  by the way. Conrad seems to call it \"module-finite\", in contrast to \"ring-finite\" (finite type). I don't know what is prevalent in the literature nowadays...</p>",
        "id": 208657557,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1598948430
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> But <code>ring_hom.finite</code> can have only one meaning. Brian Conrad doesn't have namespaces....</p>",
        "id": 208657912,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1598948679
    },
    {
        "content": "<p>And yes, all these are <code>Prop</code>s, so the definitions can't go too wrong (apart from getting the maths right <span aria-label=\"rofl\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rofl\">:rofl:</span>)</p>",
        "id": 208657941,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1598948712
    },
    {
        "content": "<p>The \"usual\" definition of flatness involves quantifying over all modules, so it might cause universe issues. I wonder if it would it be better to use the equivalent definition   using ideals only?</p>",
        "id": 208684796,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598966164
    },
    {
        "content": "<p>I don't think there would be any problem with the \"usual\" definition, but in a hypothetical future world where we can automatically prove invariance of properties under <code>ulift</code>, it might be better to use a definition that doesn't involve quantifying over <code>Type u</code></p>",
        "id": 208686885,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598967121
    },
    {
        "content": "<p>Sure, as long as we quantify over modules at the same universe level as the ring itself it would be fine. One would still want to prove the fact that checking the flatness condition for ideals is sufficient.</p>",
        "id": 208687626,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598967389
    },
    {
        "content": "<p>In any case, we'll want to proof the two characterizations are equivalent.</p>",
        "id": 208688138,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598967651
    },
    {
        "content": "<p>Since it's just a Prop, the only reason I can see to prefer choosing one definition over the other is that it might make things simpler for a future \"prove things are invariant under <code>ulift</code>\" tactic if we pick the one that's obviously invariant as the definition.</p>",
        "id": 208688329,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598967732
    },
    {
        "content": "<p>I guess maybe another reason is if one wants to support the ring and module in different universes and it affects the equivalence</p>",
        "id": 208688352,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598967751
    },
    {
        "content": "<p>There was a related discussion about projective modules starting at <a href=\"#narrow/stream/116395-maths/topic/free.20module/near/158488533\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/free.20module/near/158488533</a></p>",
        "id": 208692680,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598969700
    },
    {
        "content": "<p>What was the conclusion? I guess the analogous idea would be to define a projective module as (isomorphic to) a direct summand of a freee module.</p>",
        "id": 208692885,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598969797
    },
    {
        "content": "<p>I don't know if there really was a conclusion, but the message I linked to has a definition of projective which doesn't quantify over a universe and is equivalent to the usual notion at least for reasonable choices of universe levels</p>",
        "id": 208693364,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598970005
    },
    {
        "content": "<p>I see. (It's a very long thread...)</p>",
        "id": 208693419,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598970031
    },
    {
        "content": "<p>or at least is supposed to be equivalent, I didn't actually prove it in Lean</p>",
        "id": 208693434,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598970039
    },
    {
        "content": "<p>I suppose that a module of universe level <code>u</code> is projective (with respect to arbitrary universe level) if and only if it is a direct summand of a free module generated by a type <code>S</code> of the same level <code>u</code>.</p>",
        "id": 208693553,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598970092
    },
    {
        "content": "<p>But it seems that projective modules are actually worse than flat modules, since a priori universes appear in all of the mathematically equivalent definitions that I know of.</p>",
        "id": 208693751,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1598970172
    },
    {
        "content": "<p>well, now you know of another one <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 208693854,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598970223
    },
    {
        "content": "<p>You can always use the free module on the underlying set to provide the surjection to test splitting against.</p>",
        "id": 208693954,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598970250
    },
    {
        "content": "<p>But I think I looked at the stacks project and it was true that all the characterizations listed there involved quantifying over the universe (either forall or exists).</p>",
        "id": 208694571,
        "sender_full_name": "Reid Barton",
        "timestamp": 1598970498
    }
]