[
    {
        "content": "<p>Hi all, <span class=\"user-mention\" data-user-id=\"382349\">@Calvin Lee</span> and I have been working on a WIP blueprint for proving the <a href=\"https://en.wikipedia.org/wiki/Adjunction_formula\">Adjunction Formula</a> in Lean. </p>\n<p>The proof has two main components, one (section two) which is mainly uses algebraic geometry machinery and some commutative algebra that is well within reach. Much of it piggy-backs off of work that is already being done in mathlib, e.g. Kahler differentials, Nakayama's lemma. The other component (section one) is entirely commutative algebra, dedicated to proving the following claim: A localization of a regular ring at a prime ideal is regular. This requires the Auslander-Buchsbaum-Serre theorem, which is a homological statement that will be a consumer of the homological machinery from LTE in one way or another.</p>\n<p>As far as I can see, there are two reasonable choices for trying to prove Auslander-Buchsbaum-Serre: one can follow Bruns-Herzog and prove a bunch of facts about Ext, depth, and define Cohen-Macaulay rings, going through much of Bruns-Herzog chapter 1. Or, one can try to avoid this and develop the theory of Koszul homology, define DG-algebras, and prove a statement due to Serre using this machinery--though I'm not 100% sure this alternate proof is free of the notion of depth. </p>\n<p>I'd be interested to hear feedback about which proof might be a better option to do.</p>\n<p>The blueprint can be found <a href=\"https://jjgarzella.github.io/adjunction-formula-blueprint/index.html\">here</a>, notice that many proofs and statements are missing but the dependency graph is mostly there, with one major exception--the choice of proof of Auslander-Buchsbaum-Serre.</p>\n<p>We're hoping to do a bunch of work on the side of things that doesn't need homological algebra, and then work on the homological bits later after having though through it a bit more.</p>",
        "id": 295522822,
        "sender_full_name": "Jack J Garzella",
        "timestamp": 1661552863
    }
]