[
    {
        "content": "<p>If someone formalised a proof of a fact that was already in mathlib, but via a different route (e.g. algebraic closedness of C famously has many very different proofs), would this new proof be accepted to mathlib?</p>",
        "id": 251050716,
        "sender_full_name": "Vladimir Goryachev",
        "timestamp": 1630151625
    },
    {
        "content": "<p>It doesn't make much sense for mathlib to contain multiple proofs of exactly the same statement, but sometimes the new proof can replace the old one if it is shorter, faster, or more readable.</p>",
        "id": 251051239,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1630152107
    },
    {
        "content": "<p>However, a collection of different proof strategies of the same statement might still be a good fit for the <code>archive</code> folder, as they likely provide educational value to both human users and possibly linter metaprograms.</p>",
        "id": 251051345,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1630152223
    },
    {
        "content": "<p>Putting them in the library means more work for the maintainers when in two years' time a proof breaks and you're nowhere to be found</p>",
        "id": 251051610,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1630152458
    },
    {
        "content": "<p>This would be perfect either as a separate project (you could call it the algebraists closure project or whatever) and then write the code yourself and put a bunch of comments explaining what you're doing. That would be more helpful then a second mathematics proof. Mathlib is unfortunately many things but I don't think it's a repository for random proofs of things which we already have</p>",
        "id": 251051741,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1630152593
    },
    {
        "content": "<p>I have plenty of students who have done random lean projects and just leave them up as github repos. There's some link to \"student projects\" on the Xena Project blog</p>",
        "id": 251051865,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1630152701
    },
    {
        "content": "<p>Thank you, this makes sense!</p>",
        "id": 251051964,
        "sender_full_name": "Vladimir Goryachev",
        "timestamp": 1630152785
    },
    {
        "content": "<p>Note that it is very common for different proofs (in the usual mathematical sense) of the same statement to generalize in different directions, so having multiple generalized statements is one way to get alternate proofs in mathlib</p>",
        "id": 251051977,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1630152807
    },
    {
        "content": "<p>I definitely think it would be nice to have things like that in archive, if only so that any useful api for the proof gets pr'ed to the main library too</p>",
        "id": 251062327,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1630163632
    },
    {
        "content": "<p>Would it be reasonable then to add some doc of the official <code>mathlib</code> file pointing to the other repo? Because I would imagine that someone wondering about which proofs of algebraic closeness of <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">C</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbb{C}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68889em;vertical-align:0em;\"></span><span class=\"mord mathbb\">C</span></span></span></span> exist in <code>mathlib</code> would have nowhere else to look but in there.</p>",
        "id": 251250279,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1630338696
    },
    {
        "content": "<p>Sure, I think that makes sense.</p>",
        "id": 251250541,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1630338810
    },
    {
        "content": "<p>I guess <code>src/field_theory/abel_ruffini.lean</code> could do something similar</p>",
        "id": 251250665,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1630338858
    }
]