[
    {
        "content": "<p>Do people know of a filter definition of <a href=\"https://en.wikipedia.org/wiki/Bitopological_space\">bicompactness</a>?</p>",
        "id": 270608575,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1643918309
    },
    {
        "content": "<p>Why do we want this notion? I've never heard of it. I can think of 100 things I have heard of which we don't have and which would perhaps be more profitable to work on. Does anyone serious use this notion? Maybe they do -- I'm just asking</p>",
        "id": 270793275,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644022572
    },
    {
        "content": "<p>I don't even understand the definition. What's this thing about it must contain an element from each topology? What must? How about we add the empty set? That's in both </p>\n<p>Is it different to the topology generated by the two topologies being compact?</p>",
        "id": 270793458,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644022745
    },
    {
        "content": "<p>A bi-group is a type with two group structures. We say it's bi-abelian if both of them are abelian. Let's not put this in mathlib.</p>",
        "id": 270794028,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644023225
    },
    {
        "content": "<p>This is because of <a href=\"https://en.wikipedia.org/wiki/Duality_theory_for_distributive_lattices\">duality theory for distributive lattices</a>. It is genuinely useful, Kevin <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 270810520,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644044100
    },
    {
        "content": "<p>Do you even understand what is written on Wikipedia? It seems like a very vague comment about how something must contain an open from each topology.</p>",
        "id": 270813230,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644048267
    },
    {
        "content": "<p>That comment made me wonder about whether this stuff was just written by a randomer and was never clarified because this stuff is never used</p>",
        "id": 270813252,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644048311
    },
    {
        "content": "<p>No, I don't understand that offhand comment because it seems like it adds a condition after the main sentence. However, I found <a href=\"https://alexhkurz.github.io/papers/PairwiseStoneRevised.pdf\">the original paper</a>.</p>",
        "id": 270813266,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644048331
    }
]