[
    {
        "content": "<p>Carlos Simpson (a mathematician) wrote <a href=\"https://arxiv.org/abs/math/0311260\" target=\"_blank\" title=\"https://arxiv.org/abs/math/0311260\">this article</a> [NB: now links to ArXiv] on computer theorem proving in 2003. I'd not seen it until today. At the end of it he talks about formalising a proof that some space coming up in the study of variation of Hodge structures is negatively curved. If this sounds like a big deal today (and it does, to me) then perhaps it sounded like a massive deal in 2003. </p>\n<p>In the last couple of pages of the paper, Simpson writes down a sketch of how he imagines this theorem should be proved in a computer proof checker. I don't want to quote it all here, it's about three pages long. But it might be interesting to know how far we have gone down this route and how feasible people think this plan is to pull off in Lean.</p>",
        "id": 188225854,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581700478
    },
    {
        "content": "<p>I particularly like that he refers to what I call mathematics as \"standard mathematics\" and all the constructive stuff as \"exotic mathematics\" :D</p>",
        "id": 188225889,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581700518
    },
    {
        "content": "<p>Incidentally, this is the same Simpson that found a mistake in Voevodsky's papers, and drove Voevodsky towards formalisation.</p>",
        "id": 188227254,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581701534
    },
    {
        "content": "<p>Here are a few more related articles by Simpson on the arxiv: </p>\n<ul>\n<li><a href=\"https://arxiv.org/abs/math/0402336\" target=\"_blank\" title=\"https://arxiv.org/abs/math/0402336\">\"Set-theoretical mathematics in Coq\"</a> (which appears to be a revision of part of the article Kevin linked above), </li>\n<li><a href=\"https://arxiv.org/abs/math/0410224\" target=\"_blank\" title=\"https://arxiv.org/abs/math/0410224\">\"Formalized proof, computation, and the construction problem in algebraic geometry\"</a>, and </li>\n<li><a href=\"https://arxiv.org/abs/math/0506471\" target=\"_blank\" title=\"https://arxiv.org/abs/math/0506471\">\"Explaining Gabriel-Zisman localization to the computer\"</a> (see also <a href=\"https://arxiv.org/abs/math/0506470\" target=\"_blank\" title=\"https://arxiv.org/abs/math/0506470\">\"Files for Gabriel-Zisman localization\"</a>).</li>\n</ul>",
        "id": 188229840,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1581703367
    },
    {
        "content": "<blockquote>\n<p>If the makers of other systems feel impelled at this point to say “hey, our system does just as well or better”, the main point I am trying to make is:  That’s great!  Try to get us working on it!</p>\n</blockquote>",
        "id": 188232367,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581705050
    },
    {
        "content": "<blockquote>\n<p>Once we have a reasonable control over the basic notions of ring, algebra, module etc. then much of commutative algebra can be done without any new notational worries.</p>\n</blockquote>\n<p>And here we are... moaning about commutative diagrams and problems with really getting comm.alg. goin.</p>",
        "id": 188233286,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581705714
    },
    {
        "content": "<p>Do they have these problems in Coq? That was the system Carlos had experience in. </p>\n<p>Of course the moans are only that stuff is annoyingly fiddly, not that it is impossible...</p>",
        "id": 188235024,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581706744
    },
    {
        "content": "<p>Well... how much commutative algebra has been added to the system after the great module refactor?</p>",
        "id": 188235312,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581706868
    },
    {
        "content": "<blockquote>\n<p>But it might be interesting to know how far we have gone down this route and how feasible people think this plan is to pull off in Lean.</p>\n</blockquote>\n<p>I think we're about halfway through the sketch and in the middle of the paragraph about sheaves</p>",
        "id": 188268831,
        "sender_full_name": "Jesse Michael Han",
        "timestamp": 1581741362
    },
    {
        "content": "<p>My link above now points to the 2004 version of the article on ArXiv. It seems to me that we are basically on the last page of the article (p25), modulo para on p24 which mentions the construction going from schemes over C (which we have) to complex manifolds (which we have). </p>\n<p>I think that it is interesting to note that whilst this article was written by a mathematician in 2003, the vision he spells out involves formalising precisely the things (manifolds, schemes, topological groups, sheaves) which mathematicians in 2018-20 were pushing to get, completely independently.</p>",
        "id": 188281150,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581768242
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/116395-maths/topic/Carlos.20Simpson.20and.20VHS/near/188235312\" title=\"#narrow/stream/116395-maths/topic/Carlos.20Simpson.20and.20VHS/near/188235312\">said</a>:</p>\n<blockquote>\n<p>Well... how much commutative algebra has been added to the system after the great module refactor?</p>\n</blockquote>\n<p>Things like Hilbert Basis? And I'm in the middle of Nullstellensatz? Of course Kenny's absence this year has slowed things down but on the other hand analysis is now moving much faster.</p>",
        "id": 188281164,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581768309
    }
]