[
    {
        "content": "<p>I've been working on formalizing incidence geometry in Lean as an exercise and came across the following question: when we say that a set of points are collinear, do they necessarily have to be distinct?</p>",
        "id": 189423721,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1583048166
    },
    {
        "content": "<p>Also, does it make sense to say that zero points or one point is/are (trivially) collinear?</p>",
        "id": 189423787,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1583048375
    },
    {
        "content": "<p>That's all up to the person who is using those words.</p>",
        "id": 189423789,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583048399
    },
    {
        "content": "<p>Thanks, so I suppose it's fine either way?</p>",
        "id": 189423837,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1583048426
    },
    {
        "content": "<p>I guess if I were using these words I would be clear about what I meant in these edge cases</p>",
        "id": 189423868,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583048520
    },
    {
        "content": "<p>If you literally have a <code>set</code> of points, then its members are distinct by definition</p>",
        "id": 189436612,
        "sender_full_name": "Reid Barton",
        "timestamp": 1583075840
    },
    {
        "content": "<p>My usual message every time someone mentions that formalization project: if you are serious about it, you should have a look at <a href=\"https://geocoq.github.io/GeoCoq/\" target=\"_blank\" title=\"https://geocoq.github.io/GeoCoq/\">https://geocoq.github.io/GeoCoq/</a></p>",
        "id": 189436671,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583075911
    },
    {
        "content": "<p>And GeoCoq is also a cautionary example of how hard the kind of issues you are asking about are: their definition of orthocenter is wrong (a right triangle has no orthocenter according to their definition, while the orthocenter should be defined as the vertex at the right angle) because of a definition of orthogonality which excludes certain points from being equal.</p>",
        "id": 189438812,
        "sender_full_name": "Reid Barton",
        "timestamp": 1583080146
    },
    {
        "content": "<p>Did you just noticed that issue?</p>",
        "id": 189438817,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583080187
    },
    {
        "content": "<p>Or was it discussed somewhere else?</p>",
        "id": 189438818,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583080200
    },
    {
        "content": "<p>It was discussed before but possibly not on a public Zulip stream</p>",
        "id": 189438923,
        "sender_full_name": "Reid Barton",
        "timestamp": 1583080381
    },
    {
        "content": "<p>Did you discuss it with the authors of GeoCoq?</p>",
        "id": 189438933,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583080403
    },
    {
        "content": "<p>No</p>",
        "id": 189438935,
        "sender_full_name": "Reid Barton",
        "timestamp": 1583080409
    },
    {
        "content": "<p>I think this story is surprising, I'd be curious to know what they think about it.</p>",
        "id": 189438992,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583080510
    },
    {
        "content": "<p>I'll tell Julien Narboux he should come here.</p>",
        "id": 189439036,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583080581
    },
    {
        "content": "<p>You are right our definition is wrong, because it does not include the case of the right triangle  ! thank you for pointing this. It has to be noted that we even proved Lemma orthocenter_per : ∀ A B C H, Per A B C →is_orthocenter H A B C → H=B. without noticing that the hypotheses imply False !<br>\nThe orthocenter is not used much in GeoCoq, I guess by using it more we would have detected this error.</p>",
        "id": 189440637,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583083716
    },
    {
        "content": "<p>Our are right that giving good definitions is not always as trivial as it looks. My favorite example of this is the definition of a point being inside an angle. if you say that  a point P is inside an angle ABC if there are points X and Y such that P belongs to segment XY: this definition works nicely in euclidean geometry, but does not work in neutral geometry. This confusion led to a flawed proof by Legendre of the parallel postulate.</p>",
        "id": 189440762,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583083926
    },
    {
        "content": "<p>About collinearity, we have in GeoCoq, a predicate Col taking only three points as input, and Col A A B holds. Then we have a tactic to deal with pseudo-transitivity of collinearity: A&lt;&gt;B -&gt; Col A B P -&gt; Col  A B Q -&gt; Col A B R -&gt; Col P Q R. I think it is convenient to allow in the definition of Col equal points because in many case you do not know if the point are distinct.<br>\nIn education, and in the Elements, there is some kind of implicit assumptions that points are in general position, but when you do it in Coq, you have a lot of problems with degenerated cases.</p>",
        "id": 189440836,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583084114
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span>  and <span class=\"user-mention\" data-user-id=\"268018\">@Julien Narboux</span> for your input (and thanks <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>  for mentioning GeoCoq). On a note related to incorrectly formalizing definitions, I think I read somewhere that Andrew W. Appel formalized a predicative type system and proved its soundness (in Coq) and even published a paper on it that got accepted, but only later realized that he wanted an impredicative type system when trying to integrate it into part of a larger research project. It's interesting how one can trip up on definitions despite being well-trained in formal methods.</p>",
        "id": 189458719,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1583116357
    },
    {
        "content": "<p>I have a question for Julien. I one hour, I'll be teaching my geometry class for future school teachers. I'll \"prove\" that every simple polygon can be triangulated without adding interior vertices (and then deduce the formula for the sum of angles of polygons). Each time I've explained this since I started formalized math I feel guilty (thinking I would have a very hard time formalizing this proof). Is this formalized in GeoCoq?</p>",
        "id": 189470497,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583136566
    },
    {
        "content": "<p>Patrick, no it is not formalized in GeoCoq. I think, Harrison has formalized the fact that simple polygon can be triangulated without adding interior vertices in HOL light for the proof of Pick's theorem. We worked on Pick's theorem in Coq a long time ago with a student but we never finished the formalization.</p>",
        "id": 189471066,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583137321
    },
    {
        "content": "<p>Moreover, it is funny because the proof that the sum of angles of a triangle is 180° is one of the examples I give to explain that proofs given in high-school and in textbooks, often \"read facts from the figure\". See <a href=\"https://dpt-info.u-strasbg.fr/~narboux/slides/slides_toulouse.pdf\" target=\"_blank\" title=\"https://dpt-info.u-strasbg.fr/~narboux/slides/slides_toulouse.pdf\">https://dpt-info.u-strasbg.fr/~narboux/slides/slides_toulouse.pdf</a> near slide 18.</p>",
        "id": 189471146,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583137435
    },
    {
        "content": "<p>The usual proof of the sum of angles of a just a triangle, is to consider the parallel line to one side going through the third vertex. And then, from the fact that we have alternate angles, we can conclude that the sum is 180°. But doing it formally requires some work , I wrote a short (unpublished) note about this a few years ago: <a href=\"https://www.overleaf.com/read/xxzrndcfycfy\" target=\"_blank\" title=\"https://www.overleaf.com/read/xxzrndcfycfy\">https://www.overleaf.com/read/xxzrndcfycfy</a></p>",
        "id": 189471441,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583137725
    },
    {
        "content": "<p>I know the triangle case is already based on pure cheating. I learned that from Arsac's book a long time ago.</p>",
        "id": 189489539,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583154975
    },
    {
        "content": "<p>Your Toulouse slides are really nice. On Page 63 you can add \"Orsay (Lean)\" next to Nijmegen and Nice.</p>",
        "id": 189489668,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583155089
    }
]