[
    {
        "content": "<p>I just spent an hour proudly looking through the mathlib github repo and summarising the stuff that is there which a mathematician would recognise and think of as \"standard\" or \"important\" or whatever. The style of my summary is very much the same style as the course summaries for the courses I attended as an undergraduate. I completely skip all the foundational stuff (e.g. no mathematician wants to hear that we have finset and fintype and finsupp, they won't even understand what that means, these are just \"obvious\", and they also don't want to know about conditionally complete lattices or monoids because they don't understand their importance). The big question: did I miss anything which a mathematician would find \"standard\" or \"important\" or whatever, and which is not trivially implied by things I already wrote?</p>\n<blockquote>\n<p>Algebra:<br>\n  Groups. Subgroups, quotients, cosets, centralizers, free groups, abelianisation, Sylow 1.<br>\n  Rings. primes and irreducibles, characteristic of a ring, ideals, fields, Euclidean domains, principal ideal domains, unique factorization domains, Noetherian rings. Ordered rings and fields. Polynomials and power series.<br>\n  Modules over a ring, direct sums and limits, tensor products, localisation.<br>\n  Lie algebras (definition and basic properties).<br>\n  Fields: minimal polynomials, finite extensions, algebraic extensions, splitting fields, perfect closure, finite fields.<br>\n  Vector spaces, bases, finite-dimensional spaces, matrices, linear maps, dual spaces, bilinear and sesquilinear forms.</p>\n<p>Number theory:<br>\n  The naturals, the integers, the rationals. Primes, uniqueness of factorization. GCDs. Congruences and modular arithmetic. Z is an ED/PID/UFD. Sums of two and four squares, Pell's equation in cases needed for Matiyasevich's theorem (d=a^2-1). Euler's Totient function. Quadratic reciprocity.</p>\n<p>Topology:<br>\n   Metric spaces. Cauchy sequences, Hausdorff distance and Gromov-Hausdorff distance. Completions. Lipschitz continuous functions.<br>\n   Uniform spaces, uniform continuity, completions.<br>\n   Topological spaces, open and closed sets, compact sets, continuous maps, homeomorphisms, the compact-open topology. Stone-Cech compactification. Topological fibre bundles.<br>\n   Presheaves on a topological space, stalks.</p>\n<p>Analysis:<br>\n   The reals and complex numbers.<br>\n   Basic theory of differentiation of functions of one variable: chain rule, product rule, mean value theorem, C^n and C^infty functions.<br>\n   Sups and Infs. Sequences and sums. Sum of a GP, exp and log, trig and inverse trig functions, basic properties. Pi.<br>\n   The complex numbers are algebraically closed.<br>\n   Definition of real manifold, manifolds with corners.</p>\n<p>Measure theory:<br>\n   Sigma algebras, measure spaces, Borel measurable functions, probability spaces, the Lebesgue integral, L^1 spaces, the Bochner integral, the Giry monad (i.e. measures on a measurable space form a measurable space).</p>\n<p>Category theory:<br>\n   Categories, small and large categories.<br>\n   Functors, full and faithful functors, natural transformations, the Yoneda lemma. Equivalence of categories, sums, products, limits, adjoints.<br>\n   The category of commutative rings, the category of modules over a ring, the category of measurable spaces.</p>\n<p>Other:<br>\n   Continued fractions. Turing machines, the Halting problem. Ordinals and Cardinals, Conway games. The Fibonacci sequence. The hyperreals. Cubing a cube.</p>\n<hr>\n<p>Written in Lean but not (yet?) in Lean's maths library:</p>\n<p>Sheaves of rings on a topological spaces, affine schemes, schemes.</p>\n<p>Valuations, continuous valuations on a topological ring, Huber rings,<br>\nTate rings, adic spaces, perfectoid spaces.</p>\n<p>The Cap Set Problem &lt;link&gt;</p>\n<p>Independence of the Continuum Hypothesis &lt;link&gt;</p>\n</blockquote>",
        "id": 181904930,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574761689
    },
    {
        "content": "<blockquote>\n<p>Modules over a ring, direct sums and limits, tensor products, localisation.</p>\n</blockquote>\n<p>Do we have localisation of modules? I thought only of rings...</p>",
        "id": 181905063,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574761812
    },
    {
        "content": "<p>We have tensor products and localisation of rings, right?</p>",
        "id": 181905076,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574761832
    },
    {
        "content": "<p>I can move \"localisation\" to the rings sentence.</p>",
        "id": 181905144,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574761909
    },
    {
        "content": "<p>I think it would (currently) make sense to move it there</p>",
        "id": 181905225,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574761953
    },
    {
        "content": "<p>We only have tensor products of modules, not of rings, as far as I know</p>",
        "id": 181905242,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574761966
    },
    {
        "content": "<p>At least no tensor product of algebras.</p>",
        "id": 181905266,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574761982
    },
    {
        "content": "<p>Someone should do extension of scalars (-;</p>",
        "id": 181905281,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574761992
    },
    {
        "content": "<p>Anyway, this list looks pretty good to me.</p>",
        "id": 181905290,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574762004
    },
    {
        "content": "<p>Maybe add <code>monoidal cats</code> to the category theory list</p>",
        "id": 181905320,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574762025
    },
    {
        "content": "<p>p-adic numbers?</p>",
        "id": 181906025,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574762520
    },
    {
        "content": "<p>It looks pretty comprehensive to me.</p>",
        "id": 181906070,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574762529
    },
    {
        "content": "<p>What does \"Sum of a GP\" means?</p>",
        "id": 181906103,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1574762564
    },
    {
        "content": "<p>Ooops... you missed Hensel</p>",
        "id": 181906273,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574762682
    },
    {
        "content": "<p>You mention differentiation of functions in one variable, but we also do several variables, so it is really <code>one or several variables</code>.</p>",
        "id": 181906437,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1574762812
    },
    {
        "content": "<p>connectedness. Baire theorem. Normed vector spaces and operator norm.</p>",
        "id": 181908022,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1574764099
    },
    {
        "content": "<p>Kevin, did you read <a href=\"https://github.com/leanprover-community/mathlib/blob/master/docs/theories/topology.md#file-organization\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/master/docs/theories/topology.md#file-organization\">https://github.com/leanprover-community/mathlib/blob/master/docs/theories/topology.md#file-organization</a> while writing this list? There may be a couple more items hidden there.</p>",
        "id": 181908491,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1574764494
    },
    {
        "content": "<p>I didn't read anything -- thanks for these. I knew I would have missed several things. I just had a free hour and thought \"I'm going to glance at every file\"</p>",
        "id": 181918010,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574772989
    },
    {
        "content": "<blockquote>\n<p>Ooops... you missed Hensel</p>\n</blockquote>\n<p>I am kind of stunned I missed p-adics and Hensel because in real life they're some of my favourite things, so I went back to find what I did wrong, and it was that I only glanced at <code>src/data</code> and decided that everything there looked too trivial to mention ;-) I remember distinctly looking at <code>pnat</code> and thinking \"nope\".</p>",
        "id": 181968784,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574806013
    },
    {
        "content": "<p>That <code>data</code> folder will remain a mystery to us, forever.</p>",
        "id": 181969974,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1574806956
    },
    {
        "content": "<p>What version of Hensel? The one in Bourbaki? Or just the one for the p-adics?</p>",
        "id": 181992122,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1574834004
    },
    {
        "content": "<p>We only have the p-adics, hence...</p>",
        "id": 181992942,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574835101
    },
    {
        "content": "<p>Well, actually, by now we have <code>local_ring</code> and <code>topological_space</code> and <code>topological_ring</code> and <code>complete_space</code>, so someone can do the more general version (-;</p>",
        "id": 181993012,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574835159
    },
    {
        "content": "<p>I think I even saw a branch <code>hensel-ring</code> flying around github</p>",
        "id": 181993213,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574835423
    }
]