[
    {
        "content": "<p>I knocked off a basic theory of nilpotent groups yesterday because I was talking about possible projects with an undergraduate and this was one (I thought I'd start them off). But the linter informs me that my predicate <code>is_nilpotent</code> on groups in the root namespace clashes with the predicate <code>is_nilpotent</code> on elements of rings (or more generally monoids with zero) also in the root namespace. Such is life -- but what do I do? Define <code>group.is_nilpotent</code>? The word nilpotent certainly means several (related, but not equal) things in mathematics.</p>",
        "id": 248324180,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628066561
    },
    {
        "content": "<p>Sorry, I put <code>is_nilpotent</code> into the global namespace! For what it's worth, I face the Lie algebra variant of your group problem and I just rely on namespacing <code>lie_algebra.is_nilpotent</code>.</p>",
        "id": 248327376,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1628068978
    },
    {
        "content": "<p>OK I'll put this stuff in the <code>group</code> namespace. Thanks!</p>",
        "id": 248327418,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628069013
    },
    {
        "content": "<p>I am not sure if this is a good idea, but could <code>is_nilpotent</code> be the <code>to_additive</code> version of <code>is_unipotent</code>?  In my mental picture, this captures most of the meaning of \"unipotent/nilpotent\", at least when applied to individual elements.</p>\n<p>This would also go well with a unipotent/nilpotent matrices.</p>",
        "id": 248329368,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1628070381
    },
    {
        "content": "<p>I think you're talking about nilpotent elements not nilpotent groups, and I think what you're suggesting will run into the issue that r^n=1 will be translated by to_additive as n \\bub r = 0 rather than r^n=0 :-)</p>",
        "id": 248330026,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628070852
    },
    {
        "content": "<p>Yes, I was indeed thinking about individual elements.  Also, you are right about the <code>pow/smul</code> issue.  I know that Floris has been updating <code>to_additive</code>, but I do not know if he tried to make this work as well...</p>",
        "id": 248334574,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1628074272
    },
    {
        "content": "<p>I believe that he got it working fine!</p>\n<p>I guess I mis-spoke -- I don't think r^n=1 is relevant here. What does unipotent mean to you? Do you just mean (r-1)^n=0? I am not sure that <code>to_additive</code> should be translating between nilpotent and unipotent elements, I think the relationship is more subtle. <code>to_additive</code> is performing the blanket isomorphism between group theory set up <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>×</mo></mrow><annotation encoding=\"application/x-tex\">\\times</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.66666em;vertical-align:-0.08333em;\"></span><span class=\"mord\">×</span></span></span></span> and group theory set up with <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo>+</mo></mrow><annotation encoding=\"application/x-tex\">+</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.66666em;vertical-align:-0.08333em;\"></span><span class=\"mord\">+</span></span></span></span>. The relationship between unipotent and nilpotent seems to me to be something to do with the much more subtle relationship between them, namely via <code>exp</code> and <code>log</code>, where these things are often not isomorphisms, but rather local isomorphisms where the interest is in higher-order effects (e.g. the Lie bracket comes from failure of commutativity of multiplication, pushed into an additive world via exp rather than by to_additive, and my feeling about the relationship between unipotent and nilpotent elements is that it's of a similar flavour.)</p>",
        "id": 248335070,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628074652
    },
    {
        "content": "<p>I think that you are right, Kevin: in my mind, I was thinking of <code>to_additive</code> as a magic wand that would convert <em>anything</em> multiplicative to <em>anything</em> additive, e.g. using <code>exp/log</code> when needed.</p>\n<p>My wishful thinking came about precisely because you mentioned nilpotency in the context of groups and right after, it was pointed out that there is nilpotency for Lie algebras.  Thus, I got to thinking: could the conversion between Lie groups and Lie algebras be automated (at least somewhat)?  And my mind very happily said \"there already is <code>to_additive</code>\"!</p>\n<p>I guess that there is the need for a <code>to_lie_algebra</code> tactic...</p>",
        "id": 248335821,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1628075153
    }
]