[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> I need degenerate triangles in a project I'm working on. What do you think about making <code>def simplex P n := fin (n + 1) → P</code>, <code>def simplex.independent (K : Type*) [...] (s : simplex P n) := affine_independent K s</code>?</p>",
        "id": 207729054,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598109990
    },
    {
        "content": "<p>This way we can have <code>△ A B C</code> and <code>simplex.map (s : simplex P1 n) (f : affine_map k P1 P2)</code> or even <code>simplex.map (s : simplex P1 n) (f : P1 → P2)</code>.</p>",
        "id": 207729358,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598110488
    },
    {
        "content": "<p>I don't see the advantage over the unbundled map when degenerate triangles are allowed. The point of <code>simplex</code> is for definitions such as <code>circumcenter</code> that need affine independence (so e.g. <code>centroid</code> is defined for an unbundled function, not for a <code>simplex</code>, because it doesn't need affine independence). Normally when a geometry problem refers to a triangle ABC, it definitely means a nondegenerate one (so with current definitions, you can either declare a hypothesis using <code>triangle</code> and then refer to A, B and C using <code>points</code>, or declare A, B and C as points and then assert <code>affine_independent ℝ ![A, B, C]</code>).</p>\n<p><code>map</code> is simply function composition when there is no requirement of affine independence. (With the present definition of <code>simplex</code> it would be meaningful to define <code>map</code> for an <em>injective</em> affine map, though we don't yet have a lemma to say that injective affine maps preserve affine independence.)</p>",
        "id": 207729949,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1598111619
    },
    {
        "content": "<p>There are quite a few theorems and definitions that don't need vertices to be independent: <code>face</code>, barycentric subdivision, subdivision of a triangle into 4 triangles with vertices A, B, C, and midpoints.</p>",
        "id": 207730513,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598112585
    },
    {
        "content": "<p>And in geometry sometimes it makes sense to consider degenerate triangles</p>",
        "id": 207730701,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598112774
    },
    {
        "content": "<p>For subdivisions we can prove theorems about unions and intersections of new simplexes</p>",
        "id": 207730702,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598112774
    },
    {
        "content": "<p>E.g., sometimes the following argument works: the main goal is to prove that some affine function is zero. We prove that it vanishes at many points, some of them correspond to degenerate configurations</p>",
        "id": 207730869,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1598113002
    },
    {
        "content": "<p>Those all seem like reasonable things to do with an indexed family of points, but we have several different ways to express such an indexed family already when affine independence is not of the essence for what you want to do with the points; <code>simplex</code> is for when it is of the essence and when having affine independence bundled is useful. (Bundled <code>face</code> allows convenient statements of the form \"the orthogonal projection of the circumcenter onto a face is the circumcenter of that face\". The unbundled version is function composition with <code>mono_of_fin</code>. Or a definition of <code>simplex.medial</code>, that bundles affine independence, would immediately give you <code>t.medial.circumcenter</code> as the nine-point center of a triangle <code>t</code>, without needing to pass affine independence hypotheses around separately.) An indexed family could be a plain function (possibly indexed by a <code>fintype</code>, possibly using a <code>finset</code> of the index type, if finiteness is needed, possibly using <code>fin</code> if it seems useful to bundle the number of points). Or it could be an <code>equiv</code> or <code>embedding</code> if those properties of the function seem important to bundle for particular uses.</p>\n<p>I don't know if there might be a use for additional bundled ways of talking about indexed families of points in an affine space (even if it's just another name for the unbundled function to allow some uses of dot notation), but I don't think having more such ways would take away the use of having a type for bundled affinely independent families with a given number of points (i.e. what <code>simplex</code> is at present).</p>",
        "id": 207736712,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1598121437
    }
]