[
    {
        "content": "<p>That's mostly an idle question, but isn't it kind of a historical artifact to see metric spaces as pertaining to topology?<br>\nI'm thinking e.g. of:</p>\n<ul>\n<li>For median spaces, graphs, convexity and friends, I don't think topology plays any role.</li>\n<li>Same for anything \"coarse-geometric\".</li>\n</ul>",
        "id": 314829937,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670569087
    },
    {
        "content": "<p>Do you think it should have its own top-level dir? Or be a subdir of analysis? Or another suggestion?</p>",
        "id": 314831196,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1670569835
    },
    {
        "content": "<p>I'd have it in its own top level dir, in the sense that it's neither a subfield of analysis, nor of topology, in my mind.</p>",
        "id": 314831417,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670569983
    },
    {
        "content": "<p>But maybe \"subfield\" is not actually the best organizing principle? I asked the question since given the port to mathlib4 (which I'd like to help with at some point), I was wondering if it might make sense to correct that while it's still feasible (if it really is still feasible _and_ reasonable).</p>",
        "id": 314831594,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670570090
    },
    {
        "content": "<p>The idea during the port is to change as little as possible. If a refactor is being considered then it should be either done in mathlib3 ASAP, or (once the rising tide has reached metric spaces) in both mathlib3 and mathlib4, or should wait until after the port is complete in hopefully a few months. The idea is that during the port mathlib3 and mathlib4 should not diverge at all</p>",
        "id": 314831989,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670570343
    },
    {
        "content": "<p>Ah, that makes sense: the point is to make the port as \"direct\" as possible?</p>",
        "id": 314832332,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670570580
    }
]