[
    {
        "content": "<p>As I've mentioned before, I've been working on an implementation of Hamming spaces (that is, spaces equipped with the Hamming metric/norm if appropriate). While it is possible to construct this using the L_1 norm and discrete metric, that isn't desirable for a number of reasons - you can define the metric much more generally, for instance, and in many ways the fact that it is integer-valued is significant: it also means it's naturally computable.</p>\n<p>Here's what I have so far:<br>\n<a href=\"https://gist.github.com/linesthatinterlace/9d13f7f13a9779e5986db573753741f7\">https://gist.github.com/linesthatinterlace/9d13f7f13a9779e5986db573753741f7</a></p>\n<p>I think this is nearing a PR, probably going under computability though I'm not sure about that. Some of the notions in computability (languages, encoding) are close to but not the same as notions in coding theory (which is the thing I'm really aiming to formalise some results for).</p>\n<p>I do have some issues. I've mentioned these in the file (and in previous messages) but to summarise:</p>\n<ul>\n<li>The lack of a \"normed monoid\" structure seems related to the fact that I seem to get odd possible-diamond related problems when defining a module structure for the Hamming space when the base space has monoid instances.</li>\n<li>\"normed space\" is not the appropriate notion for unifying module and metric behaviour here, but there are true results about the way they interact - e.g. <code>ham_dist_smul_le</code> in my file - that I can't seem to capture in any existing structure.</li>\n<li>Side point - the fact that there's no way of defining a norm on a non-commutative group feels very odd. This only slightly impacts this work but I did encounter it.</li>\n<li>I'm not sure if \"integer-valued metrics\" could do with their own definition, or if the type of the return values a metric/norm should be part of its type a la <code>valuation</code>, but the Hamming distance is just one of a number of metric or metric-like operations from computer science which are topologically equivalent to the discrete metric but which are nevertheless of significance.</li>\n</ul>\n<p>I would be interested in thoughts in these issues or others relating to the code I've posted above.</p>",
        "id": 286111669,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655230132
    },
    {
        "content": "<p>Can you please open a WIP or RFC pull request? Don't worry if it's not done yet!</p>",
        "id": 286112139,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1655230357
    },
    {
        "content": "<p>I am teaching a course about linear codes, so I am definitely interested in having this in Lean</p>",
        "id": 286112201,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1655230392
    },
    {
        "content": "<p>Ah, I can do! I thought it was good practice to ask for a bit of feedback before making a larger PR.</p>",
        "id": 286118480,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655233507
    },
    {
        "content": "<p>What do I do to mark it WIP/RFC?</p>",
        "id": 286118495,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655233517
    },
    {
        "content": "<p>There are <code>WIP</code> and <code>RFC</code> labels.</p>",
        "id": 286118716,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1655233613
    },
    {
        "content": "<p>bingo, ta.</p>",
        "id": 286118814,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655233668
    },
    {
        "content": "<p>Right, here we go.</p>",
        "id": 286121275,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655234863
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/pull/14739\">https://github.com/leanprover-community/mathlib/pull/14739</a></p>",
        "id": 286121279,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655234864
    },
    {
        "content": "<p>Riccardo, I would be super interesting in discussing what the definition of linear codes should be as I've been mulling a few options, but that's outside the scope of this.</p>",
        "id": 286121391,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1655234899
    }
]