[
    {
        "content": "<p>A conversation recently started on the metamath board about formalizing <a href=\"https://arxiv.org/abs/1312.7748\">Helfgott's proof</a> of the ternary goldbach conjecture. Could someone with some expertise in analytic number theory take a look at the proof and estimate what would be needed to formalize the paper part of the proof (for C large)? There are also <a href=\"https://arxiv.org/abs/1305.3062\">some tricks</a> used to reduce TGB &lt;= 10^30 to RH &lt;= 10^10, and then <a href=\"https://people.maths.bris.ac.uk/~madjp/thesis5.pdf\">more tricks</a> to prove RH &lt;= 10^10. Ignoring the computational aspect, how does a formalization of the TGB toolbox compare to, for example, the FLT toolbox?</p>",
        "id": 206246349,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799662
    },
    {
        "content": "<p>You're not going to be able to formalise the brute force computational search I shouldn't think -- this was in some sense one of the hardest parts of the proof and it's not formalised</p>",
        "id": 206246431,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596799717
    },
    {
        "content": "<p>It's never a brute force search with these things, that's the point</p>",
        "id": 206246449,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799748
    },
    {
        "content": "<p>I think Assia worked on some required integral estimates, and found a mistake that is fortunately not fatal.</p>",
        "id": 206246512,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596799803
    },
    {
        "content": "<p>To do the analysis part you're going to have to formalise the circle method I guess, and also have a way of rigorously computing integrals very accurately. Did you see <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span> 's talk on this?</p>",
        "id": 206246530,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596799811
    },
    {
        "content": "<p>you look at the numbers and see \"we checked TGB &lt;= 10^30\" and think \"gee that's a lot of horsepower\" but of course the these folks know how to do maths too and they use lots of tricks to bring them under the realm of feasibility</p>",
        "id": 206246539,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799816
    },
    {
        "content": "<p>yes but they're writing custom C++ code or whatever to do this part</p>",
        "id": 206246558,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596799841
    },
    {
        "content": "<p>Sure, but that's a problem I understand</p>",
        "id": 206246590,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799881
    },
    {
        "content": "<p>I want to know about the mathy parts</p>",
        "id": 206246600,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799891
    },
    {
        "content": "<p>like what do all these integrals have to do with ternary goldbach</p>",
        "id": 206246615,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799915
    },
    {
        "content": "<p>See page 19 of <a href=\"https://hal.inria.fr/hal-01630143v2/document\">https://hal.inria.fr/hal-01630143v2/document</a></p>",
        "id": 206246656,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596799924
    },
    {
        "content": "<p>how much work would it be to formalize the paper part of the proof?</p>",
        "id": 206246660,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799936
    },
    {
        "content": "<p>I have no doubt that it's possible to estimate integrals by a myriad of methods</p>",
        "id": 206246692,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596799992
    },
    {
        "content": "<p>oh boy, it depends on <a href=\"https://arxiv.org/pdf/1305.2897.pdf\">https://arxiv.org/pdf/1305.2897.pdf</a> which has another 80 pages of integrals</p>",
        "id": 206247326,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596800638
    },
    {
        "content": "<p>And <a href=\"https://arxiv.org/pdf/1205.5252.pdf\">https://arxiv.org/pdf/1205.5252.pdf</a>, another 80 pages</p>",
        "id": 206247395,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596800688
    },
    {
        "content": "<p>I think the author just had an 80 page limit and spread out the publications</p>",
        "id": 206247409,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596800705
    },
    {
        "content": "<p>I am a bit annoyed that I can't find Assia's video lecture which was given as part of Leroy's type theory lectures from 2018 -- links like <a href=\"https://www.college-de-france.fr/site/xavier-leroy/course-2018-11-28-10h00.htm\">https://www.college-de-france.fr/site/xavier-leroy/course-2018-11-28-10h00.htm</a> are not working for me. He gave a series of lectures and others gave some guest lectures -- Assia talked in part about Helfgott's estimate. But Patrick has posted a pdf now.</p>\n<p>Warning: I am not an expert.</p>\n<p>Helfgott's main contribution is to tighten up the arguments used (it has been known for nearly a century that all sufficiently large odd integers are the sum of three primes) until the estimates given by the techniques were sufficiently strong that the search space became (just) feasible. So really if you want to understand what is going on you may as well look at the original proofs e.g. Vinogradov's work from the '30s, which proved the result but with a much worse explicit bound. Helfgott \"just\" did the error estimates far far far more precisely.</p>\n<p>The idea is to come up with a function F(x) which is bounded below by a positive constant such that for n odd and sufficiently large, the number of ways expressing n as a sum of three primes is at least F(n). Here F is some kind of analytic function like N^2/(log N)^3. </p>\n<p><a href=\"https://en.wikipedia.org/wiki/Vinogradov%27s_theorem\">https://en.wikipedia.org/wiki/Vinogradov%27s_theorem</a></p>\n<p>Vinogradov used the circle method to get this estimate.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Hardy%E2%80%93Littlewood_circle_method\">https://en.wikipedia.org/wiki/Hardy%E2%80%93Littlewood_circle_method</a></p>\n<p>The idea here is very elegant -- it says that for the kind of functions which come up in this area, if you want to integrate them from 0 to 1 then you can break up the interval into two pieces -- the \"major arcs\" (which are small neighbourhoods of rational numbers with denominator bounded by some D) and the \"minor arcs\" (all the rest). By estimating the integral over the major and minor arcs you get bounds for the integral. The trick for estimating these things is basically to use Fourier inversion to interpret what's going on near a rational number as some contribution to a function from a period function with small period.</p>",
        "id": 206247802,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596801017
    }
]