[
    {
        "content": "<p>In <a href=\"https://leanprover-community.github.io/mathlib_docs/find/category_theory.full_subcategory\">docs#category_theory.full_subcategory</a>, a function <code>F : C → D</code> is used to specify the objects of the subcategory. What is the use case for having this instead of a subtype?</p>",
        "id": 264065391,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1638908172
    },
    {
        "content": "<p>You might not want to set up the objects of <code>C</code> as a literal <code>subtype</code> for whatever technical reason, for example<br>\n<a href=\"https://github.com/leanprover-community/mathlib/blob/ae7a88d1bf0fbd4978e6e0d20000a25712b94284/src/topology/category/CompHaus/default.lean#L35-L49\">https://github.com/leanprover-community/mathlib/blob/ae7a88d1bf0fbd4978e6e0d20000a25712b94284/src/topology/category/CompHaus/default.lean#L35-L49</a></p>",
        "id": 264066687,
        "sender_full_name": "Reid Barton",
        "timestamp": 1638908784
    },
    {
        "content": "<p><del>So <code>C</code> is perhaps carrying some extra structure which <code>F</code> loses but in general is helpful?</del> So <code>C</code> packages data more efficiently than passing via <code>F</code> to <code>D</code>?</p>",
        "id": 264067156,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1638909009
    },
    {
        "content": "<p>Usually <code>F</code> will be an injective function I think (though it doesn't have to be), it's just that in Lean we cannot replace an injective function \"for free\" with the inclusion of a subtype (<code>subtype.val</code>) like in ordinary math, so since the definition works exactly the same way with <code>F</code> in place of <code>subtype.val</code>, we might as well state it in \"extra generality\".</p>",
        "id": 264067770,
        "sender_full_name": "Reid Barton",
        "timestamp": 1638909334
    },
    {
        "content": "<p>The point is you might already have an idea of what the objects of <code>C</code> are meant to be, and that might not happen to be literally a <code>subtype</code> of the objects of <code>D</code>.</p>",
        "id": 264067876,
        "sender_full_name": "Reid Barton",
        "timestamp": 1638909371
    },
    {
        "content": "<p>Thanks.</p>",
        "id": 264068335,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1638909604
    },
    {
        "content": "<p><code>full_subcategory</code> is realized as a special case of <code>induced_category</code> in that file. Induced category structures may not come up often in mathematics, but in Lean they can be quite convenient. For example, if the subtype is the range of a function, it's much easier to work with the function directly than working with the range, which involves an existential quantifier and an equality. This happens for the subcategory of basic open sets inside the category of all open sets in the spectrum of a ring R; the set of basic opens is the range of the function sending r : R to D(r). In <a href=\"https://github.com/leanprover-community/mathlib/issues/9802\">#9802</a>, I need to work with B-sheaves, which are (contravariant) functors from the basic opens to a value category, and it turned out it's much easier to work with functors from R to the value category, where R is equipped with the induced category structure (from the category of open sets).</p>",
        "id": 264403145,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1639112051
    }
]