[
    {
        "content": "<p>I'm interested in capturing some abstract information around user interactions. Hypothetically lets say someone moves their mouse icon on an application. This application can read the position of the mouse and calculates it's 1) randomness and/or 2) energy. I'm not sure if either are different or the same. The idea - for me anyway - is to reflect the high intensity (moving back and forth quickly) as a value from 0 to 1 so I can us it to change something visually on the screen. How would I start to reason about this problem mathematically? And am I in the right place for these kinds of ideas?</p>",
        "id": 260350179,
        "sender_full_name": "Andre",
        "timestamp": 1636069802
    },
    {
        "content": "<p>Unless you have a theorem you want to prove about such things I don't think lean is likely to help you, although I suppose it can be helpful to get your thoughts in order on a mathematical topic once you have some familiarity with the tool. Mathematical modeling as it applies to programming is more a task for general computer science, not formalization</p>",
        "id": 260350655,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1636070172
    },
    {
        "content": "<p>Hm, do you want to build an application that executes such task? I'd recommend using Python and a lib called <a href=\"https://pythonhosted.org/pynput/\"><code>pynput</code></a></p>",
        "id": 260351046,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1636070419
    },
    {
        "content": "<p>Regarding a starting point for the mathematical underpinnings of energy and randomness I would suggest reading up on <a href=\"https://en.wikipedia.org/wiki/Entropy_(information_theory)\">information entropy</a>, and possibly <a href=\"https://en.wikipedia.org/wiki/Thermodynamic_temperature\">thermodynamic temperature</a>. The short answer is that yes, they are connected, and there is even a relatively straightforward equation to convert between information entropy and temperature</p>",
        "id": 260351367,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1636070649
    }
]