[
    {
        "content": "<p>At the <a href=\"https://www.icms.org.uk/bigproof.php\" target=\"_blank\" title=\"https://www.icms.org.uk/bigproof.php\">Big Proof 2</a> meeting, Marie Kerjean gave a <a href=\"https://www.irif.fr/~kerjean/slidesBigProof19.pdf\" target=\"_blank\" title=\"https://www.irif.fr/~kerjean/slidesBigProof19.pdf\">nice talk</a> about her proof of Hahn-Banach in Coq. She is a beginner who started to learn Coq/SSReflect only six months ago, as a post-doc working with <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span>. I thought it was a nice opportunity to learn how to translate from Coq to Lean, hoping she was not expert enough in SSReflect obfuscation to prevent me from understanding her code. For this experiment, I resisted the temptation to think about the proof, or to install Coq and watch the proof state evolving, I really followed the code, with only local adaptations. The original is at <a href=\"https://github.com/math-comp/analysis/blob/hb/hahn_banach.v\" target=\"_blank\" title=\"https://github.com/math-comp/analysis/blob/hb/hahn_banach.v\">https://github.com/math-comp/analysis/blob/hb/hahn_banach.v</a> (see also an <a href=\"https://www.irif.fr/~kerjean/TYPES19.pdf\" target=\"_blank\" title=\"https://www.irif.fr/~kerjean/TYPES19.pdf\">abstract</a>) and the translation at <a href=\"https://gist.github.com/PatrickMassot/328b58599618f8642da7fd45a5457f17\" target=\"_blank\" title=\"https://gist.github.com/PatrickMassot/328b58599618f8642da7fd45a5457f17\">https://gist.github.com/PatrickMassot/328b58599618f8642da7fd45a5457f17</a>. It took me about one day to do it, which I think is pretty encouraging. So there is hope to be able to port more things from mathcomp. </p>\n<p>I hope this can be used a Rosetta stone. But of course it would also be interesting to learn from the proof itself, and maybe find a better way. There are two main independent questions: how to use classical logic? how to handle partial function? In particular she uses <a href=\"https://github.com/math-comp/analysis/blob/hb/hahn_banach.v#L21-L27\" target=\"_blank\" title=\"https://github.com/math-comp/analysis/blob/hb/hahn_banach.v#L21-L27\">https://github.com/math-comp/analysis/blob/hb/hahn_banach.v#L21-L27</a> which is of course completely useless in Lean. Can we use the fact those things are more natural in Lean in order to make the proof nicer? About partial functions, the main trick of this formalization is to consider linear forms that are defined everywhere, but bounded only on a subspace, and handle partiality using relations. Could we use what <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> did when he worked on calculus for partial functions? Last note: the <a href=\"https://gist.github.com/PatrickMassot/328b58599618f8642da7fd45a5457f17#file-hahn_banach-lean-L298-L299\" target=\"_blank\" title=\"https://gist.github.com/PatrickMassot/328b58599618f8642da7fd45a5457f17#file-hahn_banach-lean-L298-L299\">statement</a> is cheating a bit because the map to be extended is assumed linear everywhere (but bounded only on a subspace of course). So, in order to get the math version, we would need to prove that linear forms on subspaces can be extended as linear forms.</p>\n<p>I hope some form of this can be PR'ed at some point, but let's discuss first.</p>",
        "id": 167489782,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559833424
    },
    {
        "content": "<p>Nice! Do you have a sense why your file is only 1/3 the length, if you were following the code? Is it that you found more prerequisites already available in mathlib, or was there genuinely some compression possible?</p>",
        "id": 167493600,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1559835761
    },
    {
        "content": "<p>Hi Scott ! One reason may be that our Coq proof spends some time proving a fixpoint lemma and Zorn (we wanted a new demonstration of Zorn using only  the axiom of choice in Prop).</p>",
        "id": 167493885,
        "sender_full_name": "Marie Kerjean",
        "timestamp": 1559835952
    },
    {
        "content": "<p>I see. Is there an axiomatic difference then in what Patrick did (pretending otherwise Lean and Coq have the same axioms?) Or did he already have that \"stronger\" version of Zorn available?</p>",
        "id": 167495113,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1559836795
    },
    {
        "content": "<p>Very nice! Except that the statement is not exactly the one we want, as you explain. To apply it to get the classical version, you would need to start from a linear functional on a subspace and extend it to the whole space, which means doing Zorn again (essentially with the same arguments except that you don't need to check the boundedness). I think a direct proof using just one Zorn instead of two would be more satisfactory (and shorter), but maybe harder to formalize?</p>",
        "id": 167496085,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1559837452
    },
    {
        "content": "<p>In fact I guess the very same proof works just under the assumption that the function is linear on the subspace. Then the extension problem becomes trivial (just put 0 or anything else outside).</p>",
        "id": 167500384,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1559840660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> Yes, indeed, that was the idea of the statement - any linear function on a subspace can be extended by 0 outside of this subspace. We should have commented that..</p>",
        "id": 167501783,
        "sender_full_name": "Marie Kerjean",
        "timestamp": 1559841704
    },
    {
        "content": "<p>In Patrick's version, <code>f</code> should be linear on the whole space, so he can't start from a linear functional on the subspace and extend it by 0 outside as this breaks linearity. What about your version?</p>",
        "id": 167502047,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1559841878
    },
    {
        "content": "<p>It's the same in Marie's version.  I thought she wanted to prove existence of supplement of subspaces (which is very much related, but not exactly the same, I think). But indeed we could probably modify the proof. Linearity outside the subspace can't be used in any serious way.</p>",
        "id": 167512170,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559847917
    },
    {
        "content": "<p>Scott, the difference is mainly Zorn. I also used <a href=\"https://github.com/leanprover-community/mathlib/blob/master/src/analysis/convex.lean#L567-L570\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/master/src/analysis/convex.lean#L567-L570\">https://github.com/leanprover-community/mathlib/blob/master/src/analysis/convex.lean#L567-L570</a>, and maybe a couple of other small lemmas from mathlib.</p>",
        "id": 167512348,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559848012
    },
    {
        "content": "<p>About the global linearity issue: Assia just fixed the Coq version <a href=\"https://github.com/math-comp/analysis/commit/c5c2cfdef78aee5b85dfc9e7ba576573afbdf0a9\" target=\"_blank\" title=\"https://github.com/math-comp/analysis/commit/c5c2cfdef78aee5b85dfc9e7ba576573afbdf0a9\">https://github.com/math-comp/analysis/commit/c5c2cfdef78aee5b85dfc9e7ba576573afbdf0a9</a></p>",
        "id": 167520684,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559853731
    },
    {
        "content": "<p>I'll fix my translation tomorrow if nobody does it while I sleep</p>",
        "id": 167520718,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559853777
    },
    {
        "content": "<p>But I'm still interested in more substantial improvements by experts here.</p>",
        "id": 167520851,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559853863
    },
    {
        "content": "<p>Just to mention, Zorn is already proven in Mathcomp Analysis (classical_sets) and we were just interested in another proof. As shown by Assia, requiring linearity on subspaces just asks for minor modifications, but it might change a few things concerning the application of HB thm to normed spaces which we formalized too.</p>",
        "id": 167523999,
        "sender_full_name": "Marie Kerjean",
        "timestamp": 1559856117
    },
    {
        "content": "<p>I updated my translation. Now the final statement is the reasonable one.</p>",
        "id": 167559315,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559897503
    }
]