[
    {
        "content": "<p>I was just searching for something else (Hales' question on some physics stackexchange site about formalising Yang-Mills; I can never find it (edit : <a href=\"https://physics.stackexchange.com/questions/339234/what-is-a-precise-mathematical-statement-of-the-yang-mills-and-mass-gap-clay-pro\">just found it</a>)) and I ran into <a href=\"https://publicationsthomashales.files.wordpress.com/2017/09/formal-abstracts-obergurgl-march-27-2017.pdf\">slides of a talk he gave in March 2017</a>, before I was in this game. A quote from it (last page):</p>\n<blockquote>\n<p>Formalizing statements in Automorphic Representation Theory (a branch of number theory).</p>\n<p>This will require a great deal of work just to state the theorems that are proved: algebraic geometry (schemes, motives, stacks, moduli spaces, and sheaves), measure theory and functional analysis, algebra (rings, modules, Galois theory, homological algebra, derived categories), category theory, complex analysis (L-functions and modular forms), class field theory (local and global), Lie theory and linear algebraic groups (Cartan classification and structure theory), representation theory (infinite dimensional, spectral theory), Shimura varieties, locally symmetric spaces, Hecke operators cohomology (singular, de Rham, intersectino homology, l-adic), rigid geometry, perfectoid spaces, ...</p>\n</blockquote>\n<p>I don't remember seeing this quote before, but I imagine that in 2017 it was in some sense written in jest. I now think that this looks like a long-term but feasible list. In three years we have made huge progress towards these goals in Lean and whilst some are clearly still a long way away, things are done, and things are in process, and I don't see why we can't go much further.</p>",
        "id": 198597470,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590350401
    },
    {
        "content": "<p>Page 4 is also worth a read :-)</p>",
        "id": 198597532,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590350428
    },
    {
        "content": "<p>On p17 Hales raises (if I understand correctly) the question as to whether categories of sheaves in HOL Light would have enough injectives.</p>",
        "id": 198597645,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590350593
    },
    {
        "content": "<p>I think it would take me about 10 minutes to show that an elementary topos has enough injectives in lean (if I'm understanding the definitions right) so I'm pretty sure we can get that result in lean</p>",
        "id": 198598280,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1590351506
    },
    {
        "content": "<p>I like the fact that Tom's list ends with perfectoid spaces.</p>",
        "id": 198598304,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1590351554
    },
    {
        "content": "<p>Yeah... we work from right to left (-;</p>",
        "id": 198633790,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1590382716
    }
]