[
    {
        "content": "<p>The PR <a href=\"https://github.com/leanprover-community/mathlib/pull/15026\">#15026</a> defines the height of a poset as the supremum (in <code>enat</code>) of the lengths of finite strictly increasing sequences. I have never studied any order theory, and I just want a way to do mathematically trivial calculations regarding heights of prime ideals, lengths of module etc. However, <span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> thinks that the current approach is weird, so I was wondering if there is a standard or a more general/sophisticated way to deal with these objects in order theory?</p>\n<p>There were some previous discussions <a href=\"#narrow/stream/217875-Is-there-code-for-X.3F/topic/Length.20of.20longest.20chain\">here</a>.</p>",
        "id": 289949999,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1658142430
    },
    {
        "content": "<p>I think the approach is fine, though it shouldn't be the only approach we eventually implement.</p>",
        "id": 289973956,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1658154956
    },
    {
        "content": "<p>The approach looks sensible to me - certainly on paper I'd expect to see extended naturals for this quantity. It's not too clear to me what's weird about this approach - or rather, what the advantage of specialising to finite orders is. Is the definition you currently have useful for your applications?</p>",
        "id": 290139657,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1658254554
    },
    {
        "content": "<p>Here's one example of extended naturals being used in literature: <a href=\"https://stacks.math.columbia.edu/tag/02I0\">https://stacks.math.columbia.edu/tag/02I0</a></p>",
        "id": 290139820,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1658254641
    },
    {
        "content": "<p>I think this will be useful for my applications, but I also agree that the things in mathlib should be done in the right generality, and I have no experience in order theory to judge. Hopefully Yaël could elaborate more on the caveats of this approach?</p>",
        "id": 290152071,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1658260424
    },
    {
        "content": "<p>When one is applying these ideas to ring theory <code>enat</code> should be fine. Typically if one is talking about chains of prime ideals one is in a situation where all chains are finite length (because one is not interested in the idea otherwise) so one possibility is doing <code>enat</code> and another possibility is that we assume Noetherian and then do everything in <code>nat</code>...</p>",
        "id": 290169162,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1658269534
    }
]