[
    {
        "content": "<p>So with <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>, <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> and myself there are now at least three people working towards some form of homological algebra. Maybe now would be a nice moment to create a \"project\" on the mathlib GitHub repo for homological algebra, similar to what we already have for analysis? This could help to avoid duplicate efforts. For example, now that regular monos are coming soon, I am interested in strong monomorphisms and strong epi-mono factorizations, and it would be nice to know whether anyone else is working on this, so that the work isn't done twice.</p>",
        "id": 190882983,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1584465906
    },
    {
        "content": "<p>I think this is a great idea. You know Scott has these mathlib branches which have been around for almost a year?! He wants to set up a general theory of enriched categories, and then define an additive category via being enriched over abelian groups, and then abelian categories on top of this. I think <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span> and <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> have also worked on homological algebra in the past, and <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span> also knows a lot about homological algebra in Lean.</p>",
        "id": 190888370,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1584468120
    },
    {
        "content": "<p>You may have seen already, but I've got regular epi-mono factorisations in locally cartesian closed categories with coequalizers, but other than that I don't imagine our topos theory project will have much overlap with what you're up to.</p>",
        "id": 190923385,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1584486972
    },
    {
        "content": "<p>I have created the project at <a href=\"https://github.com/leanprover-community/mathlib/projects/2\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/projects/2\">https://github.com/leanprover-community/mathlib/projects/2</a> and added some first cards. Please feel free to create issues and add them to the project. These issues could also be a good place to discuss design decisions before fully committing to some approach. For example, I would be very happy to hear your thoughts on <a href=\"https://github.com/leanprover-community/mathlib/issues/2178\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/issues/2178\">#2178</a> and <a href=\"https://github.com/leanprover-community/mathlib/issues/2179\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/issues/2179\">#2179</a>.</p>",
        "id": 190950394,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1584520559
    },
    {
        "content": "<p>There is also the homalg computer algebra package, based on GAP, that is programmed on a very categorical level:<br>\n<a href=\"https://homalg-project.github.io/\" target=\"_blank\" title=\"https://homalg-project.github.io/\">https://homalg-project.github.io/</a><br>\nThey have an appreciation of type theory.</p>",
        "id": 190968227,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1584531698
    }
]