[
    {
        "content": "<p>I am not used to tactic style proofs yet and I am wondering if a tactic style or (detailed) term style proof is considered more readable for an experienced user.<br>\nFurthermore, are proofs in the mathlib supposed to be easily readable or instead short and concise?<br>\nI think I understand dependent type theory in lean well enough to get started soon but I am struggling to understand the fundamentals of topological or measure spaces for example, as they are implemeneted in the mathlib.<br>\nDo people just remember all these small lemmas? Do you only look for a lemma when you need one?<br>\nThanks for the help.</p>",
        "id": 213645089,
        "sender_full_name": "Golol",
        "timestamp": 1602930016
    },
    {
        "content": "<p>That's a lot of questions at once - I guess one first thing to note is that readability <em>without the benefit of seeing the tactic state</em> (as you get when looking at a proof in vscode or emacs) is not considered important, so don't assume you can learn much from just looking at the code</p>",
        "id": 213645307,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1602930444
    },
    {
        "content": "<p>For the small lemmas, the idea is that the naming convention should be consistent enough that you can (mostly) guess the name of the lemma you need, and autocompletion can do the rest if needed. If that doesn't work, <code>library_search</code> and <code>suggest</code> can (sometimes) find relevant lemmas</p>",
        "id": 213645374,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1602930558
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/contribute/naming.html\">#naming</a></p>",
        "id": 213645441,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1602930633
    },
    {
        "content": "<p>Many of the topological space lemmas have very short proofs using filters. I tend not to look at proofs, if I need a lemma I guess its name and then find it with ctrl-space autocompletion</p>",
        "id": 213646054,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602931675
    },
    {
        "content": "<p>Okay guys, thanks for the information!</p>",
        "id": 213656479,
        "sender_full_name": "Golol",
        "timestamp": 1602947873
    },
    {
        "content": "<p>About readability: We try to make statements as readable as we can, but don't spend much efforts to make proofs readable.</p>",
        "id": 213661315,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1602955050
    },
    {
        "content": "<p>If you are struggling to understand the Lean definitions of concepts, your best bet is to read the documentation around it (module docs and doc strings). If they don't explain it well enough to you, <em>please</em> ask questions here, and once you understand what is going on, improve the doc strings!</p>",
        "id": 213661374,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1602955113
    }
]