[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"240862\">@Oliver Nash</span> I've been following your Lie PRs with curiosity, and I'm a big fan. Could you share in a couple of lines what kind of things you would like to aim for. E.g., may we dream of working towards the classification of semisimple Lie algebras?</p>",
        "id": 186163923,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1579596921
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> I'm very grateful for the numerous very helpful improvements that you and others have provided. I do have the semi-simple classification in mind but I've been telling myself just to aim for the statement for now, rather than the proof.</p>",
        "id": 186222347,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637693
    },
    {
        "content": "<p>Even the statement would be cool!</p>",
        "id": 186222400,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1579637722
    },
    {
        "content": "<p>I hope so :)</p>",
        "id": 186222405,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637728
    },
    {
        "content": "<p>I'm a differential geometer at heart though and I'd really like to define the Lie algebra structure on vector fields of a smooth manifold since IMHO until we have that, the tangent bundle is just another vector bundle but once we have that, we're really doing differential geometry.</p>",
        "id": 186222488,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637768
    },
    {
        "content": "<p>(Obviously this doesn't really need any Lie theory.)</p>",
        "id": 186222525,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637809
    },
    {
        "content": "<p>I actually tried this a week or two ago but I learned that there was a moderate amount of work to do even to prove that the continuous/smooth sections of the tangent bundle are an additive group, and that most of this should be done for vector bundles (not yet defined) so I backed off for the time being.</p>",
        "id": 186222595,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637867
    },
    {
        "content": "<p>So for now I'll probably just keep plugging away trying to get to the statement of the classification. I looked for the trace because I was thinking I should be able to state Cartan's criterion for semisimplicity etc.</p>",
        "id": 186222686,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637914
    },
    {
        "content": "<p>Unfortunately (for now) my day job takes up far more of my time than I'd like so my progress has been somewhat glacial but nevertheless, non-zero!</p>",
        "id": 186222790,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579637991
    },
    {
        "content": "<p>I really appreciate what you've done so far.</p>",
        "id": 186222882,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1579638037
    },
    {
        "content": "<p>Not at all, most fun I've had in years!</p>",
        "id": 186222897,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579638048
    },
    {
        "content": "<p>Well, perhaps I exaggerate, but I do enjoy it!</p>",
        "id": 186222917,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1579638060
    },
    {
        "content": "<p>I know the feeling. It's an open source project and people contribute when they have time. Thanks a lot!</p>",
        "id": 186232608,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1579643965
    }
]