[
    {
        "content": "<p>I have a reverse mathematics question for the algebraists:</p>\n<blockquote>\n<p>What are the weakest conditions on a ring <code>R</code> so that any linearly independent set in an <code>R</code>-module <code>M</code> has cardinality bounded by any basis for <code>M</code>?</p>\n</blockquote>\n<p>Currently in mathlib we just have this for <code>division_ring</code> (maybe that is even still in the <a href=\"https://bit.ly/3kaztxO\">#queue</a>, and we only have it for fields?)</p>\n<p>If you have a _finite_ basis, then any ring satisfying the strong rank condition has this property (proof: build a linear map R^i to R^b by taking coordinates of each element of the linearly independent set, show this is injective because the set is independent, and then by definition of the strong rank condition i &lt;= b) (EDIT: you need a tiny bit of extra work to show the linearly independent set must be finite, by showing any finite subset of it has bounded cardinality, before you can actually apply the strong rank condition).</p>\n<p>As a consequence, this is true (for finite bases) for any left-noetherian ring and any commutative ring.</p>\n<p>But what is true in the infinite case? I have no idea.</p>\n<p>(Relatedly, I've already got the proof that any basis has cardinality bounded by any spanning set, as soon as the ring satisfies the rank condition; so including all left-noetherian and all commutative rings, without any finiteness assumptions.)</p>",
        "id": 240796442,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622442598
    },
    {
        "content": "<p>An upper bound is that <code>R</code> is an integral domain, for finite bases: <a href=\"https://leanprover-community.github.io/mathlib_docs/find/basis.card_le_card_of_linear_independent\">docs#basis.card_le_card_of_linear_independent</a></p>",
        "id": 240807739,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622450951
    },
    {
        "content": "<p>Through ordinal induction, you can extend that to infinite bases too.</p>",
        "id": 240807911,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622451071
    },
    {
        "content": "<p>So for finite bases I've already extended it way beyond integral domains: all commutative rings and all left-noetherian rings.</p>",
        "id": 240808273,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622451324
    },
    {
        "content": "<p>Can you explain what the ordinal induction argument is? I don't see what to do.</p>",
        "id": 240808282,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622451336
    },
    {
        "content": "<p>Looking for a source right now...</p>",
        "id": 240808767,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622451633
    },
    {
        "content": "<p>Can't find it in Lang or Dummit &amp; Foote, but did find another way to do it: show that the rank of the <code>R</code>-module <code>M</code> agrees with the dimension (over <code>Frac(R)</code>) of <code>M \\otimes_R Frac(R)</code>, then use what we already have for division ring. My reference to \"ordinal induction\" is basically this but with the fractions inlined in the division ring proof.</p>",
        "id": 240809623,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622452207
    },
    {
        "content": "<p>See also this mathoverflow link with a good reference: <a href=\"https://mathoverflow.net/a/30369\">https://mathoverflow.net/a/30369</a></p>",
        "id": 240810052,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622452517
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span>, this argument is for arbitrary commutative rings, right?</p>",
        "id": 240812900,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622454437
    },
    {
        "content": "<p>I'm not so familiar with linear independence when there are zero divisors, so I can't say.</p>",
        "id": 240813185,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622454603
    },
    {
        "content": "<p>The paper that MO answer references is online at <a href=\"http://www.numdam.org/article/PSMIR_1973___4_A4_0.pdf\">http://www.numdam.org/article/PSMIR_1973___4_A4_0.pdf</a>.</p>",
        "id": 240813343,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622454711
    },
    {
        "content": "<p>My french is terrible, but I think it says <code>A</code> is any unital commutative ring (bottom of p.1), and has the claim that in an infinite free module, every maximal independent set has the same cardinality on p.4, as Section 2.1.</p>",
        "id": 240813528,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622454795
    },
    {
        "content": "<p>Yes, my rusty French agrees.</p>",
        "id": 240815448,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1622455964
    },
    {
        "content": "<p>Nice! Although he assumes he has a commutative ring, the argument actually only uses the strong rank condition.</p>",
        "id": 240815453,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622455969
    },
    {
        "content": "<p>Thanks very much for finding this, it's precisely what I wanted.</p>",
        "id": 240815473,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622455995
    },
    {
        "content": "<p>Bottom of page 1 says: We'll assume A commutative and unital. Recall that every basis of a free module M have the same cardinal.<br>\nSection 2.1 says: If M is an infinite dimensional free A-module, then all maximal independent sets have the same cardinal.<br>\nTell me if you need more translation <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 240820557,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1622459772
    },
    {
        "content": "<p>No, it's okay, I can read the proof myself, and I've written the four Lean statements corresponding to the steps. Maybe I'll prove them another day, though. :-)</p>",
        "id": 240822772,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622461314
    },
    {
        "content": "<p>I couldn't speak a word of intelligible French to save my life, but reading mathematical French is a fun puzzle. You get vague hints about the next step of the proof, work out what it has to be, then finish the translation based on the maths, then repeat on the next sentence.</p>",
        "id": 240822933,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1622461436
    },
    {
        "content": "<p>If you're stuck at some point, don't hesitate to ask here. Plenty of people could write a blueprint for you :-)</p>",
        "id": 240823165,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1622461595
    }
]