[
    {
        "content": "<p>Dear All,</p>\n<p>I am trying to fill in some of the API around linear_ordered_comm_group_with_zero, mostly to work with <code>nnreal</code>.  Essentially all the results could be phrased without using the commutativity assumption.  However, I cannot think of any example of a linearly ordered non-commutative group (with or without zero).</p>\n<p>Do you have any such example?  Should the theory assume <code>mul_comm</code>, even though it is not used?</p>\n<p>This feels something like Wedderburn's theorem on finite division algebras being commutative...</p>",
        "id": 235095521,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618775358
    },
    {
        "content": "<p>It seems other people have wondered about this too. <a href=\"https://mathoverflow.net/questions/4011/whats-a-non-abelian-totally-ordered-group\">https://mathoverflow.net/questions/4011/whats-a-non-abelian-totally-ordered-group</a></p>",
        "id": 235095983,
        "sender_full_name": "Hanting Zhang",
        "timestamp": 1618775881
    },
    {
        "content": "<p>Thanks for the link!  I will have to look at the examples carefully, but it seems that the class of <code>linearly_ordered_group</code> is justified.</p>\n<p>As I am wondering specifically about the class with zero, I will take a look at whether it is really justified to use it, or whether adding a zero is simply artificial.</p>",
        "id": 235096466,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776346
    },
    {
        "content": "<p>Follow up: any totally ordered division ring that is not s field?</p>",
        "id": 235096513,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776377
    },
    {
        "content": "<p>You'll have to decide whether you want it left-ordered, right-ordered or bi-ordered if you go down that route.</p>",
        "id": 235096514,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618776377
    },
    {
        "content": "<p>Ok, I will dig a little in the examples.  Note that I only really care about <code>nnreal</code>, for my intended application, so I may end up not defining any new class after all.</p>",
        "id": 235096579,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776472
    },
    {
        "content": "<p>If you're not an ordered-groupist then you are in a difficult position because how can you guess what the correct definition is in the non-commutative case?</p>",
        "id": 235096671,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618776519
    },
    {
        "content": "<p>Ok, I will simply assume commutativity and never use it, then!</p>",
        "id": 235096951,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776833
    },
    {
        "content": "<p>Thanks for the great answers, though!</p>",
        "id": 235096995,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776848
    },
    {
        "content": "<p>Out of interest, do you use both a&lt;b -&gt; ga&lt;gb and a&lt;b -&gt; ag&lt;bg?</p>",
        "id": 235097011,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618776875
    },
    {
        "content": "<p>I think that I never use both assumptions in the same proof.  Of course, I use one or the other, depending on asymmetric assumptions.</p>",
        "id": 235097053,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618776920
    },
    {
        "content": "<p>My question was mostly about how interesting was to have the left and the right version of some lemmas, given commutativity.  The answer seems to be that, in the future, someone might care.</p>",
        "id": 235097190,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618777050
    },
    {
        "content": "<p>... except possibly in the proof that <code>a^2=b^2 =&gt; a=b</code>.  I will check tomorrow.</p>",
        "id": 235097664,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618777455
    },
    {
        "content": "<p>I'm very conscious that my \"just do what you need to do\" approach has its disadvantages -- e.g. we don't have ideals for non-commutative rings precisely because I didn't know whether <code>ideal</code> should mean <code>left_ideal</code> or <code>right_ideal</code> or <code>bi_ideal</code> in the noncommutative case but I <em>really</em> wanted ideals so just pushed for a theory of ideals for commutative rings, and now we have people like <span class=\"user-mention\" data-user-id=\"317890\">@Julian Külshammer</span> saying that they cannot do the stuff they want to do in Lean because we made some not-general-enough design decisions a long way back, which are difficult to change. They're not impossible to change (indeed Sebasti\\'en just showed us that we can change the definition of a monoid and then edit 100+ files and make it work) but it's certainly nontrivial.</p>",
        "id": 235097866,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618777632
    },
    {
        "content": "<p>However I am pretty sure that the number of people who study ideals in noncommutative rings is rather larger than the number of people who study noncommutative ordered groups...</p>",
        "id": 235097895,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618777677
    },
    {
        "content": "<p>You would be surprised by the number of mathematicians having something to do with orders on groups. For instance, many people doing dynamics in low dimensions need this a lot (if you can realise a group as a subgroup of increasing homeomorphisms of the real line, then it is orderable, so if you know that a group is not orderable this is saying something about its complexity).</p>",
        "id": 235099151,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1618778697
    },
    {
        "content": "<p>(This shows up also in geometry, in logic, and so on)</p>",
        "id": 235099279,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1618778769
    },
    {
        "content": "<p>do you mean left orderable or bi-orderable? ;-)</p>",
        "id": 235099364,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618778833
    },
    {
        "content": "<p>Both, of course, depending on the precise theorem you're stating!</p>",
        "id": 235099383,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1618778867
    },
    {
        "content": "<p>Just the unrelated side note, that <code>bi_ideal</code> means yet something else: <a href=\"https://ncatlab.org/nlab/show/biideal\">https://ncatlab.org/nlab/show/biideal</a>. You mean two-sided ideal.</p>",
        "id": 235103477,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1618781486
    },
    {
        "content": "<p>Ok, given the turn that this conversation has taken, I am now thinking that <code>linear_ordered_comm_group(_with_zero)</code> are good names, since they represent the \"correct\" concept.  Possible the more common mathematical name would be <code>linear_bi_ordered_comm_group(_with_zero)</code>, but this would simply be a matter of changing the <em>name</em>,  not the substance.</p>\n<p>I am thinking, though, that it might make sense to introduce <code>left/right_ordered_group(_with_zero)</code> and make <code>linear_ordered_comm_group</code> extend <code>left_ordered_group(_with_zero)</code>, similar to what happened with the <code>(left/right_)cancel_comm</code> stuff, that I could get to the bottom of thanks to Eric and Yury's help.</p>",
        "id": 235136513,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1618815817
    }
]