[
    {
        "content": "<p>I find the page <a href=\"https://leanprover-community.github.io/install/linux.html\">here</a> (and the variant for Debian derivative) as bit deceptive: it's mostly about installing elan, mathlibtools and vscode+lean extension. It doesn't really install what it's about!</p>\n<p>I installed lean in my homedir with \"elan default stable\"... mostly unusable: no mathlib.</p>\n<p>I then created a directory and started a leanproject in there, and it did download mathlib. In the directory, not my homedir, so if I try to make various experiments, that means massive duplication (700M!). As a comparison, I have coq installed from packaging and I have dozen of separate 4k-files.</p>\n<p>Is there a way to install mathlib along the lean toolchain so it's of more general use? Did I miss a better documentation?</p>",
        "id": 315367700,
        "sender_full_name": "Julien Puydt",
        "timestamp": 1670852040
    },
    {
        "content": "<p>There is no real \"mathlib installation\", what we usually do is <code>leanproject new your_project</code>. Then, <code>leanproject</code> creates a folder <code>your_project</code> with mathlib inside.</p>",
        "id": 315369293,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1670852408
    },
    {
        "content": "<p>Mathlib gets a new version several times a day, so having a global mathlib is essentially useless because most projects depend on a slightly different version. Personally I have a \"draft\" project in which I make all of my testing, which use a common mathlib. But apart from that, each project having its own mathlib directory is essentially the only possible way right now</p>",
        "id": 315369313,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1670852416
    },
    {
        "content": "<p>The reason is that mathlib change super quickly, so the usual way of installing a software is not really adapted to it.</p>",
        "id": 315369420,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1670852453
    },
    {
        "content": "<p>If you follow two links from that webpage you'll find <a href=\"https://leanprover-community.github.io/leanproject.html#global-mathlib-install\">https://leanprover-community.github.io/leanproject.html#global-mathlib-install</a> explaining how to get a global mathlib install, but it is indeed a very bad idea (and this explain why the corresponding documentation is somewhat hidden).</p>",
        "id": 315370086,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1670852682
    },
    {
        "content": "<p>I found that, for the kind of usage that does not need to care about mathlib updates, the <code>trylean</code>approach works very well.</p>",
        "id": 315414050,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1670864349
    }
]