[
    {
        "content": "<p>As part of my order/category series, I'm considering formalizing modal algebras and interior (aka S4) algebras, just so that people know.</p>",
        "id": 270991145,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644246381
    },
    {
        "content": "<p>Why don't you do things which regular mathematicians have heard of instead of arbitrary low-level objects which nobody will ever use?</p>",
        "id": 271001721,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644250413
    },
    {
        "content": "<p>You are so insanely productive and helpful, I want to drive you in the right direction :-)</p>",
        "id": 271001843,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644250458
    },
    {
        "content": "<p>If you want to do something spectacular, prove that a topological space is spectral iff it's isomorphic to Spec of a ring. If you want to do something more mundane but still helpful then there's chapter 3 of <a href=\"https://arxiv.org/abs/1910.05934\">https://arxiv.org/abs/1910.05934</a> (skipping this part); all of this stuff about spectral spaces is important in other areas.</p>",
        "id": 271002458,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644250648
    },
    {
        "content": "<p>My original goal is actually to prove that a topological space is spectral iff it's isomorphic to the spectrum of a lattice, which is closely related. I thought I would immerse myself in this area of maths by defining related stuff as I read about it and, well, I read about modal algebras :^)</p>",
        "id": 271105224,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644314796
    },
    {
        "content": "<p>I understand I am very new to all this math, so I can't judge what's important. If you tell me to work on spectral spaces, I will work on spectral spaces.</p>",
        "id": 271105470,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644314919
    },
    {
        "content": "<p>(but I'll probably keep doing sporadically one-day write ups about random bits of maths because it's just too fun!)</p>",
        "id": 271105559,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644314977
    }
]