[
    {
        "content": "<p>I'd like to define modular lattices (to talk about modules), and I'd like to know whether modular-ness should be a mixin. So far, everything to do with lattices (including the <code>distrib_lattice</code> property) includes a new lattice structure, except for the mixin I defined, <code>is_simple_lattice</code>.</p>",
        "id": 221376086,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609546702
    },
    {
        "content": "<p>I’m thinking yes, it should be a mixin, unless there’s some more complicated notion of completely modular lattice, analogous to <code>complete_distrib_lattice</code></p>",
        "id": 221376652,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609547778
    },
    {
        "content": "<p>It appears there is such a notion, and it does look pretty fiddly... <a href=\"https://encyclopediaofmath.org/wiki/Complete_Dedekind_lattice\">https://encyclopediaofmath.org/wiki/Complete_Dedekind_lattice</a></p>",
        "id": 221377131,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609548662
    },
    {
        "content": "<p>Modular lattices form a  variety, so you can define them using a set of equations.  In fact, the book on universal algebra by Burris and Sankappannavar (among others) shows a single equation that characterizes all modular lattices.  I'm new to lean, so I'm not sure what is a \"mixin\", and I don't know what you mean by a \"new lattice structure\", but my intuitive idea of what you mean is that you may be concerned about the language for these structures.  To me the most natural language for lattices is the same as for modular lattices, just like for distributive lattices, so I tend to think \"no\".  If I'm misunderstanding your question, please let me know,  as I would like to learn more about this particular part of lean, since I have worked in lattice theory.</p>",
        "id": 221810172,
        "sender_full_name": "Matt Insall",
        "timestamp": 1609960857
    },
    {
        "content": "<p>\"mixin\" is a technical thing we use in Lean in order to add axioms to structures in some cases. For example a commutative ring is an additive group and a multiplicative monoid together with some relation between + and *, namely distributivity. In Lean 3 there is a crazy object called a <code>distrib</code> which is just an object with a + and a * satisfying _only_ distributivity, and it's used in the definition of a ring.</p>",
        "id": 221810803,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609961183
    },
    {
        "content": "<p>Aaron's modular lattice PR: <a href=\"https://github.com/leanprover-community/mathlib/issues/5564\">#5564</a>. Comments and additional reviews welcome, particularly if you know the math!</p>",
        "id": 221813124,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1609962352
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"123965\">Bryan Gin-ge Chen</span> <a href=\"#narrow/stream/116395-maths/topic/Modular.20Lattice/near/221813124\">said</a>:</p>\n<blockquote>\n<p>Aaron's modular lattice PR: <a href=\"https://github.com/leanprover-community/mathlib/issues/5564\">#5564</a>. Comments and additional reviews welcome, particularly if you know the math!</p>\n</blockquote>\n<p>Thanks for linking</p>",
        "id": 221816091,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609963678
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"376762\">Matt Insall</span> <a href=\"#narrow/stream/116395-maths/topic/Modular.20Lattice/near/221810172\">said</a>:</p>\n<blockquote>\n<p>Modular lattices form a  variety, so you can define them using a set of equations.  In fact, the book on universal algebra by Burris and Sankappannavar (among others) shows a single equation that characterizes all modular lattices.  I'm new to lean, so I'm not sure what is a \"mixin\", and I don't know what you mean by a \"new lattice structure\", but my intuitive idea of what you mean is that you may be concerned about the language for these structures.  To me the most natural language for lattices is the same as for modular lattices, just like for distributive lattices, so I tend to think \"no\".  If I'm misunderstanding your question, please let me know,  as I would like to learn more about this particular part of lean, since I have worked in lattice theory.</p>\n</blockquote>\n<p>Either way, it's going to start with the regular language for lattices. The question is whether the actual Lean code for introducing a modular lattice will look like <code>[lattice α] [is_modular_lattice α]</code> (the mixin, this is the version in my PR) or <code>[modular_lattice α]</code> (a whole other name, but still defines all the usual <code>lattice</code> operations on <code>α</code>.)</p>",
        "id": 221816621,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609963919
    },
    {
        "content": "<p>It's probably worth mentioning that my PR on modular lattices is depending on another PR of mine on order theory, <a href=\"https://github.com/leanprover-community/mathlib/issues/5493\">#5493</a> (although this is probably near the end of its reviewing process).</p>",
        "id": 221817852,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609964478
    },
    {
        "content": "<p>Aaron, like I said I'm new to lean, and being not a programmer, I'm more comfortable with natural language instead of code, but from the little bit I gathered here, introducing something using \"mixin\" means that the resulting structure is an expansion of the original, or equivalently, that the original is a reduct of the result.  That's not the case for modular lattices, so I don't see why using \"mixin\" would be efficient.  Another way I could have said what I said before is that modular lattices form a subvariety of the variety of lattices.  </p>\n<p>On the other hand, bounded lattices do not form a subvariety of the variety of lattices, so in order to specify them, the philosophically nore cogent approach to introducing those lattices would to me include using \"mixin\", if I'm understanding that correctly, because a \"lattice that has an element greater than all the others and has an element that is less than all of the others\" is categorically distinct from a \"bounded lattice\", whose specification language needs two constant terms (one for the top element and another for the bottom element) not in the language for lattices, in order to see that bounded lattices form a variety, even though they don't form a subvariety of the variety of lattices. </p>\n<p>I may be barking up the wrong tree here, but even in the informal literature, the notions this that I discuss above lead to confusion if not dealt with carefully.</p>",
        "id": 221982774,
        "sender_full_name": "Matt Insall",
        "timestamp": 1610044817
    }
]