[
    {
        "content": "<p>A quick question regarding naming in mathematical subfields.</p>\n<p>We may soon introduce the \"commutant\" of a subalgebra of B(H) (bounded operators on Hilbert space), and the notion of a \"factor\" (a von Neumann algebra with trivial center).</p>\n<p>Of course, in the wider mathematical world there are already perfectly good names for these notions (\"centralizer\" and \"simple\" respectively).</p>\n<p>Should we aim for internal uniformity, or consistency with the literature?</p>",
        "id": 273562719,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1646086799
    },
    {
        "content": "<p>My instinct in this case is to go for consistency with the literature. It's not the case that we can simply reuse the existing definitions (e.g. because we need to say the structure that the commutant has, i.e. a von Neumann algebra).</p>",
        "id": 273562920,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1646086856
    },
    {
        "content": "<p>Uniformity can be partially addressed by copious doc-comments.</p>",
        "id": 273562943,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1646086869
    },
    {
        "content": "<p>When making discrete valuation rings (DVRs) I wanted to define <code>uniformiser</code> to be consistent with the literature, but we already had <code>irreducible</code> which for DVRs is the same thing. So I went with an abbreviation.</p>",
        "id": 273570569,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1646091624
    },
    {
        "content": "<p>Currently <code>centralier</code> is defined on a set, not a subalgebra. Is that the easy way out here, have <code>X.commutant</code> defined as <code>centralizer (coe X)</code>, which enables dot notation too?</p>",
        "id": 273571904,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1646092634
    },
    {
        "content": "<p>My instinct says that we should follow the literature, and point out the connections to other notions in the docstrings.</p>",
        "id": 273609195,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1646125709
    }
]