[
    {
        "content": "<p>Hi, </p>\n<p>Assuming the message below states a consensual opinion, should people ideally stop submitting PRs to mathlib3 and help with the port effort?<br>\nI've got quite a few PRs waiting and a few in the pipeline too, but if it's going to get increasingly harder to get them approved, and in some sense unwelcome, then I'd rather know and help with the effort.<br>\nAt what point could one start making PRs to mathlib4 only?</p>\n<p>Thanks!</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2317832/near/315247798\">said</a>:</p>\n<blockquote>\n<p>I'm sorry for the delay <span class=\"user-mention silent\" data-user-id=\"479359\">Michael Stoll</span> . More and more people coming to the opinion that mathlib3 PRs (other than those which actively help with the port to mathlib4) are in some sense now a step in the wrong direction; maintainers are spending less time reviewing mathlib3 PRs and more time porting files to mathlib4. Any new PR to mathlib3 is just making the port harder. In a parallel universe mathlib3 got frozen and no more PRs are now allowed; right now we're trying not to freeze it and port it simultaneously, and we're still just about managing to do this, but already some PRs were  drowned by the rising tide, and the situation will only get worse as the tide rises further. The problem is that mathlib3 is kind of a cool hobby for lots of people, but a bunch of people are planning on teaching using mathlib4 in January, so there are some very concrete porting goals which need to be focussed on by the community which is driving resources away from mathlib3.</p>\n</blockquote>",
        "id": 315292148,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670823771
    },
    {
        "content": "<p>If you want to help with the port, then you are very welcome to do so, the wiki page <a href=\"https://github.com/leanprover-community/mathlib4/wiki/Porting-wiki\">https://github.com/leanprover-community/mathlib4/wiki/Porting-wiki</a> provides good information on how to do the porting and there is a (slightly out of date) video by Scott.</p>",
        "id": 315292861,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1670824343
    },
    {
        "content": "<p>I'd have to check now that <code>data.set.basic</code> is merged, but I'm not sure there are enough files available for porting right now to have everyone work on that yet. Still, we might get to that point sooner than later</p>",
        "id": 315296033,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1670826005
    },
    {
        "content": "<p>I should say that I am not a maintainer and my \"every PR to mathlib3 unrelated to the port is a step in the wrong direction\" claim is just my personal opinion</p>",
        "id": 315302741,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670829789
    },
    {
        "content": "<p>We haven't made a decision that we want no more Mathlib3 PRs (yet, anyway) but help with the port is definitely preferable to PRs to Mathlib3.</p>",
        "id": 315310723,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1670833389
    },
    {
        "content": "<p>Besides the docs on <em>how</em> to port, is there any resource on <em>what</em> to work on? I'm aware of the dependency graph, but is there some kind of \"first-issue\" kind of things to take a stab at?</p>",
        "id": 315314800,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670834767
    },
    {
        "content": "<p>See <a href=\"https://math.commelin.net/files/port_status.html\">#port-status</a></p>",
        "id": 315315044,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1670834868
    },
    {
        "content": "<p>In my experience, a good \"first issue\" is to port a file which you understand the contents of!</p>",
        "id": 315316841,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1670835497
    },
    {
        "content": "<p>something nice would be to have a way to filter for files which are not modified by a current PR of mathlib 3. I've had an <del>few</del> instance<del>s</del> of a PR getting bors' greenlight only to get \"merge conflict\" later on because someone ported the file in the meantime.</p>",
        "id": 315317116,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670835620
    },
    {
        "content": "<p>Yes, having a list of \"active mathlib3 PRs touching this file\" visible on <a href=\"https://math.commelin.net/files/port_status.html\">#port-status</a> would help a lot here</p>",
        "id": 315327753,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1670839456
    },
    {
        "content": "<p>I'm pretty confident that we now have more parallel tasks available than people actively working on the port, and I expect this to stay true.</p>",
        "id": 315328712,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670839758
    },
    {
        "content": "<p>I posted some advice on identifying the most important tasks <a href=\"#narrow/stream/287929-mathlib4/topic/port.20progress/near/315325863\">here</a>.</p>",
        "id": 315328786,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670839789
    },
    {
        "content": "<p>And yes, from a long-term point of view, I think that anyone who is interested/willing to work on either mathlib3 or mathlib4, should choose to work on mathlib4.</p>",
        "id": 315329095,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670839884
    },
    {
        "content": "<p>If you are a mathlib maintainer and haven't yet merged any mathlib4 PRs, it's time to get up to speed on that. :-)</p>",
        "id": 315329175,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1670839917
    },
    {
        "content": "<p>I have an open PR for mathlib3, adding new content. Would it be helpful to port it to mathlib4 and PR it there instead? I don't think it relies on anything major except for the definition of primes and Fermat's Little Theorem. In other words, does mathlib4 accept new theories and things that aren't ported?</p>",
        "id": 315454529,
        "sender_full_name": "Niels Voss",
        "timestamp": 1670876633
    },
    {
        "content": "<p>Neither of those things is ported yet, so probably PR it to mathlib.</p>",
        "id": 315455298,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1670876852
    },
    {
        "content": "<p>Can I ask for an update on the same question that <span class=\"user-mention\" data-user-id=\"461830\">@Rémi Bottinelli</span> asked a month ago? Are new mathlib PR's still welcome, or should those of us who aren't able to contribute to the porting effort put our contributions on hold until the port is complete?</p>\n<p>I'm asking because I have been working for some while on proving a fairly big theorem in analytic number theory -- the analytic continuation and functional equation of the Riemann zeta function -- which <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  and others had led me to believe would be welcomed in mathlib. Sadly, this seems to be nearing completion just as the door is closing for new mathlib3 contributions. It's a bit harsh to be told after several months of work that one's efforts are \"a step in the wrong direction\". <span aria-label=\"frown\" class=\"emoji emoji-1f641\" role=\"img\" title=\"frown\">:frown:</span></p>\n<p>My project uses a pretty wide range of stuff from all over mathlib (measure theory, complex analysis, etc); so it will be months before the prerequisites are ported to mathlib4, even at the current impressive rate of porting progress -- I gather mathlib4 doesn't even have real numbers yet. This also means that I'm unable to contribute anything meaningful myself to porting, since the only mathlib files I feel I understand are far higher up the import hierarchy than the porting project has yet reached. So what should I do with my nearly-complete project? </p>\n<ul>\n<li>Put it on ice for now, and wait (potentially many months) until mathlib4 catches up with its prerequisites?</li>\n<li>Make mathlib3 PR's, and run the risk that no maintainer has time to look at them because they're all busy on the port?</li>\n</ul>\n<p>Some general guidance on this would be appreciated. I'm sure I'm not the only contributor to mathlib who is finding the current situation a bit puzzling and frustrating.</p>",
        "id": 319807529,
        "sender_full_name": "David Loeffler",
        "timestamp": 1673020264
    },
    {
        "content": "<p>The second option will definitely be faster, but probably still quite frustating.</p>",
        "id": 319807874,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673020378
    },
    {
        "content": "<p>I personally still very much review mathlib PRs, and a few other reviewers too: Eric, Anne, Yury...</p>",
        "id": 319808036,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1673020427
    },
    {
        "content": "<p>I think it really depends on you medium/long term goals. Of course we really want analytic continuation of the zeta function in mathlib sooner or later, it is an impressive result!</p>\n<p>Are you interested in learning lean 4? If yes you can just help with the port and at some point run mathlibport on your project (hopefully it will work even better than today), so the only problem is that you result is not in \"official\" mathlib, but you can of course publish it on github. Note that updating mathlib is now a fairly easy job, since the rate of accepted PR is quite small.</p>\n<p>You can also start opening small PRs, but if you modified already ported files you'll have to learn a little bit of Lean 4 anyway. In any case I think you should make the result public as soon you feel is ready, in mathlib or not it's not very important at the moment.</p>",
        "id": 319809081,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1673020718
    },
    {
        "content": "<p>Currently what I am doing with my own projects and those of my students is to wait for the port to catch up and then I will use mathport to translate them, as Riccardo mentioned. It's not ideal, but hopefully it will all be over after several months.</p>",
        "id": 319810324,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1673021071
    },
    {
        "content": "<p>In any case case porting is much easy that writing from scratch, so I wouldn't say that this was a step in the wrong direction!</p>",
        "id": 319810689,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1673021173
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 319810792,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1673021214
    },
    {
        "content": "<blockquote>\n<p>I wouldn't say that this was a step in the wrong direction!</p>\n</blockquote>\n<p>I didn't say it -- that was a direct quote from <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>'s post quoted by Remi at the start of this thread.</p>",
        "id": 319810907,
        "sender_full_name": "David Loeffler",
        "timestamp": 1673021248
    },
    {
        "content": "<p>From personal experience (since I got @'ed ): helping porting files to mathlib4 is really quite straightforward in the cases I dealt with, so I'd suggest giving that a go; and you get to see new landscapes closer to the foundations of mathlib, which is quite fun.<br>\nAs for PRs to mathlib3, it definitely feels a bit like swimming against current in some cases, and the policy of keeping ported files in sync makes you think twice before doing a PR on such a file. I guess it depends a lot on what you're working on and the attitude of the maintainer at the other end of the PR.</p>",
        "id": 319811115,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1673021298
    },
    {
        "content": "<p>David, note that Kevin was specifically talking about <em>PRs</em>. Working with Lean 3 with mathlib is certainly fine, and we'll <em>definitely</em> want the results in mathlib at some point, it's just that now might not be the best time to PR and merge them. I'm sure <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> wouldn't argue that the work you've undertaken was a step in the wrong direction.</p>",
        "id": 319811758,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1673021504
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"481963\">David Loeffler</span> <a href=\"#narrow/stream/116395-maths/topic/No.20more.20PRs.3F/near/319807529\">said</a>:</p>\n<blockquote>\n<p>Some general guidance on this would be appreciated. I'm sure I'm not the only contributor to mathlib who is finding the current situation a bit puzzling and frustrating.</p>\n</blockquote>\n<p>Since your project is very much ahead of the tide, I think it's perfectly fine to go on making PRs with the new material if it doesn't touch basic files. And if you ping me I'll try to review them quickly, to make sure that everything has the time to go through before the switch.</p>",
        "id": 319812617,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1673021787
    },
    {
        "content": "<p>OK, so it seems that I was reading too much into Kevin's \"step in the wrong direction\" comment; I see now that it was extracted from a discussion about <a href=\"https://github.com/leanprover-community/mathlib/pull/17832\">#17832</a>, which modifies the very low-level file <code>data.list.basic</code>, a very different scenario to my project. It is good to know that PR's are still welcomed for stuff higher up the import hierarchy.</p>",
        "id": 319817806,
        "sender_full_name": "David Loeffler",
        "timestamp": 1673023390
    },
    {
        "content": "<p>That's right. I think that PRs that touch low-level files probably should only be happening if the authors know enough to know that this will help the port, rather than hinder.</p>\n<p>If you're only working on advanced material, and in particular if you're proving cool theorems, please keep PRing!</p>\n<p>It's a balancing act, obviously, but we really don't want to squash people's enthusiasm for doing maths in Lean. :-)</p>",
        "id": 319896108,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1673059278
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"481963\">@David Loeffler</span> and sorry for the delay (start of term).</p>\n<p>I think that formalising mathematics is a step in the right direction. I think that <em>in general</em> making more Lean 3 PRs is a step in the wrong direction, but I also think that it's rather more nuanced than that. I think that me saying out loud \"making more Lean 3 PRs is a step in the wrong direction\" is quite a good way of beginning to deal with the issue that we have over 500 mathlib3 PRs and a few months ago they were still pouring in at a terrifying rate.</p>\n<p>In a parallel universe, the mathlib maintainers decided that porting and growing at the same time was not feasible, and announced a freeze on all mathlib3 PRs. In fact this might still happen, although I am now beginning to believe that it won't.</p>\n<p>You are not the only person who is in the middle of PRing a big project -- indeed there are people who I \"manage\" (PhD students and post-docs) in the same situation. The reason I'm not too bothered about the situation is that I am convinced that ultimately their projects and yours will end up in mathlib4 somehow, although I am unclear whether the route is \"PR to mathlib3 and then get them ported\" or \"wait until the port is done and then autotranslate them and PR them to mathlib4\" or perhaps a combination of the two. </p>\n<p>I believe that porting files from lean 3 to lean 4 will get easier, and by the time mathlib is ported it shouldn't be too difficult to start porting other things (like random PRs to mathlib4 which haven't been merged yet).  I do think that it's temporarily a difficult situation right now. But I do wonder whether the general lack of reviewers will discourage people who just want to fiddle, or add a couple of lemmas, and that ultimately what will happen will be that it will just be people working on big projects who get attention (e.g. I might well go back to mathlib3 PR reviewing but might just review stuff in my own area or by people who I believe need encouraging).  To prove that right now it is still possible to get big projects into mathlib, the final PR of Oliver Nash's work proving the theorem of Gallagher which pertained to some of Maynard's work just made it into mathlib last week.</p>",
        "id": 320229392,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1673271904
    }
]