[
    {
        "content": "<p>Hello, I am working in mathematicial analyis, hyperbolic non-linear PDE to be precise and therefore I have little knowledge of formal proof checkers. (More than 10 years ago I looked a bit into Isabelle but forgot almost everything). I learned about lean in an article about the successful confirmation of a proof of Peter Scholze. So I am curious, sometimes proofs for showing global existence for (classical) solutions of non-linear PDE can be quite sophisticated. Is there any project, any material, in lean trying to provide support for these sort of questions? What I have found so far only concerned, logic, set theory, etc but not really analysis. Can anybody enlighten me please. Regards Uwe Brauer</p>",
        "id": 250262417,
        "sender_full_name": "Uwe Brauer",
        "timestamp": 1629620293
    },
    {
        "content": "<p>Welcome!  I work on nonlinear elliptic PDE (also known as differential geometry :) ).  So I share many of your long-term hopes for formalization.</p>\n<p>Lean (and other formal proof checkers) are a long way away from being able to do this.  At the moment we are doing much more foundational work that heads in that direction -- for example, Remy Degenne contributed a theory of Lp spaces a few months ago, then last month I proved that continuous functions are dense in Lp.  An expert user could probably write down a <em>definition</em> of Sobolev spaces now, but it would be a fair bit of work.</p>",
        "id": 250263157,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1629621558
    },
    {
        "content": "<p>Yury Kudryashov recently defined Holder spaces.</p>",
        "id": 250263226,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1629621629
    },
    {
        "content": "<p>He's also working on a version of Stokes' theorem -- unfortunately integration in several variables, though defined (thanks to work last year by Floris van Doorn), is a bit clunky to work with currently.</p>",
        "id": 250263273,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1629621717
    },
    {
        "content": "<p>I think the Gagliardo-Nirenberg-Sobolev inequality would be within reach, again for an expert user.</p>",
        "id": 250263327,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1629621772
    },
    {
        "content": "<p>Thanks for your reply. So the situation is as I expected (or feared ;) ). Could you provide any pointers to the work you mentioned? BTW, I am also dealing sometimes with differential geometry, however with a Lorentzian metric, so that some of the corresponding PDE are hyperbolic. regards</p>",
        "id": 250267975,
        "sender_full_name": "Uwe Brauer",
        "timestamp": 1629629341
    },
    {
        "content": "<p>The definition of Lp spaces is at <a href=\"https://leanprover-community.github.io/mathlib_docs/find/measure_theory.Lp/src\">src#measure_theory.Lp</a>.</p>",
        "id": 250269668,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1629632117
    },
    {
        "content": "<p>Hölder continuity is at <a href=\"https://leanprover-community.github.io/mathlib_docs/find/holder_with/src\">src#holder_with</a>.</p>",
        "id": 250269822,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1629632335
    },
    {
        "content": "<p>Heather's proof that continuous functions are dense in Lp is at <a href=\"https://leanprover-community.github.io/mathlib_docs/find/measure_theory.Lp.bounded_continuous_function_dense/src\">src#measure_theory.Lp.bounded_continuous_function_dense</a>.</p>",
        "id": 250269930,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1629632516
    },
    {
        "content": "<p>thanks</p>",
        "id": 250270341,
        "sender_full_name": "Uwe Brauer",
        "timestamp": 1629633133
    },
    {
        "content": "<p>We also have the beginnings of a differential geometry library, by the way (the work of Sebastien Gouezel).  It too is in early stages, but here is Yury's recent proof of the Whitney embedding theorem:<br>\n<a href=\"https://leanprover-community.github.io/mathlib_docs/find/exists_embedding_euclidean_of_compact/src\">src#exists_embedding_euclidean_of_compact</a></p>",
        "id": 250278396,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1629644541
    }
]