[
    {
        "content": "<p>I'd like to get more involved and plan to take on a research MSc student to help formalise results in number theory over function fields. For example, proving quadratic reciprocity, the Riemann Hypothesis, etc. in this setting.</p>\n<p>Two questions for the experienced members:<br>\n1) Has any of this been done? I can't see it in mathlib, but perhaps I'm not looking hard enough.<br>\n2) In your opinion, is it a reasonable goal for an MSc dissertation?</p>\n<p>Thanks!</p>",
        "id": 196799060,
        "sender_full_name": "Gihan Marasingha",
        "timestamp": 1588870364
    },
    {
        "content": "<p>I don't think we have anything in that direction. I'm not aware of anything involving function fields.</p>",
        "id": 196799468,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1588870563
    },
    {
        "content": "<p>It depends very much on how much maths the student knows and how much experience they have with formalising maths.</p>",
        "id": 196799507,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1588870585
    },
    {
        "content": "<p>If they don't have any prior experience... it might go well, but it might also be very tough.</p>",
        "id": 196799548,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1588870608
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>. That's good to know. I can make a start to see how challenging it's likely to be before the start of the academic year in September.</p>",
        "id": 196800267,
        "sender_full_name": "Gihan Marasingha",
        "timestamp": 1588870892
    },
    {
        "content": "<p>There is also no theory of Dedekind domains AFAIK, e.g. the fact that integrally closed 1-dimensional domains have the property that non-zero ideals factor uniquely into primes. </p>\n<p>I think it's a super thing to do for an MSc dissertation. It's kind of high-risk high-gain, because there's a chance the student won't get anywhere (I've had students in the past where I have had to write 50% of the code myself, before they could get going), but if they do something then it's probably worth publishing. For preparation you might want to try and find the simplest route to each major theorem. I would very much like to work on general commutative algebra (e.g. Nullstellensatz etc) over the summer.</p>",
        "id": 196803070,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1588872127
    },
    {
        "content": "<p>Thanks for the advice <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>!</p>",
        "id": 196803417,
        "sender_full_name": "Gihan Marasingha",
        "timestamp": 1588872308
    }
]