[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> I'm curious why you reversed the direction of the arrows of <code>open_set</code>. I would rather put the contravariant-ness in the notion of (pre)sheaf.</p>",
        "id": 135489758,
        "sender_full_name": "Reid Barton",
        "timestamp": 1539110689
    },
    {
        "content": "<p>Ah, I hadn't seen this, and asked your opinion elsewhere. I'll reverse it again when I get there.</p>",
        "id": 135500583,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1539120642
    },
    {
        "content": "<p>Yes Scott mentioned this before I think. Maybe he said something like he had ops everywhere at all times with no obvious purpose?</p>",
        "id": 135502013,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1539122350
    },
    {
        "content": "<p>I guess the point is that we never use the unopped category</p>",
        "id": 135502023,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1539122373
    },
    {
        "content": "<p>Right, but once we start doing sheaves over sites we will want contravariant (pre)sheaves. And we also want those to specialise to \"plain old\" (pre)sheaves on open sets. So I vote for keeping the <code>op</code>.</p>",
        "id": 135511685,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1539134741
    },
    {
        "content": "<p>Another question of course is where you want the <code>op</code> -- source or target. It's funny this is coming up now. I distinctly remember Scott saying \"eew there are <code>op</code>s everywhere, but I've had a brilliant idea -- if we just redefine the open set category then they all go away and it's much easier to use\" and it was one of those moments where I just thought \"yeah, it's not ideal but I can completely see his point. It removes all of them at once.\"</p>",
        "id": 135521274,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1539151653
    }
]