[
    {
        "content": "<p>Hey, so there is <a href=\"https://github.com/bottine/mathlib/blob/bottine/simple_graph_ends/src/combinatorics/simple_graph/ends/for_mathlib/fintype_inverse_systems.lean\">code here</a> dealing with some properties of <code>fintype_inverse_systems</code>.<br>\nMathlib has a lemma stating that such a system has a section, but I needed some finer-grained facts about it.</p>\n<p>I'd like to have all these things in mathlibs, in some form or another. Could I get some guidance on whether and how I should proceed to get them merged? There is obviously a lot of golfing to be done, but beyond that, I'm not even sure how to correctly name things and where they would fit.</p>\n<p>Thanks!</p>",
        "id": 299523076,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1663576331
    },
    {
        "content": "<p>I have a thoroughly cleaned-up (still far from perfect) version <a href=\"http://sprunge.us/QmKaJj\">here</a> and would still welcome some hints as to where to include this.<br>\nThe obvious first guess would be in <code>topology.category.Top.limits</code> since that's where <code>nonempty_sections_of_fintype_inverse_system</code> is proved, but it's also obvious that it does not belong there…</p>",
        "id": 315078896,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670679304
    },
    {
        "content": "<p>What is the precise mathematical statement you need? There may be a way to deduce it from what's already in mathlib.</p>",
        "id": 315103744,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1670690878
    },
    {
        "content": "<p>This assertion is in the topology folder because it comes from a general fact about cofiltered limits of compact Hausdorff spaces</p>",
        "id": 315103832,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1670690922
    },
    {
        "content": "<p>Well, this is meant to be used to talk about the ends of a simple graph. <br>\nThings I need:</p>\n<ul>\n<li>The sections are the same thing as sections of the \"surjective\" part (which translates to the ends being defined equivalently as the sections over connected components obtained by removing finsets, or <em>infinite</em> such components).</li>\n<li>Injectivity of the evaluation map of sections given some conditions on the system (so that I can put an upper bound on the number of ends)</li>\n<li>The sections can be decomposed, for any index <code>i</code>, as a sum of the sections having each possible value at index <code>i</code> (so that I can describe the ends of a graph as the sum of the ends of subgraphs).</li>\n</ul>",
        "id": 315111955,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670695542
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224323\">@Junyan Xu</span> mentioned the Mittag-Leffner condition, and suggested that I generalize as much as possible to cofiltered systems.</p>",
        "id": 315114669,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670697210
    },
    {
        "content": "<p>I feel like no matter whether or not the the lemmas I have can be obtained by more direct means, they would fit <em>somewhere</em> in mathlib.</p>",
        "id": 315114786,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670697271
    },
    {
        "content": "<p>Yeah I think the correct approach is probably to work with the Mittag-Leffler condition, and separately show that a directed inverse system of finite types automatically satisfies the condition.</p>",
        "id": 315131449,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1670709842
    },
    {
        "content": "<p>The nonempty result, however, doesn't have much to do with the Mittag-Leffler condition; even if all objects are nonempty and all maps are surjective, the limit (<code>section</code>) could still be empty, see <a href=\"https://mathoverflow.net/questions/261574/when-is-the-projective-limit-non-empty\">MO question</a> and <a href=\"https://arxiv.org/abs/0908.2168\">explicit example</a>. If the directed set is countable, however, the limit is always nonempty (<a href=\"https://stacks.math.columbia.edu/tag/0597\">stacks#0597</a>).</p>",
        "id": 315134696,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1670712408
    },
    {
        "content": "<p>Both this <a href=\"https://math.stackexchange.com/a/3875985/12932\">SE answer</a> and the <a href=\"https://ncatlab.org/nlab/show/Mittag-Leffler+condition#discussion\">nLab page</a> say something about pro-objects and I wonder whether there's anything relevant done in LTE.</p>",
        "id": 315135060,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1670712665
    },
    {
        "content": "<p>Are \"Mittag-Leffler\" and \"cofiltered system\" essentially two incompatible way to generalize what I want? In case they are, which one should I try for? <br>\nWell, I'll just toy a bit with it all and see what can be proved.</p>",
        "id": 315169716,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670742938
    },
    {
        "content": "<p>OK, I've got a PR <a href=\"https://github.com/leanprover-community/mathlib/pull/17905\">here</a> introducing Mittag-Leffler. <br>\nIt has two lemmas that should go somewhere else, but otherwise I'm pretty happy with it (beside the fact that it's <em>yet another</em> mathlib3 PR ;) )</p>",
        "id": 315332472,
        "sender_full_name": "Rémi Bottinelli",
        "timestamp": 1670840925
    }
]