[
    {
        "content": "<p>Currently we have four flavours of spectra of rings (hopefully I have not missed any):</p>\n<ul>\n<li><code>prime_spectrum</code> for prime ideals of any commutative ring,</li>\n<li><code>projective_spectrum</code> for homogeneous prime ideals of a graded ring avoiding the irrelevant ideal,</li>\n<li><code>height_one_spectrum</code> for height one prime ideals of a Dedekind domain, and</li>\n<li><code>maximal_spectrum</code> for maximal ideals of any commutative ring in <a href=\"https://github.com/leanprover-community/mathlib/pull/16905\">a new PR</a></li>\n</ul>\n<p>The first two are currently defined as a <code>def</code> with information encoded by subtyping, and the last two are currently defined as a <code>structure</code> with information encoded in fields (as suggested by <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span>). If possible, I would like to refactor them to look the same, but I'm not sure which approach is preferable to people working with these things, so I'm requesting for opinions. I also think the files containing their definitions and e.g. topological properties are currently in awkward locations, so I would also like to relocate them with permission.</p>",
        "id": 303597262,
        "sender_full_name": "David Ang",
        "timestamp": 1665569695
    },
    {
        "content": "<p>Sounds good! I think working with a structure is probably a good idea.</p>",
        "id": 303597702,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1665569882
    },
    {
        "content": "<p>Where are you planning to move them? Somewhere under <code>ring_theory</code> I suppose?</p>",
        "id": 303606975,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1665574096
    },
    {
        "content": "<p>I don't have a plan yet, but I guess they will be under <code>ring_theory</code>. I think everything under the <code>prime_spectrum</code> folder should be in one file called <code>prime_spectrum.lean</code> somewhere in <code>ring_theory</code>, and similarly with <code>maximal_spectrum.lean</code>, while <code>height_one_spectrum</code> should be its own file <code>height_one_spectrum.lean</code> in <code>ring_theory/dedekind_domain</code>. I don't know what to do with <code>projective_spectrum</code> but I'm guessing the topological properties can be in a file <code>projective_spectrum.lean</code> while the structure sheaf and projective schemes can remain in <code>algebraic_geometry</code>. It's hard to separate algebra with algebraic geometry but the definitions should at least be at a unified location.</p>",
        "id": 303635161,
        "sender_full_name": "David Ang",
        "timestamp": 1665583775
    },
    {
        "content": "<p>Wild idea but maybe we can have a folder <code>ring_theory/spectrum</code> instead, and put all four files in the same place?</p>",
        "id": 303636194,
        "sender_full_name": "David Ang",
        "timestamp": 1665584079
    }
]