[
    {
        "content": "<p>I would like to slice <code>category_theory/limits/limits.lean</code> into smaller files, as it has become unwieldy. <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>, <span class=\"user-mention\" data-user-id=\"246273\">@Bhavik Mehta</span>, <span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span>, <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span> </p>\n<p>The first thing I would like to do is separate out the <code>is_limit</code> stuff from the <code>has_limit</code> stuff (presumably into files with those names). There's also a variety of rarely used API (e.g. equivalent formulations of limit conditions in terms of yoneda) that I might just break into their own files.</p>\n<p>The change I'm not sure about is whether to split everything to two sets of parallel files, once for limits, once for colimits.</p>\n<p>advantages:</p>\n<ul>\n<li>better parallelism while compiling (or just faster if you only need one side)</li>\n<li>perhaps easier to keep thing in sync by opening the files side by side</li>\n</ul>\n<p>disadvantages:</p>\n<ul>\n<li>perhaps harder to keep things in sync by forgetting about the other file...</li>\n</ul>\n<p>Happy to follow any expressed preferences here.</p>",
        "id": 211218100,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601009219
    },
    {
        "content": "<p>I don't have strong reasons, but I slightly favour the two-files version, I think.</p>",
        "id": 211219507,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1601010998
    },
    {
        "content": "<p>I slightly prefer the one-file version, partially because the splitting might need to happen for special shapes and anything else which uses limits, so I think the maintainability problem could get tough. That said opening the files side by side seems like a good way round this; so I'd be happy with either decision. Obviously though it would be great if we could automatically dualise :)</p>",
        "id": 211257519,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1601040605
    },
    {
        "content": "<p>I think I might try a compromise: I'll split <code>limits.lean</code> into <code>is_limit.lean</code>, <code>has_limit.lean</code>, <code>is_colimit.lean</code>, <code>has_colimit.lean</code>, but not plan to split the special shapes files into dual pairs.</p>",
        "id": 211334578,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601083793
    }
]