[
    {
        "content": "<p>I'm looking to define semisimple modules, but there are a few equivalent definitions, and I'm not sure how to express all of them in mathlib at the moment.</p>",
        "id": 221308342,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609439933
    },
    {
        "content": "<p>In Lang's Algebra, there are the following three conditions for when <code>M</code> is semisimple:</p>\n<ol>\n<li><code>M</code> is the sum of a family of simple submodules</li>\n<li><code>M</code> is the direct sum of a family of simple submodules</li>\n<li>Any submodule of <code>M</code> is a direct summand</li>\n</ol>",
        "id": 221308573,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440155
    },
    {
        "content": "<p>Of these, 1. and 2. require <a href=\"https://github.com/leanprover-community/mathlib/issues/5473\">#5473</a> defining simple modules</p>",
        "id": 221308599,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440179
    },
    {
        "content": "<p>and 2. and 3. at face value require defining internal direct sums</p>",
        "id": 221308616,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440204
    },
    {
        "content": "<p>Currently, the closest thing to semisimplicity in mathlib is Maschke's Theorem, which shows that every submodule has a complement in the sense of <code>is_compl</code>.</p>",
        "id": 221308713,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440295
    },
    {
        "content": "<p>Ideally, I'd pick one of these definitions, state all of them, prove them all equivalent, and make that a PR.</p>",
        "id": 221308742,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440332
    },
    {
        "content": "<p>However, I think there's a lot to work out with internal direct sums that I'm not sure how to do, and I'm not sure it's necessary at the moment to profit from semisimple modules (and move towards representation theory).</p>",
        "id": 221308805,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440388
    },
    {
        "content": "<p>Would the following be a reasonable approach?</p>\n<ul>\n<li>Develop the internal direct sum for 2 submodules (show that if they are disjoint, then their sup is isomorphic to their direct product)</li>\n<li>Show that if two <code>submodule</code>s satisfy <code>is_compl</code>, then the whole module is isomorphic to their direct product</li>\n<li>Define <code>is_semisimple_module</code> using the <code>exists_is_compl</code> definition in our version of Maschke's Theorem</li>\n<li>Show that this is equivalent to 1., where by \"sum\" I mean <code>Sup</code>.</li>\n</ul>",
        "id": 221309050,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440614
    },
    {
        "content": "<p>That last definition is equivalent to saying that the <code>complete_lattice</code> is atomistic, once I show that simple submodules are the same as minimal submodules, which are atoms in the order. Much of the machinery for that is in <a href=\"https://github.com/leanprover-community/mathlib/issues/5493\">#5493</a></p>",
        "id": 221309273,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1609440864
    },
    {
        "content": "<p>I think we'll need an API for internal direct sum anyway. But I agree that it doesn't sound very appealing to work on.</p>",
        "id": 221309512,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1609441129
    },
    {
        "content": "<p>I haven't thought hard about it yet. If anybody knows of other libraries that have worked on this, that would be good to know.</p>",
        "id": 221309534,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1609441159
    },
    {
        "content": "<p>Is there something like this done in mathcomp or Isabelle?</p>",
        "id": 221309542,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1609441170
    },
    {
        "content": "<p>If it's any help, for vector spaces over a field 1. says \"there exists a spanning set\", 2. says \"there exists a basis\" and 3. says \"this module is projective\". They're all true for vector spaces over a field. They're equivalent but not always all true for modules over a commutative local ring.</p>",
        "id": 221310056,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609441796
    },
    {
        "content": "<p>I think that in our setting, 1. just says \"the inf of the simple submodules is top\".</p>",
        "id": 221310118,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609441842
    },
    {
        "content": "<p>you mean the sup</p>",
        "id": 221310141,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1609441866
    },
    {
        "content": "<p>and 3. can be just written as \"for any S in M, there's a map from M to S which is a one-sided inverse\".</p>",
        "id": 221310156,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609441888
    },
    {
        "content": "<p>Being a direct summand is the same as having a compl, but compls are in general not unique.</p>",
        "id": 221310234,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609441957
    }
]