[
    {
        "content": "<p>Where is the <code>notation</code> declaration for set builder notation in the lean source? I'm trying to understand what exactly I can put before the <code>|</code> in <code>{ x | even x }</code>. Is it only a _single identifier_ that I can place there, so it just becomes a <code>λ x, even x</code>? The main reason I'm asking is because I was hoping to do something like <code>{(a, f a) | a ∈ A}</code>. But I've currently resorted to <code>{x : A × B | f x.1 = x.2}</code>.</p>",
        "id": 185446802,
        "sender_full_name": "Enrico Borba",
        "timestamp": 1578857514
    },
    {
        "content": "<p>You do have to do it the ugly way I'm afraid.</p>",
        "id": 185446868,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1578857627
    },
    {
        "content": "<p>There might be good notation for this in Lean 4. But the main downside would be that I expect it would end up having to unfold to something like <code>{x : A × B | ∃ a : A, (a, f a) = x}</code></p>",
        "id": 185447012,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1578857781
    },
    {
        "content": "<p>I think it has to unfold to something like this because that's the only definition I can think of for the set!</p>",
        "id": 185448189,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1578859622
    },
    {
        "content": "<p>There's the definition in the first post.</p>",
        "id": 185448240,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1578859723
    },
    {
        "content": "<p>The set builder notation of Lean is of a really different nature as what Enrico wants. It is purely syntactic sugar for defining sets (in the sense of type theory, so all elements have the same type <code>X</code> and a set is a map from <code>X</code> to <code>Prop</code>). Writing <code>{(a, f(a)) | a ∈ A}</code> is the image of a set <code>A</code> under a function, it involves an existential quantifier. Actually I'm not even sure what is meant because <code>A</code> seems to be a set or a type depending on the sentence.</p>",
        "id": 185448391,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1578860040
    }
]