[
    {
        "content": "<p>Hi! Who's \"in charge\" of the simplicial API (simplex category and simplicial sets) in mathlib? I would be interested in working a bit on it (though I do not have much free time to do so) and I'd like to know what would be interesting \"milestones\" for it?<br>\nI have a file in which I proved a bunch of lemmas concerning epi and monos in the simplex category (namely that they're exactly the maps whose underlying functions are surjective/injective, how they behave with respect to length, existence and unificity of epi-mono factorization in the simplex category), I don't think my code is PR-able right now since the proofs are probably very poorly written (I'm still a lean begginer) but I'd like to know what I could work on anyway.</p>",
        "id": 244062187,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624792580
    },
    {
        "content": "<p>I was thinking about trying to prove the Eilenberg-Zilber lemma in simplicial sets (any simplex of a simplicial set is uniquely a degeneracy of a non-degenerate simplex)</p>",
        "id": 244062202,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624792630
    },
    {
        "content": "<p>there was some talk about it <a href=\"#narrow/stream/116395-maths/topic/simplex.20category\">here</a>!</p>",
        "id": 244062485,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1624793148
    },
    {
        "content": "<p>its probably still worth at least posting it as a gist, then we can give you some general feedback ^^</p>",
        "id": 244062523,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1624793166
    },
    {
        "content": "<p>Mmh, I'll try to have a mathlib fork on my github to post it then, rather than just sending a raw 400 lines of code here :P</p>",
        "id": 244062595,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624793296
    },
    {
        "content": "<p>Though I guess I could do a pastebin, but is there lean syntax coloring for it?</p>",
        "id": 244062623,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624793375
    },
    {
        "content": "<p>Aw nope.</p>",
        "id": 244062627,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624793394
    },
    {
        "content": "<p>that seems like a solid idea :b @mantainers can give you branch access too ^^</p>",
        "id": 244062731,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1624793542
    },
    {
        "content": "<p>Usually the people mentioned in the copyright list are the people to talk to. Don't work if possible, CI is much better if you have push access to non master branches on the official mathlib repo -- post your github userid</p>",
        "id": 244062863,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1624793668
    },
    {
        "content": "<p>I didn't understand what you meant by a gist! So here we go: <a href=\"https://gist.github.com/robin-carlier/4b4c19edcabf3be393d20e98aff44f5f\">https://gist.github.com/robin-carlier/4b4c19edcabf3be393d20e98aff44f5f</a><br>\nAs you can see the proof are probably over-complicated due to me not being at ease with the library now, and relying to much on \"have\".<br>\nI don't think I'll just ask for push access right now, I don't feel like I should have access for now, but my (pretty empty) git account is <a href=\"https://github.com/robin-carlier\">https://github.com/robin-carlier</a>.</p>",
        "id": 244062968,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624793854
    },
    {
        "content": "<p>Code is also completely undocumented, which is why I don't think it's worth anything yet.</p>",
        "id": 244063039,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624793968
    },
    {
        "content": "<p>I put some of the code in <a href=\"https://github.com/leanprover-community/mathlib/commit/1bf357f71a64386d605f650e34737cb546bf4124\">https://github.com/leanprover-community/mathlib/commit/1bf357f71a64386d605f650e34737cb546bf4124</a> after cleaning it up a bit, if anyone has general feedback (especially concerning style, I've been trying to follow the style guidelines but not sure I did everything right) that'd be nice. Does that amount of code seems too much/too little for a PR? Sorry if the questions feel silly but I'd rather not mess up.</p>",
        "id": 244072751,
        "sender_full_name": "Robin Carlier",
        "timestamp": 1624809401
    },
    {
        "content": "<p>I think you probably should make the pull request - it's much easier to comment on anything there. The size seems fine; I wouldn't add too much to it.</p>",
        "id": 244073023,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1624809811
    }
]