[
    {
        "content": "<p>So for better or worse, we have <code>subgroup</code> and <code>is_subgroup</code>, and the same for monoids. One advantage of doing things the way we did them (didn't remove <code>is_X</code> but added <code>X</code> anyway) was that <code>is_X</code> became available immediately. Another advantage is that in both cases I got an Imperial student to write <code>is_X</code> and in both cases I believe the student learnt a lot. I am proposing doing the same with subrings now. We don't have <code>subring</code>, we do have <code>is_subring</code>, so I'm proposing making a new file <code>subring.lean</code>, moving the current <code>subring.lean</code> to <code>is_subring.lean</code> and getting a student to bundle subrings so they can have access to bundled subrings for another project. </p>\n<p>The refactoring is happening. Scott and I (mostly Scott so far) are working on removing <code>is_subgroup</code> from a bunch of files, in WIP PR <a href=\"https://github.com/leanprover-community/mathlib/issues/3321\">#3321</a> . The advantage of the procedure I'm outlining above is that students of mine can access <code>subring</code> immediately.</p>\n<p>Is there anyone who thinks this is a terrible idea, or knows of someone who has started on this already?</p>",
        "id": 204443805,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1595262296
    },
    {
        "content": "<p>I saw that <span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> recently defined bundled <a href=\"https://leanprover-community.github.io/mathlib_docs/ring_theory/subsemiring.html\">subsemirings</a>.</p>",
        "id": 204475015,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1595278632
    },
    {
        "content": "<p>Yury, would it be a good first PR to make subrings on top of this?</p>",
        "id": 204491987,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1595284424
    },
    {
        "content": "<p>I think yes. It's mostly about replacing <code>add_submonoid</code> by <code>add_subgroup</code> everywhere.</p>",
        "id": 204632723,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1595397442
    }
]