[
    {
        "content": "<p>We now have formal <a href=\"https://leanprover-community.github.io/mathlib_docs/find/laurent_series\">docs#laurent_series</a>, so I started looking towards an API for the sum of a Laurent series. However, when poking around the analysis library for the connection between analytic function and <code>power_series</code>, I found that it looks like there is none at the moment.</p>",
        "id": 240862176,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1622487054
    },
    {
        "content": "<p>I can still define some infinite sums, and prove some relations between them, but it will have little relation to any real API in the <code>analysis</code> folder.</p>",
        "id": 240862294,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1622487143
    },
    {
        "content": "<p>Does anyone with experience with that part of the analysis library have opinions on whether any of this is worth doing now, without waiting for a better connection to formal<code>power_series</code> first?</p>",
        "id": 240862352,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1622487202
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span></p>",
        "id": 240865089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1622489566
    },
    {
        "content": "<p>There are two different things here:</p>\n<ul>\n<li>\n<p>specializing the existing analytic functions to one variables, to create a link with power series. This will really be a specialization of what we have for analytic functions (all the file <code>analysis/analytic/basic.lean</code> makes sense when you specialize it to think of <code>p n</code> as a number instead of an <code>n</code>-multilinear map). So here, there will be no need to reprove any theorem, only reexpress them in the more specialized language. (Just like naive one-dimensional derivatives are a specialization of the general Frechet derivative).</p>\n</li>\n<li>\n<p>considering finite order singularities of meromorphic functions (i.e., Laurent series). There, we will not be able to specialize the general facts, as this is a more specific one-dimensional phenomenon. So an API will be built from scratch here. However, it would probably make sense to state and prove the results by separating the finitely many terms with negative exponents, and the power series parts. So, doing first the power series part seems more reasonable.</p>\n</li>\n</ul>",
        "id": 240866226,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1622490643
    }
]