[
    {
        "content": "<p>Is it true that if <code>C</code> is a balanced category, then the category of <code>C</code>-valued sheaves over a site is balanced? Is there an easy proof?<br>\nActually I only care about when <code>C</code> is <code>Type</code> or <code>Module R</code>, and mathlib already know that the latter is abelian.<br>\nFor the former, to show that every mono is regular, I could either show that there exists a subobject classifier, or show that functors that creates  pushouts and pullbacks reflects regular monos and do the heavy-lifting in the category of presheaves. However, both approaches seem to have constraints on the universe and seems to be quite some work, and I am wondering if there is a better way forward.</p>",
        "id": 306564722,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1666918125
    },
    {
        "content": "<p>I'm not sure what is in mathlib already, but I would suggest first proving that in a sheaf category, a pushout of a mono is also a pullback square. You can prove it in a somewhat long-winded way from the Giraud axioms, or by checking it in Set and using that sheaves form a left-exact localization.</p>",
        "id": 306576746,
        "sender_full_name": "Reid Barton",
        "timestamp": 1666926846
    },
    {
        "content": "<p>Thanks for the reply! I think we are quite far from Giraud's axioms, so I'll look into the second approach. If I understand it correctly, I should first check in <code>Type u</code> and then <code>Cᵒᵖ ⥤ Type u</code> and then <code>Sheaf J (Type u)</code>? And I guess this only holds over small sites?</p>",
        "id": 306579342,
        "sender_full_name": "Andrew Yang",
        "timestamp": 1666929708
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"439483\">Andrew Yang</span> <a href=\"#narrow/stream/116395-maths/topic/The.20category.20of.20sheaves.20is.20balanced.2E/near/306579342\">said</a>:</p>\n<blockquote>\n<p>If I understand it correctly, I should first check in <code>Type u</code> and then <code>Cᵒᵖ ⥤ Type u</code> and then <code>Sheaf J (Type u)</code>?</p>\n</blockquote>\n<p>Yes exactly.</p>\n<blockquote>\n<p>And I guess this only holds over small sites?</p>\n</blockquote>\n<p>I don't know what happens if you take sheaves (of small sets) on a large site (usually it is not a very useful thing to do).</p>",
        "id": 306580509,
        "sender_full_name": "Reid Barton",
        "timestamp": 1666930658
    },
    {
        "content": "<p>Sheaves on a large site are scary, this is exactly why Scholze spends several of the first few pages of his course on condensed sets going on about strong limit cardinals and concludes that the definition of condensed set is not your first guess.</p>",
        "id": 306590105,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1666938529
    }
]