[
    {
        "content": "<p>Hi all,<br>\nI'm trying to work toward developing results about eigenvalues of matrices in Lean, and it appears that a reasonable short-term goal is to try to develop the  concepts of (geometric) eigenvalue multiplicity and the Jordan Normal Form.<br>\nThat said, it sounds like the community wants to get JNF through the structure theorem for finitely generated modules over a PID, so that it is available for arbitrary fields. So I can also contribute in that direction--let me know if you're already working on that.<br>\nI could also leapfrog just to the result for \\C by the Schur decomposition as done here: <a href=\"https://www.isa-afp.org/entries/Jordan_Normal_Form.html\">https://www.isa-afp.org/entries/Jordan_Normal_Form.html</a> . Though, I don't know whether I'm just passing the buck there and some part of the Schur decomp relies on the structure theorem. I need to think more about whether that is a reasonable plan.<br>\nI'm a beginner to Lean, so any advice about how to approach these goals would be very welcome!</p>",
        "id": 268053713,
        "sender_full_name": "Daniel Packer",
        "timestamp": 1642185188
    },
    {
        "content": "<p>If you <a href=\"#narrow/search/module.20pid\">search for module pid</a> you'll see this has been discussed <em>many</em> times, but nobody ever did the work. This is now long overdue so don't hesitate to break the tradition and actually do it!</p>",
        "id": 268056303,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642186446
    },
    {
        "content": "<p>I don't really see the point of trying to go the Jordan normal form using a shortcut since we want the module results in mathlib anyway.</p>",
        "id": 268056351,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642186477
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> did Smith Normal Form and I always felt that this was the hard part.</p>",
        "id": 268056584,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642186580
    },
    {
        "content": "<p>Oh, I forgot about that.</p>",
        "id": 268056960,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642186780
    },
    {
        "content": "<p>So we may be much closer than what I remembered.</p>",
        "id": 268056994,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642186793
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/116395-maths/topic/Toward.20Jordan.20Normal.20Form/near/268056960\">said</a>:</p>\n<blockquote>\n<p>Oh, I forgot about that.</p>\n</blockquote>\n<p>Me too but I soon found out about it again when I clicked your link :-)</p>",
        "id": 268057110,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642186819
    },
    {
        "content": "<p>My mistake is I didn't click my link...</p>",
        "id": 268057183,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642186842
    }
]