[
    {
        "content": "<p>This is sort of a curious meta question from a non-mathematician , but I notice that while Lean has a type <code>Set</code> and all of traditional mathematics is based on structures made of sets, that a lot of the basic definitions are defined on arbitrary types (α : Type u). E.g rather than a group being structure of a <code>set</code> with a binary operation satisfying the group axioms, it is a (α : Type u) with the binary operation, which seems like a much more general sort of thing.  Is it true that such algebraic structures in Lean really are more general than one just defined on sets? or is this just syntax</p>",
        "id": 196085260,
        "sender_full_name": "Brandon Brown",
        "timestamp": 1588482734
    },
    {
        "content": "<p>Lean is based on type theory, so types are the more basic construct here</p>",
        "id": 196085327,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1588482936
    },
    {
        "content": "<p>when you say \"more general\", do you mean more general in lean or more general in maths? The answer is yes to the first question and not really to the second</p>",
        "id": 196085392,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1588483015
    },
    {
        "content": "<p>In traditional maths a \"set\" is basically the same as what we would call a \"type\"</p>",
        "id": 196085404,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1588483073
    },
    {
        "content": "<p>I meant more general in mathematics. But I guess that makes sense since ZFC isn't somehow less expressive than dependent type theory</p>",
        "id": 196085559,
        "sender_full_name": "Brandon Brown",
        "timestamp": 1588483389
    },
    {
        "content": "<p>Brandon, there is a very light discussion of this at <a href=\"https://leanprover-community.github.io/lean-perfectoid-spaces/type_theory.html\" title=\"https://leanprover-community.github.io/lean-perfectoid-spaces/type_theory.html\">https://leanprover-community.github.io/lean-perfectoid-spaces/type_theory.html</a></p>",
        "id": 196093023,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1588497275
    }
]