[
    {
        "content": "<p>Dear Lean users,</p>\n<p>Gilles Dowek is coordinating the submission of a European project (25<br>\nparticipating sites) aiming at creating an online encyclopedia of formal proofs<br>\n (named Logipedia) allowing the exchange of formal proofs between different systems.<br>\nIn this framework, we are setting up a \"Club of users in education\" and a \"Club of academic<br>\n users\" interested in Logipedia.<br>\nThe first one is a think tank on the use of proof assistants in the classroom.<br>\nThe second brings together researchers who would be potential users of such an encyclopedia in their research. We are especially looking for outsiders: researchers in maths or other science who think they need formal proofs or formal statements.</p>\n<p>In both cases, the requested investment is light: participation (as far as possible) in two meetings over the 4 years of the project (expression of needs<br>\n and evaluation of results), and participation in the dissemination/training around the project in your circles (mathematicians, university or secondary school teachers, ...).</p>\n<p>Do you agree to be part of either of these two clubs? The academic users' club will be led by Benedikt Ahrens (<a href=\"mailto:b.ahrens@cs.bham.ac.uk\" title=\"mailto:b.ahrens@cs.bham.ac.uk\">b.ahrens@cs.bham.ac.uk</a>). and the club of users in education will be led by Julien Narboux (<a href=\"mailto:narboux@unistra.fr\" title=\"mailto:narboux@unistra.fr\">narboux@unistra.fr</a>). </p>\n<p>Julien Narboux</p>",
        "id": 189472429,
        "sender_full_name": "Julien Narboux",
        "timestamp": 1583138991
    },
    {
        "content": "<p>I told Julien by email a few days ago that I'd be part of this.</p>",
        "id": 189473052,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583139690
    },
    {
        "content": "<p>I told Benedikt by email a few days ago that I'd be part of this.</p>",
        "id": 189473073,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1583139716
    },
    {
        "content": "<p>Yeah I told Benedikt too :-)</p>",
        "id": 189473145,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583139763
    },
    {
        "content": "<p>but that's off topic for this thread ;-)</p>",
        "id": 189473154,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583139777
    },
    {
        "content": "<p>Same for me.</p>",
        "id": 189488529,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1583154169
    }
]