[
    {
        "content": "<p>I think it was mentioned often that some students really did not like Lean in the courses, even when it was stated to be part of the course ahead of time. Were there any surveys on why students did not like Lean?</p>",
        "id": 221966481,
        "sender_full_name": "Angela Li",
        "timestamp": 1610037929
    },
    {
        "content": "<p>What's the difference between Lean and Marmite?</p>\n<p>A: Lean is yummy, and Marmite is yuck.</p>",
        "id": 221968784,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1610038814
    },
    {
        "content": "<p>I like how nuanced your answer is <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span></p>",
        "id": 221968972,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1610038880
    },
    {
        "content": "<p>/me experienced unvoluntary exposure to Marmite on a boarding school where one couldn't always choose which sandwich you got for lunch...</p>",
        "id": 221971107,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1610039792
    },
    {
        "content": "<p>Marmite is yummy!</p>",
        "id": 221972511,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1610040459
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"304229\">@Angela Li</span> some maths students are just \"not into computers\"</p>",
        "id": 221972545,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1610040478
    },
    {
        "content": "<p>Weren't some of the courses joint math/computer science though? At least that's what I thought with Patrick's course.</p>",
        "id": 221972802,
        "sender_full_name": "Angela Li",
        "timestamp": 1610040586
    },
    {
        "content": "<p>My course had about 230 maths students and 40 joint-maths-computing students</p>",
        "id": 221995049,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1610050705
    },
    {
        "content": "<p>I thought this might be a good location to place my question <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>. Has anyone using Lean in their classrooms noticed patterns to what groups of students respond well to the use of Lean and what groups it does not resonate with? And what does that response look like? How do you know if it works well in your classrooms or does not?</p>",
        "id": 302352583,
        "sender_full_name": "Sarah Smith",
        "timestamp": 1664920051
    },
    {
        "content": "<p>Hi Sarah, </p>\n<p>Not exactly an answer to your questions, but I thought I'd share my teaching workflow, since this semester has, at least so far, worked much better than the same period of the last semester. </p>\n<p>Here's my workflow: I usually spend about twenty to thirty minutes lecturing about the key concepts of each lesson, often sketching  some informal and non-rigorous figures, say a figure for how to get a partition from an equivalence relation. We then spend the rest of class time (roughly about 45-55 minutes) to make these ideas precise and rigorous by writing our proofs in Lean. </p>\n<p>I have only eight students, and I make them into 4 teams (rotating teams each lecture). For every line of code, I wait until the team whose turn it is to suggest a solution to the current Lean goal, and then I type their solution. If Lean gives us an error, I explain the error, and then I go to the next team and ask them if they have a solution. If no team  at all gives a solution to the current goal, and this happened very rarely so far, I write my own solution, and we move on to the next lemma/theorem.  </p>\n<p>In Spring 2022 semester, a little less than half of my students responded well to the use of Lean and and the rest followed without much enthusiasm and in some cases with apathy. </p>\n<p>This semester, so far, everyone seems to be enthusiastic, and we usually  end up proving some statement in multiple ways, since different students/teams like to propose their own distinct solutions with their own favorite tactic. For instance, some students love <code>apply</code>, some others are addicted to <code>have</code>, and two students who use <code>calc</code> whenever possible.  You can also tell this from their homework solutions. </p>\n<p>I am writing a report (a collection of mistakes I did last semester, and how i fixed them this time) about the main factors responsible for the  increased enthusiasm/participation from Spring 2022 to Fall 2022. I'll post it here when I'm done with it. I think the main factor is to instill in students a (mild) obsession with Lean, and having a Zulip server for my course, so that my TAs and I could help and debug in real-time, has been very helpful in this regard. We did not have a Zulip server in Spring 2022, and I think this was one of the mistakes.</p>",
        "id": 302370610,
        "sender_full_name": "Sina",
        "timestamp": 1664930463
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"420917\">Sina</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302370610\">said</a>:</p>\n<blockquote>\n<p>I am writing a report (a collection of mistakes I did last semester, and how i fixed them this time) about the main factors responsible for the  increased enthusiasm/participation from Spring 2022 to Fall 2022.</p>\n</blockquote>\n<p>Are you thinking of turning that into a formal paper? As a person who has published in computer science and related conferences before, this kind of experience report seems right in line with the usual publications of such conferences. I think such a paper would be a great addition to the field! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 302374522,
        "sender_full_name": "Mac",
        "timestamp": 1664933910
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"315577\">Mac</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302374522\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"420917\">Sina</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302370610\">said</a>:</p>\n<blockquote>\n<p>I am writing a report (a collection of mistakes I did last semester, and how i fixed them this time) about the main factors responsible for the  increased enthusiasm/participation from Spring 2022 to Fall 2022.</p>\n</blockquote>\n<p>Are you thinking of turning that into a formal paper? As a person who has published in computer science and related conferences before, this kind of experience report seems right in line with the usual publications of such conferences. I think such a paper would be a great addition to the field! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>\n<p>Thanks for the encouragement. I actually have no experience of writing such a paper (reporting on teaching with Lean) for a conference publications. What are some of related CS conferences that would accept such a report?</p>",
        "id": 302379755,
        "sender_full_name": "Sina",
        "timestamp": 1664939080
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"420917\">@Sina</span> of the conferences I know, ACM <a href=\"https://sigcse2023.sigcse.org/\">SIGCSE</a>, <a href=\"https://iticse.acm.org/2023/\">ITiCSE</a>, <a href=\"https://sigcse.org/events/icer/index.html\">ICER</a>, APSE <a href=\"https://icce2022.apsce.net/\">ICCE</a>, and IEEE <a href=\"https://ieee-edusociety.org/event/ieee-frontiers-education-2022\">FIE</a> are big hitters. They are well ranked (though I generally think of SIGCSE as the flagship conference and FIE's ranking fell from B to C in the 2021 CORE rankings).  On the deadline front, SIGCSE's has already past (it was in August), ITiCSE is in January, ICER is in March, ICCE is in May, and FIE has its abstracts due February but papers due April/May.</p>\n<p>While your topic is technically mathematics, your specific application is computing-focused enough that I would be surprised if any of them reject you on that grounds. Though, if you are worried, ICCE  (International Conference on Computers in Education) or FIE (Frontiers in Education) are broader on their face as neither is directly focused on Computer Science Education (CSE) - ICCE is pretty generally and FIE covers \"all disciplines relating to engineering and computing education\" -- so they may be better bets.  For instance, the <a href=\"https://icce2022.apsce.net/call-for-papers/c2/\">ICCE 2022 subconference on Computer-Supported Collaborative Learning (CSCL) and Learning Sciences</a> might have been up your alley from your description of the class.</p>",
        "id": 302396354,
        "sender_full_name": "Mac",
        "timestamp": 1664952735
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"420917\">Sina</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302370610\">said</a>:</p>\n<blockquote>\n<p>I am writing a report (a collection of mistakes I did last semester, and how i fixed them this time) about the main factors responsible for the  increased enthusiasm/participation from Spring 2022 to Fall 2022. I'll post it here when I'm done with it. </p>\n</blockquote>\n<p>Sina, this is a wonderful answer and thank you so much for the details. I would love to read the report when complete!</p>",
        "id": 302486748,
        "sender_full_name": "Sarah Smith",
        "timestamp": 1664984683
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"504487\">Sarah Smith</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302352583\">said</a>:</p>\n<blockquote>\n<p>I thought this might be a good location to place my question <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>. Has anyone using Lean in their classrooms noticed patterns to what groups of students respond well to the use of Lean and what groups it does not resonate with? And what does that response look like? How do you know if it works well in your classrooms or does not?</p>\n</blockquote>\n<p>This is a tricky question. For a long time I thought that really bad students could not benefit from Lean. But last year I got one who really kept trying and actually ended up making very unexpected progress. Some people are not patient enough with the syntax requirement, they find it irritating to think they understand everything but can't convince Lean. Most of the time it comes from inadequate understanding but sometimes it indeed comes from purely technological difficulties. However it is very hard to predict who will be blocked by those technological issues.</p>",
        "id": 302536176,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1665000560
    },
    {
        "content": "<p>However the global picture for me is still that most students respond well.</p>",
        "id": 302536219,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1665000583
    },
    {
        "content": "<p>I don't really have anything to report because in my introductory course it's all optional and typically only some of the smart ones get involved, and for my final year course the people who choose to do it are selecting Lean as an option and hence are naturally going to be interested. I guess one observation is that last year everyone who was interested in my final year course did manage to write hundreds of lines of Lean code.</p>",
        "id": 302542360,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665003027
    },
    {
        "content": "<p>No hard data but some observations mainly derived from a body of students that are seeing any math beyond single variable calculus (US style) for the first time. </p>\n<ul>\n<li>NNG was overwhelmingly the favorite for the final project of the course I taught in fall 20,  like 90%</li>\n<li>students seem most confused at the beginning by how to structure a proof. Assumptions vs conclusions. What is allowed. The English language is not structured tightly enough for this even in the stilted vernacular that mathematicians often use. A student can follow a proof in tactic mode both locally at each step and globally better than natural language one at the start.</li>\n</ul>",
        "id": 302549641,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665005983
    },
    {
        "content": "<p>Feedback via the info view is also something that is impossible to match in paper. It is instantaneous and constant. Success in lean helps build confidence in one’s abilities.</p>",
        "id": 302550060,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665006133
    },
    {
        "content": "<p>On the other hand, when Lean was discussed in my graduate class one student was very dismissive. With an attitude of “I can provide a proof. If lean didn’t like, then it’s lean’s problem not mine”.</p>",
        "id": 302550746,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665006439
    },
    {
        "content": "<p>Generality once people get stuck in their views, it becomes more difficult to move them then if they come to something fresh.</p>",
        "id": 302550922,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665006517
    },
    {
        "content": "<p>Re: it's Lean's problem not mine: Oh that's interesting, Patrick just made the same point. I didn't have that sort of problem in my class, but I suspect the difference was that people in my class had specifically signed up to it to learn Lean, and they had to write Lean code to pass the exam, so if Lean didn't like their proofs then it really was their problem, not Lean's.</p>",
        "id": 302550986,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665006546
    },
    {
        "content": "<p>So far my students have not self selected for Lean affinity. That changes next semester</p>",
        "id": 302551511,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665006840
    },
    {
        "content": "<p>One more anecdote: the intro to proofs students really really dislike premature “🎉 goals accomplished”</p>",
        "id": 302553129,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665007561
    },
    {
        "content": "<p>you mean \"rw randomly closed the goal because it unexpectedly tried refl\"? This surprised people to the extent that I disabled this functionality in NNG.</p>",
        "id": 302553260,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665007620
    },
    {
        "content": "<p>No. I move cursor focus and it fires. Less worse is when it happens in a sub proof, like <code> have </code> block.</p>",
        "id": 302553515,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665007750
    },
    {
        "content": "<p>We just saw <code>rw</code> calls <code>rfl</code> today and it was hard to gauge their response</p>",
        "id": 302553658,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665007828
    },
    {
        "content": "<p>I should also mention I’m using Lean 4 this semester.</p>",
        "id": 302555891,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665009108
    },
    {
        "content": "<p>You mean when you get \"<span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> goals accomplished\" but there is still a <code>sorry</code> somewhere?</p>",
        "id": 302580155,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1665029045
    },
    {
        "content": "<p>In the middle of a proof. It seems different than Lean 3. I will try to reproduce the behavior and update.</p>",
        "id": 302667052,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665066905
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/302555891\">said</a>:</p>\n<blockquote>\n<p>I should also mention I’m using Lean 4 this semester.</p>\n</blockquote>\n<p>I am one who is slowly switching from Coq to Lean 3 in my teaching. I would be interested in the reasons some are choosing to use  Lean 4, given that the latter still seems a little unstable.</p>",
        "id": 303659342,
        "sender_full_name": "Assaf Kfoury",
        "timestamp": 1665586927
    },
    {
        "content": "<p>I think right now this is dependent on the specific course. For an intro to proofs course that covers topics like sets, functions, and relations then everything except sets perhaps has been stable for a while in Lean 4. This is the course for which I am currently using Lean 4. Lean 3 would look the same to the students. With Lean 4, I can more easily automate grading/feedback though. </p>\n<p>I am also teaching an introduction to cryptography course where most of the programming components only use what I would view as \"basic\" features of a language. I choose Go in advance for its small syntactic surface area, its general focus on readability, and portability. It is a math/CS cross-listed course so I have broad range of students in terms of familiarity with programming and I wanted something user-friendly. So far Lean 4 would have been totally appropriate. Lean 3 would have been a stretch. I would trade some of simplicity for the ability to reason about the algorithms. If I do this course again, I will probably use Lean 4. </p>\n<p>Next, semester I am teaching an undergrad course modeled on the <a href=\"https://lean-forward.github.io/logical-verification/2020/index.html\">logical verification course at VU</a> and a graduate course. I know some people are thinking about porting the VU course to Lean 4. If that happens or if I have enough time to fill in the gaps over winter break, I would use Lean 4 for this. The graduate course is only feasible in Lean 4 after we pass through mathport.</p>",
        "id": 303673916,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1665591522
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Marmite/near/303673916\">said</a>:</p>\n<blockquote>\n<p>I think right now this is dependent on the specific course. For an intro to proofs course that covers topics like sets, functions, and relations then everything except sets perhaps has been stable for a while in Lean 4. This is the course for which I am currently using Lean 4. Lean 3 would look the same to the students. With Lean 4, I can more easily automate grading/feedback though. </p>\n<p>I am also teaching an introduction to cryptography course where most of the programming components only use what I would view as \"basic\" features of a language. I choose Go in advance for its small syntactic surface area, its general focus on readability, and portability. It is a math/CS cross-listed course so I have broad range of students in terms of familiarity with programming and I wanted something user-friendly. So far Lean 4 would have been totally appropriate. Lean 3 would have been a stretch. I would trade some of simplicity for the ability to reason about the algorithms. If I do this course again, I will probably use Lean 4. </p>\n<p>Next, semester I am teaching an undergrad course modeled on the <a href=\"https://lean-forward.github.io/logical-verification/2020/index.html\">logical verification course at VU</a> and a graduate course. I know some people are thinking about porting the VU course to Lean 4. If that happens or if I have enough time to fill in the gaps over winter break, I would use Lean 4 for this. The graduate course is only feasible in Lean 4 after we pass through mathport.</p>\n</blockquote>\n<p>Many thanks for the comments. Very useful!</p>",
        "id": 303725122,
        "sender_full_name": "Assaf Kfoury",
        "timestamp": 1665610385
    }
]