[
    {
        "content": "<p>Patrick -- your course is done now, right? This <a href=\"https://www.math.u-psud.fr/~pmassot/enseignement/math114/\" target=\"_blank\" title=\"https://www.math.u-psud.fr/~pmassot/enseignement/math114/\">https://www.math.u-psud.fr/~pmassot/enseignement/math114/</a> is the link I know about -- is there anything else you have to show off? How did it go?</p>",
        "id": 166039000,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1558298062
    },
    {
        "content": "<p>My French is not so good, so I asked google for some help, and very much liked its translation: \"This course uses the Lean Demonstration Wizard\".</p>",
        "id": 166047268,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1558311653
    },
    {
        "content": "<p>ooo this thread is old but how did this course go?</p>",
        "id": 221406006,
        "sender_full_name": "Angela Li",
        "timestamp": 1609604446
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>  <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span></p>",
        "id": 221408154,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1609607817
    },
    {
        "content": "<p>I think it went well, but half of it took place during Covid lockdown, which disrupted everything of course. I think more students got something from it than during the first iteration. And the Lean community got the tutorials project (which is an almost direct translation of the exercises from this course), and one more contributor to mathlib (Anatole Dedecker). It is still frustratingly difficult for student to translate Lean code into normal maths writing, more difficult than writing Lean code. I may try some new things for the next iteration specifically because of this issue.</p>",
        "id": 221410710,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1609611572
    },
    {
        "content": "<p>In the Lean Together Panel on teaching with proof assistants Patrick showed a Future slide (51:30 <a href=\"https://youtube.com/watch?v=mTLuON5eRZI&amp;feature=share\">https://youtube.com/watch?v=mTLuON5eRZI&amp;feature=share</a> ) with some amazingly readable Lean code. Is this available or described in more detail somewhere? Seems it would definitely be helpful with using Lean in teaching</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"mTLuON5eRZI\" href=\"https://youtube.com/watch?v=mTLuON5eRZI&amp;feature=share\"><img src=\"https://i.ytimg.com/vi/mTLuON5eRZI/default.jpg\"></a></div>",
        "id": 230387060,
        "sender_full_name": "Peter Jipsen",
        "timestamp": 1615829354
    },
    {
        "content": "<p>I would add that I'm very much looking forward to seeing his attempts at controlled natural language via lean 3 parsers and tricks. </p>\n<p>I have been trying to write readable lean code in the formalising mathematics repo</p>",
        "id": 230432596,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615847895
    },
    {
        "content": "<p>I have a full set of basic tactics (enough to do the tutorials project) in this controlled natural language but they are in French.</p>",
        "id": 230432723,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1615847982
    },
    {
        "content": "<p>What is the error reporting like when you step outside the controls?</p>",
        "id": 230435942,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1615849941
    },
    {
        "content": "<p>This is of course the trickiest part. In the end I gave on certain goodies for the sake of error reporting. Especially tactics that actually try several different tactics are very bad for error reporting because the error that surfaces is typically from the last tactic that was tried whereas the first one would have succeeded without a small typo in the arguments.</p>",
        "id": 230436203,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1615850120
    },
    {
        "content": "<p>But I don't think students are more confused than with normal tactics, before they are totally unable to read error messages anyway.</p>",
        "id": 230436242,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1615850153
    },
    {
        "content": "<p>This is not even specific to Lean. I'm still waiting for students who can read basic python error messages.</p>",
        "id": 230436320,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1615850188
    },
    {
        "content": "<p>Actually I think my error messages are more read than python's messages since I wrote error messages in French.</p>",
        "id": 230436339,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1615850215
    },
    {
        "content": "<p>Are the tactics perhaps available somewhere to try out? Or some example files to browse? (No problem if they are in French.) The slide in your presentation made this approach look very useful</p>",
        "id": 230461553,
        "sender_full_name": "Peter Jipsen",
        "timestamp": 1615872394
    },
    {
        "content": "<p>Patrick is definitely right about error messages. I am not really a programmer and I still remember how much I'd felt I'd levelled up in lean when it dawned on me that actually trying to understand what the error messages said was really helpful. I still get loads of questions of the form \"why doesn't this work\"for which the answer is \"lean is telling you exactly which variable you put which is wrong, and what you should have put'</p>",
        "id": 230466082,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615876857
    }
]