[
    {
        "content": "<p>Hi all,</p>\n<p>I am giving an informal course of interactive proving with lean, for mathematics undergrad students.</p>\n<p>I considered talking about finite sets and types, but haven't been able to think of a nice way to present them (mostly because the multiple incarnations of similar concepts: fintype, finset, finite and set.finite). </p>\n<p>Do you know if there is some teaching material that covers that ?</p>",
        "id": 312924781,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1669751422
    },
    {
        "content": "<p>yeah I tend to avoid finiteness. Did you talk about sets? If you have already explained sets then <code>finset</code> is I guess the obvious next thing.</p>",
        "id": 312929724,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1669753011
    },
    {
        "content": "<p>I certainly avoid finiteness in my teaching, but the goal is to teach math, not Lean.</p>",
        "id": 312940209,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1669756886
    },
    {
        "content": "<p>Miguel, I am currently teaching a similar undergraduate class, and I have a bit of material that I used in lectures to give students some pointers about finite sets and structures. It's not really suitable for public consumption but I am planning to work it into another Mathematics in Lean chapter in the spring. In the meanwhile, I can share some of the material with you offline, if you would like.</p>",
        "id": 312974145,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1669774495
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/stream/187764-Lean-for-teaching/topic/Resources.20for.20finite.20sets.2Ftypes/near/312974145\">said</a>:</p>\n<blockquote>\n<p>Miguel, I am currently teaching a similar undergraduate class, and I have a bit of material that I used in lectures to give students some pointers about finite sets and structures. It's not really suitable for public consumption but I am planning to work it into another Mathematics in Lean chapter in the spring. In the meanwhile, I can share some of the material with you offline, if you would like.</p>\n</blockquote>\n<p>That would be very helpful. Can you please email it to me?</p>",
        "id": 313005571,
        "sender_full_name": "Miguel Marco",
        "timestamp": 1669795710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>  I'd be interested too, since I have a student who is doing a final project on adjacency matrices of finite simple graphs, and so far my advice to him was to just do it for arbitrary types and avoid finiteness (as Kevin also said), but it would be nice to have some concrete finite types to reduce/eval some basic computation with adj matrices.</p>",
        "id": 314156478,
        "sender_full_name": "Sina",
        "timestamp": 1670289852
    }
]