[
    {
        "content": "<p>Hi,</p>\n<p>I am involved in a pilot Lean course which I mentioned recently in this stream. I would like to set up some form of communication for participants to have discussions. There are a few options available, but I thought Zulip could be a good way to do this, as it would automatically draw our (small) cohort into the main forum for the Lean community.</p>\n<p>I saw <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> has done this before, using a private stream. Did this work well, and if so, is it possible for me to set up a private stream here? I also saw <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> mention use of a channel in the Xena discord: did this work well and do you think this would be a good place for people to hang out and chat about the course?</p>\n<p>Sorry for these very newbie questions, I'm not totally sure of the etiquette here. I would like to try and bring the participants in to the Lean community during the course and see where discussions happen (they are grad students, postdocs and faculty, so optimistically some of them will stick around longer term).</p>",
        "id": 321645243,
        "sender_full_name": "Patrick Kinnear",
        "timestamp": 1673876999
    },
    {
        "content": "<p>I was thinking of setting up a private stream for my current course but when I tried to do it I couldn't figure out how to (which was strange because I've done it before). Maybe something changed at some point?</p>",
        "id": 321648926,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1673878038
    },
    {
        "content": "<p>I think anyone can create a private stream.</p>",
        "id": 321649416,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1673878166
    },
    {
        "content": "<p>On the website, there is a cogwheel icon in the upper-right corner with a menu containing \"Manage streams\"</p>",
        "id": 321649561,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1673878203
    },
    {
        "content": "<p>This open a dialog whose right-hand side has a button \"Create stream\"</p>",
        "id": 321649693,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1673878231
    },
    {
        "content": "<p>But I have moderations rights here, so maybe I see more buttons than the average user.</p>",
        "id": 321649788,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1673878262
    },
    {
        "content": "<p>Current settings for public and private streams are “admins and moderators”</p>",
        "id": 321651558,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1673878605
    },
    {
        "content": "<p>I personally just set up another Zulip server.</p>",
        "id": 321652208,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1673878779
    },
    {
        "content": "<p>Ah yes, I imagine it's something moderators can do but not normal users (I can't see the create stream option under manage streams).</p>",
        "id": 321663544,
        "sender_full_name": "Patrick Kinnear",
        "timestamp": 1673881777
    }
]