[
    {
        "content": "<p>This failed to merge yesterday and wasn't automatically re-tried.  I've tried re-running the jobs that had failed (not sure if this was the right thing to do) and it failed again.  Both times the failure was at the stage where it tries to <code>install trepplein</code>.  Could someone give this a nudge, or is this just some bors weather I have to wait to pass over?</p>",
        "id": 281681366,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652101832
    },
    {
        "content": "<p>Hmm, not sure either. Can you merge master and see if that helps?</p>",
        "id": 281682179,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1652102155
    },
    {
        "content": "<p>I merged master and CI failed on <code>.github/workflows/merge_conflicts.yml / main (pull_request_target)</code>, although it's nonetheless gone on to start <code>Build mathlib</code></p>",
        "id": 281688001,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652104657
    },
    {
        "content": "<p>This has also been reported <a href=\"#narrow/stream/113488-general/topic/unhappy.20user.20ID.20104802998\">here</a>. I wouldn't worry about those jobs now. Even if they keep failing they shouldn't prevent the main build / lint jobs nor should they be able to prevent bors from merging the PR later.</p>",
        "id": 281688226,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1652104749
    },
    {
        "content": "<p>Ok, thanks</p>",
        "id": 281688944,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652105026
    },
    {
        "content": "<p>This failed again at <code>Build mathlib</code>, but I'll wait patiently for the weather to blow over</p>",
        "id": 281727293,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652121603
    },
    {
        "content": "<p>This time it looks like the runner lost connection to github (possibly due to being overloaded). It's a bit annoying how GitHub doesn't show this on the actual job, but if you navigate to the <a href=\"https://github.com/leanprover-community/mathlib/actions/runs/2294607456/attempts/1\">\"Summary tab\" for the run</a> and scroll down to the \"Annotations\" at the bottom, you'll see :</p>\n<blockquote>\n<p>Build mathlib<br>\nThe self-hosted runner: nela lost communication with the server. Verify the machine is running and has a healthy network connection. Anything in your workflow that terminates the runner process, starves it for CPU/Memory, or blocks its network access can cause this error.</p>\n</blockquote>\n<p>When this happens, you can try re-running the job from the \"Re-run jobs\" button in the top right (which I've just done).</p>",
        "id": 281728162,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1652121955
    },
    {
        "content": "<p>I merged master on this again and it has passed CI.  Could someone give bors a nudge to see if it will merge this time?   Thanks</p>",
        "id": 282169040,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652388324
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 282171679,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1652389591
    }
]