[
    {
        "content": "<p>Hi - wondering if I could get a review on <a href=\"https://github.com/leanprover-community/mathlib/pull/13182\">#13182</a>, since it's been a few days and hasn't been picked up from the queue. More generally, should I ask in this channel for reviews or should I expect it to be picked up by someone automatically from the PR page?</p>",
        "id": 278407790,
        "sender_full_name": "Mark Lavrentyev",
        "timestamp": 1649507345
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"266440\">@Shing Tak Lam</span></p>",
        "id": 278407803,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1649507381
    },
    {
        "content": "<p>One first comment is that you have four new definitions and no API at all.</p>",
        "id": 278407870,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1649507437
    },
    {
        "content": "<p>In general, as long as your PR is marked <code>awaiting-review</code> then it should (eventually) be picked up by someone looking at the <a href=\"https://bit.ly/3zVLgqR\">#queue</a> and you shouldn't need to ask here for reviews.  However, when people are busy this can take a while, and so it's not unreasonable to worry that you've done something wrong and accidentally left your PR languishing in an unseen corner somewhere!</p>",
        "id": 278410026,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1649510632
    },
    {
        "content": "<p>Also, we're in a bit of a <a href=\"https://bit.ly/3zVLgqR\">#queue</a> management crisis at the moment. If <em>everyone</em> (not only maintainers) pitches in with reviews, this makes the job of maintainers easy. If maintainers can see that some review has happened, and someone relatively experienced has marked the PR as \"approved\", or said something equivalent, they might just merge quickly. :-)</p>",
        "id": 278411508,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1649512717
    }
]