[
    {
        "content": "<p>This was approved last week but was waiting on a dependency on <a href=\"https://github.com/leanprover-community/mathlib/pull/10689\">#10689</a>.  That merged 2 days ago and the robot marked the dependency as resolved, but it still has a pending check <code>Dependent Issues Pending — Blocked by #10689</code>.  Do I just need to be patient, or does something need to be done to give the robot a nudge?</p>",
        "id": 265328285,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1639761069
    },
    {
        "content": "<p>Once the dependencies get merged, a maintainer should take a final look to ensure the remaining code will merge cleanly. So indeed, Bors needs to be given a nudge before something happens. By the way, your PR dropped of the maintainers' radar because you removed the <code>awaiting-review</code> tag.</p>\n<p>More generally, any branch that has had a green checkmark for a couple of minutes is probably not going to be updated, so feel free to poke the maintainers a bit sooner next time! :)</p>",
        "id": 265330363,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1639761948
    },
    {
        "content": "<p>Ah, I thought that once the checks had cleared it was just a matter of waiting to resolve the dependency, which is why I took off the label. Thanks for explaining and for nudging!</p>",
        "id": 265331785,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1639762536
    },
    {
        "content": "<p>On the subject of \"Intermediate PRing\" lessons: if a reviewer has used the \"request changes\" facility on a PR rather than just commenting to suggest changes (e.g. in <a href=\"https://github.com/leanprover-community/mathlib/pull/10540\">#10540</a>) do I have to flip some switch to confirm that the changes have been made, beyond just resolving the relevant conversations?</p>",
        "id": 265340388,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1639766126
    },
    {
        "content": "<p>That should be enough</p>",
        "id": 265343491,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1639767596
    },
    {
        "content": "<p>The \"request changes\" flag can only be unflipped by the person who set it, but also isn't noticed by bors</p>",
        "id": 265347516,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1639769432
    },
    {
        "content": "<p>Oh dear, I didn't know it could be unflipped - can you onlu dom that by making another review?</p>",
        "id": 265347723,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1639769471
    },
    {
        "content": "<p>There's a \"dismiss stale review\" button you can click</p>",
        "id": 265348691,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1639769686
    },
    {
        "content": "<p>So is it considered rude or impatient to click the \"Re-request review\" button when the requested changes are completed, or is this a useful thing to do?  Is it like standing at reception repeatedly pinging the bell for service?!</p>",
        "id": 265425065,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1639842646
    },
    {
        "content": "<p>This is a good question which can best be answered by the maintainers, but my 2 cents as a contributor is that if I think everything's done and the ball is in the maintainer's court then I just make sure my PR is on the <a href=\"https://bit.ly/3zVLgqR\">#queue</a> (ie make sure it compiles and it's tagged \"awaiting review\") and then I forget about it. They're really busy.</p>",
        "id": 265425247,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639842881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"422543\">@Stuart Presnell</span> If your PR has been on the <a href=\"https://bit.ly/3zVLgqR\">#queue</a> for &gt; 24 hrs, I think it's fine to give a polite ping (the request-review-button is fine for that, but you can also use this stream on zulip). Especially if you have other stuff that depends on this PR.</p>",
        "id": 265425874,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1639843650
    },
    {
        "content": "<p>I guess if you start \"pinging the bell for service\" multiple times per day, we would quickly let you know to calm down <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 265425938,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1639843686
    }
]