[
    {
        "content": "<p>I think I messed up with the PR process. I intended to <em>to make many PRs containing small, self-contained pieces</em>, so I committed+pushed some material and created this PR. Later I committed material intended for a 2nd PR (to be reviewed afterwards) but it got absorbed by this one.</p>\n<p>Should I rebase my branch in order to eliminate that last commit?</p>\n<p>Apart from some line overflows, I think it looks OK, but if I keep it, the commit message for the PR has half the information right now.</p>",
        "id": 316510459,
        "sender_full_name": "Pedro Sánchez Terraf",
        "timestamp": 1671311082
    },
    {
        "content": "<p>We don't care about the commit history within a PR because we squash-merge, so do whatever you prefer!</p>",
        "id": 316552608,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1671350359
    },
    {
        "content": "<p>We do actually have a policy not to rebase / force push to make reviewers' life easier</p>",
        "id": 316556220,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1671353004
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2317972.20Borel.20hierarchy/near/316556220\">said</a>:</p>\n<blockquote>\n<p>We do actually have a policy not to rebase / force push to make reviewers' life easier</p>\n</blockquote>\n<p>I understand that, when the review process has started. I'll just commit to satisfy the linters then.</p>\n<p>EDIT: Well, I did that and edited the PR title &amp; comment in order to better reflect the current situation. I also explained that the changes to <code>set_theory</code> could be reviewed separately (that was my original intent).</p>",
        "id": 316579135,
        "sender_full_name": "Pedro Sánchez Terraf",
        "timestamp": 1671365966
    },
    {
        "content": "<p><em>On the new file <code>borel_hierarchy.lean</code></em>: Near the end, the main results in <a href=\"https://leanprover-community.github.io/mathlib_docs/measure_theory/card_measurable_space.html\">measure_theory.card_measurable_space</a> are reproved. As part of the initial development, I removed the original (theorem) docstrings.<br>\nI believe it would be reasonable to split the file, use the last part as a replacement of <code>measure_theory.card_measurable_space</code> while adding the missing theorem docstrings and the original authors to the list.</p>",
        "id": 316723519,
        "sender_full_name": "Pedro Sánchez Terraf",
        "timestamp": 1671451078
    }
]