[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"132889\">@Jean Lo</span>  asked at <a href=\"https://github.com/leanprover-community/mathlib/pull/1926/files#diff-d195d790a435985b1cbbef26bfcac1edR158\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/pull/1926/files#diff-d195d790a435985b1cbbef26bfcac1edR158\">https://github.com/leanprover-community/mathlib/pull/1926/files#diff-d195d790a435985b1cbbef26bfcac1edR158</a>:</p>\n<div class=\"codehilite\"><pre><span></span>-- TODO: this section contains lemmas all named like `seminorm_lemma`,\n-- mimicking e.g. `norm_sub_rev`. Immediately after there is a\n-- namespace `seminorm`, which contains the definition `seminorm.ball`\n-- and related lemmas named `seminorm.property_ball`, mimicking\n-- `metric.ball` and `metric.bounded_ball`. What is the\n-- convention/rationale?\n</pre></div>\n\n\n<p>Can someone explain?</p>\n<p>My guess is that historically we used more <code>X_Y</code> names, and have trended over time to putting declarations in namespaces. I prefer this.</p>\n<p>Of course, if putting a declaration in a namespace enables projection notation, one should essentially always do this.</p>",
        "id": 189627305,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1583264945
    },
    {
        "content": "<p>The <a href=\"https://github.com/leanprover-community/mathlib/blob/master/docs/contribute/naming.md\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/master/docs/contribute/naming.md\">naming guide</a> doesn't seem to be prescriptive on this issue. It does say \"We generally restrict the use of dots to inductive types. So, for example, we use: <code>dvd_intro</code> <code>...</code>\"</p>",
        "id": 189627522,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1583265066
    },
    {
        "content": "<p>It seems that the naming guide should be updated.</p>",
        "id": 189629543,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1583266269
    },
    {
        "content": "<p>One thing to consider is whether the namespace will or should be <code>open</code>ed. If the names become ambiguous (to a human) without the namespace, they should probably be <code>protected</code> or written with underscore instead</p>",
        "id": 189632566,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583268496
    },
    {
        "content": "<p>I generally find the more deeply nested parts of mathlib more difficult to use, so I try to keep the namespaces rather flat, but that's just my preference. In particular, once you have enough to globally pick out the area of maths you don't need to namespace anymore; it's not a file hierarchy so things like <code>algebra.linear_algebra.vector_space.basis</code> are completely unnecessary (to give an exaggerated example)</p>",
        "id": 189632748,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583268641
    },
    {
        "content": "<p>Hi, I've just gotten back to working on this — sorry for the absence, and thanks for looking at it!</p>\n<p>Thinking about what's been said above about whether names become ambiguous, I feel like it might actually make sense to keep the names as they are now: I think the lemmas will become confusing if they were without their underscore-prefix; on the other hand <code>seminorm.ball</code> has the seminorm as the explicit first argument, so I imagine the user can reasonably open the namespace and write <code>ball p x r</code> and not be confused. Does that sound reasonable?</p>\n<p>(I'm currently making an effort to get this up to date and into a state that's ready for review / merging, but mathlib has moved to 3.5.1 in the meantime and I will first have to spend some time building lean again, so it might be a few days before the WIP label can be gone. Hope that's okay &amp; sorry for the delay.)</p>",
        "id": 189728438,
        "sender_full_name": "Jean Lo",
        "timestamp": 1583351659
    }
]