[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/issues/1136\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/issues/1136\">#1136</a>, on further properties of the tangent cone, is not really interesting per se. However, there is a lot of material I would like to submit (on an extended derivatives API, and the mean value inequality, and <code>C^\\infty</code> functions) that depends on it. That is the problem with small PRs for which the interest is not obvious by itself. Anyway, I would be grateful if someone could have a look.</p>",
        "id": 169760513,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1562406578
    },
    {
        "content": "<p>I think the issue is nobody has any opinion about this. I guess this story is mostly ignored in the real world. The PR looks good to me, but I never thought about the maths. Do you have any paper reference you could mention in the Lean file?</p>",
        "id": 169860039,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562585199
    },
    {
        "content": "<p>I would say that if <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> has no opinion either then we should merge this</p>",
        "id": 169860045,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562585218
    },
    {
        "content": "<p>No paper reference. It's one of these things that are math-trivial, but important when you do formalization. Usually, C^\\infty functions are defined on open sets, and when you want to define a C^\\infty function on a manifold with boundary you require that, in charts, it extends to a C^\\infty function slightly beyond the boundary, and then you check that nothing depends on the extension. Except that \"checking that nothing depends on the extension\" quickly becomes a can of worms, for instance if you try defining the tangent bundle. Everything is much neater and intrinsic if you accept to define smooth functions on more general sets than open sets, but then you need conditions to make sure that the differential is unique. That is the whole point of this notion of tangent cone. This is not complicated, but it needs some API to be usable efficiently.</p>",
        "id": 169863684,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1562588732
    },
    {
        "content": "<p>Maybe you need to write that paper reference then. I really don't like the idea that some day Viviane could eventually find a way to prevent you from wasting time playing with computer, and nobody will ever be able to use mathlib derivatives because it's all based on non-standard maths. We are already very close to having this problem in the topology part of the library (and my next PR will make it even worse).</p>",
        "id": 169864237,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562589311
    },
    {
        "content": "<p>Sorry, it's on my list. (I even assigned it to myself!) I was planning to look over it tomorrow. Is that o.k.? If that is holding Sebastien up, I am o.k. with merging it.</p>",
        "id": 169876261,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1562597596
    },
    {
        "content": "<p>Who is Viviane?</p>",
        "id": 169878176,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1562599024
    },
    {
        "content": "<p><a href=\"https://en.wikipedia.org/wiki/Viviane_Baladi\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Viviane_Baladi\">https://en.wikipedia.org/wiki/Viviane_Baladi</a> was Sébastien's PhD advisor. It seems she has pretty strong opinion about how useful it is to use Sébastien's brain on formalized math...</p>",
        "id": 169878473,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562599233
    },
    {
        "content": "<p>Aha... most mathematicians seem to have strong opinions on formalising maths. And they don't all agree (-;</p>",
        "id": 169878665,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1562599356
    },
    {
        "content": "<p>We're lucky Sébastien defended a while ago</p>",
        "id": 169878797,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562599445
    },
    {
        "content": "<p>If I'm talking with a random mathematician (that I don't know very well) about the perfectoid project, and I say: \"You know, this is really polarising. We have fields medalists who think this is a complete waste of time, and other fields medalists who think this is quite exciting stuff\". Then they reply with: \"Ooh, that's quite a surprising reaction!\". Then I ask them: \"Which one, the 'waste of time' reaction, or the 'exciting-stuff' reaction?\".</p>\n<p>The answer to that question seems to model a perfect toin coss.</p>",
        "id": 169878864,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1562599500
    },
    {
        "content": "<p>Math genealogy says 2004.</p>",
        "id": 169878922,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562599549
    },
    {
        "content": "<p>Oh it also says Damien Thomine was a student of Sébastien. I didn't know that. He is a guy in my corridor who expressed interest in Lean, but never really jumped in. Now I will try harder to enroll him.</p>",
        "id": 169879037,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1562599625
    }
]