[
    {
        "content": "<p>I started recently (see <a href=\"#narrow/stream/116395-maths/topic/Lagrange.20interpolants\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/Lagrange.20interpolants</a>) a refactor of Lagrange interpolants, initially aiming to remove a bunch of unnecessary decidable_eq hypotheses on the field by doing things over a suitable indexing set instead. The PR has grown a bit in the doing, as the new approach I've tried allowed for improved or extended versions of some theorems. It's currently here: <a href=\"https://github.com/leanprover-community/mathlib/pull/15036\">https://github.com/leanprover-community/mathlib/pull/15036</a></p>\n<p>I just managed to implement the barycentric form of the interpolant.</p>\n<p>My last messages in that other thread show where I'm at - I think the refactor is good and useful, but a) my proofs probably could do with golfing, b) I need to check there's no other generalisations etc. that could be put in, c) there are some special cases of the interpolant that you can usefully define, including one that re-implements the current form: should we have these/lemmas for them, d) does this need splitting into multiple PRs?</p>",
        "id": 288414133,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1656943876
    },
    {
        "content": "<p>Thanks to <span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span> for a great review on this. I'm actually going to move it out of WIP now, though it will still need further review before it's ready: I think this is viable though.</p>",
        "id": 290495060,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1658490256
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"330967\">Wrenna Robson</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2315036.20Lagrange.20interpolant.20refactor.20and.20extension/near/290495060\">said</a>:</p>\n<blockquote>\n<p>Thanks to <span class=\"user-mention silent\" data-user-id=\"238446\">Anne Baanen</span> for a great review on this. I'm actually going to move it out of WIP now, though it will still need further review before it's ready: I think this is viable though.</p>\n</blockquote>\n<p>This has now merged.</p>",
        "id": 291878412,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1659545235
    }
]