[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> This new PR of yours is probably affected by some thoughts I have had lately about orthonormal bases.  I'd like to introduce a new bundled definition <code>orthonormal_basis</code>, which is a finite-dimensional version of the <a href=\"https://leanprover-community.github.io/mathlib_docs/find/hilbert_basis\">docs#hilbert_basis</a> definition I recently added for (primarily) the infinite-dimensional case.  By definition an <code>orthonormal_basis</code> on <code>ι</code> would be a structure whose single field is a linear isometry equivalence <code>repr</code> from <code>E</code> to <code>euclidean_space 𝕜 ι</code>, and an orthonormal basis would be given a <code>coe_fn</code> associating to it a function <code>ι → E</code> listing the basis elements.  Then we'd prove lemmas <code>orthonormal_basis.orthonormal</code>, <code>orthonormal_basis.sum_repr</code>, <code>orthonormal_basis.span_eq</code>, <code>orthonormal_basis.basis</code>, etc.</p>\n<p>I think this would work out quite cleanly.  It's directly analagous to how <a href=\"https://leanprover-community.github.io/mathlib_docs/find/basis\">docs#basis</a> itself is actually defined, and also analogous to the new <code>hilbert_basis</code> which seems to be working well.</p>\n<p>What do you think?  I mention it because I think this would affect your PR, in that some of the content would be expressed differently.  It would also require a rewrite of some stuff currently in <code>inner_product_space.projection</code> and <code>inner_product_space.spectrum</code>.</p>",
        "id": 269052183,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1642989457
    },
    {
        "content": "<p>I haven't tried this refactor yet because of some other WIP which also touches <code>inner_product_space.spectrum</code>, but that shouldn't be too far off.</p>",
        "id": 269052242,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1642989511
    },
    {
        "content": "<p>Having <code>orthonormal_basis</code> seems reasonable, but I don't see any reason for it to block that PR; that PR going in would simply mean that a few more lemmas and definitions need adjusting to take a single <code>orthonormal_basis</code> rather than separate <code>basis</code> and <code>orthonormal</code> hypotheses (and that after such adjustment, you have the API for <code>orthonormal_basis.equiv</code> done, though many other pieces of API such as <code>map</code> and <code>reindex</code> will be needed as well).</p>\n<p>Note that nothing in that PR depends on being finite-dimensional. I don't know how useful infinite-dimensional orthonormal bases are, but they're certainly mathematically meaningful (if represented with a linear isometry equivalence, it would be one to a <code>finsupp</code> (for which I don't think we currently have an inner product space structure defined) rather than to <code>euclidean_space</code>, with the equivalence to <code>euclidean_space</code> in the finite-dimensional case being deduced from that).</p>",
        "id": 269058694,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1642998058
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2311631/near/269058694\">said</a>:</p>\n<blockquote>\n<p>that PR going in would simply mean that ... after such adjustment, you have the API for <code>orthonormal_basis.equiv</code> done, though many other pieces of API such as <code>map</code> and <code>reindex</code> will be needed as well</p>\n</blockquote>\n<p>Yup, makes sense.</p>",
        "id": 269058844,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1642998263
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.2311631/near/269058694\">said</a>:</p>\n<blockquote>\n<p>Note that nothing in that PR depends on being finite-dimensional. I don't know how useful infinite-dimensional orthonormal bases are, but they're certainly mathematically meaningful (if represented with a linear isometry equivalence, it would be one to a <code>finsupp</code> (for which I don't think we currently have an inner product space structure defined) rather than to <code>euclidean_space</code>, with the equivalence to <code>euclidean_space</code> in the finite-dimensional case being deduced from that).</p>\n</blockquote>\n<p>This is technically true, but I've never seen a literal \"orthonormal basis\" used in infinite dimension, since the inner product spaces which admit them are so badly behaved (not complete).  Good infinite-dimensional inner product spaces have Hilbert bases!</p>\n<p>So I'd rather stick to the \"equiv with <code>euclidean_space</code>\" definition for orthonormal basis.  Even this is arguably unnecessary, since a finite-dimensional Hilbert basis is an orthonormal basis, but I think it's useful to have a direct elementary construction in finite dimension.</p>",
        "id": 269059045,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1642998596
    }
]