[
    {
        "content": "<p>This PR <a href=\"https://github.com/leanprover-community/mathlib/pull/14271\">#14271</a> has been accumulating dust for two weeks now</p>",
        "id": 285489887,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1654754543
    },
    {
        "content": "<p><span aria-label=\"ping pong\" class=\"emoji emoji-1f3d3\" role=\"img\" title=\"ping pong\">:ping_pong:</span></p>",
        "id": 285868787,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1655078478
    },
    {
        "content": "<p>So in combinatorial game theory, the four possible outcomes of comparing a game G with the empty game 0, <code>&lt;</code>, <code>&gt;</code>, <code>≈</code>,  or<code>∥</code>, corresponds exactly to the four possible outcomes of the game: right wins (no matter who moves first), left wins (ditto), whoever moves second wins, or whoever moves first wins. I think it's reasonable to drop the abbreviations (currently actually defs) <code>right_wins</code>, <code>left_wins</code>, <code>first_loses</code> and <code>first_wins</code> in favor of the relation operators, because the relation operators are just the mathematical way of stating the outcomes, and we have more lemmas to work with them. They are also pretty intuitive once you internalize the convention that positive is advantage for left and negative is advantage for right, and that in the empty game 0 without moves, the first player (who is obliged to move) loses.</p>\n<p>However, now that I look at the PR again, I do think the above should be explained in the docstring, probably module docstring in <code>pgame.lean</code>? Also using relation operators may make some theorem statements (that are currently stated using <code>win/lose</code> predicates) slightly less intuitive, so whenever you do such a change, it may be a good idea to add a docstring to the theorem, stating the result using the win/lose terminology. For example, in <a href=\"https://leanprover-community.github.io/mathlib_docs/find/pgame.impartial.winner_cases\">docs#pgame.impartial.winner_cases</a> (now <code>equiv_or_fuzzy_zero</code>), the docstring could say \"in an impartial game, either the second player always wins, or the first player always wins\".</p>",
        "id": 285880297,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1655094082
    },
    {
        "content": "<p>It's already explained in the <code>pgame.lean</code> module docstring what each of the four relations means in terms of winning players</p>",
        "id": 285886191,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1655101451
    },
    {
        "content": "<p>I added the docstring on <code>impartial.winner_cases</code>, but I don't think we should add too many of these. The order relations themselves are ultimately what's important here.</p>",
        "id": 285886425,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1655101703
    },
    {
        "content": "<p>In some developments of CGT, the win/lose outcomes are of central importance, and the outcome is a function <code>o</code> from games to four possible values L,R,N (next, i.e. first player wins),P (previous, i.e. second player wins). This is a total function on well-founded games, and only a partial function on loopy games. It might be more reasonable to change the original win/lose statements to be in terms of this function instead (of course, the inequality statement should still be kept).</p>\n<p>For example, in Siegel's CGT (see p.12 and p.14), the \"fundamental\" equivalence between games G and H is defined to mean o(G+X) = o(H+X) for a certain class of games X, but with the adopted definition in mathlib, we don't have it stated as a theorem yet. The definition is also flexible to allow us obtain different notion of equivalence by restricting the class of games according to whether you care about normal or misere play conventions, partizan or impartial, short (finite many positions) or possibly long, well-founded or loopy.</p>",
        "id": 285932660,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1655129299
    },
    {
        "content": "<p>This doesn't seem like a very useful theorem though, at least not with our current development. It's essentially all the theorems on <code>≤</code>, <code>⧏</code>, etc. preserving equivalence smushed into one</p>",
        "id": 286119009,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1655233763
    },
    {
        "content": "<p>When we start a development of loopy games, there's a lot of things that will need to be changed. I wouldn't worry about them until we actually start said refactor.</p>",
        "id": 286119283,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1655233897
    }
]