[
    {
        "content": "<p>Oooh, we've made some good progress on the PR queue recently, and my old PR on domineering as a combinatorial game is back on the front page. I think it's in good shape, so it would be nice if someone could have a quick look at it.</p>",
        "id": 189330964,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1582910864
    },
    {
        "content": "<p>Recall a combinatorial game (already in mathlib) is, per Conway's definition, an inductive type containing two indexed families of combinatorial games, representing the available moves for the two players \"Left\" and \"Right\".</p>\n<p>This PR first adds the notion of a \"short game\", which just adds the condition that every indexing family (including those of the subgames) are <code>fintype</code>. There are then various lemmas about short games (the algebraic operations on games preserve short games, games built via lists of short games are short games, etc). The final results in this file are then the facts that the order operations, and hence equivalence of games, are decidable on short games. This is simply asserting that it's possible to completely explore the game tree if it's finite at every step.</p>\n<p>After that, we provide a new mechanism for constructing short games, in the case that the game can be described by a \"state\" (e.g. the actual configuration of chess pieces on a board), containing <code>finset</code>s of possible moves, and decreasing bounds on the number of possible turns remaining.</p>\n<p>Finally, we construct an example, the game of Domineering, using this setup, and verify that it is computational --- that is, the decidability instances for the order operations really do compute.</p>\n<p>In order to actually prove the best known results on values of small games in Domineering (or any other combinatorial game), one couldn't just rely on this computation, but it's very convenient for end-games!</p>",
        "id": 189330967,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1582910868
    },
    {
        "content": "<p>I started looking at this for learning purposes a while ago. I'll take another look at it now that it's been updated.</p>",
        "id": 189335094,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1582913382
    }
]