[
    {
        "content": "<p>[Copied from the metaprogramming stream: I'm hoping that this message did not get answers, due to where it was posted!  <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> ]</p>\n<p>Dear All,</p>\n<p><a href=\"https://github.com/leanprover-community/mathlib/pull/14532\">#14532</a> introduces \"function underscores\" for use with <code>congrm</code>.  This is to implement one of Heather's suggestions in the thread \"variant syntax for <code>congr'</code>\" in metaprogramming.</p>\n<p>The PR introduces notation <code>_ᵢ</code> for an unspecified function with arity <code>i</code>.  Does anyone have any opinion on the matter?</p>\n<p>Thanks!</p>",
        "id": 288220450,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1656707222
    },
    {
        "content": "<p>I assume it's not possible to directly match <code>_ _ _</code> as a placeholder for <code>f a b</code>?</p>",
        "id": 288326046,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1656852603
    },
    {
        "content": "<p>I think that it might, but there might be issues.  Whenever you encounter an underscore, you could check if the lhs is a function or not.  If it isn't, then proceed to create a side-goal.  If it is a function, you could count its explicit arguments and use the next so-many provided arguments to continue the matching process.</p>",
        "id": 288335925,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1656866206
    },
    {
        "content": "<p>I'd have to experiment with it, but is seems a possibility</p>",
        "id": 288335932,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1656866223
    },
    {
        "content": "<p>After all, the user-provided expression can be parsed however the tactic wants...</p>",
        "id": 288335946,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1656866265
    },
    {
        "content": "<p>In fact, an earlier version of the tactic had a behaviour very similar to this, but then it was suggested that using a different symbol for this kind of underscore was preferable, if I remember correctly.</p>",
        "id": 288336084,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1656866416
    }
]