[
    {
        "content": "<p>It would be nice if someone could have a look at this. It's more than a month old and looking at PRs like <a href=\"https://github.com/leanprover-community/mathlib/pull/15703\">#15703</a> it will keep rotting.</p>",
        "id": 290995760,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1658904935
    },
    {
        "content": "<p>Taking a look right now!</p>",
        "id": 290997062,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1658905829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260921\">@Markus Himmel</span> The diff doesn't really show pain points being removed, which I find a bit surprising.<br>\nI can certainly imagine <code>\\u X</code> being annoying, but it isn't really noticeable in the diff.</p>",
        "id": 290997621,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1658906293
    },
    {
        "content": "<p>The reason is that the places where this was really painful (most prominently <code>category_theory.sheaf</code>, i.e., sheaves on sites) are already migrated to a custom structure specific to that category. The goal of this (and future) PRs is to make full subcategories usable enough that you don't have to hand-roll the custom structure for every full subcategory you want to consider. In a follow-up PR, we should be able to make sheaves on sites into a <code>full_subcategory</code> (potentially after also creating a structure for morphisms in a <code>full_subcategory</code> as is done for sheaves). In other words, the present PR can be seen as a first step to get the ball rolling. I hope you'll agree that multiple small refactors with small diffs are preferable to a single huge refactor with a huge diff.</p>\n<p>If you like, you can also have a look at the Zulip discussion linked in the PR, where the pain points of using subtypes are discussed in detail.</p>",
        "id": 290998321,
        "sender_full_name": "Markus Himmel",
        "timestamp": 1658906785
    },
    {
        "content": "<p>Aha, fair enough. So we should refactor sheaves to make use of this new refactor. Good point. Let's merge this.</p>",
        "id": 290999476,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1658907606
    },
    {
        "content": "<p>I gave you a <code>bors d+</code> since CI is still running.</p>",
        "id": 290999630,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1658907699
    }
]