[
    {
        "content": "<p>I heartily invite anyone interested to have a look at this PR, and the related <a href=\"https://github.com/leanprover-community/mathlib/issues/2850\">#2850</a>. It can maybe serve as a prototype for other back-and-forth arguments.<br>\n<span class=\"user-mention\" data-user-id=\"252300\">@Jalex Stark</span></p>",
        "id": 199206716,
        "sender_full_name": "David Wärn",
        "timestamp": 1590783481
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"302826\">@Aaron Anderson</span> and I read through together. It looks great! We're looking at using the same framework to prove that the theory of the Rado graph is omega-categorical</p>",
        "id": 199321475,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1590959758
    },
    {
        "content": "<p>I think the way you use <code>cmp</code> will make it natural to generalize most of the machinery to partial isomorphisms of relational structures.</p>",
        "id": 199323542,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1590963803
    },
    {
        "content": "<p>That's good to hear! :-) The Rado graph sounds like a good next step. The key to any relational structure should be to prove an analogue of what I called <code>separation</code>: with the Rado graph this is axiomatic afaiu.</p>",
        "id": 199344742,
        "sender_full_name": "David Wärn",
        "timestamp": 1590998375
    },
    {
        "content": "<p>yes, I agree</p>",
        "id": 199348351,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591001739
    },
    {
        "content": "<p>I think all I need to finish is a bunch of exercises with <code>finset</code>s</p>",
        "id": 199348433,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591001801
    },
    {
        "content": "<p>just to record a mistake I fell into when trying to apply these proofs to the Rado graph:<br>\nthe proofs are simplified by the fact that equality can be recovered from your <code>cmp</code> function. for instance this is needed in order for <code>partial_iso</code>s to be thought of as bijective functions between subsets.  I added in this bijectivity as a new property of <code>partial_iso</code> and had to deal with nontrivial new proof obligations. Adding equality as one of the <code>cmp</code> outcomes is easier</p>",
        "id": 199682856,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591221822
    }
]