[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> has done the great job of immediately emptying the <code>init_/</code> folder (with the algebraic hierarchy that came from core) and merging it into the standard hierarchy in mathlib. But the diff is huge!<br>\nI think we should prioritise this PR, because it is a mega refactor.</p>",
        "id": 197921036,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589801801
    },
    {
        "content": "<p>How are we going to review this?</p>",
        "id": 197921044,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589801810
    },
    {
        "content": "<p>Btw, big thanks to Mario <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span> <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span></p>",
        "id": 197921063,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589801831
    },
    {
        "content": "<p>I vote for merging before this gets 101 merge conflicts.</p>",
        "id": 197923155,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589803298
    },
    {
        "content": "<p>I agree. Mario does solid work as always, and I don't see anything that can't be fixed in a follow-up PR.</p>",
        "id": 197924143,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589803863
    },
    {
        "content": "<p>I think as Mario particularly said that this PR is just meant to do the migration, and we should defer making things \"mathlib style\" for a subsequent PR, if it builds, lets merge it.</p>",
        "id": 197924168,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589803879
    },
    {
        "content": "<p>Shall we fix the remarks by Gabriel? (Especially the copyright headers.)</p>",
        "id": 197924304,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589803940
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> Maybe Mario changed those copyrights to an earlier date to reflect the copyright of the migrated file from core?</p>",
        "id": 197924681,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589804053
    },
    {
        "content": "<p>I assume that's what happened.  But AFAICT the files were merged, and contain contents from both dates.  In this case the date should be the maximum, and the author list the union.</p>",
        "id": 197926706,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589804840
    },
    {
        "content": "<p>Ooh, I don't understand copyrights...</p>",
        "id": 197926926,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589804926
    },
    {
        "content": "<p>My limited understanding of this is that ... the year you write doesn't mean very much, and regardless of what you say in the copyright notice a separate legal copyright exists for each revision in any case. Arguably using the minimum year is the least correct thing to do, as that can easily be read as implying that a copyright for the current revision existed as of the minimum year.</p>",
        "id": 197928327,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589805729
    },
    {
        "content": "<p>Maybe it's not too late to start public-domaining mathlib...</p>",
        "id": 197928387,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589805779
    },
    {
        "content": "<p>Don't we see \"Copyright 2006-2020 [blah]\" nowadays on the bottom of a lot of web pages?</p>",
        "id": 197928653,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589805955
    },
    {
        "content": "<p>Yes. It's also the reason you often see things like \"Copyright 2006, 2010, 2020\", which might implicitly assert there were revisions or new editions made in those particular years, and separate copyrights exist for each.</p>",
        "id": 197928794,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589806029
    },
    {
        "content": "<p>Good luck relicensing the stuff from Johannes (Hölzl) or Leo.  I don't expect any problems from being careless with the copyright headers, it's more a politeness thing.  Legally speaking, the biggest requirement is probably due to paragraph 4 of the license:</p>\n<blockquote>\n<p>(b) You must cause any modified files to carry prominent notices stating that You changed the files; and<br>\n(c) You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; [...]</p>\n</blockquote>",
        "id": 197928846,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589806059
    },
    {
        "content": "<p>My brain shut down while parsing (c).</p>",
        "id": 197928964,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589806114
    },
    {
        "content": "<p>\"do not delete copyright headers unless you delete the whole file, but you don't have to include them in the oleans\"</p>",
        "id": 197929025,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589806166
    },
    {
        "content": "<p>I wasn't thinking to attempt to relicense everything. If people cared enough (I don't!) we could</p>\n<ol>\n<li>start putting a different copyright header in new files,</li>\n<li>allow authors modifying files for which they know that all the listed authors have agreed to replace the copyright header with a different one.</li>\n</ol>",
        "id": 197929118,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589806217
    },
    {
        "content": "<p>I would be happy to unlicense all my stuff</p>",
        "id": 197929203,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589806266
    },
    {
        "content": "<p>The \"but not in oleans\" part is actually potentially important down the line ... (flame-)wars have been fought over this distinction. :-)</p>",
        "id": 197929241,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589806293
    },
    {
        "content": "<p>I'm fine with it, but if this is being discussed seriously, it should probably move out of the PR reviews stream :)</p>",
        "id": 197929275,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1589806312
    },
    {
        "content": "<p>So, back on topic: shall we kick <a href=\"https://github.com/leanprover-community/mathlib/issues/2707\">#2707</a> onto the merge queue?</p>",
        "id": 197929804,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589806568
    }
]