[
    {
        "content": "<p>It looks like I'm getting pretty close to something mergeable here, and I'm wondering what the best way to proceed would be. The goal is to replace <code>real_inner_product</code> by this new more general inner product. Should I try to do it all in one go, or should I first just try adding the new one and then remove <code>real_inner_product</code> in a subsequent PR? The main disadvantage with the second approach is that the two of them step on each other's toes quite a bit and one would have to do rather awkward things with namespaces to make sure they don't in the intermediate step.</p>",
        "id": 209712885,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1599773857
    },
    {
        "content": "<p>I think it's okay to do it all at once.</p>",
        "id": 209717887,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1599777127
    },
    {
        "content": "<p>Getting all the users of the real inner product working with the new implementation is key to judging how usable that implementation is (if any proofs get longer, that indicates more work may be needed to make the real case as usable as it is at present).</p>\n<p>You need to keep merging from master, there's at least one new lemma in analysis/normed_space/real_inner_product.lean since you last merged.</p>",
        "id": 209725151,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1599783152
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span>  As far as I can tell, your code on Euclidean geometry is the main application of the real inner product currently in mathlib. So far it looks like it won't be a problem, I haven't seen anything that required more than trivial changes.</p>",
        "id": 209733519,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1599788639
    },
    {
        "content": "<p>I just finished porting, and indeed all of the proofs have remained essentially the same.</p>",
        "id": 209738214,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1599795647
    }
]