[
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/issues/6355\">#6355</a> . Thanks Mario for your review -- I've had a hectic week but hope to get back to this tomorrow or over the weekend.</p>\n<p>In the mean time It occurred to me over the last few days that perhaps another approach would be a refactor of <code>set.finite</code>. One could define it as an inductive Prop on <code>set X</code>, saying that <code>emptyset</code> is finite, and if <code>S</code> is finite then so is <code>insert a S</code>. This would be a far more \"mathematical\" or \"nonconstructive\" or whatever you want to call it definition of finiteness, and I'm wondering whether it would make this whole thing easier. Perhaps there's no point changing it now. <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> <span class=\"user-mention\" data-user-id=\"110044\">@Chris Hughes</span> do either of you have any thoughts on this?</p>",
        "id": 227866727,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614301722
    },
    {
        "content": "<p>That was actually the original definition</p>",
        "id": 227869647,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1614303834
    },
    {
        "content": "<p>It was refactored to connect it to finsets so that proving results in both contexts is easier</p>",
        "id": 227869707,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1614303857
    },
    {
        "content": "<p>Since <code>set.finite</code> is a Prop, its definition shouldn't matter for mathematical uses, so if you want to view it as an inductive like that you should use that recursion principle for it (that I think already exists)</p>",
        "id": 227869758,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1614303924
    },
    {
        "content": "<p>You could even define it to be <code>acc (&lt;)</code>.</p>",
        "id": 227873602,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1614307061
    },
    {
        "content": "<p>Where's the \"beautiful\" emoji?</p>",
        "id": 227904302,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614332806
    },
    {
        "content": "<p>Aah interesting! In 6355 we spend a lot of time reducing things about finsum to things about finset.sum etc, and it occurred to me that because all the proof in finset are so elegant that we might have been better off just proving some of them directly using this induction principle -- this is why this idea came to me. But that'll teach me to do maths at 1 in the morning -- I now see that there's no need for a refactor at all and we should instead just consider using the induction principle more often (I have no idea whether this will help but it's worth considering).</p>",
        "id": 227904498,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614332928
    }
]