[
    {
        "content": "<p>I have had very little time for Lean recently... <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span> (Hopefully some more in the coming weekends <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span>.) But I have a question about the PR etiquette and  workflow.</p>\n<p>The PR <a href=\"https://github.com/leanprover-community/mathlib/issues/8904\">#8904</a> (very small steps towards the topology of weak convergence of probability measures and portmanteau theorem) looks ready, also according to most recent review comments. There is one approving review and one \"LGTM + delegated\". Am I right to assume the latter means I am allowed and expected to run <code>bors r+</code> and approve+merge the PR myself? Since the last \"LGTM\" I reverted one change (in accordance with the last review comments) and made tiny docstring changes --- I assume these sorts of routine changes are considered ok in a \"delegated\" case...</p>\n<p>Sorry, this may be an overly cautious question, but I <em>still</em> want to avoid breaking mathlib... <span aria-label=\"innocent\" class=\"emoji emoji-1f607\" role=\"img\" title=\"innocent\">:innocent:</span></p>",
        "id": 253895391,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1632000997
    },
    {
        "content": "<p>As the last post in the thread (by a bot) explains, it is now expecting you to do what it says, and it will make sure that everything is OK. I don't think it's possible for you to break mathlib, the bots will ensure nothing bad happens.</p>",
        "id": 253895625,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1632001290
    },
    {
        "content": "<p>Thanks! This is what I assumed. I guess I just wasn't totally sure if \"kkytola <em>can</em> now approve this pull request\" meant \"kkytola <em>should</em> now approve this pull request\" --- especially after some further changes. So wanted to check the etiquette :).</p>\n<p>The reassurances of (likely) not breaking mathlib are particularly important to me! <span aria-label=\"relieved\" class=\"emoji emoji-1f60c\" role=\"img\" title=\"relieved\">:relieved:</span></p>",
        "id": 253895919,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1632001673
    },
    {
        "content": "<p>It actually means \"kkytola <em>must</em> now approve this pull request, because the labels have changed, it's no longer on the <a href=\"https://bit.ly/3kaztxO\">#queue</a>, and so nobody else is going to look at it any more\" :-)</p>",
        "id": 253895978,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1632001724
    },
    {
        "content": "<p>Done now. Thank you Kevin! Now fingers crossed for not breaking anything <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 253896110,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1632001878
    },
    {
        "content": "<p>Even more is true: the delegated status mean that we expect you to do modifications (or ignore suggestions) without anyone else checking. Otherwise we simply bors merge.</p>",
        "id": 253927548,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1632038859
    }
]