[
    {
        "content": "<p>If I'm not mistaken, the remaining \"nolint\" in <a href=\"https://github.com/leanprover-community/mathlib/issues/8598\">#8598</a> is unused arguments.</p>\n<p>I'd be tempted to say that this definition of weak star topology should only be made under the assumptions that the (semi)ring has a continuous addition and multiplication, the module is a module for the (semi)ring, and the module has a continuous addition and scalar multiplication. The linter is not happy, because the assumptions are not logically necessary.</p>\n<p>In cases like these, should one still try to minimize the assumptions (although the definition is likely a bad one without the assumptions), or should one somehow bypass the linter?</p>",
        "id": 249419397,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1628892038
    },
    {
        "content": "<p>It can pay off to minimize the assumptions, for performance reasons. It might save Lean a bunch of typeclass searches, even if you only apply the definition in sensible situations.</p>",
        "id": 249419952,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1628892369
    },
    {
        "content": "<p>Ok, thanks! That makes sense.</p>",
        "id": 249419985,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1628892402
    },
    {
        "content": "<p>Usually the approach is to provide the data (ie the topology) under the weakest assumptions you can think of, and then strengthen them to prove properties of it (ie continuous addition) as and when you need to</p>",
        "id": 249420038,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1628892460
    },
    {
        "content": "<p>Eg how the action of a \"group\" on itself <code>x • y</code> is actually defined for any situation where <code>x * y</code> is valid, even if <code>*</code> has no properties at all (and so there is no group to be found)</p>",
        "id": 249420213,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1628892575
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> by the way, you can run lint locally by writing #lint at the bottom of the file -- this saves pushing and waiting an hour.</p>",
        "id": 249425340,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1628897088
    },
    {
        "content": "<p>It's not foolproof (it doesn't find the more subtle things about interactions among different files) but it's still quite helpful.</p>",
        "id": 249425365,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1628897120
    },
    {
        "content": "<p>Thanks! I actually just realized that when I noticed that fixing the assumptions in each of the defs, lemmas, theorems, etc. would be very tedious if I had to push to github and wait for the lint each time.  <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> </p>\n<p>I expect even the unused arguments lint to be fine in the most recent push (at least it was ok locally on my computer).</p>",
        "id": 249425584,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1628897342
    },
    {
        "content": "<p>This whole \"don't demand hypotheses which are essential for the definition to make mathematical sense but which are inessential for the definition to typecheck\" are everywhere, and are just mathlib's preferred style. We let you divide by zero, take the square root and log of a negative number, form a group ring with something that isn't a group and something that isn't a ring etc etc. I recently PRed a definition of an elliptic curve over a ring which is only mathematically correct under certain hypotheses on the ring but which made sense in general -- I just made this fact clear in the docstring.</p>",
        "id": 249446330,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628925678
    },
    {
        "content": "<p>I defined extreme points of a set without asking for it to be convex, and it turns out that the Krein-Milman theorem still holds with this extended definition. I was quite astonished.</p>",
        "id": 249446395,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1628925810
    },
    {
        "content": "<p>The funniest thing was Rolle's theorem holding for all functions whether or not they were differentiable</p>",
        "id": 249446453,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628925903
    },
    {
        "content": "<p>Oh what?!?</p>",
        "id": 249446465,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1628925918
    },
    {
        "content": "<p>If it's not differentiable somewhere the derivative there is defined to be zero so you can use that point</p>",
        "id": 249446506,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1628925965
    },
    {
        "content": "<p>Ahahah, good point</p>",
        "id": 249446513,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1628926002
    },
    {
        "content": "<p>Thanks for the clarity and (scary) examples about the mathlib's conventions! <a href=\"https://github.com/leanprover-community/mathlib/issues/8598\">#8598</a> is now merged <span aria-label=\"astonished\" class=\"emoji emoji-1f632\" role=\"img\" title=\"astonished\">:astonished:</span>, with minimized assumptions. There was one definite surprise (noticed by Heather) regarding the assumptions: the compatibility between the topology of the scalars and the topology of the module never got used in any of the lemmas up until now <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span>. (Ok, not as <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span> as Rolle without differentiability <span aria-label=\"hurt\" class=\"emoji emoji-1f915\" role=\"img\" title=\"hurt\">:hurt:</span> or extreme points without convexity <span aria-label=\"worried\" class=\"emoji emoji-1f61f\" role=\"img\" title=\"worried\">:worried:</span>).</p>",
        "id": 249529967,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1629060795
    },
    {
        "content": "<p>I just wanted to say many many thanks to <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> for incredible patience and generous insights in the PR review and on this Zulip, and for suggesting this route in the first place! I can't describe the contrast between me stubbornly doing my first project alone (which I still view as necessary, though) and now getting this sort of tutoring from experts. Hopefully with what I'm learning I can at least in the future slowly contribute back.</p>",
        "id": 249529972,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1629060804
    },
    {
        "content": "<p>For the record, my next planned steps are:</p>\n<ul>\n<li>My docstrings here had a density of misprints strictly larger than I'd be willing to admit. I will make an easy PR fixing these soon, almost surely one evening next week.</li>\n<li>The original intention was to use this as a basis for the definition of weak convergence of finite Borel measures (and Borel probability measures), in <a href=\"https://github.com/leanprover-community/mathlib/issues/8337\">#8337</a>. The changes to the original PR when shifting to Heather's proposed route (discussed already quite extensively in <a class=\"stream-topic\" data-stream-id=\"144837\" href=\"/#narrow/stream/144837-PR-reviews/topic/.238337.20Weak.20convergence\">#PR reviews &gt; #8337 Weak convergence</a>) will be so significant that it looks better to abandon the old PR and start a new one. I will do that relatively soon, but most likely not next week, yet. This will anyway depend on <a href=\"https://github.com/leanprover-community/mathlib/issues/8580\">#8580</a>, so would have to wait for it. (And I'm wrestling with a few coercions.)</li>\n<li>If the definition of weak convergence of measures goes through, my longer terms plan is still to polish <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/Portmanteau.20theorem\">#new members &gt; Portmanteau theorem</a> to mathlib quality, and PR it.</li>\n<li>Meanwhile, independently of any of the above, once I familiarize myself with a few new corners of the library, Banach-Alaoglu looks as easy as anything ever is in formalization <span aria-label=\"trademark\" class=\"emoji emoji-2122\" role=\"img\" title=\"trademark\">:trademark:</span>. I'd probably try to add that to the weak-star topology files rather soon.</li>\n</ul>",
        "id": 249530041,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1629060908
    },
    {
        "content": "<p>It has turned out difficult to Lean much during the semester... I hope there will be more time to play at some point again...</p>\n<p>I however finally did a <a href=\"https://github.com/kkytola/lean-questions/blob/main/alaoglu.lean\">version of the Banach-Alaoglu theorem</a>, and I plan to PR it soon. It still needs cleaning up, though. I will <a href=\"#narrow/stream/217875-Is-there.20code.20for.20X.3F/topic/linear_map_bound_of_ball_bound/near/258238787\">ask</a> about the right way to do the first lemmas on <a class=\"stream\" data-stream-id=\"217875\" href=\"/#narrow/stream/217875-Is-there-code-for-X.3F\">#Is there code for X?</a>, but for improving the bulk of this I'll perhaps just solicit the help of the reviewers of the PR... <span aria-label=\"thank you\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"thank you\">:thank_you:</span></p>\n<p>(Comments are of course welcome already before the PR!)</p>",
        "id": 258238669,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1634664759
    },
    {
        "content": "<p>That's a really nice milestone!</p>",
        "id": 258240776,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1634665436
    },
    {
        "content": "<p>PRs: <a href=\"https://github.com/leanprover-community/mathlib/issues/9827\">#9827</a>, <a href=\"https://github.com/leanprover-community/mathlib/issues/9836\">#9836</a>, <a href=\"https://github.com/leanprover-community/mathlib/issues/9862\">#9862</a></p>\n<p>I know these are not nearly polished enough yet, sorry! (But having stared at them, I am becoming blind to how to improve without others' help.) Thanks in advance to helpful reviewers --- again!</p>",
        "id": 258600622,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1634843285
    }
]