[
    {
        "content": "<p>I thought I would try to reduce the amount of <a href=\"https://github.com/leanprover-community/mathlib/blob/master/scripts/style-exceptions.txt\">files with missing module docstrings</a>. But I got this error on the mathlib build:</p>\n<div class=\"codehilite\" data-code-language=\"Text only\"><pre><span></span><code>The self-hosted runner: lena lost communication with the server. Verify the machine is running and has a healthy network connection. Anything in your workflow that terminates the runner process, starves it for CPU/Memory, or blocks its network access can cause this error.\n</code></pre></div>\n<p>What's going on here?</p>",
        "id": 250713558,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1629947853
    },
    {
        "content": "<p>Sometimes the actions just fail. Runners can be restarted. In general, it's not worth it to make a short docstring for a file just to get it off of the nolints list. It's on the nolints list specifically because it doesn't yet have a detailed docstring. A barebones module docstring can be worse, because it will remove it from the list thus hiding the fact that it doesn't have a detailed docstring.</p>",
        "id": 250714191,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1629948355
    },
    {
        "content": "<p>Ok, I guess I'll just restart.</p>",
        "id": 250715117,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1629949066
    },
    {
        "content": "<p>I'm noticing there are a few module docstrings in the folder that are just titles, without any content at all. If I'm not going to write more comprehensive docstrings for these, should I delete them so that they go on the nolints list?</p>",
        "id": 250719164,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1629951876
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282271\">@Bolton Bailey</span> Those shorter module docstrings are probably quite old (I didn't check). In general, we just leave them around and hope that someone makes them longer.</p>",
        "id": 250721161,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1629953192
    }
]