[
    {
        "content": "<p>I love this idea, and I think it's ready for merging. Since that's a big shift in our perspective on the right way to do things, I won't merge it just by myself, and I'd like to hear more thoughts here.</p>",
        "id": 264287027,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1639048938
    },
    {
        "content": "<p>I'm generally in favor of this idea too, and in future I'd like to see some meta or even language support to make it easier to use. We won't know what we want those to look like until we start using this design!</p>",
        "id": 264288153,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1639049702
    },
    {
        "content": "<p>Some ideas for that future work:</p>\n<ul>\n<li><code>virtual struct foo extends bar</code> which generates <code>class foo_I extends bar_I</code> containing the appropriate fields</li>\n<li>language support for having the elaborator translate <code>f.map_bar</code> where <code>f : foo</code> into <code>foo_I.map_bar f</code></li>\n</ul>",
        "id": 264288364,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1639049828
    },
    {
        "content": "<p>Out of interest, if we're trying this in Lean 4 would that language support suggestion need changes to core Lean or could it be done in mathlib4?</p>",
        "id": 264288495,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639049901
    },
    {
        "content": "<p>I expect we could design a macro that generates the appropriate commands for us</p>",
        "id": 264289066,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1639050304
    },
    {
        "content": "<p>Whether that ends up as part of mathlib or core Lean can be figured out later on :)</p>",
        "id": 264289220,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1639050408
    },
    {
        "content": "<p>My question was meant to be \"does it <em>have</em> to be in core Lean\" and my understanding is that your answer is \"no\", which makes me happy.</p>",
        "id": 264290727,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639051334
    },
    {
        "content": "<p>I think Leo has had a far happier time recently with the mathlib people at arm's length, and I am hoping that his design decisions for Lean 4 will enable far more flexibility at our end so we do not have to be pestering him to change his software -- we have seen in the past that this does not work well.</p>",
        "id": 264290805,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639051392
    }
]