[
    {
        "content": "<p>Sorry for the long silence on my part on the final part of the Banach-Alaoglu theorem!</p>\n<p>In the end of December, <span class=\"user-mention\" data-user-id=\"214703\">@Yury G. Kudryashov</span> made a very meaningful generalization to the PR. The generalization made me feel like I should rethink which parts of the weak dual code needed to exist in the original form of the codomain being the scalar ring, and which parts should exist in greater generality. Also, the changes included 52 new commits, including changes in files I do not know well. That happened just at the time when my teaching (or at least arranging TA meetings and posting course materials) for the semester became urgent, and also when I had finally accepted the reality that I'd have to switch to remote teaching again. I kept thinking I'd find a weekend to catch up and figure out what the new design choices and their downstream effects are, and what the appropriate scope of the weak dual file would be. But every time I tried to start, it just felt overwhelming, although the whole PR is only +184 -75 lines of code...</p>\n<p>A very unfortunate effect of me having postponed this for long is that the merging with master might be complicated now. At least the folder structure has changed, but probably there may have been other relevant changes, too.</p>\n<p>I expect to now have some time during weekends again (still sporadic, though), and I believe both the Banach-Alaoglu theorem and the other new improvements in that branch should find their ways to mathlib. But I am very unsure of what is the best way to proceed. I can think of a few possibilities, but I'm very open to other ideas as well.</p>\n<p>One possibility is to continue with the existing PR. But I don't feel confident enough about my understanding of the design decisions to really be in charge of it. If Yury or someone else is willing to adopt this PR, I'd be grateful if this can still be salvaged despite the bitrot that I let happen.</p>\n<p>Another option might be to start cherry-picking pieces from the code in that branch, and making possibly even smaller PRs, eventually abandoning the original PR when everything relevant has been picked. Hopefully the current diff in the branch indicates well enough what was new in the branch (and the total is not even very much). The advantage is that I could pick pieces that I do understand. However, some of the first cherry-pickable pieces should probably be Yury's changes, so I'm again not necessarily the right person to PR them. To me this looks like to more feasible option unless someone courageous takes over the original PR.</p>\n<p>I'd love to hear also if anyone has more pragmatic alternatives of how to proceed!</p>",
        "id": 278429966,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1649537533
    },
    {
        "content": "<p>I am happy to do the merge for you. Looks like I'm pretty good at this.</p>",
        "id": 278430129,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1649537748
    },
    {
        "content": "<p>Oh wow, that would be great! As far as I'm concerned the contents are good with the improvements that especially Yury made. (I never really had any other concerns except whether I understood the choices and what the scope of the weak_dual file should be, and that probably doesn't have to be decided in the current PR anyway.)</p>\n<p>Huge thanks if you are able to do this!</p>",
        "id": 278430468,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1649538091
    },
    {
        "content": "<p>Merge done. Didn't yet get to do the bump because you touched <code>topology.maps</code> which is way too far from <code>analysis.normed_space.weak_dual</code> for my machine to catch up <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span></p>",
        "id": 278431902,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1649539770
    },
    {
        "content": "<p>Is that the version of Banach-Alaoglu for normed spaces?</p>",
        "id": 278432852,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1649541174
    },
    {
        "content": "<p>Unfortunately we are all hitting a timeout in <a href=\"https://tqft.net/mathlib/category_theory/fin_category\">file#category_theory/fin_category</a>, so the bump will have to wait.</p>",
        "id": 278432933,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1649541290
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"412682\">Moritz Doll</span> <a href=\"#narrow/stream/144837-PR-reviews/topic/.239862.20the.20rest.20of.20Banach-Alaoglu/near/278432852\">said</a>:</p>\n<blockquote>\n<p>Is that the version of Banach-Alaoglu for normed spaces?</p>\n</blockquote>\n<p>Yes.</p>\n<p>Well at least it was. The original PR was about the compactness of polar sets (including the closed unit ball) in duals of normed spaces over <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">R</mi></mrow><annotation encoding=\"application/x-tex\">\\R</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6889em;\"></span><span class=\"mord mathbb\">R</span></span></span></span> or <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi mathvariant=\"double-struck\">C</mi></mrow><annotation encoding=\"application/x-tex\">\\mathbb{C}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6889em;\"></span><span class=\"mord mathbb\">C</span></span></span></span> with their weak-star topology. Sébastien Gouëzel generalized to weak duals of normed spaces over  any<code>nondiscrete_normed_field</code> that is a <code>proper_space</code>. Then Yury Kudryashov generalized to the compactness in a suitable induced topology in spaces of semi-linear maps whose domain is a normed space and codomain is a proper normed space. Or maybe I lost track. <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span></p>\n<p>But I think modulo mathlib style, it is <a href=\"https://en.wikipedia.org/wiki/Banach%E2%80%93Alaoglu_theorem\">the usual Banach-Alaoglu theorem</a>. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 278433895,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1649542631
    },
    {
        "content": "<p>The issue is that there is the (highly nontrivial) generalization to topological vector spaces, where the weak topology comes from a nondegenerate bilinear form. Mathlib is missing to two Lemmas (algebraic dual is complete and weakly bounded sets are precompact) that are crucial to get the tvs Banach-Alaoglu theorem.</p>",
        "id": 278435252,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1649544834
    },
    {
        "content": "<p>Ok, so this was indeed only for normed spaces in the PR, not for topological vector spaces.</p>\n<p>(How to generalize to topological vector spaces with topology from a nondegenerate bilinear form might also have implications about the right scope of the <code>weak_dual</code> file.)</p>",
        "id": 278436018,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1649545967
    },
    {
        "content": "<p>Let me add that I originally PR'd the weak duals because it was suggested in a PR review about the portmanteau theorem that the right way to do the topology of convergence in distribution is via weak star topology on topological modules over topological semirings <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span>. (I fully agree it was, but it opened a rabbit hole.) I then added Banach-Alaoglu for normed spaces because I felt like that should naturally come right after the definition of weak star topology... For now, the topology of convergence in distribution is still not in mathlib, let alone the proof of the portmanteau theorem which I was trying to PR... I think I'd now like to move back to those. I'd be quite happy to leave generalizations of weak topologies and Banach-Alaoglu theorems to others... (Although the sequential Banach-Alaoglu in weak duals of separable normed spaces will be of substantial interest to me. Yes, the sequential compactness version of Banach-Alaoglu is currently still missing.)</p>",
        "id": 278436521,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1649546818
    },
    {
        "content": "<p>Bors says there's a merge conflict, but there isn't? (I just pulled master and merged locally to be sure.)</p>\n<p>Is this because it got pulled off and put back on the queue quickly?</p>",
        "id": 281169353,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1651676873
    },
    {
        "content": "<p>It's maybe another PR in the same batch.</p>",
        "id": 281169502,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1651676932
    }
]