[
    {
        "content": "<p>Over the last few days, I have tidied a significant part of the code of a proof of the Dold-Kan correspondence (equivalence between categories of simplicial objects and chain complex in an abelian category). As there are more than 20 files and about 3500 lines of code, I would like to be sure what is the best way how to proceed. The whole code is at <a href=\"https://github.com/joelriou/dold-kan\">https://github.com/joelriou/dold-kan</a><br>\nThe dependency graph of the files is<br>\n<a href=\"http://jriou.org/tmp/lean/dold-kan/graph.png\">dependency graph</a><br>\nI was thinking about PRing about one file at a time, starting with the right branch of the graph which leads to <code>homotopy_equivalence.lean</code> which contains a proof that the normalized Moore complex of a simplicial object in an abelian category is homotopy equivalent to the alternating face map complex. Does it sound ok?</p>\n<div class=\"message_inline_image\"><a href=\"http://jriou.org/tmp/lean/dold-kan/graph.png\" title=\"dependency graph\"><img src=\"https://uploads.zulipusercontent.net/05db04cb2919c4571abaee223a644e08bc9da900/687474703a2f2f6a72696f752e6f72672f746d702f6c65616e2f646f6c642d6b616e2f67726170682e706e67\"></a></div>",
        "id": 275495731,
        "sender_full_name": "Joël Riou",
        "timestamp": 1647429195
    },
    {
        "content": "<p>I don't know the math well, but don't be afraid about PRing small technical lemmas.  You can explain in the description what the final goal is, but there is need to a have an interesting result in all PR.</p>",
        "id": 275496697,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1647429800
    },
    {
        "content": "<p>Yes, one file at a time is an easy default approach when you've taken the effort already to organise the work into files! Typically it results in digestible size PRs, too.</p>",
        "id": 275498067,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1647430688
    },
    {
        "content": "<p>I'm excited to see this in mathlib!</p>",
        "id": 275498082,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1647430698
    },
    {
        "content": "<p>(and I think Riccardo left out a critical \"no\" in the phrase \"no need\" :-) It's completely fine to have trivially small PRs.)</p>",
        "id": 275498154,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1647430758
    },
    {
        "content": "<p>When making long strings of PRs like this, don't hesitate to keep pinging us here to review, especially whenever you're currently up to an easy one. I've done long strings of PRs before, and it can be discouraging how slow it is: you're allowed to crack the whip. :-)</p>",
        "id": 275498262,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1647430820
    },
    {
        "content": "<p>Further, it can be tempting to make lots of the PRs at once, and labelled them all as <code>blocked-by-other-PR</code>. In my experience this leads to wasting lots of time merging or rebasing... Your call. :-)</p>",
        "id": 275498310,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1647430871
    },
    {
        "content": "<p>Thanks for the encouragements! The difficulty I anticipated in the process is that in my first few PR for this, I will be dealing with objects which do not obviously seem to be interesting at all (like the null homotopic maps defined in <code>homotopies.lean</code>): they become really interesting only after a long string of lemmas have been obtained. So this is the reason why I wanted to give the full picture here so that people can check that the whole files compile and give nontrivial theorems! I will certainly proceed one PR at a time (as my multitasking abilities are low...).</p>",
        "id": 275498840,
        "sender_full_name": "Joël Riou",
        "timestamp": 1647431262
    },
    {
        "content": "<p>I like Kyle's approach of opening a huge PR just to provide the full picture and then opening small PRs until the big PR becomes obsolete</p>",
        "id": 275499140,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1647431415
    },
    {
        "content": "<p>Yes Joel, don't worry about PRing objects which don't seem interesting -- there will be maintainers who know what you're doing. I guess PRs which add a whole bunch of definitions without using them at all are a bit scary because then people don't know for sure if the definitions are appropriate or will work. But PRs which add one definition and then prove 4 lemmas about it are fine.</p>",
        "id": 275514285,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1647439374
    },
    {
        "content": "<p>Also, a general rule is max 150-200 lines per PR, otherwise people don't review it because there are easier things to review :-)</p>",
        "id": 275514335,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1647439400
    },
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib/pull/12742\">#12742</a>, I add three lemmas about homological complexes. After this PR, I should be able to start PRing material more directly related to the Dold-Kan correspondence.</p>",
        "id": 276019253,
        "sender_full_name": "Joël Riou",
        "timestamp": 1647852018
    },
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib/pull/13028\">#13028</a>, I add a compatibility of the alternating face map complex functor with the application of additive functors between the underlying preadditive categories.</p>",
        "id": 276985733,
        "sender_full_name": "Joël Riou",
        "timestamp": 1648550392
    },
    {
        "content": "<p>Reviewed.</p>",
        "id": 277081642,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1648600585
    },
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib/pull/13085\">#13085</a>, I introduce null homotopic maps which shall play a critical role in my formalisation of the proof of the Dold-Kan correspondence.</p>",
        "id": 277370919,
        "sender_full_name": "Joël Riou",
        "timestamp": 1648789177
    },
    {
        "content": "<p>In PR <a href=\"https://github.com/leanprover-community/mathlib/pull/14044\">#14044</a>, I prove technical lemmas about face maps and the null homotopic maps defined in the previous PR <a href=\"https://github.com/leanprover-community/mathlib/pull/13085\">#13085</a>. This PR is presumably the most technical in the whole proof of the Dold-Kan correspondence.</p>",
        "id": 281671959,
        "sender_full_name": "Joël Riou",
        "timestamp": 1652097361
    },
    {
        "content": "<p>Is it possible to merge <a href=\"https://github.com/leanprover-community/mathlib/pull/14044\">#14044</a> in a near future? I promise the next PR in this series will be easier to review!</p>",
        "id": 285886857,
        "sender_full_name": "Joël Riou",
        "timestamp": 1655102227
    }
]