[
    {
        "content": "<p>I trying to find out what Lean has to offer me. Part of that process involves understanding Lean's underlying type theory. </p>\n<p>Here's a test case: prove that every surjective function (f : A -&gt; B such that for all  b : B there exits a : A with f a = b) is an effective epimorphism (for all types C and functions g : A -&gt; C satisfying for all a,a':A , f a = f a' -&gt; g a = g a', there exists a unique function h : B -&gt; C whose composition with f equals g)</p>\n<p>In my go-to prover, Agda, that is not a theorem, but it becomes one if one postulates an axiom of unique choice (a very uncontentious axiom!).</p>\n<p>Question: how do people prove that surjections are effective epimorphisms in Lean? Is it by an appeal to AC (Hilbert choice operator), or by more subtle means? What is the status of unique choice in Lean?</p>",
        "id": 256976319,
        "sender_full_name": "Andrew Pitts",
        "timestamp": 1633892129
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib_docs/find/classical.some\">docs#classical.some</a> is non-unique choice if that helps</p>",
        "id": 256977221,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1633892995
    },
    {
        "content": "<p>I'm not sure what the question is. In Lean's maths library there are no extra axioms assumed beyond those in core lean and I would just prove the contentious part of this by proving every surjective function has a one-sided inverse using AC and then it's easy. AC is an axiom in Lean and I use it 6 times before breakfast. But I suspect you're asking something else.</p>",
        "id": 256978149,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633893929
    },
    {
        "content": "<p>There is not really a community of people here working on any kind of mathematics other than classical mathematics</p>",
        "id": 256978231,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633894015
    },
    {
        "content": "<p>It is probably worth noting that AC is an <code>axiom</code> in Lean and not thus not part of its foundational logic. That is, you can still do logic in Lean without assuming choice should you so desire. In fact, that is the default. You only get AC rolled into the environment if you <code>open</code> the <code>classical</code> (Lean 3) or <code>Classical</code> (Lean 4) namespace.</p>",
        "id": 256978988,
        "sender_full_name": "Mac",
        "timestamp": 1633894771
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/236446-Type-theory/topic/effective.20epimorphisms/near/256978149\">said</a>:</p>\n<blockquote>\n<p>I'm not sure what the question is. In Lean's maths library there are no extra axioms assumed beyond those in core lean and I would just prove the contentious part of this by proving every surjective function has a one-sided inverse using AC and then it's easy. AC is an axiom in Lean and I use it 6 times before breakfast. But I suspect you're asking something else.</p>\n</blockquote>\n<p>OK so the answer is: just use AC (as I suspected).<br>\n(I was asking because I was interested to know whether Lean's core logic (before assuming any axioms) entailed unique choice. For example in set theory, where a function is the same thing as single-valued total binary relation, it's provable that surjections are effective epis without any appeal to AC. )</p>",
        "id": 256979801,
        "sender_full_name": "Andrew Pitts",
        "timestamp": 1633895556
    },
    {
        "content": "<p>I have heard it said that unique choice cannot be proved in lean without invoking some of the axioms in lean. By the way you don't have to <code>open classical</code> to use classical axioms, you can use <code>classical.some</code> whether or not it's open. </p>\n<p>To be quite frank, the fact that the axiom of choice is baked into core lean was one of the things which attracted me to it over the other theorem provers. It made me feel like lean was taking classical mathematics (the kind of mathematics which wins Fields Medals) more seriously than the other provers.</p>",
        "id": 256986331,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633901572
    },
    {
        "content": "<p>By the way I have also heard it said that you can tell which of the axioms a theorem uses with the <code>#print axioms</code> command</p>",
        "id": 256986431,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633901648
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"139457\">@Andrew Pitts</span> Lean has built-in quotient types. In particular, there is a nice epi/mono image factorization. However, since Lean's <code>Prop</code> is impredicative, it takes axioms to let it bleed into the <code>Type</code> hierarchy. In particular, unique choice makes everything impredicative (which is not that big a deal by my taste, but some palates are more sensitive than mine). To keep a predicative hierarchy, you can ignore Lean's <code>Prop</code> and think of propositions as subsingletons in the <code>Type</code> hierarchy. Interpreted this way, all surjections are effective since \"surjection\" then basically means that there is an induced bijection between the codomain and the image.</p>\n<p>Keep in mind that Lean's universe hierarchy is _not_ cumulative!</p>",
        "id": 256995018,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1633910248
    },
    {
        "content": "<p>Something I did a long while ago is relevant: <a href=\"https://github.com/fgdorais/uniq\">https://github.com/fgdorais/uniq</a></p>",
        "id": 256995974,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1633911214
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"119741\">François G. Dorais</span> <a href=\"#narrow/stream/236446-Type-theory/topic/effective.20epimorphisms/near/256995018\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"139457\">Andrew Pitts</span> Lean has built-in quotient types. </p>\n</blockquote>\n<p>Built-in? Wouldn't \"built-on\" be better? -- I though quotients are axiomatized and given tactic support, but are not part of the core type theory.</p>\n<blockquote>\n<p>In particular, there is a nice epi/mono image factorization. However, since Lean's <code>Prop</code> is impredicative, it takes axioms to let it bleed into the <code>Type</code> hierarchy. In particular, unique choice makes everything impredicative </p>\n</blockquote>\n<p>I don't see that postulating unique choice implies impredicativity. For example in Agda I use a postulate</p>\n<p>A!C : {l : Level}{A : Set l} → (∃ x ∶ A , ∀(x' : A) → x =x') → A</p>\n<p>where the equality x = x' is (implicitly) in the predicative universe of propositions Prop l when the type A of x and x' are in universe Set l.</p>\n<p>I understand that Lean's Prop is impredicative and hence one has to be careful how many inductively defined propositions can be eliminated in types, but I don't see that unique choice is affected by that.</p>\n<p>Thanks for sharing your Lean snippet axiomatizing unique choice.</p>",
        "id": 257023873,
        "sender_full_name": "Andrew Pitts",
        "timestamp": 1633937281
    },
    {
        "content": "<p>I think you're right that this issue with unique choice is unrelated to predicativity (you can have either one without the other)</p>",
        "id": 257024748,
        "sender_full_name": "David Wärn",
        "timestamp": 1633937777
    },
    {
        "content": "<p>As I understand, the only non-built-on aspect of quotients in Lean is that the computation rule holds definitionally, as in:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">example</span> <span class=\"o\">(</span><span class=\"n\">α</span> <span class=\"n\">β</span> <span class=\"o\">:</span> <span class=\"kt\">Type</span><span class=\"o\">)</span> <span class=\"o\">(</span><span class=\"n\">r</span> <span class=\"o\">:</span> <span class=\"n\">α</span> <span class=\"bp\">→</span> <span class=\"n\">α</span> <span class=\"bp\">→</span> <span class=\"kt\">Prop</span><span class=\"o\">)</span> <span class=\"o\">(</span><span class=\"n\">f</span> <span class=\"o\">:</span> <span class=\"n\">α</span> <span class=\"bp\">→</span> <span class=\"n\">β</span><span class=\"o\">)</span> <span class=\"o\">(</span><span class=\"n\">h</span> <span class=\"o\">:</span> <span class=\"bp\">∀</span> <span class=\"n\">a</span> <span class=\"n\">a'</span><span class=\"o\">,</span> <span class=\"n\">r</span> <span class=\"n\">a</span> <span class=\"n\">a'</span> <span class=\"bp\">→</span> <span class=\"n\">f</span> <span class=\"n\">a</span> <span class=\"bp\">=</span> <span class=\"n\">f</span> <span class=\"n\">a'</span><span class=\"o\">)</span> <span class=\"o\">(</span><span class=\"n\">a</span> <span class=\"o\">:</span> <span class=\"n\">α</span><span class=\"o\">)</span> <span class=\"o\">:</span>\n  <span class=\"n\">quot.lift</span> <span class=\"n\">f</span> <span class=\"n\">h</span> <span class=\"o\">(</span><span class=\"n\">quot.mk</span> <span class=\"n\">r</span> <span class=\"n\">a</span><span class=\"o\">)</span> <span class=\"bp\">=</span> <span class=\"n\">f</span> <span class=\"n\">a</span> <span class=\"o\">:=</span> <span class=\"n\">rfl</span>\n</code></pre></div>",
        "id": 257025239,
        "sender_full_name": "David Wärn",
        "timestamp": 1633938107
    },
    {
        "content": "<p>In case you haven't found it already, <a href=\"https://github.com/digama0/lean-type-theory/releases/tag/v1.0\">Mario's thesis</a> is the best source on Lean's type theory, such as the quotient types.</p>",
        "id": 257030716,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1633941212
    },
    {
        "content": "<p>I never said unique choice was impredicative. Lean has quotients, an impredicative Prop, and a non-cumulative hierarchy. Combined with unique choice, the impredicativity of Prop leaks into the Type hierarchy.</p>\n<p>As I hinted, there is a way to have predicativity and unique choice, which is to ignore Lean's impredicative Prop and work with \"constructive propositions\", i.e. subsingletons in the type hierarchy. So, for example, the existential quantifier would be interpreted as squashing a Sigma type to a subsingleton by quotienting with the always true equivalence relation. (Like hProp in HoTT.) This way, we still have predicative Type universes and unique choice is actually provable! Of course, none of the Lean tools are meant to work with constructive propositions, so you would need to fork Lean or use something else to make this practical.</p>",
        "id": 257104167,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1633978813
    },
    {
        "content": "<p>This seems like an odd way of thinking about the issue. Is there any sense in which Lean-without-choice is predicative at the level of types? If we put on our predicative hat and imagine that Lean is inconsistent as a result of impredicativity, then not only are all <code>Prop</code>s inhabited, all <code>Types</code>s are also inhabited by <code>exfalso</code>, so we haven't salvaged anything by avoiding unique choice.</p>",
        "id": 257108193,
        "sender_full_name": "David Wärn",
        "timestamp": 1633981282
    },
    {
        "content": "<p>A more pedestrian way of understanding why Lean-without-choice doesn't prove unique choice is that when you define a term of a type, Lean remembers how to construct that thing, whereas when you prove a proposition, Lean just remembers that it's true. It's a separation between \"constructions\" and \"properties of constructions\", and you can't use a property of a construction to carry out some other construction.</p>",
        "id": 257109049,
        "sender_full_name": "David Wärn",
        "timestamp": 1633981794
    },
    {
        "content": "<p>Also, while it's true that impredicativity is a major selling point of <code>Prop</code> over subsingleton types for the classical mathematician, it's not the only one. Lean also uses definitional proof irrelevance a lot.</p>",
        "id": 257109154,
        "sender_full_name": "David Wärn",
        "timestamp": 1633981844
    },
    {
        "content": "<p>That's right. Lean's Prop is very isolated from higher Types by design. That is actually really nice since it allows Lean's Prop to behave much more like the meta-theory of Lean. For example, adding LEM for Prop only has very little impact in Lean. After all, it doesn't matter whether a programmer thinks classically, intuitionistically, or whatever, the written program runs exactly the same.</p>",
        "id": 257109772,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1633982223
    },
    {
        "content": "<p>Note we already have some tools for quotients by the always-true relation as <a href=\"https://leanprover-community.github.io/mathlib_docs/find/trunc\">docs#trunc</a></p>",
        "id": 257131358,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1633997248
    }
]