[
    {
        "content": "<p>There is a <a href=\"https://agda.readthedocs.io/en/latest/language/flat.html\">thing in Agda</a> that implements the \"flat modality\" from <a href=\"https://arxiv.org/abs/1509.07584\">real-cohesive type theory</a> / <a href=\"https://arxiv.org/abs/1801.07664\">crisp type theory</a>. Conceptually, it's something like thinking of functions A-&gt;B between types as being \"continuous\", and then if one has a function ♭(A)-&gt;B, this is \"discontinuous\" (\"crisp\" in the generic variable of type A). More generally, given a multivariable function some of the variables can be crisp. The operation ♭ is an idempotent comonad, in category theoretic semantics. </p>\n<p>I'm wondering if <code>noncomputable</code> acts in a similar way. My only understanding of <code>noncomputable</code> is what I just read <a href=\"https://leanprover.github.io/theorem_proving_in_lean/axioms_and_computation.html#choice\">here</a>, so I'm open to being educated.</p>",
        "id": 249495603,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629008331
    },
    {
        "content": "<p>(Obviously <code>noncomputable</code> applies to more than just definitions of functions, and that's fine, I expect that given some Curry–Howard magic.)</p>",
        "id": 249496872,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629010687
    },
    {
        "content": "<p>(I don't understand your parenthesized statement; <code>noncomputable</code> applies <em>only</em> to data and not proofs, aka just to definitions of functions)</p>",
        "id": 249499674,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1629015425
    },
    {
        "content": "<p>Well, one could have a proposition that depended on <code>noncomputable</code>, I guess. It's not important for my question.</p>",
        "id": 249503782,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1629021240
    },
    {
        "content": "<p>I don't think there is much of an analogue. <code>noncomputable</code> is a property of terms, not of positions in a term / arguments to a function. In particular, the rules for when <code>noncomputable</code> is not viral are very term-oriented: a term constructed from <code>noncomputable</code> parts is itself <code>noncomputable</code> unless it is a type or type constructor (it has type <code>... -&gt; Sort u</code>) or it is a proof (it has type <code>p</code> where <code>p : Prop</code>). By contrast, there is no \"taint analysis\" style mechanism to justify that a function like <code>\\lam x y, y</code> (where <code>x</code> and <code>y</code> have a generic type) preserves the noncomputability of its second argument and discards the first. That is a much more refined notion than lean's version, which summarizes the whole analysis into one bit: computable or not.</p>",
        "id": 249511517,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1629032792
    },
    {
        "content": "<p>This absence of \"taint analysis\" comes up when working with noncomputable instances where the fields you care about are computable but the ones you don't aren't, and you end up being unfairly tainted by noncomputability</p>",
        "id": 249513046,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1629034679
    },
    {
        "content": "<p>But usually there are workarounds</p>",
        "id": 249513085,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1629034701
    },
    {
        "content": "<p>One of the workarounds is the type <code>erased A</code>, which basically launders the type through types and proofs so that you end up with a type that is provably isomorphic to <code>A</code> but is also computable by lean's definition. You can use this as a poor man's flat modality, at least as long as you aren't doing anything too crazy with the value</p>",
        "id": 249513781,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1629035552
    },
    {
        "content": "<p>(<a href=\"https://leanprover-community.github.io/mathlib_docs/find/erased\">docs#erased</a>)</p>",
        "id": 249514633,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1629036510
    },
    {
        "content": "<p>Aha, <code>erased.out : erased α → α</code> looks like the counit for flat, thanks. But I'm not so reliant on this to be true.</p>",
        "id": 256185823,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1633416178
    },
    {
        "content": "<p>I would rather consider <code>erased.mk : α → erased α</code> to be the unit of a modality, since it's the computable one. Noncomputably, <code>erased α</code> is isomorphic to <code>α</code> so there is not much point in looking at the structure that <code>erased</code> has if you allow noncomputable functions.</p>",
        "id": 256250533,
        "sender_full_name": "Reid Barton",
        "timestamp": 1633442585
    },
    {
        "content": "<p>A noncomputable function <code>a -&gt; b</code> is the same as a computable function <code>a -&gt; erased b</code> but it's not the same as anything like <code>?? a -&gt; b</code>--I'm not sure quite how to prove this, but it seems pretty clear. So I would imagine the computable setting as lying over the noncomputable/classical one, with <code>erased</code> as the corresponding modality/monad/reflection/whatever.</p>",
        "id": 256250993,
        "sender_full_name": "Reid Barton",
        "timestamp": 1633442743
    },
    {
        "content": "<p>There should be a picture where, in the computable setting, each type corresponds to something like a topological space, whose points are the classical values of the type but where the only computable functions we can define out of the type are the continuous ones. For example, sequences <code>nat -&gt; bool</code> form a Cantor space (because a computable function of a sequence to something discrete like <code>bool</code> can only depend on finitely many entries in the sequence). In this picture, <code>erased</code> will be retopologizing with the indiscrete topology.</p>",
        "id": 256251652,
        "sender_full_name": "Reid Barton",
        "timestamp": 1633442953
    },
    {
        "content": "<blockquote>\n<p>A noncomputable function a -&gt; b is the same as a computable function a -&gt; erased b but it's not the same as anything like ?? a -&gt; b--I'm not sure quite how to prove this, but it seems pretty clear.</p>\n</blockquote>\n<p>Perhaps consider the noncomputable function <code>choice : nonempty A -&gt; A</code> for some A that has no computational realizers, for example <code>A := decidable continuum_hypothesis</code>. <code>nonempty A</code> is <em>equal</em> to <code>true</code> so the <code>?? (nonempty A) -&gt; A</code> function is equivalent to <code>?? true -&gt; A</code>, so if <code>?? true</code> is computably inhabited we have a contradiction, and if there are no inhabitants then it is extensionally equal to <code>?? true -&gt; false</code>, so it's not an equivalence, since <code>nonempty A -&gt; A</code> and <code>nonempty A -&gt; false</code> are not equal in the classical setting.</p>",
        "id": 256333873,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1633475782
    }
]