[
    {
        "content": "<p>I met a bunch of people IRL for the first time at the Providence meetings over the last couple of weeks, and one of them told me that they were very impressed by some kind of number I had attached to my Zulip account here (and Patrick too) because it was apparently very low. This was not surprising as I remember the day we moved here from Gitter so probably I was one of the first people to register at this Zulip instance. But I can't figure out at all how to see this number! If I begin to type <code>@Patrick Massot</code> (without the quotes) and then hit <code>tab</code> then it expands to <code>@**Patrick Massot|110031**</code> (which <em>might</em> mean \"Patrick is number 31\"?) but if I try it with <code>@**Sebastian Ullrich**</code> then I don't get any number; I conjecture that this is because Patrick at some point had two accounts here registered with two different email addresses and then he nuked one of them, but the number was inserted to differentiate between them at some point and it never went away. The person who was so bowled over by my absurdly small number said that it showed up in DMs or something? But I can't manage to make this happen. I'm now curious as to what they saw which made them so excited! Can anyone guess?</p>",
        "id": 291255672,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1659044451
    },
    {
        "content": "<p>clicking on your avatar then \"View Full Profile\" shows your User ID 110038</p>",
        "id": 291256287,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1659044837
    },
    {
        "content": "<p>the number also shows up in the URL when you go to PM someone</p>",
        "id": 291256969,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659045204
    },
    {
        "content": "<p>aah this must have been what they were talking about.</p>",
        "id": 291257241,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1659045344
    }
]