[
    {
        "content": "<p>I've realised that I ignore my github notifications, with the result that much of my PR reviewing is \"drive by\" --- I make some suggestions, but don't necessarily come back to the same PR quickly if it's not of core interest too me. I've just been catching up on some of these and apologising.</p>\n<p>What I would really like is zulip integration, so a bot sent me a private message on zulip when people @mentioned me on github. Does anyone know how to do this?</p>",
        "id": 231910242,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1616729846
    },
    {
        "content": "<p>(Google finds <a href=\"https://zulip.com/integrations/doc/github\">https://zulip.com/integrations/doc/github</a> which I'm sure is worth a quick look to check if your personal user stream is a stream you can use with that) -- but more broadly just to be sure you know --</p>",
        "id": 231968716,
        "sender_full_name": "Julian Berman",
        "timestamp": 1616767166
    },
    {
        "content": "<p>When GitHub sends emails, they tag an email header which says the reason the email was sent to you</p>",
        "id": 231968748,
        "sender_full_name": "Julian Berman",
        "timestamp": 1616767180
    },
    {
        "content": "<p>So if it's helpful to you by chance, you can differentiate between emails sent to you because you're subscribed to a repo and emails sent because you're mentioned, say.</p>",
        "id": 231968871,
        "sender_full_name": "Julian Berman",
        "timestamp": 1616767211
    },
    {
        "content": "<p><a href=\"https://docs.github.com/en/github/managing-subscriptions-and-notifications-on-github/configuring-notifications#filtering-email-notifications\">https://docs.github.com/en/github/managing-subscriptions-and-notifications-on-github/configuring-notifications#filtering-email-notifications</a> -- looks like these days it's via the CC header (which gets set to a different email address depending on why you got the notification, so for mentions, it's <code>mention@noreply.github.com </code>)</p>",
        "id": 231969514,
        "sender_full_name": "Julian Berman",
        "timestamp": 1616767420
    }
]