[
    {
        "content": "<p>Hey folks, Long time ago Jakob  and had shared it here. I have been using it since then on the Desktop App and .<br>\nI have made an extension that tweaks the Zulip UI to appear more modern and  it feels really beautiful and good to use to me. You can check out the extension here if you want to try it out - <a href=\"https://github.com/abhigyank/Prettier-Zulip\">https://github.com/abhigyank/Prettier-Zulip</a> .<br>\nYou can also install it via <a href=\"https://microsoftedge.microsoft.com/addons/detail/prettier-zulip/cnlcfmdhejpbbcoicbemlmgkkallgfjl\">Edge Store</a> and <a href=\"https://addons.mozilla.org/en-US/firefox/addon/prettier-zulip/\">Firefox Store</a> .</p>",
        "id": 245614237,
        "sender_full_name": "Abhigyan",
        "timestamp": 1626020062
    },
    {
        "content": "<p>If you have the extension installed you can enjoy the UI on your web-browser. Do try it out, and I would love  to  have your feedback here.</p>",
        "id": 245614242,
        "sender_full_name": "Abhigyan",
        "timestamp": 1626020081
    },
    {
        "content": "<p>Zulip is open source; have you considered contributing your style tweaks upstream and getting feedback from the Zulip maintainers?</p>",
        "id": 245614598,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626020616
    },
    {
        "content": "<p>It isn't very easy to have consensus on designs as a non-core member. The Zulip team is trying to work on improving its style and design, but in a different way then the tweaks in the extension. It is much convenient and time-saving to just use the extension and do tweaks on top of it based on feedback.</p>",
        "id": 245616848,
        "sender_full_name": "Abhigyan",
        "timestamp": 1626023660
    },
    {
        "content": "<p>For instance, you'd see that a major change in the style in this is that it removes the dark blue box on the message (which I feel is essential to have a modern style vibe). Based on design disucussions I have seen in the dev zulip,  a lot of core team and some other users do prefer having the blue box and don't  want to move away from it. So I feel there  it's always going  to be difficult for non maintainers to drive design changes at scale.</p>",
        "id": 245617144,
        "sender_full_name": "Abhigyan",
        "timestamp": 1626023996
    },
    {
        "content": "<p>(for reference, this was posted on the Zulip meta server here: <a href=\"https://chat.zulip.org/#narrow/stream/2-general/topic/Zulip.20.28Prettier.3F.29.20UI.20Extension/near/1125571\">https://chat.zulip.org/#narrow/stream/2-general/topic/Zulip.20.28Prettier.3F.29.20UI.20Extension/near/1125571</a>)</p>",
        "id": 245696658,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626101348
    }
]