[
    {
        "content": "<p>Hi folks! We're getting close to launching a <a href=\"https://github.com/zulip/zulip/issues/3618\">read receipts feature</a>, which will let people see who has viewed a message via the three-dot message menu, and I'd love to get some feedback about how we roll it out.</p>\n<p>There will be two settings for controlling this feature: an organization-wide setting for whether read receipts are turned on at all, and a personal setting for whether information about whether <em>you</em> have viewed a message is shared or not. </p>\n<p>We're wondering what would be good initial defaults for these settings from the perspective of an open organization like this one. We are leaning strongly towards defaulting the personal setting to \"sharing read receipts is allowed\", as the feature will hardly be useful if the great majority of people have it turned off simply because they don't realize it's there. But there's a lot more flexibility regarding the organization-wide setting.</p>\n<p>Any thoughts are appreciated!</p>",
        "id": 292061084,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1659642708
    },
    {
        "content": "<p>Hi Alya, thanks for the heads-up! Just to clarify, is this for any kind of message? My own assumption, probably influenced by other apps, would be that they are opt-out for private messages but not available for public messages.</p>",
        "id": 292062456,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1659643299
    },
    {
        "content": "<p>These would be for any messages. We could potentially make the personal setting distinguish between private vs. public messages if folks thought that was important.</p>",
        "id": 292062713,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1659643440
    },
    {
        "content": "<p>Do you know what apps your expectations might be coming from?</p>",
        "id": 292062787,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1659643459
    },
    {
        "content": "<p>My sense is that this is more of a \"business\" feature than one for a volunteer community like ours. I would most likely disable them for myself. I'd lean toward disabling them for the organization, or at least turning them off by default, but I could be convinced otherwise.</p>",
        "id": 292063654,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1659643917
    },
    {
        "content": "<p>(Not to talk down the feature, I can imagine lots of Zulip instances where it's extremely useful!)</p>",
        "id": 292063772,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1659643970
    },
    {
        "content": "<p>One thing to keep in mind is that reactions can also function as a more targeted form of read receipt: I can see who upvoted me and if they want me to know they acknowledged my message that's an easy way to do it. But it's opt in, so that doesn't have any information on the legions of lurkers that may possibly be less comfortable with read receipts</p>",
        "id": 292105832,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659673406
    },
    {
        "content": "<p>I agree with Rob and Mario. I can see how this is a useful feature, but for the Lean community I don't think we need it, and I would prefer to have them off by default.</p>",
        "id": 292106797,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1659674417
    },
    {
        "content": "<p>A conscious <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> as read receipt feels more privacy-friendly on a large and open chat like this zulip.</p>",
        "id": 292106824,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1659674492
    },
    {
        "content": "<p>One possible middle ground would be in public streams to share the number of readers but not their identities; which might be of interest to gauge the audience reached in <a class=\"stream\" data-stream-id=\"113486\" href=\"/#narrow/stream/113486-announce\">#announce</a> for instance.</p>",
        "id": 292161613,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1659709716
    }
]