[
    {
        "content": "<p>(This is an issue with Zulip, which I'm new to.) I tried searching for stuff about \"equality of structures\" in the big prominent search bar at the top of the page. This basically returned nothing. So I wrote out a long-ish question, and when I went to make a new topic, typing \"Equalit...\" gave some names that sounded like my question. It took me a frustrating few minutes to find these topics, even though I knew their names. AFAICT the ways are: type \"topic:EXACTNAME\" in the search bar; or, in the sidebar, click on \"more topic\" below a stream, then search in the bar that pops up. I think this is causing people to ask the same question over and over; there's &gt;2 topics already created to ask the same question I was about to create another topic for. Not sure what to do about this. If the welcome bot gave instructions like \"to find people asking a similar question, do X\", that might help people.</p>",
        "id": 268947513,
        "sender_full_name": "Tsvi Benson-Tilsen",
        "timestamp": 1642842773
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"472847\">@Tsvi Benson-Tilsen</span> Very good point. I'm running into the same issue. I've sort of learned to live with it. But it's something that we should report to the Zulip devs.</p>",
        "id": 268952396,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642850066
    },
    {
        "content": "<p>The <code>\"more topics\" -&gt; search in the bar that pops up</code> strategy works well. But it's hard to discover. It would be great of the big search bar at the top could have <code>topic:not-very-exact-name</code> or something like that.</p>",
        "id": 268952430,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642850134
    },
    {
        "content": "<p>Related: I asked a question recently and when I was making the topic title Zulip suggested a title which looked perfect and which presumably already exists. But then I couldn't figure out how to read just that precise topic; search gave me far too much and it turned out that the discussion I wanted happened in 2019. Did I miss a trick?</p>",
        "id": 268952647,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642850477
    },
    {
        "content": "<p>I sometimes resort to Google \"site:\" search on the chat archive, it can be more effective than the Zulip search sometimes.</p>",
        "id": 268952814,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1642850702
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/236604-Zulip-meta/topic/topic.20search/near/268952647\">said</a>:</p>\n<blockquote>\n<p>Related: I asked a question recently and when I was making the topic title Zulip suggested a title which looked perfect and which presumably already exists. But then I couldn't figure out how to read just that precise topic; search gave me far too much and it turned out that the discussion I wanted happened in 2019. Did I miss a trick?</p>\n</blockquote>\n<p>I think there are additional issues with search being raised here, but to answer this one: you can use the <code>CTRL/CMD</code> + <code>.</code> shortcut to narrow to the current compose box recipient. So if the topic auto-complete suggests a topic you think might be relevant, you can choose it from the auto-complete and then use the shortcut to navigate to it.</p>",
        "id": 269001624,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1642920560
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"439115\">@Alya Abbott</span> Thank you so much. Definitely going to use that in the future.</p>",
        "id": 269004048,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642924398
    },
    {
        "content": "<p>I understand that one of the design goals is to have an uncluttered UI. But do you think there could also be a button that shows this \"Narrow to topic\"?</p>",
        "id": 269004103,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642924495
    },
    {
        "content": "<p>Yeah, we had a student working on that feature over the summer, but it didn't quite get finished. I bumped the discussion thread and he just updated the pull request (<a href=\"https://github.com/zulip/zulip/pull/19590\">https://github.com/zulip/zulip/pull/19590</a>), so hopefully we can get it polished up and merged.</p>",
        "id": 269060546,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643000620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"472847\">@Tsvi Benson-Tilsen</span> 's message above revealed a search bug that surfaces when there is a very large number of topics, which should be fixed shortly (<a href=\"https://github.com/zulip/zulip/pull/20942\">https://github.com/zulip/zulip/pull/20942</a>). Thanks for providing all the details, which let us replicate it and track down what's going on!</p>",
        "id": 269608541,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1643305022
    }
]