[
    {
        "content": "<p>Hi folks! We have a \"Show user list on left sidebar in narrow windows\" display option, which puts the user list at the bottom of the left sidebar when the window is too narrow to display it on the right.</p>\n<p>Now that we have added a new private messages section in the left sidebar, we're considering dropping this display option. What do folks think? Does anyone here use it (in this community or in other Zulip organizations), and if so, could you share what about it you like?</p>",
        "id": 308623152,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1667924593
    },
    {
        "content": "<p>95% of the time, my window is wide enough to have the user list on the right. But in the 5% of cases where my window is narrow, I'm happy with the user list on the left.</p>",
        "id": 308627288,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1667925812
    },
    {
        "content": "<p>One of the things that I really like about the Zulip UI is that it uses a lot of screen real estate for the actual threads/conversation. Especially on narrow windows.</p>",
        "id": 308627469,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1667925855
    },
    {
        "content": "<p>If you can maintain that property, I personally don't really care where the user list is displayed. But if dropping the current feature would mean less space for showing actual content on narrow windows, then I would dislike that move.</p>",
        "id": 308627697,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1667925924
    },
    {
        "content": "<p>Dropping the current feature would mean that you'd have to press a button to view the user list in narrow windows, just as you currently need to do if you don't enable that setting.</p>\n<p><a href=\"/user_uploads/3121/of9jrEBO9m8myyV3jCjWVIO9/Zulip_-_Lean.png\">Zulip_-_Lean.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/of9jrEBO9m8myyV3jCjWVIO9/Zulip_-_Lean.png\" title=\"Zulip_-_Lean.png\"><img src=\"/user_uploads/3121/of9jrEBO9m8myyV3jCjWVIO9/Zulip_-_Lean.png\"></a></div>",
        "id": 308633564,
        "sender_full_name": "Alya Abbott",
        "timestamp": 1667927665
    },
    {
        "content": "<p>If you're just looking for datapoints, I've been using Zulip for 5 years and I'm completely happy on my narrow-windowed-laptop to click the icon in the top right if I want to peek at who is online. I didn't even know it was possible to show the user list on the left sidebar and given that I am subscribed to all the streams I quite like having a big list of streams on the left.</p>",
        "id": 308688452,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667948205
    },
    {
        "content": "<p>Same thing for me.  Personally I don't get much out of the user list: there's (fortunately) way too many users on this zulip instance, so it only shows a subset of the users (and rarely the ones I care about).  I only use the user list for the search function.  If I want to see if a particular person is online, I check the the private messages tab.</p>",
        "id": 308689469,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1667948747
    }
]