[
    {
        "content": "<p>One of the Zulip people (Alya Abbott, who I have found very easy to work with in the past) reached out to me today; I quote part of their email.</p>\n<blockquote>\n<p>Separately, as I'm working on improving the Zulip website, I'm putting together a handful of studies showcasing how various kinds of organizations use Zulip. I was wondering if the Lean community might be up for being featured in a case study? The approach we've generally found to work best is for me to do a call with one or two folks to get their perspective, and then draft up a case study based on what they share, followed by a few rounds of feedback on the doc, with perhaps some additional questions to fill in the gaps in the story.</p>\n<p>Anyhow, please let me know what you think about the case study idea, or if there is somebody else I should reach out to about it.</p>\n</blockquote>\n<p>I would be very happy to follow up on this: I remember the gitter days in 2017 and the system we had then would not scale at all (indeed that's why we switched). I use Slack for a project at work and this works well for me but only because all the conversation is only about one thing so the coarser grading which they have there (imagine lots of threads but all in one stream, at least that's how we use it) suffices. For the growth of this community my feeling is that Zulip has been essential and conversely I think that we are one of their success stories; indeed I appear to be quoted <a href=\"https://zulip.com/for/research/\">on their web pages</a> and my impression is that they are now considering upgrading us to a \"case study\" such as <a href=\"https://zulip.com/case-studies/tum/\">this one</a> or <a href=\"https://zulip.com/case-studies/tum/\">this one</a>. Alya is looking for a call with \"one or two folks\" so if there's anyone else who fancies seeing their name in lights (I don't even have to be involved if another mathematician wants to participate, and I guess ideally we could have one mathematician and one computer scientist explaining how we can manage to make sense of what is going on here when there are 100-plus post topics about research level mathematics co-existing with 100-plus post topics about build systems). Any other Zulip addicts feel free to make themselves known and then I'll get back to Alya (or conversely in the unlikely event that people think this is a lousy idea then now's the time to make this feeling known).</p>",
        "id": 255545335,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1632995272
    },
    {
        "content": "<p>Some things it might be nice to mention in such a case study: I think we were quite early adopters/users of the \"open in web editor\" code blocks which has made sharing examples and asking questions infinitely easier. We make heavy use of the linkifiers which make it very easy to direct people to doc for any code in mathlib (coupled with the naming conventions its quite possible for experienced people to answer questions with \"you're looking for <a href=\"https://leanprover-community.github.io/mathlib_docs/find/lemma.i_know_must_exist\">docs#lemma.i_know_must_exist</a>\"). And also the archive (due to <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> ?) which I think was upstreamed and is now used by other repos too</p>",
        "id": 255558795,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1633002544
    },
    {
        "content": "<p>I'll just say that Zulip is a joy to use. I don't think any of the competing products (Slack, Gitter, Discord) come even close to the UX of Zulip.</p>",
        "id": 255559328,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1633002838
    },
    {
        "content": "<p>The times that I used Slack, I felt like I always had to click 5 times to get to a thread, and then it would only use 30% of my screen to show that discussion.</p>",
        "id": 255559421,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1633002873
    },
    {
        "content": "<p>I find that Zulip is a joy to use on desktop, but sometimes a frustrating experience on mobile due to:</p>\n<ul>\n<li>No \"reply to message\" button</li>\n<li>No \"Copy link to message\" button</li>\n<li>That android font bug that isn't Zulip's fault</li>\n</ul>",
        "id": 255560458,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1633003340
    },
    {
        "content": "<p>on mobile I also cannot delete drafts for the life of me</p>",
        "id": 255560634,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1633003428
    },
    {
        "content": "<p>Oh yeah, that's the other one: once you start editing a message on mobile it's impossible to work out how to cancel the edit and reply instead</p>",
        "id": 255560730,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1633003459
    },
    {
        "content": "<p>For me the most problematic issue with Zulip is waking up before my partner, with my Android phone on silent, grabbing my phone and opening up Zulip, replying to a DM, and then getting a response back which makes a notification noise because of an incorrectly set up notification. I mentioned this to the Zulip people and just heard that they fixed it. They might fix your issues too.</p>",
        "id": 255561177,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633003663
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/236604-Zulip-meta/topic/Zulip.20website/near/255560458\">said</a>:</p>\n<blockquote>\n<p>I find that Zulip is a joy to use on desktop, but sometimes a frustrating experience on mobile due to:</p>\n<ul>\n<li>No \"reply to message\" button</li>\n<li>No \"Copy link to message\" button</li>\n<li>That android font bug that isn't Zulip's fault</li>\n</ul>\n</blockquote>\n<p>I get all of these (though I have to click on the three dots first).</p>\n<p>\"--sent from my galaxy\"</p>",
        "id": 255563847,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1633004814
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/qr05nslQOPCv08YM-kztvTI7/Screenshot_20210930-133851.png\">Screenshot_20210930-133851.png</a> What three dots?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/qr05nslQOPCv08YM-kztvTI7/Screenshot_20210930-133851.png\" title=\"Screenshot_20210930-133851.png\"><img src=\"/user_uploads/3121/qr05nslQOPCv08YM-kztvTI7/Screenshot_20210930-133851.png\"></a></div>",
        "id": 255565794,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633005563
    },
    {
        "content": "<p>Anyway, these issues can be discussed in another thread -- or you can just open an issue on the very active Zulip GitHub</p>",
        "id": 255565978,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633005640
    },
    {
        "content": "<p>Oh sorry I thought the app has the same functionality as the mobile web site.  But you're right this doesn't belong here.</p>",
        "id": 255567193,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1633006145
    },
    {
        "content": "<p>I've always been kind of curious about how our Zulip differs from others! I think there was a convo in the Zulip Zulip at one point saying we had very few streams proportional to our size</p>",
        "id": 255581969,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1633011533
    },
    {
        "content": "<p>I think the category-theory zulip has really exploded. It seems to be massive.</p>",
        "id": 255582170,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1633011601
    },
    {
        "content": "<p>I should get back to Alya. Is there anyone else who wants to be involved?</p>",
        "id": 256130036,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633380346
    },
    {
        "content": "<p>I'd be willing to join if you need another</p>",
        "id": 256132171,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1633381352
    }
]