[
    {
        "content": "<p>We've added a bit of text to the PR lifecycle page about the \"easy\" label on mathlib PRs.</p>\n<blockquote>\n<p>The <strong>easy</strong> label should be used to mark PRs that can be immediately approved. Maintainers often look at easy PRs first to keep the queue flowing. Easy PRs typically add a single lemma, correct typos in documentation, or similar. If you have any doubt whether your PR is trivial you should not add this label. In particular, a PR is generally <em>not</em> easy if the diff is more than 25 lines, it adds any definitions or new files, or it adds any <code>simp</code> lemmas or instances that are not immediately analogous to existing <code>simp</code> lemmas or instances.</p>\n</blockquote>\n<p>Summary: please be cautious about adding this label! Only add if if you're pretty sure that we'll merge the PR within 20 seconds of looking at it.</p>",
        "id": 223250420,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1611073287
    },
    {
        "content": "<p>Should we refrain from tagging things \"easy\" until they pass CI? Or is it fine for tag things pre-emptively with the reading \"if this doesn't pass CI then the fix will be trivial too, so a bors d+ is still reasonable\"</p>",
        "id": 223262173,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1611077735
    },
    {
        "content": "<p><del>I think it doesn't matter too much how PRs that are still building are tagged since the <a href=\"https://bit.ly/3kaztxO\">#queue</a> link that we use only includes PRs which pass CI.</del><br>\nWhoops, that's wrong. But I still don't think it matters too much.</p>",
        "id": 223262798,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1611077957
    },
    {
        "content": "<p>Also, it would make sense to put some mention of these guidelines for \"easy\" in the label description on github</p>",
        "id": 223262876,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1611077987
    },
    {
        "content": "<p>Perhaps \"&lt; 20s of review time. See the lifecycle page for guidelines\" since I think label descriptions have to be short</p>",
        "id": 223263101,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1611078038
    },
    {
        "content": "<p>That looks reasonable to me.</p>",
        "id": 223263153,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1611078057
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> I've added your description to the label, thanks!</p>",
        "id": 223265216,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1611078831
    },
    {
        "content": "<p>I have recently tagged as \"easy\" two of my PRs: I was really sure that they were easy, but they failed the 20s rule.  Sorry about that!</p>",
        "id": 223277748,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1611083643
    },
    {
        "content": "<p>No worries! It's an evolving thing... the rule didn't exist yet when you did that (-;</p>",
        "id": 223278111,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1611083770
    },
    {
        "content": "<p>Just a reminder that the \"easy\" label on GitHub indicates \"&lt; 20s of review time\". Obviously this is subjective but I think I've seen quite a few PRs adopting a fairly optimistic interpretation of what I can achieve in 20s recently.</p>",
        "id": 284472924,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1654002811
    },
    {
        "content": "<p>Maybe, <code>easy</code> could be renamed to <code>quick</code>?</p>",
        "id": 284473841,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1654003249
    },
    {
        "content": "<p>I'm not sure, that might suggest \"I need this reviewed quickly\" to somebody. I think \"easy\" mostly works just fine, I just wanted to mention this thread briefly.</p>",
        "id": 284474232,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1654003433
    },
    {
        "content": "<p>do we have a label for time-sensitive PRs that have frequent merge conflicts? That's \"quick\" in a different sense</p>",
        "id": 284474960,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1654003713
    },
    {
        "content": "<p><code>urgent</code> maybe</p>",
        "id": 284475069,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1654003765
    },
    {
        "content": "<p>We don't have such a label. I make no objection to adding one but I doubt that a GitHub label is the right medium for getting something done urgently.</p>",
        "id": 284475184,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1654003806
    },
    {
        "content": "<p>If we ever make such an urgent label, we ought to be careful. I'm pretty sure everyone thinks their contributions are urgent in some sense!</p>",
        "id": 284494300,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1654011322
    },
    {
        "content": "<p><code>urgent</code> PRs are also usually big (hence the higher chance of conflict)</p>",
        "id": 284495091,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1654011653
    },
    {
        "content": "<p>Maybe the label should be <code>will-rot-quicky</code> ?</p>",
        "id": 284496205,
        "sender_full_name": "Anatole Dedecker",
        "timestamp": 1654012071
    }
]