[
    {
        "content": "<p>Is there any way to put VSCode into a kind of \"verbose mode\" where it reports what it's doing while it's thinking?  I don't really know what extra information I want, just some indication that <em>something</em> is happening when VSCode goes into orange-bar-doing-nothing mode.</p>",
        "id": 292264477,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1659800640
    },
    {
        "content": "<p>You can compile your file on the command line with <code>lean --make path/to/file</code> and (at least on Linux) you'll get an indication of what's being compiled and what oleans are being generated.</p>",
        "id": 292264966,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1659801332
    },
    {
        "content": "<p>My problem is specifically with VSCode, because it sometimes decides it needs a good long think even when the file I'm working on hasn't changed.  Sometimes this happens when I've opened other mathlib files just to look at them; sometimes when I've viewed the mouseover popup information about a lemma; and sometimes for no discernible reason at all.  So in part I'd like to have some insight into what it's doing when this happens.  </p>\n<p>But more generally it would sometimes be good to know whether (a) VSCode is making progress but has a couple of other files it needs to compile first, and I need to be patient; or (b) it's stuck somehow or has decided it needs to recompile all of mathlib, in which case I shouldn't be patient and should intervene.</p>",
        "id": 292265440,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1659801826
    },
    {
        "content": "<p>Oh, but I guess VSCode is just using <code>lean --make</code>, so doing that on the command line will diagnose whatever's going on with VSCode, right?</p>",
        "id": 292265572,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1659801961
    },
    {
        "content": "<p>Vscode communicates to lean the current state of all files, so if a change was made to a mathlib file and then undone without saving vscode will still want to recompile, even if <code>lean --make</code> thinks everything is ok. Whenever this happens to me I try and close all the tabs except what I'm working on and restart lean from within vscode.</p>",
        "id": 292266014,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659802558
    },
    {
        "content": "<p>And  yes lean will always recheck a file when it is opened, I guess it wants more information than what is in the oleans, such as tactic states.</p>",
        "id": 292266083,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659802616
    },
    {
        "content": "<p>Is there any way to circumvent that — to open a file in \"view only\" mode?  At the moment it's got me a bit nervous about using the (otherwise exceptionally useful) \"go to definition\" functionality, because I'm always concerned that it'll break everything and I'll lose several minutes to getting things working again.</p>",
        "id": 292266606,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1659803282
    },
    {
        "content": "<p>In the past I've tried to do this by setting VSCode to \"checking nothing\" before navigating to a different file, but I have the feeling it didn't work and so I don't bother doing that now.</p>",
        "id": 292266682,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1659803363
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"422543\">Stuart Presnell</span> <a href=\"#narrow/stream/113488-general/topic/.22Verbose.20mode.22.20for.20VSCode.3F/near/292266606\">said</a>:</p>\n<blockquote>\n<p>Is there any way to circumvent that — to open a file in \"view only\" mode? </p>\n</blockquote>\n<p>That's actually what it does, but little things like hover triggers can cause it to switch from \"olean data\" to \"loaded in memory\", and that's almost certainly the \"good long think\" you are seeing</p>",
        "id": 292266880,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1659803630
    },
    {
        "content": "<p>I agree with Stuart here. Sometimes even right-clicking on a definition and looking at the definition in a file can trigger a recompilation for me, which I can only fix by <code>Lean : restart</code>. \"Closing all tabs\" is not a viable option. I've just opened a tab to look at a definition and see its API!</p>",
        "id": 292281892,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1659824091
    },
    {
        "content": "<p>I agree it's not great, but I haven't found anything better! I'm not sure if old mode is helpful here, but it might be worth experimenting with enabling that at least</p>",
        "id": 292305161,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659857754
    }
]