[
    {
        "content": "<p>If I remove <code>*.olean</code> from the <code>.gitignore</code> of a Github project (which depends on <code>mathlib</code>) and just push my <code>.oleans</code> compiled on a recent Ubuntu to github, people will just be able to pull them and everything will compile for them, whatever OS they're on, right?</p>",
        "id": 312277022,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1669421961
    },
    {
        "content": "<p>I think technically oleans are not supposed to be cross-compatible, but obviously it seems to work on mathlib.</p>",
        "id": 312280538,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669425328
    },
    {
        "content": "<p>If you wanted to you could make a release on GitHub and include them as a release artifact. Then they wouldn't be tracked.</p>",
        "id": 312280612,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669425375
    },
    {
        "content": "<p>Yes, that should work.  Platform-independence of oleans is effectively guaranteed since we rely on that in mathlib.  The only downside will be that you'll have a huge git repository.</p>",
        "id": 312285458,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1669430109
    },
    {
        "content": "<p>And once you've done this, it's essentially impossible to remove them without causing some pain for <em>everyone</em> who has pulled the repo and wants to continue using their pull; they will continue to clutter up history, slowing down pulls for all time. Instead, I'd suggest <code>git-lfs</code> (<a href=\"https://git-lfs.github.com/\">https://git-lfs.github.com/</a>) which is designed for this use case.</p>",
        "id": 312302373,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1669448094
    },
    {
        "content": "<p>It's easy to configure GitHub to upload the oleans as a \"build artifact\": we just don't have any command line tooling to retrieve them right now</p>",
        "id": 312308507,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1669452306
    },
    {
        "content": "<p>Eric, is this different from what I said (I'm actually asking, not trying to be difficult)?</p>",
        "id": 312359325,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669474982
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 312375078,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1669482435
    },
    {
        "content": "<p>Yes, release artifacts are (usually) manually uploaded with a release. Build artifacts are attached to every CI run automatically.</p>",
        "id": 312375128,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1669482479
    },
    {
        "content": "<p>Aha, thanks.</p>",
        "id": 312385414,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1669488756
    }
]