[
    {
        "content": "<p>I was proving a goal yesterday which was a rather complex maze of essentially trivial things -- everything was either a relatively easy argument or a relatively easy consequence of an already-proved result, and it was very much a case of following my nose. I was in tactic mode. Occasionally there were branches, where I would write something like <code>refine _ H _</code> because H was to hand but the two other goals needed a three-line argument, or I had a goal of the form <code>exists x, exists H, ...</code> and I would write <code>existsi _</code> and move on.</p>\n<p>I noticed during this procedure that I would always just work on \"the next available goal\". Lines like <code>existsi _</code> would usually create an extra goal and I would just use <code>{}</code>s to focus down to one goal again. I didn't really care what the next goal was, I had a good notation system going so it was easy to keep track of which trivial thing I was proving, and the arguments were all independent.</p>\n<p>However if someone made a one-line change to Lean which changed the order that the goals appeared in after a line like <code>existsi _</code> then my proof would break and it would be pretty horrible to fix it.</p>\n<p>I know that whenever there is more than one goal I can just write <code>show [blah]</code> to make sure Lean is working on the goal I expect it to be working on, but I was doing classical mathematics with proofs on and many of the goals were of the form <code>|- x in classical.some [very long thing]</code>.</p>\n<p>Would it be considered good style to actually put all these <code>show [blah]</code> lines in? Is there any conceivable reason that the devs might choose, in Lean 4 say, to reorder the way goals appear, and really break a lot of the work I did yesterday? The goals were long in my case and I felt they would clutter my code, but on the other hand I can see an argument for stating precisely what I'm working on at any given time.</p>",
        "id": 125107491,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1523789290
    },
    {
        "content": "<p>it's an option for readability</p>",
        "id": 125111068,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1523798476
    },
    {
        "content": "<p>i know i've linked this file before, but <a href=\"https://github.com/leanprover/mathlib/blob/master/order/conditionally_complete_lattice.lean\" target=\"_blank\" title=\"https://github.com/leanprover/mathlib/blob/master/order/conditionally_complete_lattice.lean\">https://github.com/leanprover/mathlib/blob/master/order/conditionally_complete_lattice.lean</a> demonstrates usage of lots of <code>show</code> for goals</p>",
        "id": 125111071,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1523798522
    },
    {
        "content": "<p>and also breaking down a problem so there isn't a single large proof that discharges many goals</p>",
        "id": 125111114,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1523798602
    },
    {
        "content": "<p>hm, in coq it's pretty easy to match based on the goal type</p>",
        "id": 125111154,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1523798680
    },
    {
        "content": "<p>doing different things based on the 'shape' of the proof may be even more resilient to changes than <code>show</code> too</p>",
        "id": 125111161,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1523798709
    },
    {
        "content": "<blockquote>\n<p>I know that whenever there is more than one goal I can just write <code>show [blah]</code> to make sure Lean is working on the goal I expect it to be working on, but I was doing classical mathematics with proofs on and many of the goals were of the form <code>|- x in classical.some [very long thing]</code>.</p>\n</blockquote>\n<p><code>show</code> selects goal by unification, no need to write down the entire goal.</p>",
        "id": 125111209,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1523798881
    },
    {
        "content": "<blockquote>\n<p>goals were of the form <code>|- x in classical.some [very long thing]</code>.</p>\n</blockquote>\n<p>You should not be facing a theorem like this. There are two ways this can come up:</p>\n<ul>\n<li>You have a definition that uses <code>classical.some</code>, that you unfolded. If you make such a definition, you should <em>always</em> state the corresponding <code>some_spec</code> theorem (or some consequences of it) as the \"interface\" to the definition. This has much better behavior wrt simp and rw, and it makes it clear what important properties you need the definition to have that caused you to use <code>classical.some</code> in the first place.</li>\n<li>If you introduce a <code>classical.some</code> in the middle of a proof, I suggest you use <code>axiom_of_choice</code> instead, which is essentially just <code>some</code> and <code>some_spec</code> together and wrapped in an exists. That way, when you open the exists in your context, it adds a variable f and a fact about it to your context without getting some irrelevant complex term <code>classical.some &lt;big thing&gt;</code> that shouldn't be unfolded anyway.</li>\n</ul>",
        "id": 125119384,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1523819248
    },
    {
        "content": "<blockquote>\n<p>However if someone made a one-line change to Lean which changed the order that the goals appeared in after a line like existsi _ then my proof would break and it would be pretty horrible to fix it.</p>\n</blockquote>\n<p>Your proof style sounds like a good way to find a proof in the first place, but it definitely requires post-processing once the proof is complete, because if you just leave it like that it will be very brittle since you give very little information about what you are proving. One easy thing to do is never use <code>existsi _</code>; once you find out what term goes there (when you finish the proof) you should go back to this line and insert the term. This should also suppress the superfluous branching. (You can get away with <code>&lt;_, proof&gt;</code> to prove an exists more often in term mode, since the type of <code>proof</code> will often give the term by unification.)</p>",
        "id": 125119646,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1523819873
    }
]