[
    {
        "content": "<p>Does anybody use the interface between Lean and Wolfram Mathematica in their work? I'd like to see some cool projects that combine these two technologies.</p>",
        "id": 282233636,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1652441489
    },
    {
        "content": "<p>I think that this interface works with neither the latest lean nor the latest mathematica (in fact IIRC a new release of Mathematica broke the interface shortly after it was up and running) and nobody is maintaining it.</p>",
        "id": 282235740,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1652442772
    },
    {
        "content": "<p>I think at that point it's mostly a proof of concept. When it gets users, this might change.</p>",
        "id": 282235967,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1652442918
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> has marked this topic as resolved.</p>",
        "id": 282238743,
        "sender_full_name": "Notification Bot",
        "timestamp": 1652444656
    },
    {
        "content": "<p>It works fine. The <a href=\"https://github.com/robertylewis/mathematica_examples\">examples repo</a> is based on mathlib from September, and there are probably slight updates to make it work with modern mathlib, but there shouldn't be anything major broken. I haven't tested it with Mathematica 13 but it should be fine on 12.3</p>",
        "id": 282262485,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1652455378
    },
    {
        "content": "<p>I'll update the examples repo when I'm back at a computer with Mathematica installed, and test on 13. Since there aren't really any customers right now we've been lazy about keeping things up to date</p>",
        "id": 282264750,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1652456291
    },
    {
        "content": "<p>Oh I'm really sorry for circulating misinformation Rob! I thought you told me a long time ago that Mathematica had upgraded and the bridge was broken.</p>",
        "id": 282269292,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1652458128
    },
    {
        "content": "<p>No worries, that was the case a long time ago, but we updated it when our <a href=\"https://link.springer.com/article/10.1007/s10817-021-09611-1?utm_source=xmol&amp;utm_medium=affiliate&amp;utm_content=meta&amp;utm_campaign=DDCN_1_GL01_metadata\">journal paper</a> was accepted</p>",
        "id": 282269902,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1652458422
    }
]