[
    {
        "content": "<p>I just did a <code>leanpkg upgrade</code> from mathlib <code>rev = \"3e679326cb4bfb8f0e714f7b52b0da883be339b5\"</code> to <code>rev = \"03ddb8dd343a0dca6cd66470eaf3f40ce933876b\"</code> and I'm now having the lean server evaluating seemingly infinitely. It's burning through 100% CPU and eating up a steadily increasing amount of memory before I kill the process around 3GB.</p>\n<p>This doesn't occur in a blank file, or a file with only a trivial <code>def</code>, but as soon as I put a <code>import data.list</code> or similar in everything blows up.</p>\n<p>Is this a known issue? I should try to put together a github issue if not, but I don't know enough about Lean's inner workings yet to get into debugging this and I'm trying to focus on the maths, so I'll likely just downgrade for now.</p>\n<p>Is there anything in particular that I should do to investigate this?</p>",
        "id": 255469024,
        "sender_full_name": "Sam",
        "timestamp": 1632947443
    },
    {
        "content": "<p>do you have <code>leanproject</code>? what you're doing is essentially rebuilding mathlib from scratch</p>",
        "id": 255469163,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1632947492
    },
    {
        "content": "<p>Oh dear, maybe I'm doing everything wrong! I have <code>elan</code> and <code>leanpkg</code>, which I thought was the proper way to handle the install.</p>",
        "id": 255469369,
        "sender_full_name": "Sam",
        "timestamp": 1632947573
    },
    {
        "content": "<p>Did you go through the recommended installation instructions <a href=\"https://leanprover-community.github.io/get_started.html\">here</a>? You should install <code>leanproject</code> and use <code>leanproject up</code> instead of <code>leanpkg upgrade</code>.</p>",
        "id": 255469565,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632947653
    },
    {
        "content": "<p>for using mathlib, we usually recommend mathlib-tools; see <a href=\"https://leanprover-community.github.io/get_started.html#regular-install\">#install</a>. <code>mathlibtools</code> specifically has <code>leanproject get-cache</code>, which lets you download the oleans separately and therefore not have to recompile mathlib</p>",
        "id": 255469613,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1632947673
    },
    {
        "content": "<p>I have <code>leanproject</code> installed but I wasn't using it. I'll give that a go! I did go through those steps, but it was about a month ago so it's possible that I just misread something badly.</p>",
        "id": 255469705,
        "sender_full_name": "Sam",
        "timestamp": 1632947710
    },
    {
        "content": "<p>Does that explain the infinite server evaluation- it's automatically compiling in the background?</p>",
        "id": 255469761,
        "sender_full_name": "Sam",
        "timestamp": 1632947741
    },
    {
        "content": "<p>Yes, if you run <code>leanproject get-mathlib-cache</code> and then restart Lean inside VS Code, the orange bars should go away quickly.</p>",
        "id": 255469789,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632947755
    },
    {
        "content": "<p>You want <code>leanproject get-mathlib-cache</code> not <code>leanproject get-cache</code></p>",
        "id": 255469918,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1632947788
    },
    {
        "content": "<p>Because it sounds like you're working on a project that depends on mathlib, and was created with <code>leanproject new</code></p>",
        "id": 255469971,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1632947807
    },
    {
        "content": "<p>Perfect, thanks guys. I'm glad that it was just me being an idiot as usual. I'll give that a go and report back.</p>",
        "id": 255470057,
        "sender_full_name": "Sam",
        "timestamp": 1632947846
    },
    {
        "content": "<p>All good now! Thanks for the help!</p>",
        "id": 255471637,
        "sender_full_name": "Sam",
        "timestamp": 1632948456
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"428422\">Sam</span> has marked this topic as resolved.</p>",
        "id": 255471643,
        "sender_full_name": "Notification Bot",
        "timestamp": 1632948459
    }
]