[
    {
        "content": "<blockquote>\n<p>Will it be that lean4 is also magnitude faster for doing (ii)?</p>\n</blockquote>\n<p>It depends. Lean 4 supports multiple levels of trust, and one of them is basically \"trust that compiled code performs according to spec\", at which point you can get that near-C level performance. If you want to actually create a proof term and push it through the kernel, you are limited by either the speed of checking a proof term or the speed of reduction, both of which are not going to be in the same ballpark, although it's hard to estimate just how good it can get as this is very domain dependent.</p>",
        "id": 258632297,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1634858094
    },
    {
        "content": "<p>As a shameless plug, I am actually working on a language called <a href=\"https://github.com/digama0/mm0\">MM0</a> which, among other things, is intended for these kinds of applications. Specifically, the idea is to prove the correctness of a reflective kernel so that proving the correctness of a program and then running it on the bare metal constitutes an actual proof without having to expand the trusted computing base beyond the hardware itself</p>",
        "id": 258632687,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1634858324
    },
    {
        "content": "<p>Thanks! Writing the certificate could be better, as an external verifier also have the same access.</p>\n<p>It's great to know that there are multiple levels of trust that we can put as an option. I'm only seeking out possibilities at this stage, so your answer is exactly what I needed now. I think we can seek out the details as the proof in progress actually enters the verification stage. I'm glad I don't have to wash all my expectations away :D </p>\n<p>Actually, I've had a look at MM0 before, and wanted to know some concrete examples of where it could be used for. Great to know that this could be a possible application! It sort of gives me an impression that it's the closest verification language to machines, which is simple and fast, like Assembly does in PL. I'm excited on the future directions of the project!</p>",
        "id": 258633360,
        "sender_full_name": "Jineon Baek",
        "timestamp": 1634858746
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"242240\">Jineon Baek</span> has marked this topic as resolved.</p>",
        "id": 258635180,
        "sender_full_name": "Notification Bot",
        "timestamp": 1634859919
    }
]