[
    {
        "content": "<p>Hi, I'm very new. \"Theorem Proving in Lean\" has the statement \"Lean’s underlying foundation has an infinite hierarchy of types\", but if I type </p>\n<div class=\"codehilite\"><pre><span></span>#check Type 87172\n</pre></div>\n\n\n<p>my Lean server crashes. Why is this? My computer says it's a segfault (SIGSEGV)</p>",
        "id": 173908297,
        "sender_full_name": "Luca Seemungal",
        "timestamp": 1566498249
    },
    {
        "content": "<p>Interesting. I need to make the number a couple of orders of maginute larger for my Lean server to crash.</p>\n<p>Of course, in practice this never matters, because you rarely work in a specific type universe higher than, say, <code>Type 3</code>.</p>",
        "id": 173909418,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1566499021
    },
    {
        "content": "<p>I'm going to go ahead and assume this is some sort of hardware (RAM?) limitation. My machine is an old laptop from 2009 and I don't have anything else to test this on at the moment.</p>",
        "id": 173909773,
        "sender_full_name": "Luca Seemungal",
        "timestamp": 1566499259
    },
    {
        "content": "<p>I think you're right. I'm under the impression that the specific universes are encoded using unary numerals</p>",
        "id": 173910348,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1566499673
    },
    {
        "content": "<p>That would be why your memory runs out</p>",
        "id": 173910403,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1566499687
    },
    {
        "content": "<p>Yes, they are something like a linked list (with 87172 nodes in this case) iirc</p>",
        "id": 173914294,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1566502542
    },
    {
        "content": "<p>A linked list with 87172 nodes in it isn't that large... There must be hundreds or thousands of them to exhaust memory, and even so a segfault is not the best way to indicate this</p>",
        "id": 173924473,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1566510708
    },
    {
        "content": "<p>You're right Mario, even with 16-byte nodes (pointer + some data) it would only be about 1Mib, so it shouldn't crash (but would be slow, since that's still a long list). Some of the code is <a href=\"https://github.com/leanprover/lean/blob/master/src/kernel/level.h#L42\" target=\"_blank\" title=\"https://github.com/leanprover/lean/blob/master/src/kernel/level.h#L42\">here</a>.</p>",
        "id": 173966218,
        "sender_full_name": "Wojciech Nawrocki",
        "timestamp": 1566564776
    },
    {
        "content": "<p>I don't know anything about how it works, but at some point there was some custom allocation going on for various objects in lean, and if that's still happening it could just be that the custom allocator ran out of memory pages and just tried to keep going.</p>",
        "id": 174016669,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1566609835
    }
]