[
    {
        "content": "<p>Over the summer I watched students struggling with easy number theory for the wrong reasons. They were asked questions about <code>nat</code> but their solutions involve dabbling with <code>int</code>. First they had to realise that subtraction was broken in <code>nat</code>. Then they had to coerce everything. And then they ended up with random goals like <code>of_nat x &lt; \\u y</code> where they knew <code>x &lt; y</code> but didn't know how to finish. Any attempt to use induction in tactic mode produced goals mentioning terms of the form <code>-[1+ succ e]</code> or some such thing, and again they didn't by default know what to do with such terms. The fact that <code>-[1+ e]</code> is not defeq to the coercion of <code>-(1+e)</code> did not help either (it turns out to be defeq to <code>-(e+1)</code>, which in some sense indicates that the notation is not great, but I don't know if there are technical problems with changing it). </p>\n<p>I talked about this with Chris. He said that number theory was much harder than one might naively think, for beginners, because of these issues. I suggested that I just told them all to work with <code>int</code> at all times, because at least then the basic ring operations <code>+ - *</code> all do what the students think they will do, but Chris was not convinced that this was a good approach, because then you lose access to all the structure built on <code>nat</code>, for example primes. I did note that after a few weeks someone had defined <code>int.prime</code> and the students were using that. But I am asking if we can have more.</p>\n<p>The structures <code>nat</code> and <code>{z : int // z &gt;= 0}</code> are canonically isomorphic, if you forget the subtraction on <code>nat</code> which no end user should be touching anyway if they're doing mathematics. Hence every definition or construction or theorem about nat should have a corresponding definition or construction or theorem if you have an int <code>z</code> in your list of hypotheses and also a proof that <code>z&gt;=0</code>. What I want the students to be able to do is to seamlessly get at all these definitions and constructions and theorems by perhaps using a tactic or perhaps using some clever tagging machinery (results about nat which transfer to int correctly because they don't mention subtraction, should be transferrable. For example one should be able to talk about <code>z</code> being prime, and it should realise that we just mean <code>nat.prime</code> for the corresponding <code>nat</code>). </p>\n<p>How feasible is this?</p>",
        "id": 134155954,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537264147
    },
    {
        "content": "<p>I agree that we need better tooling here.<br>\nAny solution to this should preferably also allow to show that every int is just a rat with denominator 1, and every real is just a complex with imaginary part 0, etc... etc...</p>",
        "id": 134156545,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1537264995
    },
    {
        "content": "<p>Actually we also ran into problems with dividing integers because we weren't in rat. In the division case I told the student to bite the bullet and stick with rat and use division and remainder and just pretend the rational was there. But I think you're right really -- to let mathematicians use the software naturally something like the following should happen: whenever someone in \"mathematician mode\" (a mode which people like Mario would always have switched off) attempts to divide a nat by another nat a little paperclip should pop up and say \"I see you're trying to divide naturals. Would you like to coerce every single thing into rat? That way you'll get the right answer!\" and then every nat is replaced by a rat plus proof that the denominator is 1 and the numerator is non-negative. Why not! To the mathematician all that has happened is that a structure has been replaced with a canonically isomorphic structure -- or, in other words, nothing has happened at all, but their division now works correctly. I don't see any disadvantages in this. At the end of it we were supposed to prove that n = 3, and we've actually proved n_rat = 3 : Q, but Lean is smart enough to figure out that we're done because n_rat := (n : Q) and simp knows about the lemma which the mathematician is too blind to see that they need.</p>",
        "id": 134158536,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537268278
    },
    {
        "content": "<p>I really think that is how it should work. That's how maths packages work, and that's what we're used to.</p>",
        "id": 134158586,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537268315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> You might be interested in the last chapter of Mohan's thesis. It deals with this concept of \"unification\". I think it is one of the main gaps that lies between mathematicians and theorem provers.</p>",
        "id": 134158669,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1537268431
    },
    {
        "content": "<p>pari-gp:</p>\n<div class=\"codehilite\"><pre><span></span>$ gp\nReading GPRC: /etc/gprc ...Done.\n\n                  GP/PARI CALCULATOR Version 2.7.5 (released)\n          amd64 running linux (x86-64/GMP-6.0.0 kernel) 64-bit version\n  compiled: Nov 10 2015, gcc version 5.2.1 20151028 (Ubuntu 5.2.1-23ubuntu1)\n                           threading engine: pthread\n                 (readline v6.3 enabled, extended help enabled)\n\n                     Copyright (C) 2000-2015 The PARI Group\n\nPARI/GP is free software, covered by the GNU General Public License, and comes\nWITHOUT ANY WARRANTY WHATSOEVER.\n\nType ? for help, \\q to quit.\nType ?12 for how to get moral (and possibly technical) support.\n\nparisize = 8000000, primelimit = 500000\n? x=4\n%1 = 4\n? type(x)\n%2 = &quot;t_INT&quot;\n? x\n%3 = 4\n? y=6/2\n%4 = 3\n? type(y)\n%5 = &quot;t_INT&quot;\n? z=x/y\n%6 = 4/3\n? type(z)\n%7 = &quot;t_FRAC&quot;\n? w=z*y\n%8 = 4\n? type(w)\n%9 = &quot;t_INT&quot;\n?\n</pre></div>\n\n\n<p>All happening seamlessly behind the user's back.</p>",
        "id": 134158676,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537268461
    },
    {
        "content": "<p>Of course I agree. We have fun with perfectoid spaces, but the sad truth is that Lean is not usable because you cannot manipulate school numbers.</p>",
        "id": 134158749,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1537268573
    },
    {
        "content": "<p>Mohan discusses several solutions, including coercions etc. And he makes fair points about them. I'm not sure if his solution will ever be adaptable to computers, because he ends up using an extremely weak type system.</p>",
        "id": 134158776,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1537268634
    },
    {
        "content": "<p>But it is a good read anyway.</p>",
        "id": 134158779,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1537268642
    },
    {
        "content": "<p>Right, manipulating \"numbers\" should be trivial. By now I've learned to just avoid them. Seems like a bad solution.</p>",
        "id": 134158845,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1537268709
    },
    {
        "content": "<p>Here's an example of the problem. Say we take the standard undergraduate proof that if p is prime and p divides ab then it divides a or b. Here p, a, b are all positive nats say (because the person setting the question is sloppy, which is fine, there is no drive in mathematics to make the absolute most general statement here, we're not adding to mathlib). So the student chooses nat for p,a,b, which is a reasonable-looking choice, and then we assume p does not divide a, and we have to use this somehow, and the way we use it is some lemma saying that if p doesn't divide a then the gcd of p and a is 1. Now we use the standard fact that the gcd is a linear combination of the numbers in question, write <code>1=l*p+m*a</code> with <code>l</code> and <code>m</code> now ints, all these random up-arrows start appearing, we multiply both sides by b, prove that p divides both factors and try to deduce that p divides b but we've only deduced \\u p divides \\u b. What happened? What would be really nice is that when <code>gcd = l p + m a</code> is invoked <em>everything</em> becomes and int, and a tactic changes our goal to the corresponding statement about ints, and the user barely notices.</p>",
        "id": 134159314,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537269384
    },
    {
        "content": "<p>Kicking around in the background is a proof that the new int-valued a and b and p are &gt;= 0, so if the user ever wants to switch back and it's safe to, they can.</p>",
        "id": 134159412,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537269502
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> Is this sort of thing feasible or am I asking for magic? Someone once told me that Lean does not do magic.</p>",
        "id": 134159421,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537269521
    },
    {
        "content": "<p>I taught you well, young man :) I think there are a few things we could try. We could have a tactic <code>to_int</code> to find all the local constants of type <code>nat</code> and replace them with a constant of the same name but of type <code>int</code> with an added assumption saying that it's non-negative.</p>",
        "id": 134161382,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537271951
    },
    {
        "content": "<p>The remaining problem would be to rewrite the assumptions to remove <code>\\u</code> occurrences and use integer related functions / operators</p>",
        "id": 134161403,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537272001
    },
    {
        "content": "<p>The short answer is yes if the above is satisfactory to you</p>",
        "id": 134161468,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537272031
    },
    {
        "content": "<p>We could have a more elaborate tactic language to solve that problem but I'm thinking it might be overkill</p>",
        "id": 134161508,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537272116
    },
    {
        "content": "<p>It could fail if the int version of the goal didn't imply the nat version.</p>",
        "id": 134161837,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537272533
    },
    {
        "content": "<p>The way I'm thinking of it, if that was the case, you'd be left with some <code>\\u</code>. But we can also make it fail if you prefer that.</p>",
        "id": 134162045,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537272788
    },
    {
        "content": "<p>The easiest way to implement it would be to use <code>simp</code> to rewrite all the propositions into equivalent ones. This is stronger than required but it has the benefit of being simple to do.</p>",
        "id": 134162484,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537273417
    },
    {
        "content": "<p>I just wrote a tactic to see if it could be done. I used it in the following example:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"kn\">example</span> <span class=\"o\">(</span><span class=\"n\">a</span> <span class=\"n\">b</span> <span class=\"n\">c</span> <span class=\"n\">d</span> <span class=\"o\">:</span> <span class=\"bp\">ℕ</span><span class=\"o\">)</span>\n  <span class=\"o\">(</span><span class=\"n\">h</span> <span class=\"o\">:</span> <span class=\"n\">a</span> <span class=\"bp\">+</span> <span class=\"n\">b</span> <span class=\"bp\">≥</span> <span class=\"n\">c</span><span class=\"o\">)</span>\n  <span class=\"o\">(</span><span class=\"n\">h₀</span> <span class=\"o\">:</span> <span class=\"n\">a</span> <span class=\"err\">∣</span> <span class=\"n\">c</span><span class=\"o\">)</span>\n  <span class=\"o\">(</span><span class=\"n\">h&#39;</span> <span class=\"o\">:</span> <span class=\"n\">a</span> <span class=\"bp\">+</span> <span class=\"n\">c</span> <span class=\"bp\">+</span> <span class=\"mi\">17</span> <span class=\"bp\">≥</span> <span class=\"n\">d</span><span class=\"o\">)</span> <span class=\"o\">:</span>\n  <span class=\"n\">a</span> <span class=\"bp\">*</span> <span class=\"n\">c</span> <span class=\"bp\">≤</span> <span class=\"n\">b</span> <span class=\"bp\">+</span> <span class=\"n\">d</span> <span class=\"bp\">*</span> <span class=\"n\">c</span> <span class=\"o\">:=</span>\n<span class=\"k\">begin</span>\n  <span class=\"n\">to_int</span><span class=\"o\">,</span>\n    <span class=\"c1\">-- a : ℤ,</span>\n    <span class=\"c1\">-- a_nneg : a ≥ 0,</span>\n    <span class=\"c1\">-- b : ℤ,</span>\n    <span class=\"c1\">-- b_nneg : b ≥ 0,</span>\n    <span class=\"c1\">-- c : ℤ,</span>\n    <span class=\"c1\">-- c_nneg : c ≥ 0,</span>\n    <span class=\"c1\">-- d : ℤ,</span>\n    <span class=\"c1\">-- d_nneg : d ≥ 0,</span>\n    <span class=\"c1\">-- h : a + b ≥ c,</span>\n    <span class=\"c1\">-- h₀ : a ∣ c,</span>\n    <span class=\"c1\">-- h&#39; : a + c + 17 ≥ d</span>\n    <span class=\"c1\">-- ⊢ a * c ≤ b + d * c</span>\n<span class=\"kn\">end</span>\n</pre></div>\n\n\n<p>Does that look like what you're looking for?</p>",
        "id": 134170146,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537281254
    },
    {
        "content": "<p>I just pushed it to <code>mathlib-nursery</code>. To use it, <code>import tactic.to_int</code></p>",
        "id": 134171190,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537282391
    },
    {
        "content": "<p>I'm hopeful that any oversight of the current version can be fixed by tagging lemmas with <code>@[to_int]</code></p>",
        "id": 134171215,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537282437
    },
    {
        "content": "<p>The version I'm thinking of here would be a tactic like <code>cast ℤ at h1 h2</code>, which would try to convert any equalities or inequalities in the given target(s) to the specified type using cast theorems</p>",
        "id": 134171547,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537282774
    },
    {
        "content": "<p>Applied to <code>h'</code> above it would produce <code>(↑a + ↑c + 17 : ℤ) ≥ ↑d</code></p>",
        "id": 134171631,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537282829
    },
    {
        "content": "<p>I decided to go one step further and eliminate all arrows if possible just so Kevin's student don't have to think about them.</p>",
        "id": 134172005,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537283241
    },
    {
        "content": "<p>I think hiding too much information might cause more problems than it solves.</p>",
        "id": 134172093,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1537283350
    },
    {
        "content": "<p>I'm also worried about losing the link to the original variables, which may be involved in other things that can't be cast</p>",
        "id": 134172119,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537283392
    },
    {
        "content": "<p>I agree that it can be the case but in this situation, removing the arrows can take a number of lines that aren't too enlightening with regards to what you're trying to prove</p>",
        "id": 134172222,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537283489
    },
    {
        "content": "<p>that's the part that a <code>cast</code> tactic would solve</p>",
        "id": 134172299,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537283545
    },
    {
        "content": "<p>The other thing is that, if we keep the arrows, you end up working with two kinds of addition, two kinds of multiplication ... etc. I thought I'd try to remove that hurdle</p>",
        "id": 134172301,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537283547
    },
    {
        "content": "<p><code>cast</code> would also solve that</p>",
        "id": 134172432,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537283665
    },
    {
        "content": "<p>What part of <code>to_int</code> would you not put in <code>cast</code>?</p>",
        "id": 134172456,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537283712
    },
    {
        "content": "<p>the part about eliminating the original variables in favor of arbitrary nonnegative integers</p>",
        "id": 134172534,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537283800
    },
    {
        "content": "<p>and also allowing for more targeting to particular hypotheses</p>",
        "id": 134172548,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537283822
    },
    {
        "content": "<p>I can see the point of that. Actually, I can see a case for both removing the original variables and keeping them.</p>",
        "id": 134172746,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537284031
    },
    {
        "content": "<p>besides the mental load of having arrows in your goal, I don't see any harm in keeping them, meaning that unless you are being specifically pedagogical and you are before the chapter on coercion or whatever it seems like a bad idea to remove them</p>",
        "id": 134174523,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537285781
    },
    {
        "content": "<p>That is, they shouldn't get in your way for the rest of the proof once they have been moved down to the atoms</p>",
        "id": 134174601,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537285827
    },
    {
        "content": "<p>I agree that it's useful for pedagogical reasons and to lift a mental burden but I wouldn't say that those are mere goodies. I think that limiting the size of the relevant vocabulary (int vs nat) can make solutions more obvious both for a human prover and for an automated prover. If every natural number in your goal occurs with <code>\\u</code> right next to it, most likely, natural numbers are not relevant for that part of the proof so let's not look for <code>nat.</code> lemmas.</p>",
        "id": 134176929,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537288252
    },
    {
        "content": "<p>It is true that if a natural number <code>n</code> only ever appears in the form <code>\\u n</code> in hypotheses and the goal, then it is \"safe\" to replace it with a nonnegative integer variable. But this only works in certain cases; I don't see an analogous argument for <code>Q -&gt; R</code> coercion for example.</p>",
        "id": 134179372,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537290757
    },
    {
        "content": "<p>That can be optional behavior. It can a useful thing to do in other cases too. But in the case of nat / int, the knowledge we have of the situation allows us to assume <code>i ≥ 0</code></p>",
        "id": 134179785,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1537291207
    },
    {
        "content": "<p>I was playing around with a tactic that I think does similar things: <a href=\"https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/naturally.lean\" target=\"_blank\" title=\"https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/naturally.lean\">https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/naturally.lean</a></p>",
        "id": 134326214,
        "sender_full_name": "Nicholas Scheel",
        "timestamp": 1537466971
    },
    {
        "content": "<p>some usages: <a href=\"https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/hw/hw2.lean#L520\" target=\"_blank\" title=\"https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/hw/hw2.lean#L520\">https://github.com/MonoidMusician/MATH361/blob/lean-3.4.1/src/hw/hw2.lean#L520</a></p>",
        "id": 134326321,
        "sender_full_name": "Nicholas Scheel",
        "timestamp": 1537467060
    },
    {
        "content": "<p>at the end I use it to squash all of these at once, after applying <code>div_nonneg</code> as appropriate:</p>\n<div class=\"codehilite\"><pre><span></span><span class=\"mi\">9</span> <span class=\"n\">goals</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">≤</span> <span class=\"mi\">81</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">&lt;</span> <span class=\"mi\">64</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">≤</span> <span class=\"mi\">2</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">≤</span> <span class=\"mi\">9</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">&lt;</span> <span class=\"mi\">8</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">≤</span> <span class=\"mi\">9</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">&lt;</span> <span class=\"mi\">4</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">≤</span> <span class=\"mi\">3</span>\n<span class=\"err\">⊢</span> <span class=\"mi\">0</span> <span class=\"bp\">&lt;</span> <span class=\"mi\">2</span>\n</pre></div>",
        "id": 134326426,
        "sender_full_name": "Nicholas Scheel",
        "timestamp": 1537467182
    },
    {
        "content": "<p>(those statements are all in ℝ)</p>",
        "id": 134326444,
        "sender_full_name": "Nicholas Scheel",
        "timestamp": 1537467216
    },
    {
        "content": "<p><code>norm_num</code>?</p>",
        "id": 134326914,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1537467651
    }
]