[
    {
        "content": "<p>Lean has a number of \"options\", e.g. <code>pp.all</code>, which are used for various things.  Since one can't add custom options, I'd like to co-opt one for a proof recording project.  In particular, I'd like to make it such that if I run <code>lean -D &lt;some_option&gt;=&lt;some_value&gt; all.lean</code> then Lean will spit out (lots of) trace code, but will not otherwise.  <strong>Is there an option which is useless which I can use without it effecting the behavior of Lean?</strong></p>",
        "id": 214132007,
        "sender_full_name": "Jason Rute",
        "timestamp": 1603327072
    },
    {
        "content": "<p>If not, I just realized I might be able to just use that a particular option is set.  Most options are never actually set.  They have default behavior, but one can distinguish (inside a tactic) if an option is set to anything or nothing, so maybe I can just test that some obscure option like <code>pp.colors</code> is set to something, and I'll just set it to the default value.</p>",
        "id": 214132213,
        "sender_full_name": "Jason Rute",
        "timestamp": 1603327299
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> I guess you <em>can</em> add options in the community fork of Lean? It's a bit more cumbersome, because you have to change core.... not sure whether it's worth it, or if you should just use your hack (-;</p>",
        "id": 214140116,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1603337149
    },
    {
        "content": "<p>I’m doing this proof recording without changing the C++.  (Mostly because I’m not comfortable programming in it.)  But if the options are built into the lean files, I could change those.</p>",
        "id": 214140315,
        "sender_full_name": "Jason Rute",
        "timestamp": 1603337419
    },
    {
        "content": "<p>Well, I'm also not comfortable with changing the C++ for you... so we would have to wait for Gabriel, I guess</p>",
        "id": 214140594,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1603337932
    },
    {
        "content": "<p>there is the <code>trace_if_enabled</code> stuff for tracing according to whether a flag is set to on or off. the flag is set from within lean code rather than from the command line, but depending on what environment you're running this in, that might not be too hard to mess around with</p>",
        "id": 214141811,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1603339943
    },
    {
        "content": "<p>You can add new trace options yourself. Several tactics already do this. (e.g. <code>suggest</code> and <code>solve_by_elim</code> offhand)</p>",
        "id": 214147098,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1603347303
    },
    {
        "content": "<p>Unfortunately none of these options can be set on the command-line, because there's a check that you only use built-in options..</p>",
        "id": 214150565,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1603350677
    },
    {
        "content": "<p>We should disable that check.</p>",
        "id": 214150572,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1603350682
    },
    {
        "content": "<p>Thanks.  I think I’ll just go with my hack.  This will be very hacky code anyway.  I’m trying to record all the tactic proofs in Lean with a combination of carefully placed tracing code added the standard library and mathlib and a crappy homemade Lean parser written in Python.</p>",
        "id": 214173371,
        "sender_full_name": "Jason Rute",
        "timestamp": 1603366087
    }
]