[
    {
        "content": "<p>My students and I are developing an affine space library, and an affine coordinate space library based on it. We formalize an affine space as a torsor over a vector space. The formalizations are fully general, e.g., arbitrary field, etc. Our use case is to help in formalizing aspects of classical physics and dynamics. </p>\n<p>My question is, what is the current state of development of affine spaces (along with frames, transformations, geometry, etc)  in Lean, beyond the work we've been doing? Also, what would be the best way to share our work with the community?</p>",
        "id": 207843473,
        "sender_full_name": "Kevin Sullivan",
        "timestamp": 1598276195
    },
    {
        "content": "<p>You can go to <a href=\"https://leanprover-community.github.io/mathlib_docs/\">https://leanprover-community.github.io/mathlib_docs/</a> and type affine in the search bar</p>",
        "id": 207843941,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598276460
    },
    {
        "content": "<p>Or else use the folder list on the left to browse to <code>`linear_algebra/affine_space</code> and <code>geometry/euclidean</code>.</p>",
        "id": 207844010,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598276499
    },
    {
        "content": "<p>As for sharing the code: I've been working on and off on infrastructure for user-contributed libraries. You could add your project to the list <a href=\"https://github.com/leanprover-contrib/leanprover-contrib\">here</a>, ideally after setting up CI as described <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/ci-info/templates/ci.md\">here</a>. (The branch update is important for the contrib tool.) Sooner or later, checked in projects will be displayed somewhere on the community site.</p>",
        "id": 207844354,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598276685
    },
    {
        "content": "<p>Although we don't have affine frames yet, the module doc string for <code>linear_algebra/affine_space/basic</code> has a suggestion for how they might be represented in Lean (as an <code>affine_equiv</code> between an affine space and the space of its coordinates; we don't have <code>affine_equiv</code> yet either). Affine spaces are defined in mathlib over arbitrary modules, not just vector spaces (most results so far don't require a field).</p>",
        "id": 207912288,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1598314427
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span> <a href=\"#narrow/stream/113488-general/topic/Affine.20spaces/near/207912288\">said</a>:</p>\n<blockquote>\n<p>Although we don't have affine frames yet, the module doc string for <code>linear_algebra/affine_space/basic</code> has a suggestion for how they might be represented in Lean (as an <code>affine_equiv</code> between an affine space and the space of its coordinates; we don't have <code>affine_equiv</code> yet either). Affine spaces are defined in mathlib over arbitrary modules, not just vector spaces (most results so far don't require a field).</p>\n</blockquote>\n<p>Thank you. We've implemented affine coordinate spaces as a special case of affine spaces and affine frames as defining isomorphisms between affine coordinate spaces. We're not quite sure yet how to handle equality of points and vectors when represented as different coordinate tuples. We'll study what you've produced and will see if we can integrate what you and what we are doing. We appreciate your work! Thank you, again.</p>",
        "id": 208224742,
        "sender_full_name": "Kevin Sullivan",
        "timestamp": 1598538821
    }
]