[
    {
        "content": "<p>why is the axiom of choice sometimes vilified by people doing interactive theorem proving? like I honestly don't get it...</p>",
        "id": 244797079,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1625308724
    },
    {
        "content": "<p>it doesn't allow computation, which can be nice (e.g. things like <code>dec_trivial, #reduce</code> and such like</p>",
        "id": 244797160,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1625308914
    },
    {
        "content": "<p><code>noncomputable</code> is much more vilified than <code>#print axioms</code> containing <code>choice</code>; the former blocks computation, the latter just feels untidy to people who know the same result can be proved without choice.</p>",
        "id": 244798418,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1625310653
    },
    {
        "content": "<p>Although even <code>noncomputable</code> is somewhat the norm for the more mathematical ends of mathlib; <code>finsupp</code> has a non-computable addition (in order to avoid passing around <code>decidable_eq</code> instances), which means that things involving <a href=\"https://leanprover-community.github.io/mathlib_docs/find/basis\">docs#basis</a> typically also end up noncomputable.</p>",
        "id": 244798484,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1625310752
    },
    {
        "content": "<p>As a mathematician, I am happy to assume the axiom of choice, but I would be hard-pressed to find a single example where, for any application that I <em>really</em> care about, the axiom of choice was really needed.  I probably <em>never</em> needed</p>\n<ul>\n<li>a basis for <code>ℝ</code> as a <code>ℚ</code>-vector space,</li>\n<li>the existence of a non-Lebesgue measurable set,</li>\n<li>a maximal ideal in a ring that was not essentially of finite type,</li>\n<li>...</li>\n</ul>\n<p>However, several results, for instance in analysis, <em>appear</em> to use the full axiom of choice, but only since it simplifies a slightly more convoluted argument.  Usually, the explicit separabilty of <code>ℝ</code> would get you what you wanted, without having to actually use the axiom of choice.</p>\n<p>To conclude: as a mathematician, I am happy to use it and to keep, in the back of my mind, the idea that it is ultimately not needed for the fragment of set theory in which I actually work.</p>",
        "id": 244799269,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1625311797
    },
    {
        "content": "<p>Usually when you define something, call it Foo, you want to write some lemmas which tell you what Foo is and how it behaves. This helps you prove things about Foo. E.g when you define natural addition you also want to prove that it is commutative, associative etc. But you cannot prove any lemmas about <code>choice</code>. It's a dead end. You cannot compute with it. Still, the way mathematics is traditionally done, you need choice all over the place and things work well. For various reasons, some people doing interactive theorem proving want to do mathematics differently, constructively. In constructive mathematics choice has no role. But you shouldn't think of constructive mathematics as \"ordinary mathematics where you avoid choice for some reason\". It's just a different style of mathematics.</p>",
        "id": 244799929,
        "sender_full_name": "David Wärn",
        "timestamp": 1625312586
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321459\">Damiano Testa</span> <a href=\"#narrow/stream/113488-general/topic/axiom.20of.20choice.20vilified/near/244799269\">said</a>:</p>\n<blockquote>\n<p>However, several results, for instance in analysis, <em>appear</em> to use the full axiom of choice, but only since it simplifies a slightly more convoluted argument.  Usually, the explicit separabilty of <code>ℝ</code> would get you what you wanted, without having to actually use the axiom of choice.</p>\n</blockquote>\n<p>A lot of stuff in analysis indeed doesn't require the full axiom of choice, but only the well-known weaker version called axiom of dependent choices (which allows you to construct sequences where you choose an element at every step).</p>\n<p>Even very innocent statements require (weak versions of) choice: e.g. that a function R-&gt;R is epsilon-delta-continuous iff it commutes with limits is false in ZF.</p>",
        "id": 244800903,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1625313699
    },
    {
        "content": "<p>You must mean is false in some exotic model of ZF right? Hence undecidable in ZF.</p>",
        "id": 244807478,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1625321384
    }
]