[
    {
        "content": "<p>Hi everyone,</p>\n<p>I have a very talented high school senior I've been working with here in upstate NY. He's completed the Natural Number Game and the Complex Number Game. He is interested in pursuing math and computer science in university, and he really seems to enjoy Lean. I've been thinking of suggesting he try to go to Brown or Fordham to potentially work with <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> or <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span>. It occurred to me that it might be a good idea to ask here for recommendations for \"best Lean-friendly undergrad departments\". I mean, obviously, there's Kevin's group at Imperial, but I don't know if this student will be able to get to London. </p>\n<p>The answer to this is probably obvious...that one needs to look at the list of names on the right rather than departments. I thought I might test that assumption, though, before talking with the student this afternoon.</p>\n<p>Thank you, in advance, for your feedback!</p>",
        "id": 301628232,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1664539105
    },
    {
        "content": "<p>I would imagine that CMU is a good place to consider.</p>",
        "id": 301629782,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1664539611
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> : great! Thank you.</p>",
        "id": 301638365,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1664542110
    },
    {
        "content": "<p>Not to self-promote too much, but both the CS and mathematics departments at the Vrije Universiteit Amsterdam have some Lean users :)</p>",
        "id": 301638787,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1664542233
    },
    {
        "content": "<p>I assume that if London is too far then Orsay and Amsterdam are probably too far.</p>",
        "id": 301639384,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1664542419
    },
    {
        "content": "<p>Maybe true, <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> , but I'm going to recommend that the student consider Orsay, Amsterdam and London.</p>",
        "id": 301639838,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1664542547
    },
    {
        "content": "<p>Since you'll be speaking in an American context, you should probably point out that Orsay is much <em>much</em> cheaper than Imperial College in London.</p>",
        "id": 301640120,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1664542629
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> Noted! I imagine that the student might jump at the chance to have access to Jeremy, though. I'll let you know how it goes when I talk with him today. (I will show him this thread, as well.) </p>\n<p>I also will note the success you have with undergrads, Patrick. E.g. Anatole!</p>",
        "id": 301640368,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1664542709
    },
    {
        "content": "<p>A quick google search suggests Orsay is about 200 times cheaper than Imperial.</p>",
        "id": 301641189,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1664542934
    },
    {
        "content": "<p>CMU does indeed seem to be a very good match for his interests. I'd be happy to talk to him.</p>",
        "id": 301656133,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1664547035
    },
    {
        "content": "<p>I wouldn't necessarily say \"best\" but, for some reason, they keep letting me teach Lean-based courses. 3/4 as it currently stands for this year. (And I kinda regret not using Lean for my crypto course <span aria-label=\"cry\" class=\"emoji emoji-1f622\" role=\"img\" title=\"cry\">:cry:</span>)</p>",
        "id": 301676156,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1664552307
    },
    {
        "content": "<p>Yeah I suspect that for a US student Imperial will cost something like £37000 per year, so comparable to many US institutions. As well as Matt in South Carolina there's Adam Topaz in UAlberta if you think North America is a more feasible alternative.</p>",
        "id": 301708110,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1664562036
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> yes, this is comparable to many US institutions.</p>",
        "id": 301728923,
        "sender_full_name": "Jon Bannon",
        "timestamp": 1664569638
    }
]