[
    {
        "content": "<p>The fact that <code>∃ δ &gt; 0, ...</code> parses as <code>∃ (δ :ℝ)  (H : δ &gt; 0), ...</code> rather than <code>∃ δ : ℝ, δ &gt; 0 ∧ ...</code> is really a pain for teaching. <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> do you think the Lean 4 parser will allow us to choose here? Or even better, is it already possible in Lean 3?</p>",
        "id": 159021393,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1550701889
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> predicted in Amsterdam, hiding from students the fact that Lean uses non-set theoretic foundations is surprisingly easy. Until you get to bounded existential like <code>∃ δ &gt; 0</code>. I couldn't find any convincing lie to interpret this <code>∃ H : δ &gt; 0</code>.</p>",
        "id": 159021558,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1550702059
    },
    {
        "content": "<p>By the way, will the new parser be accompanied by a more customizable pretty printer? It would be even better to also keep <code>∀ ε &gt; 0</code> like this in the Lean messages view.</p>",
        "id": 159021621,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1550702144
    },
    {
        "content": "<p>By way of clarification, my observation was not so much that we can hide the foundation from students, but, rather, that we don't have to apologize for it. Informal mathematics is what it is, and we can explain it to students and they can learn how to read and write ordinary proofs. Translating informal mathematics to any formal language -- set theory, type theory, or anything else -- requires adopting a rigid syntax. If we get over the idea that we have to pretend that informal proofs and formal proofs are the same thing, students have no problem learning the formal rules and understanding how they relate to the informal proof patterns. Being honest and straightforward is the best policy.</p>",
        "id": 159029787,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1550710451
    },
    {
        "content": "<blockquote>\n<p>do you think the Lean 4 parser will allow us to choose here? Or even better, is it already possible in Lean 3?<br>\nBy the way, will the new parser be accompanied by a more customizable pretty printer?</p>\n</blockquote>\n<p>Yes. No. Yes.</p>",
        "id": 159048670,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1550736623
    }
]