[
    {
        "content": "<p>I'm working on a (sort of ambitious) project in Lean.   One thing I'm doing is making tactics which can call external Python scripts (using Lean's io capabilities).  For now they are mostly toy examples, but I'll eventually call trained machine learning algorithms.  I'm just curious if there are any other projects which have done this sort of interface?  I think the Lean-Mathematica interface of <span class=\"user-mention\" data-user-id=\"110187\">@Minchao Wu</span> and <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> used the Lean server to call Lean from within Mathematica (and there are a few projects which call Lean from within Python with the Lean server).  The LeanHammer project of <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> uses custom C++ code if I recall.  (I think I know what I'm doing, but it would be good to see prior art.)</p>",
        "id": 198839519,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590540556
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110111\">@Keeley Hoek</span>'s experimental version of <code>rewrite_search</code> called a classifier written in C++. If I remember correctly, an initial version used <code>io</code> to call an external process, and subsequently he just forked Lean and inlined the C++ he needed.</p>",
        "id": 198840265,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1590541544
    },
    {
        "content": "<p>The Mathematica link goes both ways. From Mathematica, you can interact with a Lean server. And from Lean, you can query Mathematica. The latter direction does exactly what you're proposing. We wrote a small Mathematica server in Mathematica (so that we didn't relaunch it for every query), and using the io monad in Lean, we called a Python script that interacted with this server.</p>",
        "id": 198857265,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1590564057
    },
    {
        "content": "<p>The Python layer is very small, just a handful of lines, but it was easier than doing the server interface directly from Lean...</p>",
        "id": 198857300,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1590564099
    },
    {
        "content": "<p>Ok great.  I just found your code: <a href=\"https://github.com/robertylewis/mathematica\">https://github.com/robertylewis/mathematica</a></p>\n<p>I got confused since the other direction of the interface is stored in a separate repo: <a href=\"https://github.com/minchaowu/mm-lean\">https://github.com/minchaowu/mm-lean</a></p>",
        "id": 198880716,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590580559
    },
    {
        "content": "<p>Another way to communicate with Lean is by hacking the C++ code.  Since I don't know C++, I don't think about these sort of things.  I think the <a href=\"https://github.com/dselsam/lean-python-bindings\">Python Lean Bindings</a> are an example of this.  However, I also think the bindings may not work any more (Does anyone know?) which is a danger of such approaches.  Other projects, like the <a href=\"#narrow/stream/113488-general/topic/Hammer.20talk\">Lean hammer</a> and @Keeley Hoek's experimental version of rewrite_search  (where is the code?) also write custom C++ code to interact with Lean.</p>",
        "id": 199254092,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590841049
    }
]