[
    {
        "content": "<p>Since I discovered lean I have essentially stopped playing all computer video games other than Lean. But occasionally I find myself on mobile with no internet access, and for years the only game on my phone was <a href=\"https://www.chiark.greenend.org.uk/~sgtatham/puzzles/\">Simon Tatham's puzzles</a>. For most of those puzzles I think \"yeah I could make a type for those levels in lean\". But recently I went back to the Android game <a href=\"https://play.google.com/store/apps/details?id=com.largeanimal.colorzen\">Color Zen</a>. How would you formalise the type whose terms were levels of that game? Perhaps forget the physics and just make an arbitrary algorithm to break collision ties based on eg position of collision in [0,1]^2. Or is it better to use <span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span> 's beautiful ideas? Something which models some of the levels for which topology is not really playing a role would be a good start.</p>",
        "id": 308066929,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667604097
    },
    {
        "content": "<p>That's what the levels look like<br>\n<a href=\"/user_uploads/3121/dnZiGsmr9Mldz7Q5hJm6nBAq/Screenshot_20221104-235757.png\">Screenshot_20221104-235757.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/dnZiGsmr9Mldz7Q5hJm6nBAq/Screenshot_20221104-235757.png\" title=\"Screenshot_20221104-235757.png\"><img src=\"/user_uploads/3121/dnZiGsmr9Mldz7Q5hJm6nBAq/Screenshot_20221104-235757.png\"></a></div>",
        "id": 308067124,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667604208
    },
    {
        "content": "<p>Writing a solver would be cool but you'd have to understand the question first</p>",
        "id": 308068384,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667604880
    },
    {
        "content": "<p>The game reminds me a bit of pi-calculus, but with a weird communication rule.</p>",
        "id": 308076254,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1667609714
    },
    {
        "content": "<blockquote>\n<p>How would you formalise the type whose terms were levels of that game?</p>\n</blockquote>\n<p>The first step would be to provide public and unrestricted access to the game. Is it open source? Can it be played on PC? Is there an online version? There are a few gameplay videos on youtube, but in order to understand all mechanincs of the game, one would need to play the game. I don't have an iphone, and for the android, google play store is blocked in my country. How am I supposed to think about formalizing it if I can't access it? (not only me, but anyone who can't access the game).</p>\n<p>Topics about formalizing closed-source games (or mobile-only games) are more suitable for reddit or discord, rather than zulip, in my opinion.</p>",
        "id": 308124731,
        "sender_full_name": "Patrick Johnson",
        "timestamp": 1667647355
    },
    {
        "content": "<p>I'm happy to take it there!</p>",
        "id": 308126387,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667648121
    },
    {
        "content": "<p>For what it's worth, I disagree and think this is a reasonable topic of conversation on zulip. If I had more time, I would love to look at the game to understand Gabriel's intriguing comment. :-) Its irrelevance to some people is a reason for them to mute the conversation or stream, but not much more.</p>",
        "id": 308130958,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1667650178
    }
]