[
    {
        "content": "<p>After finishing <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> 's course up to and including group cohomology, it dawned on me that there are strong connections between theorem proving à la lean (which I'm getting only now a bit familiar with) and computer algebra systems such as GAP and Magma (which I know much better).</p>\n<p>The link I see is through \"interfaces\": while Kevin defines, say, H^2(G,M) as a set, and then forces on it an abelian group structure, induced maps coming from morphisms M-&gt;N or G-&gt;H, and properties such as exactness, a GAP package would define a constructor H^2(G,M), with properties \"IsAdditiveGroup\", methods producing induced maps, and would exploit exactness by giving attributes to these induced maps so that the kernel of one is automatically deduced from the image of another.</p>\n<p>I wonder whether there is some sense in making the connection between provers and computer algebra systems more explicit, and whether there are already efforts in this direction?</p>\n<p>I can imagine that, in some cases, the computer algebra system could contribute something valuable to the prover: e.g. if the CAS proved that a given finitely presented group is trivial, it could feed the Tietze transformations back into a prover for certification. If, as I groked from Kevin's classes, the underlying  interfaces are actually very close (with the CAS on the \"computing explicitly\" side and the prover on the \"apply axioms\" side of the interface), it may pay off to have them actually match.</p>\n<p>Comments of course welcome!</p>",
        "id": 234563928,
        "sender_full_name": "Laurent Bartholdi",
        "timestamp": 1618429988
    },
    {
        "content": "<p>If you have some time to spare, I can only encourage you to read <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span> 's HDR memoir <a href=\"https://tel.archives-ouvertes.fr/tel-03107626/file/memoir_with_cover.pdf\">https://tel.archives-ouvertes.fr/tel-03107626/file/memoir_with_cover.pdf</a>, which is a wonderful read and advocates among many things this idea that interactions between CAS and proof assistants is a very worthwhile goal.</p>",
        "id": 234565677,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1618430623
    },
    {
        "content": "<p>(Have a look at Listing 5.1 on Page 77 if you're curious and brave enough)</p>",
        "id": 234565932,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1618430722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> and <span class=\"user-mention\" data-user-id=\"110187\">@Minchao Wu</span> have a paper on connection Lean to Mathematica: <a href=\"https://arxiv.org/abs/2101.07758v1\">https://arxiv.org/abs/2101.07758v1</a></p>",
        "id": 234569262,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1618432117
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> Thanks for the link! That example on p77 is really terrifying.</p>",
        "id": 234575002,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1618434216
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"263407\">@Laurent Bartholdi</span> Thanks very much for going through my course! It is going to become an undergraduate course next year -- this was a trial run. Let me know if you have any comments! </p>\n<p>PS Listing 5.1 is indeed terrifying. I remember reading in Assia's zeta(3) paper about the dangers of creative telescoping (mentioned in 3.6).</p>",
        "id": 234577632,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1618434857
    },
    {
        "content": "<p>Bridges are great, and we should have more of them! A big obstacle is setting things up in a way that you can generate a Lean-only proof certificate from your interaction with the bridge, so that the software at the other end of the bridge isn't required for every recompilation. There's generally a problem that we have no intermediate layer between <code>.lean</code> files and <code>.olean</code> files, where we can cache large automatically generated proof objects.</p>",
        "id": 234592177,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1618442672
    },
    {
        "content": "<p>And besides bridges, there's no particular reason why mathlib can't itself become more like a CAS. This is mostly a matter of writing tactics, in fact. (e.g. it's crazy we don't have <code>expand</code> and <code>factor</code>, or <code>factor_integer</code>, etc. as tactics already). Doing so in an organised, <a href=\"https://github.com/leanprover-community/mathlib/issues/2730#issuecomment-630567298\">principled</a> way would be great, but doing it at all would be even better.</p>",
        "id": 234592260,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1618442749
    },
    {
        "content": "<p>See <a href=\"https://github.com/leanprover-community/mathlib/issues/2730\">#2730</a> for an old discussion in this direction.</p>",
        "id": 234592318,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1618442774
    }
]