[
    {
        "content": "<p>How would you compare automated claim-proving features in Lean with Sledgehammer in Isabelle? Do they aim for something completely different? And are they comparable for practical purposes?</p>",
        "id": 253434757,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1631720167
    },
    {
        "content": "<p>Currently sledgehammer is better than that auto-provers in lean. There are serious plans for a lean-hammer in lean 4 though.</p>",
        "id": 253442105,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1631722600
    },
    {
        "content": "<p>Gabriel Ebner did work on this in Lean 3 a while back. I believe his conclusion was that further work would have to wait for Lean 4 for performance reasons.  The slides are in the description:</p>\n<p><a href=\"https://www.youtube.com/watch?v=WydyJJYKyTs\">https://www.youtube.com/watch?v=WydyJJYKyTs</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"WydyJJYKyTs\" href=\"https://www.youtube.com/watch?v=WydyJJYKyTs\"><img src=\"https://uploads.zulipusercontent.net/d0d54ba88412cce4e1a286884b8d6b88a1ab19fd/68747470733a2f2f692e7974696d672e636f6d2f76692f577964794a4a594b7954732f64656661756c742e6a7067\"></a></div>",
        "id": 253465361,
        "sender_full_name": "Chris B",
        "timestamp": 1631730900
    },
    {
        "content": "<p>Is the following statement right? I want to mention this comparison in my research proposal.</p>\n<p>Sledgehammer combines what Lean can do using <code>simp</code> and <code>library\\_search</code> into one powerful tool. In this regard, Lean lacks behind Isabelle.</p>",
        "id": 265949393,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1640290166
    },
    {
        "content": "<p>This sounds a bit too simplistic, I think the last sentence is correct, but Sledgehammer does more than just simp and library search together by far which is what your first sentence seems to imply without any context</p>",
        "id": 265949601,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1640290335
    },
    {
        "content": "<p>Also, as <a href=\"#narrow/stream/113488-general/topic/where.20does.20lean.20really.20stand.3F/near/265863490\">Kevin said</a>, Lean allows the implementation of tactics in Lean itself. So it doesn't seem to be the case that <em>Lean</em> lacks behind. It's just that we haven't implemented such a tactic yet. Does it make sense?</p>",
        "id": 265950684,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640291292
    },
    {
        "content": "<p>Lean's kernel is very small. Thus, depending on what you call \"Lean\", it may lack a lot of things!</p>",
        "id": 265950884,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640291471
    },
    {
        "content": "<p>By that logic Lean can do anything though, implementing a decent sledgehammer is a huge amount of work, and the Isabelle people have been working on it for over 10 years. The sledgehammer isn't in the kernel of isabelle either so I don't think saying we lack behind is unfair, they really do have a tool we all wish we had</p>",
        "id": 265952049,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1640292422
    },
    {
        "content": "<p>To make it correct, I better say that the Lean's tooling lacks behind Isabelle's tooling, ok?</p>",
        "id": 265952220,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1640292602
    },
    {
        "content": "<p>In this sense, regarding sledgehammer, yes. I might be wrong in my way of thinking, but I do believe that Lean's tooling also has some cards that Isabelle doesn't? It's a bit hard to weigh everything fairly.</p>",
        "id": 265952463,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640292792
    },
    {
        "content": "<p>Maybe just for the sake of safety and compromise with generalizations, be more specific and direct about this particular tool (or other tools) that we don't have yet.</p>",
        "id": 265952834,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1640293112
    }
]