[
    {
        "content": "<p>12:45 PM</p>\n<p>I wish to contribute to the very latest and best version of Lean (proof assistant) but first i need you to send me a complete list of the mathematical theorems and mathematical calculations that the very latest and best version of Lean (proof assistant) can't yet prove or calculate efficiently so that i can teach it how in the most efficient way possible right now. I would appreciate it if you could send me this particular complete list as soon as possible. Thank you for your valuable time and attention and will wait for reply, Alejandro Lombardo</p>",
        "id": 243962892,
        "sender_full_name": "Alejandro Lombardo",
        "timestamp": 1624650927
    },
    {
        "content": "<p>At any finite time, only a finite number of theorems will have been formalized (or even said out loud by some human being).  Since there are countably many theorems that you can formulate, the list that you are looking for will be quite long!</p>\n<p>However, grepping <code>lemma</code> and <code>theorem</code> from the <code>.lean</code> files in mathlib will give you a good idea of what is currently formalized!</p>",
        "id": 243966546,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1624652663
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib_stats.html\">Here</a> you can see that there are just under 57000 theorems proven in mathlib.</p>",
        "id": 243966776,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1624652778
    },
    {
        "content": "<p>Thank you for the insight. Could you please send me the step by step process for accesing lemma and theorem from the .lean files in mathlib as soon as possible? I would appreciate it if you would. Thank you for your valuable time and attention and will wait for reply, Alejandro Lombardo P.S.: Can't wait to start contributing.</p>",
        "id": 243984305,
        "sender_full_name": "Alejandro Lombardo",
        "timestamp": 1624667245
    },
    {
        "content": "<p>You can find the instructions to install Lean on your computer <a href=\"https://leanprover-community.github.io/get_started.html\">here</a>.</p>",
        "id": 243993195,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1624680115
    },
    {
        "content": "<p>Or if you're impatient and want to interact with mathlib immediately, you can use the \"gitpod\" link in the readme to open everything in-browser.</p>",
        "id": 244004531,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1624698705
    }
]