[
    {
        "content": "<p>I am preparing a talk about proof assistants and I am thinking on making the following example as a more or less realistic dream about what proof assistants could be used for in the future, and why this is good for \"standard\" mathematics.</p>\n<p>Computer are better at playing chess than essentially any human being since 20 years (or even more). Let's suppose that in 20 years computer will be better than humans in doing mathematics. Are we all going to be fired? I don't think so:  people still enjoy playing chess very much and are not very interested that they can have a \"chess god\" in their phone. We can now use chess engines to discover, maybe by brute force,  patterns that are essentially impossible to find for a human. But  the players are still interested in understanding why these patterns exist, and are not satisfied by \"white wins because it wins whatever black does\".</p>\n<p>This is very similar to what could happen with mathematics: even if a super Lean will find a proof of the Riemann hypothesis, we will still interested in understand it in human terms, but having a proof, even a very unnatural one, will surely help.</p>\n<p>What do you think about this comparison? I am a very bad chess player, so I am a little worried that I am telling nonsense.</p>",
        "id": 263901864,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638818427
    },
    {
        "content": "<p>I was telling the same to a journalist a couple of hours ago, but this is an argument that is a bit dangerous: it's not clear people will continue paying us if this happen.</p>",
        "id": 263902107,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1638818547
    },
    {
        "content": "<p>But it's not clear  why they are paying us right now, so let's not worry too much.</p>",
        "id": 263902179,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1638818576
    },
    {
        "content": "<p>Where will you talk about this?</p>",
        "id": 263902205,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1638818585
    },
    {
        "content": "<p>On December 15th , in the Luxembourg Number Theory Day (I asked them if they'd prefer a talk about proof assistants or standard number theory and they voted for the former)</p>",
        "id": 263902798,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638818711
    },
    {
        "content": "<p>It's right now the world chess championship, and an interesting trend that I note is that players that don't understand chess as well prefer commentary with the assistance of engines, but higher-rated players tend to prefer without it, and would rather see concrete variations (series of moves) explaining why moves do/don't work. There's still a strong appreciation of \"human\" moves, though, as you say; weird suggestions by computers do often get called \"computer moves\" and dismissed (and this happens at all levels - maybe not so justifiably when I am analysing my own games!)</p>\n<p>But I can sort of see the parallels even with existing work; for example, the McCune's theorem proof that was discussed some time ago (and Bhavik translated into Lean) I think most of us can agree is kind of unsatisfactory, and if it was an area of research that people were interested in, I think there would be further research and attempts for \"natural\" proofs. Meanwhile, the one proof that stands out in my head from the past few years (and to be fair, I'm still not involved in any specific research area, so it may be kind of a \"pop-sci\" answer) was Hao Huang's proof of the sensitivity conjecture, which, to be fair, is still a proof of a major result, but is mostly remembered because of its sheer elegancy. It seems unlikely a computer would find a proof like that, or even if it does present it in such an elegant way.</p>",
        "id": 263904433,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1638819162
    },
    {
        "content": "<p>sorry for my ramble, but tl;dr yes I think it's an apt comparison</p>",
        "id": 263904452,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1638819181
    },
    {
        "content": "<p>I understand that player are not very interested in moves found by computer that are, and probably will remain, impossible find for a human. But I guess that the general understanding of the game is improved thanks to chess engines (especially the endgame). My point is exactly that computer will never replace humans in doing mathematics, but even if they will be able to do \"bad\" proofs, this will help us in finding \"good\" proof.</p>",
        "id": 263905306,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638819364
    },
    {
        "content": "<p>The idea came by seeing a commentator not understanding why Carlsen was winning during game 6 of the championship (when is was very low on time before move 40) <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 263905782,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638819431
    },
    {
        "content": "<p>oh I thought you didn't know about chess! :b yes, I also wonder if there's a comparison to be made between the speed of humans/machines, although I don't think there is many speed maths competitions!</p>",
        "id": 263908240,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1638819860
    },
    {
        "content": "<p>I am just very bad at it :D</p>",
        "id": 263908423,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638819899
    },
    {
        "content": "<p>Computers help humans to play chess now, this is clear. They only help some mathematicians to do mathematics (e.g. people computing tables of elliptic curves etc). There's a chance that all this formalisation stuff will later on help far more mathematicians to do mathematics.</p>",
        "id": 263912644,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1638820764
    },
    {
        "content": "<p>(I recommend the (very) short story\"The evolution of human science\" by Ted Chiang, collected in his anthology \"Stories of your life and others\".)</p>",
        "id": 263932292,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1638828740
    },
    {
        "content": "<p>It was actually published in Nature (and is available online!) under the title <a href=\"https://www.nature.com/articles/35014679\">\"Catching crumbs from the table\"</a>.</p>",
        "id": 263933511,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1638829348
    },
    {
        "content": "<p>Will the talk be in person or online (=can I see it?).</p>",
        "id": 263940513,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1638834019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> Thanks! That was a fun read!</p>",
        "id": 263963475,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1638858377
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"300245\">Filippo A. E. Nuccio</span> <a href=\"#narrow/stream/113488-general/topic/Comparing.20proof.20assistants.20to.20chess.20engines.20for.20a.20talk/near/263940513\">said</a>:</p>\n<blockquote>\n<p>Will the talk be in person or online (=can I see it?).</p>\n</blockquote>\n<p>It will be in person, I don't think they are going to stream it...</p>",
        "id": 263974355,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1638868288
    }
]