[
    {
        "content": "<p>What should I do about the copyright header of a file that I rewrote entirely? It's still about the same thing, but there's virtually nothing in common. Here it is: <a href=\"https://github.com/leanprover-community/mathlib/pull/7987/files#diff-59e4f73ee14640e1411e17ea4b5c962c39ee4b462e1055f0e298755b27629fee\">https://github.com/leanprover-community/mathlib/pull/7987/files#diff-59e4f73ee14640e1411e17ea4b5c962c39ee4b462e1055f0e298755b27629fee</a></p>",
        "id": 253766788,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1631895304
    },
    {
        "content": "<p>Personally, I would just add my name to the author list.</p>",
        "id": 253768118,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1631895888
    },
    {
        "content": "<p>The guidance in the docs is \"the people listed there should be the ones we would reach out to if we had questions about the design or development of the Lean code\".  Legally speaking, this is  very low-stakes.</p>",
        "id": 253768391,
        "sender_full_name": "Chris B",
        "timestamp": 1631895998
    },
    {
        "content": "<p>Yeah... and in that case Scott won't be more knowledgeable than anybody else because virtually nothing of what he did will be left.</p>",
        "id": 253768665,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1631896106
    },
    {
        "content": "<p>I had the impression that Author lists were somewhat monotonous</p>",
        "id": 253769102,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1631896264
    },
    {
        "content": "<p>But I don't have strong feelings about that myself</p>",
        "id": 253769131,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1631896279
    },
    {
        "content": "<p>Personally I have no objection to being removed from author lists when a substantial rewrite has happened, but to avoid treading on toes I think we should err on the side of monotonicity.</p>",
        "id": 253804061,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1631911031
    },
    {
        "content": "<p>I'll let you decide on that one, Scott <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 253804197,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1631911089
    },
    {
        "content": "<p>IMHO removing someone either from the author list or from the copyright header is a bit harsh. I would prefer to only have new authors added to both lists.</p>",
        "id": 254005802,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1632121425
    },
    {
        "content": "<p>Sometimes its the obvious choice when splitting a file in two, and the new piece is the only part of the original that was written by the author in question</p>",
        "id": 254009394,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1632123666
    },
    {
        "content": "<p>Is this considered acceptable? <a href=\"https://github.com/leanprover-community/mathlib/pull/13315/files/56c3894f03edba04ef988e7922b148bcc1eeefda..77defe2449f65cc7a4ff5cbe375cc135284401c6#r860286198\">https://github.com/leanprover-community/mathlib/pull/13315/files/56c3894f03edba04ef988e7922b148bcc1eeefda..77defe2449f65cc7a4ff5cbe375cc135284401c6#r860286198</a></p>",
        "id": 280418955,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1651097934
    },
    {
        "content": "<p>AFAIK, Copyright dates should usually just be the date of earliest copyright, the extension to the present is usually implied. Certainly we don't want to have to be keeping track of the second date in these files</p>",
        "id": 280420005,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651098549
    },
    {
        "content": "<p>And should the authors be in chronological order as well?</p>",
        "id": 280420147,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1651098636
    },
    {
        "content": "<p>Copyright owners or authors?</p>",
        "id": 280420167,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651098660
    },
    {
        "content": "<p>Sorry, copyright owners</p>",
        "id": 280420205,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1651098692
    },
    {
        "content": "<p>Who knows, I don't really think individual copyright makes much sense for mathlib at a file level anyway</p>",
        "id": 280420309,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651098739
    },
    {
        "content": "<p>Stuff moves and changes too often</p>",
        "id": 280420329,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651098756
    },
    {
        "content": "<p>\"Copyright Mathlib contributors\" would be a lot simpler, although making such a change would possibly require contacting every current contributor and asking them to relinquish whatever claim they think the header gives them</p>",
        "id": 280420732,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651099038
    },
    {
        "content": "<p>That list is still relatively small. It might be worth making that kind of change now as opposed to later when it may be much more difficult.</p>",
        "id": 280425546,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1651102268
    },
    {
        "content": "<p>I think some people were just following the standard without much attachment to such claims. To me, git blame is what really counts when it comes down to the idea of ownership and responsibility over a piece of code</p>",
        "id": 280426612,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1651103128
    },
    {
        "content": "<p>My understanding of copyright notices in the United States (and all Berne Convention countries) is that they are optional since authors get automatic copyright for a work. It seems that the only reason to include them still is that copyright notices can apparently be useful in infringement cases since the defendant can't claim they weren't aware of the copyright status. If you do place a notice, you're supposed to use the date of first publication, but each additional edition gets its own copyright date, and these can all be listed. I don't know how that applies to mathlib, since each merged PR could potentially be considered a new edition for the entire work.</p>",
        "id": 280433005,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651107726
    },
    {
        "content": "<p>There's a concept of joint authorship, where all contributing authors are co-owners of a single copyright over the entire work. Presumably mathlib would fall into this category, since everyone who contributes knows their code will eventually be refactored beyond recognition.</p>",
        "id": 280433019,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651107734
    },
    {
        "content": "<p>If mathlib is indeed a joint authorship work, maybe what makes sense is to do what <span class=\"user-mention\" data-user-id=\"310045\">@Eric Wieser</span> suggested and say \"Copyright mathlib contributors\" per file and have a top-level file with the names of everyone who's ever contributed, to define what \"mathlib contributors\" means.  That information might all be in the commit history, but it's not necessarily with full names.</p>",
        "id": 280433105,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651107815
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113488-general/topic/Copyright.20header/near/280420732\">said</a>:</p>\n<blockquote>\n<p>possibly require contacting every current contributor and asking them to relinquish whatever claim they think the header gives them</p>\n</blockquote>\n<p>Given that copyright is automatic (so the header doesn't give any additional rights) and that the risk of litigation has to be <em>very</em> small, this doesn't seem like it's necessary, though if anyone thinks it would be a nice gesture to contact everyone who's ever contributed, then why not. (The standard disclaimer: I'm not a lawyer.)</p>",
        "id": 280434040,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651108572
    },
    {
        "content": "<p>The easiest would be to completely remove copyright headers from individual files, and put a global mention in a readme or similar for the whole project (perhaps mentioning the list of contributors). Copyright headers make (some) sense if there is a possibility that one file gets copy-pasted into some other project, but given the inter-dependencies in mathlib there is little chance that this would occur.</p>\n<p>To add to the whole issue, in some countries (e.g. France) it is just not possible to relinquish one's moral rights on a work ...</p>",
        "id": 280456939,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1651132230
    },
    {
        "content": "<p>I agree! (Without any expertise or insight, however. And I am not actively advocating for any change, just sharing my feelings about it.)</p>\n<p>Listing the <em>authors</em> of a file seems to make sense for various reasons. But for the <em>copyright</em>, it seems natural to have the more global view that it applies to the whole mathlib and is held by the mathlib contributors. The license determining how the content can be used is anyway what it is, and sufficiently permissive.</p>\n<p>(The only hypothetical downside I see in attributing the copyright to all contributors is if there ever would be some situation in which a unanimous agreement of all copyright holders would be needed, in which case it would not be feasible to obtain.)</p>\n<p>Jireh has a point that if there ever is a time when we might want to contact all copyright holders to ask, now is strictly better than any time later. Later there will be more names to contact, and some of their contributions will be further in the past.</p>",
        "id": 280460055,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1651134216
    },
    {
        "content": "<p>Here's a concrete proposal. For all new files in mathlib, we start using this copyright header :</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"c\">/-</span><span class=\"cm\"></span>\n<span class=\"cm\">Copyright (c) 2017-2022 Mathlib contributors. All rights reserved.</span>\n<span class=\"cm\">Released under Apache 2.0 license as described in the file LICENSE.</span>\n<span class=\"cm\">Authors: David Hilbert, Emmy Noether</span>\n<span class=\"cm\">-/</span>\n</code></pre></div>\n<p>The Apache license defines a \"contributor\" as anyone from whom a \"contribution\" has been received. If we want, we can have a NOTICE file (which licensees are required to redistribute when copies or derivative works are made) that includes a list of everyone who has contributed. (<em>Edit:</em> using the NOTICE file like this is probably not a good idea since it's meant to include only legally required notices. A CONTRIBUTORS file would be better.)</p>\n<p>Whenever a file is updated, we can try to remember to bump up the copyright year, but as far as I can tell it doesn't really matter legally.  I figure we should leave the 2017 constant across all files since that's the first edition of mathlib. (As I understand it, the copyright holders of Lean were involved when mathlib was split off from core Lean, so they were able to create a new derivative work with a new copyright -- normally Apache licensees would need to include the original copyright notice.)</p>",
        "id": 280575753,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651195076
    },
    {
        "content": "<p>One function of this copyright header is that it makes it clearer to contributors that its copyright is owned under \"joint authorship\" (which is recognized, but not exactly defined, by the Berne Convention). In the US, someone is considered to be a joint author of a work if (1) they made a copyrightable contribution and (2) all contributors intend for their contributions to be merged into a unitary whole. Note that this is not something that you declare ahead of time: if it comes to it, joint authorship is something established in court.  Apparently joint authors can, without permission of the other authors, individually give out licenses to use the work. But, if we ever wanted to transfer copyright ownership of mathlib to some organization, like a mathlib foundation, we would need unanimous agreement.</p>",
        "id": 280575799,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651195103
    },
    {
        "content": "<p>The Apache license is very silent about how exactly the copyright for mathlib is owned. Certainly everyone who has contributed anything to mathlib has some copyright ownership of at least part of mathlib due to copyright law -- and this is true no matter what the copyright headers may or may not say now or in the future.</p>\n<p>For pre-existing copyright headers, we can switch them out with this new header as we get around to it during refactorings. If we want to be careful, we can check with everyone whose name is listed in a copyright header that they intended their work to be part of a unitary whole and put their names into the CONTRIBUTORS file. It seems implausible to me, though, that there's anyone who somehow contributed code to mathlib and got through the PR process without getting the impression that the point of the library is to be a unitary whole.</p>",
        "id": 280576328,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1651195623
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/Copyright.20header/near/280575799\">said</a>:</p>\n<blockquote>\n<p>One function of this copyright header is that it makes it clear to contributors that its copyright is owned under \"joint authorship\" (which is recognized, but not exactly defined, by the Berne Convention). In the US, someone is considered to be a joint author of a work if (1) they made a copyrightable contribution and (2) all contributors intend for their contributions to be merged into a unitary whole. Note that this is not something that you declare ahead of time: if it comes to it, joint authorship is something established in court.  Apparently joint authors can, without permission of the other authors, individually give out licenses to use the work. But, if we ever wanted to transfer copyright ownership of mathlib to some organization, like a mathlib foundation, we would need unanimous agreement.</p>\n</blockquote>\n<p>I think you're making the (very reasonable) mistake of putting too much faith in a plain-language interpretation of the law; in my opinion mathlib is more likely to constitute a collective work than a work of joint authorship. The case law around joint authorship is pretty complex, and to my knowledge there haven't been any landmark cases about joint authorship for large open source software projects.  <a href=\"https://h2o.law.harvard.edu/cases/2341\">Aalmuhammed v. Lee</a> is still one of the big ones for joint authorship, and I'm pretty confident most mathlib contributors would not satisfy the standard they set out for a finding of joint authorship. The point about not being able to establish joint authorship ahead of time is not correct though, courts have made it pretty clear that a contract will suffice as proof of joint authorship unless there's a finding that the party contributed literally nothing, so if you want to try and force joint authorship you can collect CLAs to that effect, but you probably don't want drive-by contributors to be joint authors.</p>\n<p>IMO if the maintainers are interested in actually securing the copyrights in the US, they should assign them to a single entity and let the entity register the work with the copyright office when there's a major version bump. Under Title 17, you can only pursue a claim if the work has been registered, and if you don't register within three months of publication you lose the ability to recoup statutory damages and attorneys fees.</p>",
        "id": 280579876,
        "sender_full_name": "Chris B",
        "timestamp": 1651199940
    }
]