[
    {
        "content": "<p>We're having a bit of fun in Coq on a pipeline from the <a href=\"https://github.com/hacspec/hacspec/\">hacspec</a> specification language to optimized verified implementations in C, rust, ... using the bedrock/fiat-cryptography libraries in Coq.<br>\n<a href=\"https://cs.au.dk/~spitters/CoqPL22.pdf\">https://cs.au.dk/~spitters/CoqPL22.pdf</a></p>\n<p>hacspec provides backends for F*,Easycrypt and Coq. Lean is missing...</p>",
        "id": 265907444,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1640258242
    },
    {
        "content": "<p>Considering that Lean 4 has its own already rather optimized codegen (that can in some cases be faster and safer than Rust) this seems like an odd project for Lean.. Maybe it might be reasonable for Lean 3, but it seems like a bit of a time sink. Especially since there is the potentially more interesting work of just translating the specific language directly to Lean 4 (and seeing how optimized and verified it could be made with just that).</p>",
        "id": 265909165,
        "sender_full_name": "Mac",
        "timestamp": 1640259831
    },
    {
        "content": "<p>Isn't that what Bas is suggesting? A translation from hacspec language to lean [3/4]</p>",
        "id": 265910063,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640260792
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> Indeed!<br>\n<span class=\"user-mention\" data-user-id=\"315577\">@Mac</span> it would be interesting to see whether lean codegen is competitive with fiat-cryptography for cryptographic primitives.</p>",
        "id": 265925336,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1640272493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"259452\">@Bas Spitters</span> Is there a way to get hacspec in an easily parsed format (say, json or sexprs), or one with a simple (documented!) spec?</p>",
        "id": 265925670,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640272751
    },
    {
        "content": "<p>The Coq backend was added in this PR, something similar should be<br>\npossible for lean, as the coq backend was an adaptation of the F*<br>\nbackend.<br>\n<a href=\"https://github.com/hacspec/hacspec/pull/144\">https://github.com/hacspec/hacspec/pull/144</a></p>",
        "id": 265927218,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1640273939
    },
    {
        "content": "<p>At least with lean 4, it is much easier and more reliable to write an importer than an exporter that produces lean text directly. (I've done this before with lean 3 and there are a lot of drawbacks to producing lean source text without lean guiding the process.) So it would be best to have the hacspec compiler just spit out an AST in some format (preferably json since we already have a good json parsing framework) and then import from there.</p>",
        "id": 265928572,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640274796
    },
    {
        "content": "<p>This is also how the current lean 3 -&gt; lean 4 source-to-source translator works: lean 3 runs and produces AST in a JSON format, and a lean 4 program reads the json, translates to lean 4 data structures and pretty prints it as type correct lean 4 text.</p>",
        "id": 265928705,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640274903
    },
    {
        "content": "<p>Ah, it looks like there is <a href=\"https://github.com/hacspec/hacspec/blob/dbac89ca8832905f020fcaa2da9ea7b78280021b/language/src/main.rs#L153-L175\">already a json exporter</a>. You should really mention that on the list of backends</p>",
        "id": 265929575,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640275465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> Do you have a recommendation for a good entry point on learning how to generate Lean source within Lean?  The haspec translation seems like it could be an interesting project when the underlying Lean 4 libraries for expressive cryptographic primitive operations are more mature.</p>",
        "id": 265933264,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1640278260
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110994\">@Joe Hendrix</span> mathport seems like a good example to follow. The idea is pretty simple: translate <code>Json</code> to <code>HacspecAST</code> to <code>Syntax</code>, then use <code>parenthesize</code> and <code>format</code> on the resulting syntax and print the format.</p>",
        "id": 265954056,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640294143
    },
    {
        "content": "<p>Yes, I think the interesting bits would more be using the result for something interesting such as verifying properties or using verified simplification rules to optimize the specification.  Once there is more sophisticated automation, I may revisit this unless somebody else tries working on it.</p>",
        "id": 265958140,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1640297636
    },
    {
        "content": "<p>An alternative translation which would make sense for lean 4 is to go from <code>HacspecAST</code> to <code>Syntax</code> representing elements of a <code>hacspec</code> syntax category, so that the final result is written in a hacspec internal DSL. That form might be better for proving properties than a shallow embedding</p>",
        "id": 265958394,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640297824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110994\">@Joe Hendrix</span> Nice work here: <a href=\"https://github.com/joehendrix/lean-crypto\">https://github.com/joehendrix/lean-crypto</a><br>\nI see you're looking for specifications. One for AES is available in hacspec already</p>",
        "id": 293279960,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1660398910
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"259452\">@Bas Spitters</span> Thanks for reminding me about this thread.  I was thinking about making an AES spec from Cryptol sources, but it'd probably be interesting to at least experiment with the HASpec to JSON to Lean Syntax route.</p>\n<p>I have a moderately large collection of bit vector and polymorphic vector operations for the Classic Mceliece spec, and I think that they should probably be polished and pulled into their own library (perhaps Mathlib already has many of these also).</p>",
        "id": 293297743,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1660409538
    },
    {
        "content": "<p>There's some interest in connecting hacspec to cryptol.<br>\nSo, this may be an excuse for another push...<br>\n<a href=\"https://hacspec.zulipchat.com/#narrow/stream/271596-crux-mir/topic/Running.20Crux-mir\">https://hacspec.zulipchat.com/#narrow/stream/271596-crux-mir/topic/Running.20Crux-mir</a></p>",
        "id": 293302017,
        "sender_full_name": "Bas Spitters",
        "timestamp": 1660412065
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110994\">@Joe Hendrix</span> our bitvector stuff in mathlib exists but is imo limited in some ways. I would be interested in helping with a project to port your lemmas.</p>",
        "id": 294968378,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1661304214
    }
]