[
    {
        "content": "<p>I'm watching Buchholtz's talk at the CMU conference. From what I've studied about Cubical Type Theory I'm kinda confused.</p>\n<p>1) From topology, a cube is isomorphic to a sphere<br>\n2) a cubical type can be mapped to a sphere where one corner is at the 'north' pole <br>\n3) a cubical type defines maps and their inverses for each corner.<br>\n4) start at the 'north' pole corner, walk a face forward, composing the forward maps.<br>\n5) after traversing one face (4 compositions) you end up at the 'north' pole again<br>\n6) start at the 'north' pole corner, walk a face backward, composing the inverse maps.<br>\n7) after traversing the same face (4 compositions) you end up at the 'north' pole again<br>\n8) so the forward and inverse functions collapse into the identity function on the 'north' pole point.<br>\n9) collapse the face into the identity function<br>\n10) iterate the above for every face<br>\n11) therefore, the cube is just the identity function</p>\n<p>Clearly I'm confused because, in the course I took on Cubical Type Theory, nobody seemed to<br>\nview the cube as collapsing to the identity function. <br>\nWhich step of reasoning is wrong?</p>",
        "id": 184960727,
        "sender_full_name": "Tim Daly",
        "timestamp": 1578347622
    },
    {
        "content": "<p><a href=\"https://ncatlab.org/nlab/show/cubical+type+theory\" target=\"_blank\" title=\"https://ncatlab.org/nlab/show/cubical+type+theory\">Cubical type theory</a> is an extension of Martin Löf Type theory.  It adds more rules which allow one to prove certain things are equal.  It lets you prove the univalence axiom (in a constructive way) in Homotopy type theory.  The name \"cubical\" comes from the concept of \"cubical sets\".  <del>I don't know what you mean by \"Cubical type\" in (2), but I think you are talking about something different.  Cubical Type Theory is also a fairly recent invention, so I don't think you took a course on it, or if you did it was a different subject by the same name.</del></p>",
        "id": 184977640,
        "sender_full_name": "Jason Rute",
        "timestamp": 1578365125
    },
    {
        "content": "<p>Sorry.  I think I was mistaken.  Forget everything I just said.</p>",
        "id": 184978085,
        "sender_full_name": "Jason Rute",
        "timestamp": 1578365861
    },
    {
        "content": "<p>I don't know if this helps, but with a cube, you can collapse (or whatever the correct homotopy term is) all but one of the faces together, but not the final face.  The same goes for a square.  You can collapse all the edges together save for the last one.  Indeed in HoTT, the \"circle\" S^1 is just a point and a loop (so basically a square where three of the four sides are collapsed together), but it is not contractible.  (This sort of thing confused me for a while until I realized that a contraction needs to be uniform/continuous.  There is not a uniform/continuous contraction which takes all points to the \"north pole\" of a cube.)</p>",
        "id": 184979150,
        "sender_full_name": "Jason Rute",
        "timestamp": 1578367636
    },
    {
        "content": "<p>The “cubes” in cubical type theory are solid cubes., so they're geometrically contractible. This is in fact necessary so that cubical sets can model homotopy types. (Cf. solid simplices and simplicial sets.) The main ingredient for both simplices and cubes is that the 1-dimensional object is an interval with which we can model path types. They differ in how they extend to higher-dimensional shapes.</p>",
        "id": 185045324,
        "sender_full_name": "Ulrik Buchholtz",
        "timestamp": 1578425436
    },
    {
        "content": "<p>Ok, I think it is safe to ignore everything I've written in this topic...  <span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span>   Thanks Ulrik for providing actual expert insight.</p>",
        "id": 185057465,
        "sender_full_name": "Jason Rute",
        "timestamp": 1578433013
    }
]