[
    {
        "content": "<p>So, how is the Dagstuhl meeting going on?</p>",
        "id": 132481772,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1534800190
    },
    {
        "content": "<p>The lean group here includes me, Johannes, Floris and Scott Morrison</p>",
        "id": 132485203,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1534804605
    },
    {
        "content": "<p>Great team! What are you up to?</p>",
        "id": 132486511,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1534806288
    },
    {
        "content": "<p>My Dagstuhl demo is online at &lt;<a href=\"https://www.youtube.com/watch?v=U_22O1O9nGc\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=U_22O1O9nGc\">https://www.youtube.com/watch?v=U_22O1O9nGc</a>&gt;.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"U_22O1O9nGc\" href=\"https://www.youtube.com/watch?v=U_22O1O9nGc\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=U_22O1O9nGc\"><img src=\"https://i.ytimg.com/vi/U_22O1O9nGc/default.jpg\"></a></div>",
        "id": 132629103,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535019117
    },
    {
        "content": "<p>People were quiet impressed by the  graph visualization. And also by the <strong>short</strong> formalization of Yoneda itself :-)</p>",
        "id": 132633173,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1535025422
    },
    {
        "content": "<p>Awesome! Well done Scott!</p>",
        "id": 132640902,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1535034722
    },
    {
        "content": "<p>Indeed it was very impressive and fun to watch.</p>",
        "id": 132640978,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1535034810
    },
    {
        "content": "<p>What does Scott say at around 1 minute 50 -- his goal was \"to be able to report back to my collegues in the math department about whether it's time something something something theorem provers\"?</p>",
        "id": 132651002,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535046119
    },
    {
        "content": "<p>I think it's \"they should start paying attention to interactive theroem provers\"</p>",
        "id": 132651180,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1535046267
    },
    {
        "content": "<p>Thanks Kevin. I planned to spend all week-end listening to this video to get used to Scott's accent before he comes to Orsay. But maybe I don't need to if you also struggled.</p>",
        "id": 132653276,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1535048641
    },
    {
        "content": "<p>It was more the fact that Scott was quite a way from his laptop mic when he said it :-) I guess I agree with him that there's no point telling the staff to pay attention, that's why I'm telling the students.</p>",
        "id": 132656462,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535052990
    },
    {
        "content": "<p>I also noticed that it got easier when listening on my computer instead of my phone with crappy internet.</p>",
        "id": 132660198,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1535057710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>: You must have impressed the right people (in Germany no less!) if you're about to become the next prime minister of Australia.</p>",
        "id": 132678601,
        "sender_full_name": "Sean Leather",
        "timestamp": 1535090169
    },
    {
        "content": "<p>Indeed I'm slightly worried about whether he'll make it to Paris next week...</p>",
        "id": 132681837,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535096218
    },
    {
        "content": "<p>Okay --- one more report from Dagstuhl, as formal abstracts is being discussed after <span class=\"user-mention\" data-user-id=\"111080\">@Floris van Doorn</span>'s presentation.</p>",
        "id": 132685187,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535101004
    },
    {
        "content": "<p>After someone asked whether results will be tagged as to whether or not they were constructive, I had to bite my tongue to avoid saying this this meeting was the first time I had met in person someone with a job in a mathematics department who did constructive mathematics.</p>",
        "id": 132685210,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535101074
    },
    {
        "content": "<p>(That would have been a slight lie; I think it's the second time.)</p>",
        "id": 132685254,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535101087
    },
    {
        "content": "<p>My impression is that computer scientists have a largely incorrect view about how much constructive mathematics goes on within a mathematics department. My impression is that most people that work in maths departments would have real trouble even stating what it means for a result to be constructive and giving basic examples of mathematics which is or is not constructive. If people in maths departments are doing constructive mathematics, my gut feeling is that they are doing it by accident.</p>",
        "id": 132685593,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535101617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>: Do logicians <em>count</em> in the set of people working in mathematics departments?</p>\n<ul>\n<li><a href=\"https://www.math.su.se/english/research/2.19150/logic-group/logic-group-1.70775\" target=\"_blank\" title=\"https://www.math.su.se/english/research/2.19150/logic-group/logic-group-1.70775\">https://www.math.su.se/english/research/2.19150/logic-group/logic-group-1.70775</a></li>\n<li><a href=\"http://www.maths.manchester.ac.uk/our-research/research-groups/mathematical-logic/\" target=\"_blank\" title=\"http://www.maths.manchester.ac.uk/our-research/research-groups/mathematical-logic/\">http://www.maths.manchester.ac.uk/our-research/research-groups/mathematical-logic/</a></li>\n<li><a href=\"https://math.nd.edu/research/research-groups-in-mathematics/logic/\" target=\"_blank\" title=\"https://math.nd.edu/research/research-groups-in-mathematics/logic/\">https://math.nd.edu/research/research-groups-in-mathematics/logic/</a></li>\n<li><a href=\"http://logic.berkeley.edu/\" target=\"_blank\" title=\"http://logic.berkeley.edu/\">http://logic.berkeley.edu/</a></li>\n<li><a href=\"http://www.math.wisc.edu/~lempp/main.html#other\" target=\"_blank\" title=\"http://www.math.wisc.edu/~lempp/main.html#other\">http://www.math.wisc.edu/~lempp/main.html#other</a></li>\n</ul>",
        "id": 132686199,
        "sender_full_name": "Sean Leather",
        "timestamp": 1535102398
    },
    {
        "content": "<p>Sure! I think they count. Kevin is wrong in the sense that most logicians can explain what constructive mathematics is. But I don't recall talking to any logicians who actually did it.</p>",
        "id": 132686690,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535103047
    },
    {
        "content": "<p>The number of logicians in most maths departments in the UK is 0</p>",
        "id": 132687652,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535104415
    },
    {
        "content": "<p>At my university it was 0 for over 20 years but we just hired two recently.</p>",
        "id": 132687700,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535104451
    },
    {
        "content": "<p>as to whether they count -- sure they count, if they're working in a maths department. But perhaps it's also worth noting that even within the maths departments I've worked in, the logicians feel like a separate group to the rest of the researchers; Berkeley was a great example, where the logicians occupied a different floor to the other pure mathematicians and I think that in my 2 years there I didn't ever bump into any. On the other hand I had plenty of mathematical interactions with geometers, topologists and algebraists when I was there (I'm a number theorist). I very much felt with the logicians that it was a case of \"they don't know anything about what we do, and we don't really care what they're doing, for the most part\". Logicians have always felt very much like the outsiders in mathematics departments I've worked in. Of course this is just my personal impression.</p>",
        "id": 132687739,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535104541
    },
    {
        "content": "<blockquote>\n<p>Scott Morrison: You must have impressed the right people (in Germany no less!) if you're about to become the next prime minister of Australia.</p>\n</blockquote>\n<p>It seems hiding in the most remote place at the other end of the world was a good strategy: all his colleagues fought among themselves, and Scott was the last one standing (at least this how it looks like in French newspapers).</p>",
        "id": 132688388,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1535105461
    },
    {
        "content": "<p>It's true the only maths department I've been in with logicians was Berkeley. There I had some contact with them, but solely with the graduate students, essentially through the non-mathematical social life of the department.</p>",
        "id": 132691454,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1535110332
    },
    {
        "content": "<p>This has all been very enlightening. I'm rather ignorant of what goes on in mathematics departments. This wasn't something we covered in any of my computer engineering, electrical engineering, or computer science courses or research.</p>\n<blockquote>\n<p>My impression is that computer scientists have a largely incorrect view about how much constructive mathematics goes on within a mathematics department.</p>\n</blockquote>\n<p>My personal experience suggests that this is largely overstating the views of computer scientists. I'd guess that most of them actually do not know or care much about constructivism or whether it is used by mathematicians. It's a rather small group of computer scientists who actually use it in research, and they're vastly outnumbered by computer scientists working in other areas.</p>",
        "id": 132692095,
        "sender_full_name": "Sean Leather",
        "timestamp": 1535111312
    },
    {
        "content": "<p>The research that goes on in maths departments (in the UK at least) is 99% classical logic being used to study what we call algebra, number theory, geometry, topology, analysis (and in the UK maybe some combinatorics), although these are pretty broad terms and what they mean changes all the time. Most of the people doing this have no idea what the law of the excluded middle or constructive maths is. You're right that the computer scientists I'm talking about are the ones I've met here though, which I'm sure is not at all a representative sample. Moreover, these mathematicians I'm talking about for the most part have no idea that things like Coq exist, either that or they do know but don't care.</p>",
        "id": 132692558,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535112081
    },
    {
        "content": "<p>Did anyone give Neil Strickland a pointer to Zulip?</p>",
        "id": 133252039,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1535969879
    },
    {
        "content": "<p>\"You are absolutely welcome to come and hang out with us any time at the Zulip chat. We're going to have perfectoid spaces soon\". From my sent-mail.</p>",
        "id": 133252096,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1535969973
    }
]