[
    {
        "content": "<p>After the discussion in the topic \"type classes for data structures\", I decided to try coding up some priority queues from Okasaki's Purely Functional Data Structures.  There isn't much there, but I thought I'd share it.  The README has some discussion on what I found. <a href=\"https://github.com/jasonrute/lean_data_structures\" target=\"_blank\" title=\"https://github.com/jasonrute/lean_data_structures\">https://github.com/jasonrute/lean_data_structures</a></p>",
        "id": 179097175,
        "sender_full_name": "Jason Rute",
        "timestamp": 1572045625
    },
    {
        "content": "<p>Thanks @Jason! Keeley and I are likely to want to use some priority queues in <code>meta</code> land soon, so it would be lovely to have some of this in mathlib, perhaps even with an API so we're not committed to a particular implementation.</p>",
        "id": 179098126,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1572046829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> What do you mean by an API? Do you mean using type classes for polymorphism?</p>",
        "id": 179103341,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1572054187
    },
    {
        "content": "<p>Yes.</p>",
        "id": 179103342,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1572054197
    },
    {
        "content": "<p>That's not a very convenient approach. You end up with overly long type classes which are not all that useful. A better approach is just to use the same name for functions and lemmas when reimplementing the data structure.</p>",
        "id": 179103454,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1572054382
    },
    {
        "content": "<p>Okay!</p>",
        "id": 179105577,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1572058278
    },
    {
        "content": "<p>By the way, with the splay tree data structure, we're cooking up an extension to lazy evaluation that uses dependent types and quotient types that allows functions <em>reading</em> the data structure to mutate it without returning a new copy. That should help make functional data structures, especially the ones with amortized complexity, significantly faster.</p>",
        "id": 179105806,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1572058752
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> That is interesting.  Do you know if is similar to the various lazy heap ideas in Okasaki's book (or thesis)?  That book (which I have just skimmed) has a lot to say about laziness and where it shines and slows things down in practice in functional data structures.</p>",
        "id": 179109673,
        "sender_full_name": "Jason Rute",
        "timestamp": 1572066112
    },
    {
        "content": "<p>For example it says this about one of it's lazy heap implementations:</p>\n<blockquote>\n<p>Hint to Practitioners: Although it now deals gracefully with persistence, this implementation of pairing heaps is relatively slow in practice because of overheads associated with lazy evaluation. It shines, however, under heavily persistent usage, where we reap maximum benefit from memoization. It is also competitive in lazy languages, where all data structures pay the over- heads of lazy evaluation regardless of whether they actually gain any benefit.</p>\n</blockquote>",
        "id": 179109797,
        "sender_full_name": "Jason Rute",
        "timestamp": 1572066274
    },
    {
        "content": "<p>I once planned to formalize Okasaki's book, but I hit a roadblock with laziness, because lean provides no way to implement memoization</p>",
        "id": 179109814,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1572066350
    },
    {
        "content": "<p>The idea is to add a mechanism expressive enough to allow the implementation of laziness and memoization. Because we have dependent types, we can go further than memoization. We can, for instance, rebalance trees or shuffle items around just like a Haskell program would evaluate and cache the value of a thunk.</p>",
        "id": 179110480,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1572067813
    }
]