[
    {
        "content": "<p>Freek Wiedijk writes about the <a href=\"http://www.cs.ru.nl/~freek/factor/\" title=\"http://www.cs.ru.nl/~freek/factor/\">de Bruijn factor</a> of a formalisation; he gives a reasonable-looking definition but one could also try things such as \"number of lines of code in textbook v number of lines of code in formalisation\". The problem with measuring it, though, is that a formalisation of something a la mathlib might contain a whole bunch of solid API stuff which is not mentioned in the books, or a formalisation might borrow from several print sources. Note also that \"Lean's de Bruijn factor\" may not even make sense; it might well be different for different branches of mathematics.</p>\n<p>I'm writing an article and I'd like to mention this concept, but currently I'm at a bit of a loss as to what I can say about it; is there any way that some kind of approximation of a de Bruijn factor for Lean can be measured?</p>",
        "id": 194810851,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1587479856
    },
    {
        "content": "<p>You should generally not count API stuff as part of the de Bruijn factor unless it is also part of the informal text</p>",
        "id": 194813462,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1587480833
    },
    {
        "content": "<p>It's usually rare to have a direct comparison just happen by accident. You can easily make synthetic benchmarks by proving self contained theorems though</p>",
        "id": 194813617,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1587480890
    },
    {
        "content": "<p>and yes, significant variance is expected. This number depends on a myriad of factors</p>",
        "id": 194813939,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1587481008
    },
    {
        "content": "<p>Out of curiosity I just did it for the sensitivity proof. <code>proof.tex.gz</code> (<a href=\"https://github.com/leanprover-community/lean-sensitivity/blob/lean-3.4.2/tex/proof.tex\" title=\"https://github.com/leanprover-community/lean-sensitivity/blob/lean-3.4.2/tex/proof.tex\">see here</a>) is 1159 bytes and <code>sensitivity.lean.gz</code> (<a href=\"https://github.com/leanprover-community/mathlib/blob/master/archive/sensitivity.lean\" title=\"https://github.com/leanprover-community/mathlib/blob/master/archive/sensitivity.lean\">see here</a>) is 5931 bytes for a de Bruijn factor of 5.12. If I strip out the comments from <code>sensitivity.lean</code> (in a not too careful fashion) then <code>sensitivity_stripped.lean.gz</code>  is 3960 bytes for a de Bruijn factor of 3.42.</p>",
        "id": 194815475,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1587481538
    },
    {
        "content": "<p>Ha, that's a nice test case.</p>",
        "id": 194818184,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1587482515
    }
]