[
    {
        "content": "<p>Currently, the variance is defined as the integral <code>𝔼[(X - 𝔼[X])^2]</code> so in particular the variance of <code>X</code> is defined to be 0 if <code>X</code> is not L². I think it might be better to define variance as a <code>lintegral</code> instead since then the variance of <code>X</code> would be infinity if <code>X</code> is not L². If this were the case, Chebyshev's inequality would remain to hold for L¹ functions . </p>\n<p>I came across this while looking at the proof of the WLLN which should hold for L¹ functions but as a result of the above, I can't use the current Chebyshev's inequality directly for it.</p>",
        "id": 301197303,
        "sender_full_name": "Jason KY.",
        "timestamp": 1664359972
    },
    {
        "content": "<p>It might be annoying to have <code>variance</code> take values in <code>ennreal</code>... <br>\nMy thought would be: try to change it to be <code>ennreal</code> valued, and if it turns out to make certain arguments harder, then we should consider having both definitions side-by-side.<br>\nBut that said, I've hardly used the probability theory part of mathlib, so let's also wait for others to chime in.</p>",
        "id": 301198412,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1664360405
    },
    {
        "content": "<p>For Chebyshev's inequality, the RHS has a<code>ennreal.of_real</code>so at least for Chebyshev's inequality it seems natural to define variance to take value in <code>ennreal</code>. Though I can certainly imagine cases where <code>ennreal</code> is annoying...</p>",
        "id": 301201362,
        "sender_full_name": "Jason KY.",
        "timestamp": 1664361533
    },
    {
        "content": "<p>In probability theory, one uses the variance all the time as a real number (and one only uses it for functions in L^2), so I think it is important that the main definition is a real number. If you find uses for the ennreal-valued version, you can introduce it as <code>evariance</code> or something, of course!</p>",
        "id": 301211534,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1664365635
    },
    {
        "content": "<p>Would it be reasonable to redefine variance as the <code>ennreal.to_real</code> of some<code>evariance</code> defined using a lintegral?</p>",
        "id": 301226995,
        "sender_full_name": "Jason KY.",
        "timestamp": 1664368957
    },
    {
        "content": "<p>If most useful lemmas remain true, it shouldn't do any harm!</p>",
        "id": 301232228,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1664370570
    }
]