[
    {
        "content": "<p>It's not completed yet, but I am incrementally adding documentation to undocumented parts of the lean source code. Would there be any interest in PRing this into the Lean 3 source eventually? Obviously someone would have to go over my changes and make sure that the comments are not wrong/ misleading etc. <a href=\"https://github.com/EdAyers/lean/tree/docstrings\" target=\"_blank\" title=\"https://github.com/EdAyers/lean/tree/docstrings\">https://github.com/EdAyers/lean/tree/docstrings</a></p>",
        "id": 136609124,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1540650099
    },
    {
        "content": "<p>I guess nobody is going to be accepting any PRs to Lean source code any time soon, and perhaps any time ever.</p>",
        "id": 136610180,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1540652051
    },
    {
        "content": "<p>Yeah I don't want to spend a lot of time on it in case they release Lean 4.</p>",
        "id": 136610191,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1540652107
    },
    {
        "content": "<p>I've been wondering whether the mathlib community should manage its own continuation of Lean 3.x in the meantime, because it seems like there are a number of low-impact improvements that would be worthwhile, and waiting for Lean 4 is a big unknown both in terms of schedule and how difficult porting will be, so otherwise mathlib's Lean could be stagnant for quite a while</p>",
        "id": 136614950,
        "sender_full_name": "Scott Olson",
        "timestamp": 1540660465
    },
    {
        "content": "<p>The disadvantage with such a \"fork\" is that it would bring all sorts of social implications and management issues with it. Your aren't just forking code, you will also need to make a whole bunch of users aware of the fact that latest mathlib won't compile on their vanilla Lean 3.4.1, and so you need to think about whether you want to include pointers all over the place that there is now <code>Lean'</code> or something.<br>\nI'm not in a position to see through all the ramifications and weigh the pros and cons.</p>",
        "id": 136615904,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1540662512
    },
    {
        "content": "<p>I was initially pro-fork, and I think that since development has effectively stopped permanently on 3.x I think the problems associated with forking are greatly lessened. It will be a big change regardless when lean 4 comes around - Leo is essentially working on his own fork already</p>",
        "id": 136615973,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1540662676
    },
    {
        "content": "<p>Well, I guess it doesn't hurt to list the pros and cons.<br>\nThe first big pro would be liberating the core library.<br>\nI know that <span class=\"user-mention\" data-user-id=\"110111\">@Keeley Hoek</span> and <span class=\"user-mention\" data-user-id=\"121918\">@Edward Ayers</span> have their private forks. These probably contain some useful patches.<br>\nAnother pro would be that we can proactively work on caching. Although this is of course very non-trivial.</p>",
        "id": 136616320,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1540663284
    },
    {
        "content": "<p>I think elan could be a big help with dealing with a new version pretty transparently, even if it has to be downloaded from a different location than the official releases</p>",
        "id": 136616557,
        "sender_full_name": "Scott Olson",
        "timestamp": 1540663689
    },
    {
        "content": "<p>One reason that I am so pro-actively trying to get mathematicians involved is that there is so so much more mathematics that can be done with Lean 3. I know some people are excitedly waiting for Lean 4 for CS reasons but I am quite happy with Lean 3.4.1.</p>",
        "id": 136617149,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1540664790
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> Right. But would you be happier with Lean-prime 3.4.1?</p>",
        "id": 136617461,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1540665468
    },
    {
        "content": "<p>One problem with forking is that we don't know whether any of the bug fixes or whatever will have appropriate analogues in Lean 4</p>",
        "id": 136617930,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1540666342
    },
    {
        "content": "<p>If we were to make a fork, I think it shouldn't accept anything that will take substantial effort to reimplement in Lean 4. (That would be inviting people to waste their time.)</p>",
        "id": 136620888,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1540671600
    },
    {
        "content": "<p>But fixing <code>leanpkg</code>, adding docstrings to <code>expr</code> and elsewhere, both sounds like great reasons.</p>",
        "id": 136620940,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1540671618
    },
    {
        "content": "<p>If you're using <code>elan</code>, it's completely trivial to specify that you want to use a forked version of <code>lean</code>. (e.g. Keeley and I do this all the time)</p>",
        "id": 136620953,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1540671678
    },
    {
        "content": "<p>I've just merged the two recent PRs to leanprover/lean and will release 3.4.2 when there are no more outstanding changes. If someone wants to implement tracking branches in leanpkg, I'll review and merge that, too.</p>",
        "id": 136621958,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1540673700
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"110111\">@Keeley Hoek</span>, have you already done this in your fork? (Allowing <code>leanpkg</code> to track a specified branch of a repo.) I know we talked about this at some point, but can't remember if it's something you've already done.</p>",
        "id": 136622496,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1540674810
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>, unfortunately for the life of me I've never really figured out what the problem with the branch tracking was. As far as I have been able to tell on my own computer, replacing a revision SHA1 with a branch name instead works, and <code>leanpkg upgrade</code> fetches a new copy of that branch properly (instead of reverting back to the SHA1 at the top of  <code>master</code>, or <code>lean-3.4.1</code>, or whatever).</p>\n<p>I guess this is a bit crude though---was the problem that we wanted to be able to type specific SHA1s and have <code>leanpkg upgrade</code> walk up that commit to the top of a branch or something? I think the obvious problem there is that the same commit can be a part of multiple branches. We could have some <code>rev = \"branch:SHA1\"</code> syntax for that too keep track, though. I have not implemented this last thing (at some point I went away to do the first thing, but then realised it seemed like it already worked).</p>",
        "id": 136634305,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1540697772
    },
    {
        "content": "<p>I am sitting on a small patch which drops the <code>leanpkg</code> requirement for <code>coreutils</code>, though. Makes it work on windows without git bash (I suppose you still need <code>git</code> in your path).</p>",
        "id": 136634354,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1540697904
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110111\">@Keeley Hoek</span> Putting anything but a commit hash in <code>rev</code> is a no-go and should ideally not even be accepted by leanpkg. You lose all reproducibility with that. Instead there should be a new key <code>branch</code> that is used for <code>leanpkg upgrade</code>.</p>",
        "id": 136645288,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1540720425
    },
    {
        "content": "<blockquote>\n<p>If someone wants to implement tracking branches in leanpkg, I'll review and merge that, too.</p>\n</blockquote>\n<p>No takers? Anything else that should be part of 3.4.2?</p>",
        "id": 147290881,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1541673943
    },
    {
        "content": "<p>I can't do it this week. :(</p>",
        "id": 147291696,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541674946
    },
    {
        "content": "<p>Would you do it next week? I guess Sebastian could wait one more week.</p>",
        "id": 147292396,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1541675861
    },
    {
        "content": "<p>I can promise to do it over the weekend</p>",
        "id": 147293498,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541677392
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> Maybe this is unrealistic, but I would hope it isn't too hard. It would be very helpful if Lean could expose the current namespace and active <code>variables</code> and <code>include</code>s. Whether this is exposed via a message/trace/set_option/#print I wouldn't really care. As long as we can get hold of that information. Is this possible?</p>",
        "id": 147350080,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1541737594
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span> filed at <a href=\"https://github.com/leanprover/lean/pull/1981\" target=\"_blank\" title=\"https://github.com/leanprover/lean/pull/1981\">https://github.com/leanprover/lean/pull/1981</a><br>\nPlease let me know if you'd like anything changed---I'll be speedy!</p>",
        "id": 147503284,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541994102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>, based on my previous experimentation it is possible to write a command in vanilla Lean which gets the current namespace, and I think I know a way to do that with <code>include</code>s as well (i.e. this is implementable as a <code>#whereami</code> command or something). The same tricks won't work for <code>variables</code> I don't think.</p>",
        "id": 147503373,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541994259
    },
    {
        "content": "<p>Actually, I can think of a super hacky way to do it with variables as well, if they have ever been used already in the current <code>namespace</code>/<code>section</code>.</p>",
        "id": 147503378,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541994289
    },
    {
        "content": "<p>I'd need an afternoon to remember how to use the code I wrote which does this</p>",
        "id": 147503387,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1541994317
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110111\">@Keeley Hoek</span> That sounds good and would be very helpful!</p>",
        "id": 147507218,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542001989
    },
    {
        "content": "<p>Sure, but I'm going to have to do it early next week unless I'm lucky I think</p>",
        "id": 147511031,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1542009377
    }
]