[
    {
        "content": "<p>We're in VU talking about documentation. Here's a gist containing a preliminary documentation attempt for <code>group_theory/quotient_group</code>.</p>\n<p><a href=\"https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d\" target=\"_blank\" title=\"https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d\">https://gist.github.com/kbuzzard/0b5a31f5a362cb32d787bc5059ed4b9d</a></p>",
        "id": 170636494,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1562854391
    },
    {
        "content": "<p>I think the summaries at the top are useful. On the other hand, I feel like many of the docstrings don't add too much value. Their content can usually be inferred from the name of the declaration, can't it?</p>",
        "id": 170644897,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1562859499
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> mostly formatting nitpicks, in the summary at the top there is some expressions not wrapped in e.g. φ : G → H, where in the docstrings below the same expression wrapped in <code>φ : G → H</code>.  The main thing of note is that in the first case G and H are going to possibly end up using different fonts for G and H.</p>\n<p>The only other thought deals with the References section in the summary, I don't believe i have implemented it yet, but in lumpy it shouldn't be too difficult to enable the <a href=\"https://github.com/raphlinus/pulldown-cmark/blob/master/specs/footnotes.txt\" target=\"_blank\" title=\"https://github.com/raphlinus/pulldown-cmark/blob/master/specs/footnotes.txt\">footnotes</a> extension, I'd probably do so by changing the comment_format field to comment_format = \"cmark+footnotes\" or comment_format=[\"cmark\", \"footnotes\"].  It is a simple addition to implement.  The main issue being deciding on whether we should accept the format, and diverse tooling issues e.g. would vscode tooltip's handle it gracefully?</p>",
        "id": 170840748,
        "sender_full_name": "matt rice",
        "timestamp": 1563123799
    }
]