[
    {
        "content": "<p>In VS Code I sometimes get a red rectangle, typically after I've written something with a syntax error. This is not the same as a red underline -- it's a full red background on one or more characters. The only way I can get rid of it is to mash the keyboard creating an error on the pane on the Lean messages pane on the right, and then to hover over the red writing in that pane explaining the error message. I've been doing this for a month or so; VS Code used to do this back in 2017 but I've not seen the behaviour for ages until recently.</p>",
        "id": 163319685,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555252441
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/JZtRmHg_Bw03Wgk2obpGF4mj/red_rectangle.png\" target=\"_blank\" title=\"red_rectangle.png\">red_rectangle.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/JZtRmHg_Bw03Wgk2obpGF4mj/red_rectangle.png\" target=\"_blank\" title=\"red_rectangle.png\"><img src=\"/user_uploads/3121/JZtRmHg_Bw03Wgk2obpGF4mj/red_rectangle.png\"></a></div>",
        "id": 163319882,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555252684
    },
    {
        "content": "<p>A few months back I fixed the old code in the extension that shows these red rectangles. They're only supposed to appear when you're hovering over a message (error, warning, or info) in the info view panel though, so something is clearly broken. Do you know what else might be triggering them?</p>",
        "id": 163323853,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1555259352
    },
    {
        "content": "<p>They appear randomly and it's hard to reproduce.</p>",
        "id": 163327309,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555265247
    },
    {
        "content": "<p>OK, I think I've found the bug. To reproduce, you have to type something which creates an error message in the info view exactly underneath your mouse cursor, and then edit the code so that the message goes away before you move your mouse away from that spot. The extension doesn't properly clean up the hover decoration and so it gets stuck. Thanks for reporting this! I'll try to PR a fix soon.</p>\n<p>edit: <a href=\"https://github.com/leanprover/vscode-lean/pull/119\" target=\"_blank\" title=\"https://github.com/leanprover/vscode-lean/pull/119\">Here it is</a></p>",
        "id": 163328032,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1555266390
    },
    {
        "content": "<p>Good detective work! Thanks!</p>",
        "id": 163328062,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555266450
    },
    {
        "content": "<p>Oh, fixing this would be great! My students see it all the time. I usually switch to another file and switch back. I never suspected this was a vscode-lean bug, I thought this was VScode alone</p>",
        "id": 163330207,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1555269755
    }
]