[
    {
        "content": "<p>So usually when I write a half-decent attempt at a module docstring, I have a go with the <code>'</code>s and the <code>$$</code>s and mixing unicode and TeX, but I occasionally get it wrong, and then when I make the PR Bryan comes along within an hour and tidies up all the typesetting errors I've made. How is Bryan doing this? Is there a way for me to take a local lean file and view the corresponding module docstring in a browser as it would be displayed in the API documentation (a module docstring documents an entire <code>.lean</code> file , right?) I would be a better module docstring writer if I knew how to do this.</p>\n<p>In fact I probably think it's worth saying at this point how brilliant <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> is. I've never even met him, but every PR I make he goes straight in there and fixes up little slips I've made like an incorrectly formatted commit name or a docstring markup mess -- he's training me to be a better PR maker and hence less trouble to the maintainers (he also taught me about correct use of tags).</p>",
        "id": 220792416,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1608733247
    },
    {
        "content": "<p>The unpleasant answer is \"just run <code>doc-gen</code> locally\", but that takes forever to generate the export data and I don't actually recommend it.</p>",
        "id": 220793381,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1608733978
    },
    {
        "content": "<p>The pleasant answer is: use <a href=\"https://observablehq.com/@bryangingechen/github-lean-doc-preview\">https://observablehq.com/@bryangingechen/github-lean-doc-preview</a> (give a PR number, and it will show you the rendered docstrings)</p>",
        "id": 220793847,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1608734308
    },
    {
        "content": "<p>we should have a zulip linkifier for this</p>",
        "id": 220794626,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608734787
    },
    {
        "content": "<p>something like <a href=\"https://github.com/leanprover-community/docpreview/issues/1234\">docpreview#1234</a></p>",
        "id": 220794663,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608734815
    },
    {
        "content": "<p>I don't know if the preview accepts the PR number as part of the url, and in any case, Zulip's linkifier complains about the @ in the url. So for now, <del>#docpreview</del> one sec</p>",
        "id": 220799068,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1608737846
    },
    {
        "content": "<p><a href=\"https://tinyurl.com/ydeyffff/\">#docpreview</a></p>",
        "id": 220799179,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1608737934
    },
    {
        "content": "<p>thanks Rob!</p>",
        "id": 220799226,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608737986
    },
    {
        "content": "<p>Thanks Kevin!  I'm glad the previewer is still useful. I haven't been advertising it much lately, but I do find it helpful previewing the output of docstrings and module docs. Note that there can be differences with what actually shows up in the final rendered docs, either due to weird parsing hacks I resorted to or due to <code>markdown2</code> limitations on the <code>doc-gen</code> side.</p>",
        "id": 220830756,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1608760459
    }
]