[
    {
        "content": "<p>I installed Lean on a Mac and went through the instructions given on the community page. When I opened a newly-created .lean file, emacs complained that</p>\n<p>(error Lean was not found in the ’exec-path’ and ’lean-rootdir’ is not defined. Please set it via M-x customize-variable RET lean-rootdir RET.)</p>\n<p>Unfortunately, I have no idea what to set lean-rootdir to. Any pointers? It appears that Lean will not work as intended unless I resolve this.</p>",
        "id": 261071889,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636587265
    },
    {
        "content": "<p>Have you used <code>leanproject</code> to create a new project? If you don't have a directory containing a leanpkg.toml file, then go back and follow the part of the instructions explaining how to do that. If you do have such a directory, that is the directory you want to open.</p>",
        "id": 261072901,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636587925
    },
    {
        "content": "<p>(I don't use emacs, so I'm not sure exactly how to translate \"open the directory\", which is what you'd say for VSCode.)</p>",
        "id": 261073013,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636587989
    },
    {
        "content": "<p>Ah, I hadn't gotten to the <code>leanproject</code> part of the instructions yet, thanks<br>\nBut then a new problem pops up: apparently leanproject isn't defined yet? The same page suggests <code>source ~/.profile</code> and <code>source ~/bash.profile</code>, I tried both it doesn't work</p>",
        "id": 261074992,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636589354
    },
    {
        "content": "<p>Should have put in the effort to convert to a Linux distro, would have been much simpler :|</p>",
        "id": 261075106,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636589419
    },
    {
        "content": "<p>Also Mac is now using <code>zsh</code> instead of <code>bash</code>, that should affect the file name but I can't find the equivalent profile file.</p>",
        "id": 261075196,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636589495
    },
    {
        "content": "<p>Might have found the problem—looking at the logs, Homebrew hit an error after installing elan and so mathlibtools was never installed. Will update to confirm.</p>",
        "id": 261076072,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636590146
    },
    {
        "content": "<p>OK I'm up and running now; thanks for the help!</p>",
        "id": 261076666,
        "sender_full_name": "Daniel Choi",
        "timestamp": 1636590559
    },
    {
        "content": "<p>Great, thanks!</p>",
        "id": 261081870,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1636594502
    }
]