[
    {
        "content": "<p>Hello! Sorry if this is the wrong stream to post this question but I'm new to Zulip and Lean.<br>\nRight now I'm getting into Lean and trying to define my own booleans and their operators, then show theorems about it. <br>\nIn <em>Functional Programming in Lean</em> <a href=\"https://leanprover.github.io/functional_programming_in_lean/getting-to-know/datatypes-and-patterns.html\">section 1.5</a> they show a definition for <code>Bool</code> using the pattern <code>inductive Bool where...</code>.<br>\nI tried defining <code>Bool</code> like that in <a href=\"https://leanprover.github.io/live/latest\">Lean Live</a> but I get the error <code>invalid binder declaration, delimiter/bracket expected (i.e., '(', '{', '[', '{{')</code>. <br>\nWhat did I do wrong? How do I fix this?<br>\nI tried changing the words <code>Bool</code> to <code>Cool</code>, <code>true</code> to <code>crue</code> etc as to avoid any sort of conflict with some standard <code>Bool</code>, but the error persists.<br>\nThanks in advance.</p>",
        "id": 303562424,
        "sender_full_name": "Matheus Andrade",
        "timestamp": 1665553375
    },
    {
        "content": "<p>I believe the FPIL book is about lean 4 and the live web editor you linked to runs lean 3 right now.<br>\nDo you know which version you would like to start learning? Lean 4 is only in pre-release at this stage, but is already very advanced for programming with. It just doesnt have a large library of mathematics ported yet. The syntax is broadly similar, but as you see there are some differences.</p>",
        "id": 303571872,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1665559099
    },
    {
        "content": "<p>Thanks for the answer! I was planning on using <em>Functional Programming in Lean</em>, <em>Theorem Proving in Lean</em>, <em>Logic and Proof</em> and the Lean reference manual as study material. Are those written for Lean 4 too?<br>\nEdit: Is there a command that outputs the Lean version? I looked for something like that in Lean Live with no success.</p>",
        "id": 303574441,
        "sender_full_name": "Matheus Andrade",
        "timestamp": 1665560300
    },
    {
        "content": "<p>FPIL is 4, LaP is 3 (unless it was updated since I last looked) and TPIL is both.</p>",
        "id": 303574524,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665560353
    },
    {
        "content": "<p>I guess I'm going for Lean4 then. Thanks a lot for the answers!</p>",
        "id": 303575201,
        "sender_full_name": "Matheus Andrade",
        "timestamp": 1665560645
    }
]