[
    {
        "content": "<p>do we have a usable model of Euclidean geometry in Lean? I guess not, because Euclidean geometry is so complex...</p>",
        "id": 245616380,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1626023234
    },
    {
        "content": "<p>like... it's taught in schools because it feels somewhat intuitive and details can be handwaved in informal proofs... but in reality Euclidean geometry is extremely complex...</p>",
        "id": 245616465,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1626023296
    },
    {
        "content": "<p>Before declaring that something is too hard for mathlib to have, I recommend you first google whether we have it. <a href=\"https://leanprover-community.github.io/mathlib-overview.html\">https://leanprover-community.github.io/mathlib-overview.html</a> has a section on euclidean geometry.</p>",
        "id": 245617205,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626024030
    },
    {
        "content": "<p>Now, there <em>are</em> plenty of bits of geometry that we don't have yet, such as signed angles - but if you have something specific in mind, it would help if you said what it was!</p>",
        "id": 245617310,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626024147
    },
    {
        "content": "<p>oh lol sorry <span aria-label=\"neutral\" class=\"emoji emoji-1f610\" role=\"img\" title=\"neutral\">:neutral:</span> hmm I have nothing specific in mind yet but... is it possible for a high school student like me to help expand the Euclidean geometry section of mathlib to make it possible to formalize high school geometry problems? or is the current formalization too general for me to understand? again, I'm not a mathematician, just an average math-literate high school student lol</p>",
        "id": 245644683,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1626065025
    },
    {
        "content": "<p>it'd probably take me a while to understand the existing code base... but I want to be sure that this is something that I could probably do rather than something that is out of reach for me (because of my lack of a math background)</p>",
        "id": 245644783,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1626065091
    },
    {
        "content": "<p>I think that in principal it is possible, but you would still have to learn the language. If you are looking for a self-contained project, I would suggest picking your favourite IMO problem, and formalizing a solution. (See <code>archive/imo</code> for examples.)</p>",
        "id": 245645433,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1626065861
    },
    {
        "content": "<p>If we can't yet prove angle at centre is twice angle at circumference then I think IMO problems might be pushing it a bit :-) I think that a development of a bunch of results with underlying space equal to a torsor for the complexes should be accessible and fun</p>",
        "id": 245660347,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1626079946
    },
    {
        "content": "<p>Ooh, I didn't mean IMO geometry problems. I should have been more clear. I think IMO problems in number theory might be easier to get started with.</p>",
        "id": 245660435,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1626080027
    }
]