[
    {
        "content": "<p>For the Parisian mathematicians (<span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> <span class=\"user-mention\" data-user-id=\"130609\">@Antoine Chambert-Loir</span>, maybe others?) I just got an announcement for an event. <span class=\"user-mention\" data-user-id=\"110172\">@Assia Mahboubi</span> is one of the speakers.<br>\nHere is a copy of the announcement:</p>\n<blockquote>\n<p>FORMALIZATION OF PROOFS, FORMALIZATION OF PROGRAMS,<br>\n<em>Paris, December, 18-19 2019</em></p>\n<p>Campus Lourcine, Bâtiment 2,Salle 02-Gérard Lyon-Caen. 1, rue de la Glacière (RER : Port Royal; Metro, ligne 7 : Les Gobelins; Metro, ligne 6 : Glacière)</p>\n<div class=\"codehilite\"><pre><span></span>     *Mercredi 18 décembre 2019*\n\n     9h30-10h45: Ursula Martin, What can studies of crowdsourcing tell us about mathematical practice?\n\n     10h45-11h: Coffe Break\n\n     11h-12h15: Gilles Dowek: The absoluity of logical truth challenged by proof formalization.\n\n     12h15- 14h00: Lunch\n\n     14h00-15h15: Gisele Secco, Diagrams and Programs in the First Proof of the Four-Color Theorem\n\n     15h15-16h30: Raymond Turner, Some Instances of Abstraction in Mathematics and Computer Science\n\n     16h30-16h45:  Coffe Break\n\n     16h45-18h30: Table Ronde What can be formalized? with contributions from: Simone Martini, Baptiste Mélès, Maël Pégny, Maté Szabo\n\n     *Jeudi 19 décembre 2019*\n\n     9h30-10h45: Cliff Jones, Formalisation and Proof in Computing: A Personal View\n\n     10h45-11h00: Coffe Break\n\n     11h00-12h15: Giuseppe Primiero, Value-sensitive co-design for resilient software systems\n\n     12h15- 14h00: Lunch\n\n     14h00-15h15: Assia Mahboubi, Verified Computations in Mathematical Proofs\n\n     15h15-15h30: Coffe Break\n\n     15h30-16h45: Alberto Naibo, Formalizing constructions and proofs in Euclid&#39;s geometry\n\n    16h45-18h: Cyrille Imbert, Vincent Ardourel, Program verification in the empirical science: formal methods for all?\n</pre></div>\n\n\n</blockquote>",
        "id": 182853854,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1575739733
    },
    {
        "content": "<p>Thanks! I'm not sure I'll have time for more philosophy, but I'll think about it.</p>",
        "id": 182854701,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1575741072
    }
]