[
    {
        "content": "<p>I am testing the new <code>expand_exists</code> attribute, which looks like a very useful tool, and I have two remarks/questions:</p>\n<ul>\n<li>The names given to the new lemmas are interpreted as being names in the <code>_root_</code> namespace. For example, if I have the namespace <code>measure_theory</code> open and use <code>[expand_exists def_name]</code> I do not get <code>measure_theory.def_name</code>, but <code>_root_.def_name</code>. I expected the opposite behaviour. Is it an intentional design decision?</li>\n<li>The attribute creates a def and lemmas, but the def does not have a docstring and the linter complains. Is there a way to give a dosctring when using the attribute?</li>\n</ul>\n<p>Related to my second question: is it possible to give a dosctring to a definition after its declaration? I want to make the linter happy :)</p>",
        "id": 291082426,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1658943382
    },
    {
        "content": "<p>Re: namespacing, I think this is fixable -- the behavior would be to put the new declarations in the same namespace as the original one. It would mimic whatever logic <code>to_additive</code> uses.</p>",
        "id": 291084007,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1658944046
    },
    {
        "content": "<p>Re: doc strings, are you imaginging the same syntax as <code>to_additive</code> to include a doc string in the attribute? I've always kind of hated that syntax, but again, it's doable. In the meantime you can use <a href=\"https://leanprover-community.github.io/mathlib_docs/commands.html#add_decl_doc\">command#add_decl_doc</a> to add a doc string after its declaration.</p>",
        "id": 291084179,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1658944115
    },
    {
        "content": "<p>For the docstring, I don't really have a preferred way of doing it, but I did not know how to add it (I never had to use add_decl_doc). A simple note in the docstring of expand_exists reminding the user that add_decl_doc exists would be fine for me.</p>",
        "id": 291084436,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1658944248
    }
]