[
    {
        "content": "<p>Like Kevin, I decided to jump the gun and teach students how to write crappy Lean code like professional mathematicians. This morning I showed Lean to the head of the Maths-CS double major program at Orsay. She was very excited and I will probably get about twenty first year undergraduate students to experiment on during the spring semester next year.</p>",
        "id": 127550815,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1528126783
    },
    {
        "content": "<p>FYI, the file I used is at <a href=\"https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/demo.lean\" target=\"_blank\" title=\"https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/demo.lean\">https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/demo.lean</a> it only depends on <a href=\"https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/choice.lean\" target=\"_blank\" title=\"https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/choice.lean\">https://github.com/PatrickMassot/lean-scratchpad/blob/master/src/choice.lean</a> (and mathlib of course)</p>",
        "id": 127550884,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1528126819
    },
    {
        "content": "<p>Of course it's focused on very explicit inefficient tactic mode, not code golf</p>",
        "id": 127550896,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1528126845
    },
    {
        "content": "<p>Having undergraduates to experiment on is really good fun. It's all about the interface, with them. I will be paying particular attention to what my undergraduates struggle with and my guess is that most of the time their struggles will be because they can do something in maths but not in Lean. Ideally the Lean proof should look as mathematical as possible.</p>",
        "id": 127551316,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1528127361
    },
    {
        "content": "<p>I must say part of my plan is to use whatever insight and documentation you will continue to accumulate</p>",
        "id": 127551503,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1528127548
    },
    {
        "content": "<p>You even managed to squeeze some French into the demo! Bonus points (-;</p>",
        "id": 127555072,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1528132225
    },
    {
        "content": "<p>How valuable would it be to have (some) tutorials in video format? I'm wondering if it would be worth looking into doing that kind of presentation</p>",
        "id": 127556971,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1528134494
    },
    {
        "content": "<p>I think videos could be nice. We could also have semi-interactive web pages with Lean code you could navigate and see the Lean status corresponding to each line, precomputed, not computed in real time. This should be a very easy exercise in using Lean in server mode.</p>",
        "id": 127561202,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1528139909
    },
    {
        "content": "<p>I'm actually making a video in a couple of weeks, it was going to be a general one on dependent type theory. We have a bunch of fancy video-making kit at my university and some people are keen for me to try it out.</p>",
        "id": 127585835,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1528181802
    }
]