[
    {
        "content": "<p>In <a href=\"http://logitext.mit.edu/main\">http://logitext.mit.edu/main</a>, Coq is used in background to manipulate the proof state. How hard would be to implement something similar with Lean4 ? For propositional logic first...</p>",
        "id": 239434945,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1621434879
    },
    {
        "content": "<p>I don't know about Lean4.  Honestly I would ask in the <a class=\"stream\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4\">#lean4</a> stream, so this gets more visibility by the right folks.</p>",
        "id": 239502891,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621462158
    },
    {
        "content": "<p>But for Lean3, the answer is just to use the lean server.  What you would be doing is essentially translating the sequent to Lean code and having lean check every step along the way.  Lean can obviously represent first order logic, so either you use the built in tactics or make your own corresponding to the rules in the calculus.  The process would be something like this.  Your webpage backend starts the lean server <code>lean --server</code>, and sends it the string for a file <code>dummy.lean</code> to sync.  This will will be our scratch pad.  When the user wants to prove <code>p -&gt; p</code>, we send an updated version of <code>dummy.lean</code> to sync:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">example</span> <span class=\"o\">:</span> <span class=\"n\">p</span> <span class=\"bp\">-&gt;</span> <span class=\"n\">p</span> <span class=\"o\">:=</span>\n<span class=\"kd\">begin</span>\n\n<span class=\"kd\">end</span>\n</code></pre></div>\n<p>Then when the user applies a rule, you put in the corresponding tactic into the file and sync again.</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">example</span> <span class=\"o\">:</span> <span class=\"n\">p</span> <span class=\"bp\">-&gt;</span> <span class=\"n\">p</span> <span class=\"o\">:=</span>\n<span class=\"kd\">begin</span>\n<span class=\"n\">intro</span> <span class=\"n\">h</span><span class=\"o\">,</span>\n<span class=\"kd\">end</span>\n</code></pre></div>\n<p>At each stage you can check the error messages and the state to see where things are at.</p>",
        "id": 239502904,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621462168
    },
    {
        "content": "<p>I wrote up an example of this in a python notebook <a href=\"https://github.com/jasonrute/communicating-with-lean\">here</a>.  The ideas are right, but I really should have been using asynchronous programming.  The <a href=\"https://github.com/leanprover-community/lean-client-python\">lean python client</a> addresses that.  (It however needs to have a PR merged to work properly again.  It isn't on the top of anyones TODO list.)</p>",
        "id": 239502906,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621462174
    },
    {
        "content": "<p>Of course there is no need to use Python.  The lean server just communicates via JSON.  Unfortunately, the interface isn't documented so that is why I suggest looking that those examples.</p>",
        "id": 239502912,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621462180
    },
    {
        "content": "<p>Lean4 has (or will have) a server as well.  It will be a really language server following the language server protocol if I recall.  This is of course a hack of the language server, but it is a good hack since the use case is very similar to interactively editing a lean file.</p>",
        "id": 239502915,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621462182
    },
    {
        "content": "<p>nice, thank you for your detailed explanation.</p>",
        "id": 239503395,
        "sender_full_name": "Alexandre Rademaker",
        "timestamp": 1621462455
    },
    {
        "content": "<p>Another approach is to directly program this in lean 3 or 4.  The Lean program would be a read eval print loop which takes in a goal and then takes in instructions.  You would have a (non-interactive) tactic which parses the instructions and applies the appropriate (non-interactive) lean tactics to the goal.  If speed is your need, this would be much faster than using the language server, but otherwise you would just have to code up more I think.  (In either case, 90% of the work would be translating your sequent calculus to Lean.)</p>",
        "id": 239504475,
        "sender_full_name": "Jason Rute",
        "timestamp": 1621463111
    },
    {
        "content": "<p>I suspect an experienced Lean 3 widget hacker could cook something up that does at least some of what that example webpage does. Maybe someone in <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>'s discord?</p>",
        "id": 239506791,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1621464513
    }
]