[
    {
        "content": "<p>On the Xena discord, I and some others have been working on a FAQ for Lean/mathlib based issues, and it is located <a href=\"https://github.com/ericrbg/leanFAQ/wiki\">here</a>. I'm more than happy to move this to some other system, but I think it'd be useful to help answer some features. It's (currently) hosted on Github's wiki feature, so anyone should be able to edit it, but if people would like me to add anything, please let me know! I hope this is helpful for common questions :)</p>",
        "id": 268714345,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1642694417
    },
    {
        "content": "<p>I think this should be relocated to the leanprover-community web site</p>",
        "id": 268714849,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1642694582
    },
    {
        "content": "<p>I think leaving it around as a wiki for a week or so might be a good way to collect entries before cleaning them up for the website</p>",
        "id": 268717612,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1642695608
    },
    {
        "content": "<p>this has now expanded a little - any questions I've missed? Bhavik's been tagging me in a lot of FAQs, but I probably missed some due to too-many-notifications. Otherwise I think it'd be nice to start moving this to the main website, and allowing zulip linkification: it'd be nice to just be able to reply to something with sth like \"See faq#div_zero\".</p>",
        "id": 269771356,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1643390963
    },
    {
        "content": "<p>I think you caught all of mine! I'm sure others might have ideas though :)</p>",
        "id": 269775581,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1643392611
    },
    {
        "content": "<p>It's not a separate question, but maybe as part of moving it it's worth interlinking some terms to the glossary (and creating issues to define any that seem like they should be linked but don't exist yet)</p>",
        "id": 269779199,
        "sender_full_name": "Julian Berman",
        "timestamp": 1643393925
    },
    {
        "content": "<p>People reading one may be audience for the other</p>",
        "id": 269779221,
        "sender_full_name": "Julian Berman",
        "timestamp": 1643393935
    },
    {
        "content": "<p>I just dumped a few more onto the todo page too, in case any of those look worthy of addressing</p>",
        "id": 269780759,
        "sender_full_name": "Julian Berman",
        "timestamp": 1643394637
    }
]