[
    {
        "content": "<p>Sometimes it makes sense to add some definitions or lemmas to a mathlib file (like <code>data.nat.prime</code> or <code>algebra.parity</code>) that is imported by a lot of other files. When I do this and run <code>leanproject build</code> to get up-to-date oleans, this takes a very long time. On the other hand, I would think that just adding stuff cannot possibly break anything (unless a naming conflict arises), so it should be possible to get by with only recompiling the file that was changed and checking for name conflicts in the other files. Is there a way of doing this so that the build process is faster?</p>",
        "id": 279684082,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1650549667
    },
    {
        "content": "<p>If you add a <code>simp</code> lemma, then the simp set changes, so many proofs could potentially  break.</p>",
        "id": 279684412,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1650549838
    },
    {
        "content": "<p>Sadly no but you can run <code>lean --make src/path/to/high/level/file.lean</code> rather than <code>leanproject build</code> to recompile just the <code>olean</code>s in between the low-level file you touched and the high-level file you're working on.</p>",
        "id": 279684454,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1650549844
    },
    {
        "content": "<p>Idem dito, if you add an <code>instance</code>, some typeclass resolution might fail</p>",
        "id": 279684474,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1650549854
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"479359\">@Michael Stoll</span> My strategy is to develop things in a new file. And by the time I want to PR things, I move them in the right place, and send off the PR. A while later, the cloud will have generated the oleans for me.</p>",
        "id": 279684589,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1650549916
    },
    {
        "content": "<p>OK, thanks for the explanations and advice!</p>",
        "id": 279684659,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1650549956
    },
    {
        "content": "<p>Also see <a href=\"https://leanprover-community.github.io/tips_and_tricks.html#old-mode\">https://leanprover-community.github.io/tips_and_tricks.html#old-mode</a> for one way to get files compiling quickly if you are sure you really only added something</p>",
        "id": 279689168,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1650552076
    },
    {
        "content": "<p>I always use <code>--old-mode</code> and recompile only the files I touched. Then lean just uses existing oleans.</p>",
        "id": 288219949,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1656706951
    }
]