[
    {
        "content": "<p>I was just trying to prove something involving a term <code>n : ℕ+</code>.  I first tried hitting the problem with <code>finish</code>, which thought for a while and failed.  Then I tried <code>tidy?</code>, which immediately found the solution <code>cases n, refl</code>.  Why wouldn't <code>finish</code> be able to find this simple solution?  Would it make sense to edit the <code>finish</code> tactic to add whatever cleverness <code>tidy</code> used in this case?</p>",
        "id": 270552555,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1643896631
    },
    {
        "content": "<p>For context (and in lieu of a <a href=\"https://leanprover-community.github.io/mwe.html\">#mwe</a>), this was in proving <code>factorization_equiv_apply</code> in <a href=\"https://github.com/leanprover-community/mathlib/pull/11440\">#11440</a>.</p>",
        "id": 270552652,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1643896667
    },
    {
        "content": "<p><code>finish</code> is being phased out, so the solution here is to not use it.</p>",
        "id": 270552748,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1643896687
    },
    {
        "content": "<p>Well, I suppose that's fair, and I wasn't intending to leave <code>finish</code> in the final version to PR into mathlib.  But in the mean time it's still a useful tool to confirm that the thing I'm trying to prove is in fact true and that I haven't messed up somewhere.  And presumably there will be a replacement for it in Lean 4 that will be based (at least to some extent) on whatever ends up being the most recent version of <code>finish</code>.</p>",
        "id": 270555558,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1643897964
    },
    {
        "content": "<p>I don't know exactly what <code>finish</code> does, but it is in some sense much more specialized than <code>tidy</code>, I think.</p>",
        "id": 270555993,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1643898153
    },
    {
        "content": "<p>Yes I think the role of finish and tidy is different enough that we shouldn't necessarily try to make them converge. Especially given that one of the main issues with these tactics is their runtine adding more work to finish seems like it might cause problems</p>",
        "id": 270558773,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1643899226
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"422543\">Stuart Presnell</span> <a href=\"#narrow/stream/113488-general/topic/finish.20vs.20tidy/near/270555558\">said</a>:</p>\n<blockquote>\n<p>And presumably there will be a replacement for it in Lean 4 that will be based (at least to some extent) on whatever ends up being the most recent version of <code>finish</code>.</p>\n</blockquote>\n<p>That's the thing. It won't. But there will be indeed others that will replace it.</p>",
        "id": 270558927,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1643899248
    },
    {
        "content": "<p>My limited understanding is that <code>finish</code> searches for a proof using <code>@[ematch]</code> lemmas -- it's supposed to be an SMT solver tactic.</p>",
        "id": 270592691,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1643911711
    }
]