[
    {
        "content": "<p>Rather out of curiosity: Does there exist work in Lean about formal language theory? So stuff like grammars, automata, turing machines etc. I've looked around a bit on the Internet but didn't really find anything but I'm guessing if there is something I missed out on people here will know about it.</p>",
        "id": 245477694,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1625854125
    },
    {
        "content": "<p>There's <a href=\"https://leanprover-community.github.io/mathlib_docs/computability/turing_machine.html\">https://leanprover-community.github.io/mathlib_docs/computability/turing_machine.html</a> for TMs</p>",
        "id": 245477761,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1625854181
    },
    {
        "content": "<p>There are also DFA, NFA and language files in the <code>computability</code> directory (you should be able to navigate to them from the link above using the menu on the left).</p>",
        "id": 245477899,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1625854240
    },
    {
        "content": "<p>Yeah <span class=\"user-mention\" data-user-id=\"267202\">@Fox Thomson</span>  has done a bunch of this.  He's currently on an internship doing Isabelle, but might be worth reaching out!</p>",
        "id": 245478398,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1625854492
    },
    {
        "content": "<p>I've been working on regular languages and finite automata but unfortunately haven't had time for it recently. We have all the definitions and a proof of the pumping lemma but there's still work to be done. The next big milestone is showing DFA's and regular languages are the same thing.</p>",
        "id": 245542606,
        "sender_full_name": "Fox Thomson",
        "timestamp": 1625913149
    },
    {
        "content": "<p>Yeah I saw those TODOs in the regexp file, I would definitely be interested in working at that or maybe Pushdown Automata which are still missing as far as I can see but I wouldn't consider my Lean good enough (yet) to work on something like that.</p>",
        "id": 245553087,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1625927205
    }
]