[
    {
        "content": "<p>A while ago, in the prenatal stages of the Formal abstracts project by Tom Hales et al., we experimented with formalizing code that is not finished, and code that refers to external references (such as published papers). The experiment still works, somewhat amazingly, at  <a href=\"https://github.com/andrejbauer/formalabstracts\">https://github.com/andrejbauer/formalabstracts</a> You can look at <a href=\"https://github.com/andrejbauer/formalabstracts/blob/master/meta_data.lean\">meta_data.lean</a> for some explanation and the definitions, and the <a href=\"https://github.com/andrejbauer/formalabstracts/tree/master/fabstract\">fabstract</a> folder for usage examples.</p>\n<p>Anyhow, the idea is to replace the rather uninformative <code>sorry</code> with a more structured and manageable way of introducing unfinished business with a new <code>unfinished</code> keyword, which equips some unfinished proof or construction with a description (informal text, references to literature, etc.).</p>\n<p>If there's some interest in this sort of thing, I can prepare a pull request for the library so that we can discuss the possibility of introducing this sort of thing.</p>",
        "id": 239952770,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621777783
    },
    {
        "content": "<p>Reid Barton introduced such a keyword: <a href=\"https://github.com/leanprover-community/mathlib/blob/master/roadmap/todo.lean\">todo</a>, which is only used in the <code>roadmap</code> directory of mathlib, and not in <code>src</code>.</p>",
        "id": 239956361,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1621781421
    },
    {
        "content": "<p>Ah, very good. I am proposing a significant upgrade to <code>todo</code>. It's like a <code>todo</code> which carries information (informal description, references, citations). Are <code>sorry</code>'s in mathlib proper forbidden?</p>",
        "id": 239956456,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621781537
    },
    {
        "content": "<p>Yep (-; The roadmap directory is the only place where <code>sorry</code>-like things are allowed (for now).<br>\nPersonally I think <code>src/</code> should always remain <code>sorry</code>-free.</p>",
        "id": 239956703,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1621781815
    },
    {
        "content": "<p>But providing a richer experience to <code>sorry</code> with something like <code>unfinished</code> sounds like a very good idea to have in mathlib.</p>",
        "id": 239956735,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1621781880
    },
    {
        "content": "<p>If only to have it available in projects that depend on mathlib.</p>",
        "id": 239956778,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1621781893
    },
    {
        "content": "<p>Ok, I can make some light-weight functionality and will issue a PR. Where would this go, in <code>src/meta</code> or in <code>src/tactic</code>?</p>",
        "id": 239956957,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621782051
    },
    {
        "content": "<p><code>src/tactic</code>, I think.</p>",
        "id": 239957069,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1621782162
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"345260\">@Andrej Bauer</span> Our CI scripts only work fully for branches in the main mathlib repo, so we prefer PRs made from branches of mathlib rather than forks. I've sent you an invite: <a href=\"https://github.com/leanprover-community/mathlib/invitations\">https://github.com/leanprover-community/mathlib/invitations</a></p>",
        "id": 239959419,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1621784553
    },
    {
        "content": "<p>Thanks. Is there a technical reason for breaking the received wisdom about forks and PRs?</p>",
        "id": 239961255,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621786359
    },
    {
        "content": "<p>Yes, because the CI scripts need a secret token to upload the built artefacts centrally</p>",
        "id": 239961400,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1621786514
    },
    {
        "content": "<p>And because mathlib is so big now that I can't review a PR which touches a file high up in the import heirarchy unless the system is also offering me fully compiled oleans of the PR</p>",
        "id": 239963292,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1621788481
    },
    {
        "content": "<p>So in principle if someone else sets up the CI for themselves, then they could issue PRs, but it's technically more demanding to set up the CI (and it requires resources). If you get really popular, you won't be able to just inviite everyone who wants to make a PR, but I suppose you'll cross that bridge when you come to it :-)</p>",
        "id": 239978565,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621804448
    },
    {
        "content": "<p>The compiled oleans are uploaded via CI to <a href=\"http://oleanstorage.azureedge.net\">oleanstorage.azureedge.net</a> which is a URL hardcoded in the python script leanproject, this storage is only writable by the mathlib CI (so its not free storage for anyone else!) and allows anyone who wants to inspect your PR to very conveniently get a built version of mathlib with your PR included (with <code>leanproject get-cache</code>). So its more than just more demanding to setup the CI for you,  currently you'd be asking any reviewers to go through a non-standard process to get oleans for your branch (or build them themselves) and therefore make the review process more involved for them if you don't use the existing mechanism.</p>\n<p>This is not dissimilar to the Sage computer algebra system (a fairly large and long-running project), which has a centralised git repo called trac that everyone signs up for an account on, and then patchbots that build sage for all branches to check for errors.</p>",
        "id": 239980031,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1621806115
    },
    {
        "content": "<p>I see. Thanks for the explanation.</p>",
        "id": 239980542,
        "sender_full_name": "Andrej Bauer",
        "timestamp": 1621806685
    }
]