[
    {
        "content": "<p>Hi people. I'm new to Lean Therom Prover and have a few questions.</p>\n<ol>\n<li>Has this software got the potential to prove all known mathematics? </li>\n<li>Has the software ever proved a mathematical theorem to be incorrect? </li>\n<li>Is there potential for Artificial Intelligence type software to hypothesize theorems and prove them correct or incorrect using this software to find new mathematical knowledge?</li>\n<li>Is this software something a computer scientist with high-school level mathematics skills could contribute towards?</li>\n<li>Is there a database of Theorems proven by this software?</li>\n<li>Can a (new) theorem use other theorems as dependencies? </li>\n<li>Are there mathematical theorems that can't be written in this software yet? How would the software be changed so they can?</li>\n<li>What are the limits of this software?</li>\n<li>Are there any beginner video guides on using this software? (on Youtube or learning platform such as Udemy etc)</li>\n<li>Has the software been used to prove anything new? (previously unproven)</li>\n<li>Are there some simple proofs that even a beginner could understand?</li>\n</ol>",
        "id": 177925837,
        "sender_full_name": "Matthew Felgate",
        "timestamp": 1570812539
    },
    {
        "content": "<p>Let me take a stab at some of the questions.</p>",
        "id": 177927019,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813414
    },
    {
        "content": "<ol>\n<li>Yes. In theory certainly. In practice, you need lots of people, lots of time, etc...</li>\n<li>If you are very strict, yes. But usually, a little change in the assumption fixes the theorem. (Someone forgot to exclude the empty set, etc...) But see <a href=\"https://www.math.sciences.univ-nantes.fr/~gouezel/articles/morse_lemma.pdf\" target=\"_blank\" title=\"https://www.math.sciences.univ-nantes.fr/~gouezel/articles/morse_lemma.pdf\">https://www.math.sciences.univ-nantes.fr/~gouezel/articles/morse_lemma.pdf</a></li>\n<li>Hard question. So far this hasn't gotten beyond trivialities.</li>\n<li>Depends. At the moment there is still a lot of low-hanging fruit. And you can certainly help with the algorithmic part.</li>\n<li>What is a database? There is a bunch of source files containing the definitions, theorems and proofs. See mathlib.</li>\n<li>Short answer: No. Long answer: People are trying to do this, but it is complicated.</li>\n<li>The problem is usually that you can't even state the theorem, because you first need 1500 definition in place. And those aren't there yet. But see 1. In theory this isn't a problem.</li>\n<li>I'll skip this one. It's very broad.</li>\n</ol>",
        "id": 177927092,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570813447
    },
    {
        "content": "<p>(1) Yes, all main proof assistants, including Lean, can prove all known mathematics in principle. The main difference between the systems is how convenient it is to do this. The goal of Lean is to be more (or at least as) convenient as other proof assistants.</p>",
        "id": 177927100,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813454
    },
    {
        "content": "<ol start=\"9\">\n<li>Yes, search Youtube. Although I haven't watched them yet.</li>\n<li>Not really.</li>\n<li>Certainly. You could look up the definition of the complex numbers, for example. After that come a bunch of proofs of basic properties.</li>\n</ol>",
        "id": 177927306,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570813610
    },
    {
        "content": "<p>Ah, Johan had already started typing an answer. Let me skip some of his...</p>",
        "id": 177927313,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813622
    },
    {
        "content": "<p>Either I don't understand question 7 or I don't understand Johan's answer</p>",
        "id": 177927345,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570813649
    },
    {
        "content": "<p><a href=\"#narrow/stream/113489-new-members/topic/Getting.20started/near/177562134\" title=\"#narrow/stream/113489-new-members/topic/Getting.20started/near/177562134\">This recent thread</a> has a bunch of links to resources for beginners, including, some videos on youtube (which I haven't watched). Most people, as I understand it, first figure out how to install Lean on their computer (following the links here <a href=\"https://github.com/leanprover-community/mathlib#installation\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib#installation\">https://github.com/leanprover-community/mathlib#installation</a>) then work their way through the book <a href=\"https://leanprover.github.io/theorem_proving_in_lean/\" target=\"_blank\" title=\"https://leanprover.github.io/theorem_proving_in_lean/\">\"Theorem Proving in Lean\"</a>. I personally also found the book <a href=\"https://leanprover.github.io/logic_and_proof/\" target=\"_blank\" title=\"https://leanprover.github.io/logic_and_proof/\">\"Logic and Proof\"</a> helpful.</p>",
        "id": 177927350,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1570813657
    },
    {
        "content": "<p>Hey all!<br>\nGreat forum and appreciate all the answers. <br>\n<span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> sorry if I'm repeating myself, but do you have a link on the software you used to create websites with clickable proofs that unfold Lean proofs?</p>",
        "id": 177927433,
        "sender_full_name": "Miguel Raz Guzmán Macedo",
        "timestamp": 1570813690
    },
    {
        "content": "<p>Re 7. Some theorems currently can't be written yet. The reason is that we don't have the \"nouns\" and \"verbs\" to do so. We first need loads of definitions, before we can \"write\" the theorem.</p>",
        "id": 177927476,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570813739
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"243947\">@Miguel Raz Guzmán Macedo</span>  Sorry I missed your question. The answer is: <a href=\"https://github.com/leanprover-community/format_lean\" target=\"_blank\" title=\"https://github.com/leanprover-community/format_lean\">https://github.com/leanprover-community/format_lean</a></p>",
        "id": 177927489,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570813748
    },
    {
        "content": "<p>(4): Yes, definitely. There are computer scientists working on Lean. There is plenty of progress that can just be made on writing tactics / decision procedures. And there is still some first-year undergraduate math missing (mostly calculus), which is probably feasible.<br>\n(5): Mathlib is the math library for Lean, and has many proven theorems: Here is the link: <a href=\"https://github.com/leanprover-community/mathlib\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib\">https://github.com/leanprover-community/mathlib</a></p>",
        "id": 177927493,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813752
    },
    {
        "content": "<p>Oops, Johan I meant 6</p>",
        "id": 177927527,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570813782
    },
    {
        "content": "<p>(6): Yes, theorems can use other theorems in their proofs. Almost all proofs do this.<br>\nJohan probably answered the question whether proof <em>assistants</em> can use the proofs of different proof assistants (e.g. can Lean use Coq's proofs). This is very hard in general, but there have been some accomplishments in this area.</p>",
        "id": 177927690,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813873
    },
    {
        "content": "<p>(11): I recommend <a href=\"http://neil-strickland.staff.shef.ac.uk/dagstuhl/\" target=\"_blank\" title=\"http://neil-strickland.staff.shef.ac.uk/dagstuhl/\">http://neil-strickland.staff.shef.ac.uk/dagstuhl/</a> which has a couple of formalized proofs with a detailed explanation (see the links under <em>Formalisations</em>). Especially the <a href=\"http://neil-strickland.staff.shef.ac.uk/dagstuhl/Systems/Lean_mathlib/Tasks/primes/\" target=\"_blank\" title=\"http://neil-strickland.staff.shef.ac.uk/dagstuhl/Systems/Lean_mathlib/Tasks/primes/\">Primes</a> example is good.</p>",
        "id": 177927800,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570813950
    },
    {
        "content": "<p>About question 4 (contributing): it very much depend what you want to contribute to. Working on Lean itself is a very difficult very specialized task. Only a handful of people in the world do that, under close supervision by Leo de Moura. However almost anyone with basic math knowledge can contribute to Lean's maths library mathlib, or contribute to documention.</p>",
        "id": 177927819,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570813965
    },
    {
        "content": "<blockquote>\n<p>Oops, Johan I meant 6</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span>  Aaah, my answer is nonsense. I read to fast. I thought the question was about theorem <em>provers</em> using each others results. Should have read better.</p>",
        "id": 177927952,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570814047
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 177928165,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570814206
    },
    {
        "content": "<p>(10) It depends on whether you mean Lean specifically or also other software, and what mathematical results you count. Let me give two examples:</p>\n<ul>\n<li>In the area of homotopy type theory - a relatively new field connecting to both logic and geometry (algebraic topology) - many results have been formalized, and some results had been formalized before being carefully written up on paper. Lean 2 (an older version of Lean) had a homotopy type theory library: <a href=\"https://github.com/leanprover/lean2/blob/master/hott/hott.md\" target=\"_blank\" title=\"https://github.com/leanprover/lean2/blob/master/hott/hott.md\">https://github.com/leanprover/lean2/blob/master/hott/hott.md</a></li>\n<li>Tom Hales proved an open problem called the Kepler conjecture in mathematics. It took many years for mathematicians to review this proof, so he <a href=\"https://github.com/flyspeck/flyspeck\" target=\"_blank\" title=\"https://github.com/flyspeck/flyspeck\">formally verified</a> it in the proof assistant HOL Light (the paper proof was published before the formal proof was completed though).</li>\n</ul>",
        "id": 177930465,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570815585
    },
    {
        "content": "<p>More on (10): since the main goal of proof assistants is to check proofs given by the user, the user basically has to already know the proof before they can formalize it. There is another branch of formal proof called <em>Automated Theorem Proving</em> where the software finds mathematical proofs. They have more success in proving new results.</p>",
        "id": 177930615,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570815686
    },
    {
        "content": "<p>Thanks for all the answers. Genuinely appreciated.</p>",
        "id": 177939587,
        "sender_full_name": "Matthew Felgate",
        "timestamp": 1570821278
    },
    {
        "content": "<p>If I use a tactic without specifying any parameters and leans matches the pattern for me, is there a way I can make lean tell me what paramters it passed? For example if I just said \"add_sub,\" but I want to know the \"a b c\" it uses.</p>",
        "id": 272066720,
        "sender_full_name": "Mason McBride",
        "timestamp": 1644978715
    },
    {
        "content": "<p>you can wrap the tactic call in <code>show_term</code> as in <code>show_term { rw add_sub }</code></p>",
        "id": 272066815,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644978816
    },
    {
        "content": "<p>Thank you for your kindness!</p>",
        "id": 272067352,
        "sender_full_name": "Mason McBride",
        "timestamp": 1644979427
    },
    {
        "content": "<p>You can mostly thank my university work to keep me up that late <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 272067656,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644979763
    }
]