[
    {
        "content": "<p>Hello everyone,<br>\nI have finally cleaned up the code for auto-generating homomorphism types for algebraic structures.<br>\nThe idea is that for structures like monoid, group, ring, ..., the type of homomorphisms can simply be read from the definition: morphisms need to be \"compatible with all operations\".<br>\nThe code linked below generates the structure of homomorphisms and the lemmas that compositions of homomorphisms and identities are homomorphisms, and defines the <code>concrete_category</code> belonging to the structure.<br>\nMoreover, it defines forgetful functors, whenever one structure is an extension of another (in the sense of also having its fields), and the respective instances.<br>\nBelow the code there is a brief section of examples, also listing current restrictions (e.g. only \"old style\" structures).<br>\n<a href=\"https://github.com/faabian/mathlib/blob/3.5/meta.lean\" target=\"_blank\" title=\"https://github.com/faabian/mathlib/blob/3.5/meta.lean\">https://github.com/faabian/mathlib/blob/3.5/meta.lean</a><br>\nI think this is relevant because, as pointed out by <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span>  and others, currently the library does not reflect the link between a class of objects and its (manually defined) homomorphism type.<br>\nA goal might be to create a \"table\" linking structures to their manually defined homomorphism types (e. g. for topological spaces) and to auto-generate the ones for structures derived from these (e. g. topological groups).</p>",
        "id": 172684796,
        "sender_full_name": "Fabian Glöckle",
        "timestamp": 1565189696
    },
    {
        "content": "<p>Does it need Lean 3.5?</p>",
        "id": 172686183,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1565190639
    },
    {
        "content": "<p>I think that in the end it does not.</p>",
        "id": 172686359,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1565190772
    },
    {
        "content": "<p>No it doesn't, structure declarations are now made with emit_code_here, not the Lean 3.5 interface</p>",
        "id": 172687322,
        "sender_full_name": "Fabian Glöckle",
        "timestamp": 1565191452
    }
]