[
    {
        "content": "<p>Hi. I'm not sure if or when, but I was wondering what graduate programs are out there. I have found some, but probably not all, and it would be great to hear from people who might have first hand experience. Thank you.</p>",
        "id": 229588228,
        "sender_full_name": "Patrick Thomas",
        "timestamp": 1615340551
    },
    {
        "content": "<p>Graduate programs for what? Specifically for formalized math? I don't think those exist yet. Probably the best bet is applying to computer science departments that have faculty in this area.</p>",
        "id": 229603076,
        "sender_full_name": "Roman Bars",
        "timestamp": 1615351716
    },
    {
        "content": "<p>I have a student Ashvni Narayanan working in formalised maths (Iwasawa theory) and this week I heard that Jujian Zhang, a former MSc student of mine who formalised transcendence of e in Lean, has been awarded funding by Imperial to do a PhD with me on elliptic curves and modular forms starting in October.</p>",
        "id": 229609923,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615357920
    },
    {
        "content": "<p>If you've \"found some\", then you probably have already made a note of CMU, but there are a <em>lot</em> of <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> 's students on this Zulip.</p>",
        "id": 229706859,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1615397103
    },
    {
        "content": "<p>NB my home department is the (unusually mathematical) philosophy department at Carnegie Mellon. It's a really interesting department that opens up all kinds of interesting possibilities for cross-disciplinary collaboration, and I have been blessed with a number of amazing students and postdocs over the years. It's a small PhD program and subject to the usual vicissitudes of funding, but we're always looking for good students.</p>",
        "id": 229717324,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1615400916
    }
]