[
    {
        "content": "<p>Is there a way to do head reduction on a term until the head changes? So I want to do something very similar to <code>whnf</code>, except I want to stop reducing as soon as the head changes.<br>\nAlternatively, I want a tactic which does a <em>single</em> head reduction step.<br>\nIf I have to write this myself, is there any way to do the reduction <code>@nat.rec P h₀ h₁ (succ n) ⟶ h₁ n (@nat.rec P h₀ h₁ n)</code>without reducing too much?</p>",
        "id": 136343289,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1540307866
    },
    {
        "content": "<p>Here is the backstory, because maybe I'm approaching it wrong.<br>\nThe <code>induction</code> tactic has some flaws, and has one restriction which is very annoying for the HoTT library: all user-defined recursors have to eliminate to <strong>all</strong> universes, including <code>Prop</code>, which is unacceptable for HoTT. Therefore, I'm writing my own <code>hinduction</code> tactic, which tries to do essentially the same as <code>induction</code>tactic.</p>\n<p>Now I'm having trouble with the following case. I write <code>hinduction x using my_rec</code>. Suppose the type of <code>x</code> is <code>F a b c</code> and the type of <code>my_rec</code> expects something of type <code>G ? ?</code>. Now I want to check whether by unfolding <code>F</code> and reducing, I can get something with head <code>G</code> (and figure out the arguments of <code>G</code>). I <em>do</em> want to support the case where <code>G</code> is a definition, so I <em>cannot</em> use the weak-head normal form of <code>F a b c</code>. There are a couple possible approaches:</p>\n<ul>\n<li>What I described above: repeatedly do a single head reduction and see if the head is now <code>G</code>.</li>\n<li>Maybe I can do <code>whnf</code> but unfold all definitions, except <code>G</code>?</li>\n<li>I could try to unify <code>F a b c</code> with <code>G _ _</code>. This last approach is something I think I know how to do, so maybe that is the best solution.</li>\n</ul>",
        "id": 136345069,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1540309192
    },
    {
        "content": "<p><code>whnf</code> should already stop at definitions that are irreducible. Do you really want to support user recursors on (semi-)reducible definitions?</p>",
        "id": 136347162,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1540310985
    },
    {
        "content": "<p>I think so. In the HoTT library we define higher inductive types in terms of other higher inductive types. For example, the suspension is defined as a homotopy pushout, and the circle is defined as a suspension. <br>\nEvery higher inductive type comes with its own custom induction principle, but I still want to be able to apply theorems about suspensions for the circle. So I don't think I want the circle to be irreducible.<br>\nThis is how it worked in Lean 2, and it was fine in practice.</p>",
        "id": 136348052,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1540311733
    },
    {
        "content": "<p>I think you should try to unify the types for this</p>",
        "id": 136349422,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1540313183
    },
    {
        "content": "<p>You can figure out the number of underscores by adding them until you get something that is a type</p>",
        "id": 136349454,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1540313242
    }
]