[
    {
        "content": "<p>In Theorem Proving in Lean, it seems to me that \"hypothesis\" is used to describe \"that which is assumed.\" But to me as a scientist, hypotheses are posed and then tested for validity; they are more like conjectures. Is this confusing for anyone else? Is \"hypothesis\" generally used this way among mathematicians?</p>\n<p>I'd probably prefer to use \"premise\" to describe \"that which is assumed,\" rather than \"hypothesis.\" Would there be any issue with that?</p>",
        "id": 295771962,
        "sender_full_name": "Tyler Josephson",
        "timestamp": 1661738811
    },
    {
        "content": "<p>In logic, the P in \"if P then Q\" is often known as the <em>antecedent</em> or the <em>hypothesis</em> of the proposition. In a goal state, it probably would be more precise to call the corresponding terms <em>premises</em> or <em>assumptions</em>, though you'll see in written proofs that something is true \"by assumption\" or \"by hypothesis\" interchangeably.</p>",
        "id": 295772840,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1661740080
    },
    {
        "content": "<p>Maybe one way to think of it is that each theorem you prove is an experiment that shows what else would need to be true if a given hypothesis were true -- proofs are in a sense evidence against their hypotheses.</p>",
        "id": 295772925,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1661740198
    },
    {
        "content": "<p>This is standard mathematical terminology, isn't it? Assumption and hypothesis are synonymous.</p>",
        "id": 295808654,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1661765229
    },
    {
        "content": "<p>I don't think we should change terminology only because physics and biology use the word hypothesis with a different meaning. And this has nothing to do with proof assistant. The name clash is already there in real life and when I teach maths to physics or biology majors I always emphasize this to prevent confusion.</p>",
        "id": 295811050,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1661766292
    },
    {
        "content": "<p><a href=\"https://en.wiktionary.org/wiki/hypothesis\">https://en.wiktionary.org/wiki/hypothesis</a> mentions all these meanings, but the etymology seems to support the mathematical / grammatical meaning more than the scientific one</p>",
        "id": 295814017,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1661767574
    },
    {
        "content": "<p>Yay! Let's change science!</p>",
        "id": 295814076,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1661767596
    },
    {
        "content": "<p>I hypothesize this will not work.</p>",
        "id": 295814104,
        "sender_full_name": "Julian Berman",
        "timestamp": 1661767608
    },
    {
        "content": "<p>I assume the same.</p>",
        "id": 295814191,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1661767642
    },
    {
        "content": "<p>Haha - thanks, everyone!</p>",
        "id": 295881300,
        "sender_full_name": "Tyler Josephson",
        "timestamp": 1661785453
    }
]