[
    {
        "content": "<p>I have implemented (locally, there is no branch or PR yet) the Galois connection between sets of topological space <code>X</code> and ideals of <code>C(X, R)</code> where <code>R</code> is a topological ring; here the maps are, for <code>s : set X</code> take the ideal of all functions which are zero on this set, and for <code>I : ideal C(X, R)</code> take the intersections of the zero sets of all functions in the ideal are zero.</p>\n<p>In case <code>R</code> is <code>is_R_or_C R</code>, and <code>X</code> is compact Hausdorff, then this can actually be upgraded to a Galois correspondence between closed sets and closed ideals, which I have also implemented in an unbundled fashion. The questions is: should I also implement a bundled version of this Galois correspondence between the types <code>closeds X</code> and <code>{ I : ideal C(X, R) // is_closed (I : set C(X, R)) }</code>?</p>",
        "id": 300224561,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663872824
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span>, <span class=\"user-mention\" data-user-id=\"311453\">@Frédéric Dupuis</span> , <span class=\"user-mention\" data-user-id=\"240862\">@Oliver Nash</span></p>",
        "id": 300230867,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663874923
    },
    {
        "content": "<p>My take is that if you don't have a use case in mind for the bundled version, then don't worry about it for now. We can always add it later.</p>",
        "id": 300234767,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1663876314
    },
    {
        "content": "<p>Well, here is one possibility, but I haven't actually tried it yet: if we have an actual <code>order_iso</code> here (between <code>(closeds X)ᵒᵈ</code> and the subtype of closed ideals), shouldn't we be able to prove more easily that the ideal correspondning to <code>{x}</code> is maximal, and vice versa that every maximal ideal arises in this way?</p>",
        "id": 300236026,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663876793
    },
    {
        "content": "<p>Another issue: should I implement all this in terms of open sets instead? closed sets has always felt to me more natural, but I could possibly be convinced to go the other way.</p>",
        "id": 300239475,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663878127
    },
    {
        "content": "<p>Given that we don't have contravariant functors I would implement it in the covariant way</p>",
        "id": 300249702,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1663882624
    },
    {
        "content": "<p>Just the order isomorphism, or everything?</p>",
        "id": 300257005,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663884936
    },
    {
        "content": "<p>Heh, I don't know really, I just think having <code>op</code>s makes stuff less readable, but it's probably not a strong argument for making the decision.</p>",
        "id": 300331935,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1663928932
    },
    {
        "content": "<p>To see how it would play out, I just did it last night. I think I agree with you that it's better via open sets.</p>",
        "id": 300379722,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1663943672
    }
]