[
    {
        "content": "<p>I want to get custom imports (i.e. stuff in <code>xenalib</code>) working in cocalc. Here are some dumb questions. Say I have a Lean file whose first line is an import.</p>\n<p>1) If I compiled this with <code>lean --make</code> on the command line, which directories will Lean look in when looking for the import?</p>\n<p>2) If I open this file in VS Code, where will Lean look, and who told it to look there?</p>\n<p>3) If I open this file in cocalc, where will Lean look, and who told it to look there?</p>\n<p>[The same question exists for emacs, but I don't need to know the answer]</p>",
        "id": 134678473,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1537971815
    },
    {
        "content": "<p>1) see <code>lean --path</code>, which depends on your current working directory<br>\n2) same as 1), but the cwd is set to the package root if vscode-lean sees you're in a package<br>\n3) I believe <span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> mentioned that CoCalc uses <code>~/.lean</code> as the cwd at the moment. Ideally it should use the same logic as the other editors</p>",
        "id": 134685628,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1537977723
    },
    {
        "content": "<blockquote>\n<p>3) I believe <span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> mentioned that CoCalc uses <code>~/.lean</code> as the cwd</p>\n</blockquote>\n<p>CoCalc currently always starts the lean server in ~.   I think CoCalc should start a separate server somewhere else if you open a file such as <code>foo/bar/a.lean</code>, although I'm not 100% clear on the semantics of what to do.</p>",
        "id": 134686203,
        "sender_full_name": "William Stein",
        "timestamp": 1537978240
    },
    {
        "content": "<p>The Emacs mode uses one server for all stand-alone Lean files and a separate server per Lean package</p>",
        "id": 134686339,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1537978390
    },
    {
        "content": "<p>I tried to describe the behavior of the emacs mode earlier, on the CoCalc thread, I believe.</p>",
        "id": 134691615,
        "sender_full_name": "Reid Barton",
        "timestamp": 1537984027
    }
]