[
    {
        "content": "<p>Someone is trying to use Lean on a Win 7 machine here and we're constantly running into memory issues. Lean suggests \"increase memory consumption threshold\" -- is this something which is possible to do and which might actually work? It's a Windows 7 machine using <code>.olean</code> files which were built on Windows 10 :-/ but that's only because none of us are using Win7 so we can't make the .olean files for Win7.</p>",
        "id": 130780966,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1533219769
    },
    {
        "content": "<p>Every third time we hit <code>Lean : restart</code> we get away with it :-)</p>",
        "id": 130781134,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1533219975
    },
    {
        "content": "<p>go to task manager and look at memory consumption?</p>",
        "id": 130781144,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1533220002
    },
    {
        "content": "<p>That sometimes means Lean thinks it needs to rebuild things</p>",
        "id": 130781228,
        "sender_full_name": "Reid Barton",
        "timestamp": 1533220085
    },
    {
        "content": "<p>1) As <span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span> said, try <code>leanpkg build</code> first.  2) In vscode, go to user settings (ctrl+shift+p user settings), and search for lean. <span class=\"emoji emoji-263a\" title=\"smile\">:smile:</span></p>",
        "id": 130791589,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1533231877
    },
    {
        "content": "<p>It didn't look unreasonable. I initially felt like we were on the boundary of what the machine was capable of, but it didn't make much sense because the machine had 16 gigs of ram and it never got filled up. Maybe it's the dodgy .olean files (and the fact that they were zipped up from some other computer and I'm not sure the timestamps would have survived -- I don't know anything about Windows timestamps).</p>",
        "id": 130791671,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1533231990
    },
    {
        "content": "<p>I don't think I can run <code>leanpkg build</code> -- I didn't try, but the machine did not have git and I didn't have admin privileges and I think that in the past this has been enough to stop the build from working -- it fails right at the start before trying to build anything. That was the root of the problem.</p>",
        "id": 130791708,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1533232072
    },
    {
        "content": "<p>The default limit is a mere 1GB, so it makes sense that you did not see the machine's memory fill up.<br>\nMy guess is also a timestamp issue.</p>",
        "id": 130791965,
        "sender_full_name": "Reid Barton",
        "timestamp": 1533232358
    },
    {
        "content": "<p>When lean is invoked by the editor, does it write out <code>.olean</code> files for modules it compiles?</p>",
        "id": 130791987,
        "sender_full_name": "Reid Barton",
        "timestamp": 1533232398
    },
    {
        "content": "<p>My impression is that it does not</p>",
        "id": 130791991,
        "sender_full_name": "Reid Barton",
        "timestamp": 1533232409
    },
    {
        "content": "<p>It's also easy to accidentally modify a mathlib source file (especially if you are using jump-to-definition) and that also tends to cause this behavior.</p>",
        "id": 130792165,
        "sender_full_name": "Reid Barton",
        "timestamp": 1533232602
    },
    {
        "content": "<blockquote>\n<p>I don't think I can run <code>leanpkg build</code> -- I didn't try, but the machine did not have git </p>\n</blockquote>\n<p>You can also do <code>lean --make</code></p>",
        "id": 130793805,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1533234565
    }
]