[
    {
        "content": "<p>The W3C is starting work on a charter for Linked Data Signatures <a href=\"https://lists.w3.org/Archives/Public/public-credentials/2021Mar/0273.html\">as per mail to the Credentials Community Group</a> today. There'll be graphs, hypergraphs, URIs and crypto discussions involved, and I mathematical proofs of correctness will play a central role.</p>\n<p>This is following up on 14 or more years of ideas. One proposal is <a href=\"https://lists.w3.org/Archives/Public/public-credentials/2021Mar/0220.html\">RDF Dataset Canonicalization - Formal Proof</a>.</p>",
        "id": 232469478,
        "sender_full_name": "Henry Story",
        "timestamp": 1617127141
    },
    {
        "content": "<p>My reading of the Formal Proof document is that this is someone using the phrase \"formal proof\" the way that a mathematician would use the phrase \"proof\" and a computer formaliser person would use the phrase \"paper proof\".</p>",
        "id": 232504377,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1617141563
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> , I thought that may be the case. <br>\nBut in their defense, this is not a standard, only a proposal for one, and I guess they are still interested in getting feedback from the community, discovering if others have come up with better methods, etc...  You can actually see quite a lively discussion on the mailing list on the <a href=\"https://lists.w3.org/Archives/Public/public-credentials/2021Mar/thread.html#msg220\">RDF Dataset Canonicalization</a> thread. </p>\n<p>Btw. DataSets in RDF I believe form hypergraphs, as defined say in David Spivak's <a href=\"https://arxiv.org/abs/0909.4314\">Higher-dimensional models of Networks</a>. I think those are generalisations of simplicial sets. From that you can build multi agent modal logics as shown by this beautifuly illustrated <a href=\"https://arxiv.org/abs/2002.08863\">Knowledge in Simplicial Complexes</a> (I have an illustrated document that shows how one can get to such a conclusion with simple illustrations :-). <br>\nAlso a number <a href=\"https://gitlab.com/web-cats/CG/-/issues/24\">of links to this here</a>. </p>\n<p>I mention that because it is usually thought that RDF Graphs are only directed graphs. That these higher dimensions are needed for the web, which is a multi-agent system spanning the globe, is often lost on people,  even logicians, mathematicians and programmers.  (But that is fine, since those graphs are part of the larger space). </p>\n<p>Also I mention that because someone might thinking of this see some powerful mathematical tool that can be used in this space, and that may have escaped those who thought about it till now. Also of course this may be an interesting and valuable exercise to try to see if one can prove this mechanically. As there are a lot of computer people in those groups, I think they would appreciate such proofs a lot.</p>",
        "id": 232563969,
        "sender_full_name": "Henry Story",
        "timestamp": 1617184526
    }
]