[
    {
        "content": "<p>I can't seem to find an instance of <code>is_lawful_monad io</code> in Lean 3.  Is that a deliberate omission in that <code>io</code> is not intended to satisfy the monad laws, or just something that wasn't implemented?  Is there a good way to manually introduce this?</p>",
        "id": 151810212,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1544827385
    },
    {
        "content": "<p><code>io</code> is postulated in Lean 3 (and implemented in C++) so it would be impossible to prove the monad laws. You could probably add a constant of type <code>is_lawful_monad io</code> and make it an instance. It doesn't seem like it would be troublesome but maybe there's something I'm not thinking of</p>",
        "id": 151814377,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1544833111
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110994\">@Joe Hendrix</span> It's certainly consistent to add an instance of <code>is_lawful_monad io</code> since there are trivial implementations of the io interface like <code>\\lam _ _, unit</code> that satisfy the monad laws</p>",
        "id": 151815085,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544834249
    },
    {
        "content": "<p>(not surprisingly, this trick does not support <code>tactic.unsafe_run_io</code>.)</p>",
        "id": 151815143,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544834353
    },
    {
        "content": "<p>If you are asking whether <code>io</code> is \"morally\" a lawful monad, first you have to figure out what you mean by that since an <code>io</code> action is not an inspectable thing, so you have to define it in terms of sequences of observable behaviors; but once you do that, then the answer seems to be that it is a monad in the appropriate sense. There is just very little that the assumption of lawfulness will give you, since equality of <code>io</code> actions is a kind of useless thing</p>",
        "id": 151815238,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544834522
    },
    {
        "content": "<p>Yes, I didn't mean inconsistent with the under logic, but the operational semantics.  At a minimum one, I'd want <code>f = g</code> to imply that the set of functional traces to be the same (e.g. if there was file io, they'd write the same contents, but one may take longer to do so than the other).  <br>\nI don't see equality of <code>io</code> as useless, programs often involve input and output, and being able to prove equivalence of two programs is often useful.</p>",
        "id": 151822149,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1544848026
    },
    {
        "content": "<p>I think you probably need more than just the monad laws for that, though</p>",
        "id": 151822196,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544848123
    },
    {
        "content": "<p>You need a <code>lawful_io</code> class that says how <code>catch</code> and <code>fail</code> interact, what <code>iterate</code> does, and so on</p>",
        "id": 151822201,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544848157
    },
    {
        "content": "<p>you could axiomatize the file system, but that's probably not correct. I don't know if any reordering of the file system calls is permissible</p>",
        "id": 151822302,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544848342
    },
    {
        "content": "<p>Yes, I think getting a complete set of axioms including all the predefined constants would be difficult.  In my current case, I literally just needed the monad laws; I had a <code>state_t</code> monad that wrapped <code>io</code> to provide lookahead when reading a file.  I wanted to prove that peeking one byte ahead and then dropping the byte was the same as just reading the byte.</p>",
        "id": 151822689,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1544849210
    },
    {
        "content": "<p>Another alternative, if you are interested in provably correct IO, is to have a mini language of your own, defined as <code>list my_io_command</code> or similar, which you can put a monad instance on and define a simple interpretation function into <code>io</code></p>",
        "id": 151822910,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1544849656
    },
    {
        "content": "<p>Yes, I've done something like that with a free monad.  In this case, I was just wondering if I overlooked existing <code>io</code> monad laws.</p>",
        "id": 151828407,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1544861962
    }
]