[
    {
        "content": "<p>In case there was any doubt: we're pleased to announce that Ellenberg and Gijswijt's solution to the cap set problem (<a href=\"https://arxiv.org/abs/1605.09223\" target=\"_blank\" title=\"https://arxiv.org/abs/1605.09223\">https://arxiv.org/abs/1605.09223</a>) is definitely correct!</p>\n<p>The Lean code still needs a bit of cleanup. We'll make that public very soon. But in the meantime, here's a draft of our paper for ITP: <a href=\"https://lean-forward.github.io/e-g/e-g.pdf\" target=\"_blank\" title=\"https://lean-forward.github.io/e-g/e-g.pdf\">https://lean-forward.github.io/e-g/e-g.pdf</a></p>\n<p>We'll submit this on Sunday. Any comments or suggestions before then are more than welcome.</p>",
        "id": 161934703,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553764285
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span> and Rob I am really pleased that you have managed to get this job out the door.  Jordan asked me about its progress several times and I was scared that Johannes was going to leave Amsterdam and the project was going to peter out before it was finished. </p>\n<p>I have said this several times before but let me try and hammer the point home again. Professional mathematicians do not really seem to care that old results like the odd order theorem have been formally verified. This is counterintuitive to me but it is absolutely what I see in practice when I talk to mathematicians up and down the UK. These results are old and people have proved far more nowadays, so they know the original results are fine and don't need formally verifying. What I am trying to do with the perfectoid project, and what this paper I think does very well, is to say \"look, modern maths can be formalised nowadays, formalisers are a tool and this tool is being used to analyse recent stuff. Formalisers are becoming relevant\". This paper adds more weight to my argument. Mathematicians still seem to think that formalising a paper like this is out of reach, or will take forever or something.</p>",
        "id": 161937409,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1553767022
    },
    {
        "content": "<p><code>theorem theorem_12_1</code> ← what is that <span aria-label=\"question\" class=\"emoji emoji-2753\" role=\"img\" title=\"question\">:question:</span> <span aria-label=\"exclamation\" class=\"emoji emoji-2757\" role=\"img\" title=\"exclamation\">:exclamation:</span></p>",
        "id": 161937762,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1553767328
    },
    {
        "content": "<p>I thought those names belonged to old school pen and paper maths</p>",
        "id": 161937768,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1553767343
    },
    {
        "content": "<p>To be fair, this paper is really a special case. Sander insisted that I tone down some of the language about how this shows \"formalizing modern mathematics is within reach.\" This is probably the only recent Annals paper that we could have formalized with this amount of effort.</p>",
        "id": 161937813,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553767408
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> See the shouting note in the following paragraph. :)</p>",
        "id": 161937827,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553767435
    },
    {
        "content": "<p>The theorem names mirror Sander's informal blueprint. We haven't had a chance to change them yet.</p>",
        "id": 161937887,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553767471
    },
    {
        "content": "<p>So what's your next target paper? ;-) I don't think you should drop your standards -- another Annals paper?</p>",
        "id": 161938552,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1553768117
    },
    {
        "content": "<p>You could go for <a href=\"http://annals.math.princeton.edu/articles/14284\" target=\"_blank\" title=\"http://annals.math.princeton.edu/articles/14284\">http://annals.math.princeton.edu/articles/14284</a> (Definitely hard, but not completely crazy :)</p>",
        "id": 161938945,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1553768467
    },
    {
        "content": "<p>I have a backlog of stuff to finish and write up. We'll see if that happens before or after the next formalization paper!</p>",
        "id": 161938977,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553768513
    },
    {
        "content": "<p>You've done an Annals paper -- you could do something else. Sander is a number theorist, right? Why not formalise one of the number theory <a href=\"http://www.claymath.org/millennium-problems\" target=\"_blank\" title=\"http://www.claymath.org/millennium-problems\">millenium problems</a> -- the Birch and Swinnerton-Dyer conjecture would be the natural one. In broad strokes I don't see any reason why the strategy you adopted couldn't work again. Sander would be capable of taking the conjecture apart and creating a document which you could work from. For extra brownie points you could formalise the refined version. It would not surprise me if (a) the weak version had been formalised before, in some form, in a theorem prover, and (b) the strong version had not. You would end up making several conjectures, for example you would have to state the known theorem, whose proof is extremely deep, that the L-function of the curve has analytic contuation to the point s=1. But then to state the weak form of the conjecture you would just need to prove the rank of an elliptic curve is finite, which Sander and you could do I'm certain, and formalise some basic definitions in complex analysis like the order of the zero of a function. To formalise the strong version would be much more of a challenge. You would have to formalise the conjecture that the Tate-Shaverevich group of an elliptic curve is finite, which needs the absolute Galois group of Q (any news on absolute Galois groups <span class=\"user-mention\" data-user-id=\"110044\">@Chris Hughes</span> <span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span> ), group cohomology (which is not hard, you only need H^1) and the Neron-Tate height, which again would require someone who knows some number theory taking the maths definition and porting it to Lean. For the fudge factors you would need Tate's algorithm over the p-adic numbers, but this would be easy to formalise given that you have the p-adic numbers.</p>",
        "id": 161941169,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1553770543
    },
    {
        "content": "<blockquote>\n<p>We'll submit this on Sunday. Any comments or suggestions before then are more than welcome.</p>\n</blockquote>\n<p>Couldn't you give an explicit and reasonable value for <code>B</code> in the main theorem (for <code>q=3</code>)? It would make the statement more neat, as you could put <code>n</code> and <code>A</code> and the fact that <code>A</code> has no arithmetic progression as assumptions  instead of stuff in the middle of a chain of implications</p>",
        "id": 161947062,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1553776236
    },
    {
        "content": "<p>And you don't need <code>n&gt;0</code> in this theorem, I think.</p>",
        "id": 161947130,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1553776322
    },
    {
        "content": "<p>We could give an explicit value. \"Reasonable\" isn't so clear, it isn't a pretty number. Honestly, I think it might make the statement messier, not neater.</p>",
        "id": 161947487,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553776637
    },
    {
        "content": "<p>Think you're right about the <code>n&gt;0</code>, thanks.</p>",
        "id": 161947517,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553776664
    },
    {
        "content": "<p>Don't give the optimal value with square roots and everything, use a larger integer. What about <code>B = 5</code>, say? Or is it rather <code>B = 10^{10}</code>?</p>",
        "id": 161947650,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1553776777
    },
    {
        "content": "<p>Oh, fair point. B is a little less than 56.</p>",
        "id": 161948065,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553777081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span>, do you plan to make Sander's blueprint public? I think it would be extremely helpful, as an example of a blueprint which is detailed enough for formalization. I'm sure <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> would love to see that</p>",
        "id": 161993396,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1553807674
    },
    {
        "content": "<p>It's up to Sander. The blueprint isn't written to be made public at the moment and it would take some effort to polish.</p>",
        "id": 161994216,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553808360
    },
    {
        "content": "<p>I wouldn't want to see a polished version. I'd like to see a version that was good enough for formalization, but without useless work.</p>",
        "id": 161995832,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1553809676
    },
    {
        "content": "<p>Patrick had a really hard time getting me to write a blueprint for the perfectoid project. I would just point to the literature and say \"what's wrong with that?\". And then every now and then I would run into a wall and say \"oh crap I wasn't expecting that, this will be some work to sort out\".</p>",
        "id": 162002509,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1553815785
    },
    {
        "content": "<p>Sander and I discussed this today. He'll make the writeup presentable and put it online soon, hopefully before the paper deadline on Sunday.</p>",
        "id": 162046785,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553866725
    },
    {
        "content": "<blockquote>\n<p>Don't give the optimal value with square roots and everything, use a larger integer. What about B = 5, say? Or is it rather B = 10^{10}?</p>\n</blockquote>\n<p>Turns out <code>B=198</code> works reasonably smoothly!</p>",
        "id": 162058649,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1553875301
    },
    {
        "content": "<p>The final draft of our paper, along with Sander's blueprint and our (still messy) Lean code, is here: <a href=\"https://lean-forward.github.io/e-g/\" target=\"_blank\" title=\"https://lean-forward.github.io/e-g/\">https://lean-forward.github.io/e-g/</a></p>",
        "id": 162181521,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1554049278
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> did you see Tim Gowers' question \"I wonder whether the slice rank argument has also been formalized.\" on Jordan's twitter feed?</p>",
        "id": 162182000,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1554050065
    },
    {
        "content": "<p><a href=\"https://twitter.com/wtgowers/status/1111356008029474816\" target=\"_blank\" title=\"https://twitter.com/wtgowers/status/1111356008029474816\">https://twitter.com/wtgowers/status/1111356008029474816</a></p>\n<div class=\"inline-preview-twitter\"><div class=\"twitter-tweet\"><a href=\"https://twitter.com/wtgowers/status/1111356008029474816\" target=\"_blank\"><img class=\"twitter-avatar\" src=\"https://pbs.twimg.com/profile_images/1083475911389954049/KzLcdZnE_normal.jpg\"></a><p><a href=\"https://twitter.com/JSEllenberg\" target=\"_blank\" title=\"https://twitter.com/JSEllenberg\">@JSEllenberg</a> I wonder whether the slice rank argument has also been formalized.</p><span>- Timothy Gowers (@wtgowers)</span></div></div>",
        "id": 162182001,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1554050089
    },
    {
        "content": "<p>Yes, I saw it. No, it hasn't. Sander added a line to the paper: \"We also note that Tao [30] reformulates Ellenberg and Gijswijt’s proof in a more symmetric way, using what is now called “slice rank.” Although this is arguably a more natural way to express things, the underlying arguments are essentially the same.\"</p>",
        "id": 162183485,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1554052523
    }
]