[
    {
        "content": "<p>This is not appropriate here but I'm not getting responses on SO.  So it may not be possible at this time and that is okay.  But how do you launch into debug mode a python application within VScode, using a command-line call?  I need this to aid in debugging BananaCats.  Bancats is written in Python 3.x.  I've already got the ability to set an executable to launch with arguments just by copying existing vscode-lean source.  So I need a command that goes into debug mode (running the app that I specify).  I also tried debugging with my python IDE and no luck there.  I'm getting the app to run, but the debug environment, no.  I figured that since Lean has some python in its source, that someone maybe had to do this before.  I mean I can debug Bancats normally, just not when it's spawned by the VScode extension.  There's only stdio to do on the bridge between the too, so theoretically shouldn't be too hard to debug, but later when I'm doing the logic stuff, it might be really helpful to debug normally.  OTOH, I could just have Bancats output code and I could copy / paste it into Lean, then copy/paste the response back perhaps.</p>",
        "id": 174642951,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1567305278
    },
    {
        "content": "<p><a href=\"https://stackoverflow.com/questions/25308847/attaching-a-process-with-pdb\" target=\"_blank\" title=\"https://stackoverflow.com/questions/25308847/attaching-a-process-with-pdb\">https://stackoverflow.com/questions/25308847/attaching-a-process-with-pdb</a></p>",
        "id": 174646070,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1567311820
    },
    {
        "content": "<p>Not sure that that helps.  I need a full-fledged debugging IDE, personally.  Here's my temporary solution:<br>\n<a href=\"/user_uploads/3121/aDj8F68yzELEusDKwdJSbRjf/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/aDj8F68yzELEusDKwdJSbRjf/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/3121/aDj8F68yzELEusDKwdJSbRjf/pasted_image.png\"></a></div>",
        "id": 174647076,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1567313930
    }
]