[
    {
        "content": "<p>We also have a version of <a href=\"#narrow/stream/113488-general/topic/LeanAide.20translation.3A.20Natural.20language.20to.20Lean.204/near/312761576\">the <code>LeanAide</code> tool</a> for Lean 3. It is hosted at this repository: <a href=\"https://github.com/0art0/lean3-statement-translation-tool\">https://github.com/0art0/lean3-statement-translation-tool</a>. Here is a demonstration of the tool in action:</p>\n<p><a href=\"/user_uploads/3121/32OkmhkPFKFg22xVvDjsOgo8/leanaide_demo.gif\">leanaide_demo.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/32OkmhkPFKFg22xVvDjsOgo8/leanaide_demo.gif\" title=\"leanaide_demo.gif\"><img src=\"/user_uploads/3121/32OkmhkPFKFg22xVvDjsOgo8/leanaide_demo.gif\"></a></div><p>A video with more details: <a href=\"/user_uploads/3121/EM-LIk4_6PJtAJ8Q-EEKBFXX/leanaide_demo.mkv\">leanaide_demo.mkv</a></p>\n<p>Instructions for trying out and using the tool are mentioned in the <code>Quickstart</code> section of the <code>README</code> file. Suggestions and contributions to the code are welcome. The tool will be maintained until we eventually switch to Lean 4 entirely. Feedback on the tool will also be highly appreciated.</p>",
        "id": 312762354,
        "sender_full_name": "Anand Rao",
        "timestamp": 1669693963
    },
    {
        "content": "<p>How does this differ in scope, method, tooling, or quality of results from <a href=\"https://marketplace.visualstudio.com/items?itemName=hoskinson-ml.lean-chat-vscode\">LeanChat</a> (<a href=\"https://github.com/zhangir-azerbayev/lean-chat\">repo</a>) (discussed in <a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/stream/219941-Machine-Learning-for-Theorem-Proving/topic/A.20chat.20interface.20for.20formalizing.20theorem.20statements\">#Machine Learning for Theorem Proving &gt; A chat interface for formalizing theorem statements</a> and <a class=\"stream-topic\" data-stream-id=\"219941\" href=\"/#narrow/stream/219941-Machine-Learning-for-Theorem-Proving/topic/Lean.20Chat.20is.20publicly.20available\">#Machine Learning for Theorem Proving &gt; Lean Chat is publicly available</a>)</p>",
        "id": 312836384,
        "sender_full_name": "Jason Rute",
        "timestamp": 1669726689
    },
    {
        "content": "<p>I think like LeanChat you are also translating statements only, right?</p>",
        "id": 312836560,
        "sender_full_name": "Jason Rute",
        "timestamp": 1669726746
    },
    {
        "content": "<p>Your tool looks to be more integrated into Lean, correct?  In particular, you can dynamically choose a prompt I think, but I'd have to remind myself of the details.</p>",
        "id": 312836938,
        "sender_full_name": "Jason Rute",
        "timestamp": 1669726853
    },
    {
        "content": "<p>And it checks that the result elaborates, which LeanChat doesn't do, right?</p>",
        "id": 312837369,
        "sender_full_name": "Jason Rute",
        "timestamp": 1669726978
    },
    {
        "content": "<p>But unlike LeanChat, it doesn't have a way to provide back any forth feedback to the model, at least in right now, correct/</p>",
        "id": 312837632,
        "sender_full_name": "Jason Rute",
        "timestamp": 1669727058
    },
    {
        "content": "<p>Yes, that's correct. The main difference with Lean Chat is the prompting strategy we use - input-dependent prompting instead of fixed-shot prompting. We have mined <code>mathlib</code> for Lean theorems and their corresponding doc-strings, and the Python code running on our server allows us to use sentence similarity to fetch statements from this database related to the sentence we want to translate. </p>\n<p>We have observed in <a href=\"https://mathai2022.github.io/papers/17.pdf\">our experiments</a> that the combination of input-dependent prompting and filtering by elaboration pushes up the number of successful translations to more than half. These experiments were done on a dataset consisting of single sentence, doc-string like statements at the undergraduate level.</p>\n<p>We also use Lean to pick up declarations from the same file that have doc-strings and append them to the prompt. This, in principle, allows the model to formalise concepts that were not in <code>mathlib</code> during its training, or even at the time we mined <code>mathlib</code> for the doc-strings. This is one of the reasons we have chosen to integrate our UI into Lean, as you mentioned.</p>\n<p>We are currently focused on just theorem translation, but we may expand to definition translation too in the next few months. Since we pick up declarations from the focused file, users can (implicitly) add to the prompt by adding theorems with doc-strings to the file in which they are working. We do not have a mechanism for back-and-forth feedback like Lean Chat, but our modifications also reduce the need for it (at least for the kinds of statements that we experimented on). We observed that passing the type-checking filter is a good proxy for actually being a valid Lean translation (though being type-correct may be less suitable as a proxy for multi-line statements or statements involving complicated formulae).</p>",
        "id": 312858145,
        "sender_full_name": "Anand Rao",
        "timestamp": 1669733001
    },
    {
        "content": "<p>One additional point to the above (though this is stronger in the Lean 4 interface) we feel that integrating with the editor is more ergonomic, quite a bit like copilot. In the Lean 4 interface, the user types a comment and this can be translated, with the comment becoming a doc-string.</p>\n<p>But as Anand said, the biggest difference is input-dependent prompting and filtering completions by elaboration. We also do a bit of auto-correction.</p>",
        "id": 312863616,
        "sender_full_name": "Siddhartha Gadgil",
        "timestamp": 1669734520
    }
]