[
    {
        "content": "<p>Hopefully, everybody potentially interested already knows, but I'd like to make sure nobody is surprisingly around, or surprisingly interested in pure math. There will be a small Lean mathematically inclined users meeting in Orsay (near Paris) on August 27th-29th. The main idea was to capture people who will be in <a href=\"https://www.dagstuhl.de/en/program/calendar/semhp/?semnr=18341\" target=\"_blank\" title=\"https://www.dagstuhl.de/en/program/calendar/semhp/?semnr=18341\">Dagstuhl</a> on the preceding week but are usually on other continents. There will be Chris, Johan, Johannes, Kevin, Mario, Rob, Scott, and me. Hopefully we'll have fun with advanced math and Lean.</p>",
        "id": 130263048,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1532508544
    },
    {
        "content": "<p>Are Chris and Kevin also from another continent?</p>",
        "id": 130263119,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1532508612
    },
    {
        "content": "<p>they'll soon be</p>",
        "id": 130263151,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1532508692
    },
    {
        "content": "<p>Johan, I guess you never went to the UK, right? I spent six months in York when I was undergrad, and I was called an \"overseas student\". I was \"from the continent\". And this was almost 15 years before Brexit.</p>",
        "id": 130263307,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1532508875
    },
    {
        "content": "<p>More seriously, that part of the message was meant as an excuse for the somehow inconvenient dates. Of course I'm super happy to also have people would could come to Orsay at any time.</p>",
        "id": 130263595,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1532509253
    },
    {
        "content": "<p>It is absolutely true that in this country we describe holidays in e.g. Spain as \"holidays in Europe\". That has been true for at least 30 years. We have an island mentality here.</p>",
        "id": 130263880,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1532509706
    }
]