[
    {
        "content": "<p>I would like to use the framework provided by the Lean blueprint package (tex building, dep graph management, links to descriptions) for a non-lean technical and scientific project. Are there any good tips for doing so? On particular, I'd like to start out with a dep graph first and flesh out the descriptions later. <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span></p>",
        "id": 283229142,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1653221466
    },
    {
        "content": "<p>I've been meaning to make a separate plugin without Lean stuff forever, but it simply never reaches the top of the priority pile. In principle this isn't difficult at all, you can simply get the code at <a href=\"https://github.com/PatrickMassot/leanblueprint/\">https://github.com/PatrickMassot/leanblueprint/</a> and remove all Lean stuff. What would be even nicer (but would take a lot more time) would be to avoid creating duplicated code by having a non-Lean plasTeX plugin and then the leanblueprint one working on top of this general purpose one.</p>",
        "id": 283250703,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1653251937
    },
    {
        "content": "<p>Sorry to dredge up this old conversation, but I wanted to get leanblueprint working on a non-Lean 3 (actually a Lean 4) formalization project, so I made a fork that I think gets rid of all the Lean stuff: <a href=\"https://github.com/mpenciak/noleanblueprint\">https://github.com/mpenciak/noleanblueprint</a>. </p>\n<p>I kind of just followed my nose for the most part and got rid of the <code>leanproject</code> specific stuff, so I don't know if I did it absolutely correctly.</p>",
        "id": 289056319,
        "sender_full_name": "Matej Penciak",
        "timestamp": 1657392058
    },
    {
        "content": "<p>It works well enough for my purposes so far though (we're using it in the <a href=\"https://github.com/yatima-inc/ZKSnark.lean\">https://github.com/yatima-inc/ZKSnark.lean</a> repo)</p>",
        "id": 289056473,
        "sender_full_name": "Matej Penciak",
        "timestamp": 1657392276
    },
    {
        "content": "<p>Could you at least open an issue in the leanblueprint repo so that I don't forget? Right now I don't have any time for this.</p>",
        "id": 289058173,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1657394614
    }
]