[
    {
        "content": "<p>The perfectoid project is now 11,000 lines long. A couple of times recently I have idly typed \"lean --make\" to compile it, and brought my (16 gigs of ram) machine down -- it becomes unresponsive, the keyboard lights don't work and I can't ssh into it, and I've had to reboot. More recently (I'm on Ubuntu) I've been typing <code>ulimit -Sv 8000000</code> in the terminal window I use to compile the project, and this stopped the problem occurring until today, where I wasn't even compiling: VS Code just decided to recompile a few files and my system was taken down again.</p>\n<p>I am on Ubuntu 18.04 with <em>no swap</em> (because I have an SSD). I am wondering whether enabling swap will give me extra time to survive the next time this happens; I have an external HDD drive now.</p>",
        "id": 163745005,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555690016
    },
    {
        "content": "<p>I mean every time I run Lean my laptop turns scorching hot</p>",
        "id": 163745598,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1555690619
    },
    {
        "content": "<p>Yes but that just means it's using all the cores. Lean shouldn't take your system down; that means it's filled all the memory.</p>",
        "id": 163745649,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555690662
    },
    {
        "content": "<p>Now when this happens Lean will start using my swap space, so I'll hear the external HD fire up and start going like crazy, and that will be the signal to kill everything.</p>",
        "id": 163745716,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555690721
    },
    {
        "content": "<p>could try <a href=\"https://github.com/rfjakob/earlyoom\" target=\"_blank\" title=\"https://github.com/rfjakob/earlyoom\">https://github.com/rfjakob/earlyoom</a></p>",
        "id": 163749357,
        "sender_full_name": "matt rice",
        "timestamp": 1555694624
    },
    {
        "content": "<p>Well, I now have a 4GB swapfile on my external hard drive. Let's see how things go now. I like the look of earlyoom though.</p>",
        "id": 163749596,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1555694820
    }
]