[
    {
        "content": "<p>The CoCalc talk in another thread reminded me that I should start getting things ready for my course next year. This led to a chat with <span class=\"user-mention\" data-user-id=\"128565\">@Harald Schilly</span> about how CoCalc installs Lean/mathlib. Irrelevant for my course, but probably relevant to others, so I'm bringing it here.</p>\n<p>It would probably be good to install Lean through the version manager elan, with a reasonable default version (3.5.1?) and a handful of options pre-installed. Right now it's a plain install of a 3.4.2 binary.</p>\n<p>What about pre-installing versions of mathlib? leanpkg has a notion of a global install of a package. But I'm not sure it's the best move here. <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> doesn't think it will play well with elan. And it probably interacts badly with non-global mathlib dependencies, which people might use if they want a newer version than whatever CoCalc gives.</p>\n<p>CoCalc could provide directories containing (compiled) mathlibs for each Lean version it pre-installs. Users would have to set up projects with leanpkg.toml files pointing to the right spot. Fine for courses that can distribute this project, trickier for someone who just wants to open a .lean file in CoCalc and start using real numbers.</p>\n<p>As I understand it, free CoCalc doesn't allow accessing external websites. So adding packages from GitHub won't work, nor will elan on new versions of Lean, nor will cache-olean/update-mathlib. This is why I'm suggesting pre-installing things, although of course this a reason to pay for CoCalc :) </p>\n<p>Thoughts? ( cc <span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> )</p>",
        "id": 188563583,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582132014
    },
    {
        "content": "<p>I can tell you that by default it is very confusing for people to get access to mathlib on CoCalc if they aren't experts.   We CoCalc admins definitely do NOT know what to do in order to make mathlib (or other libraries?) available by default, though we've tried and failed repeatedly.    If you want to see precisely what our lean install is on cocalc now, just open a Terminal in any cocalc project (+New --&gt; Terminal), then type <code>cd /ext/lean</code> and <code>ls</code>:</p>",
        "id": 188564988,
        "sender_full_name": "William Stein",
        "timestamp": 1582133017
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>\n</pre></div>",
        "id": 188564993,
        "sender_full_name": "William Stein",
        "timestamp": 1582133020
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>/ext/lean$ ls\nlean  lean-3.4.1-linux  lean-3.4.2-linux\n/ext/lean$ which lean\n/ext/bin/lean\n/ext/lean$ ls -l lean\nlrwxrwxrwx 1 salvus salvus 16 Feb 12  2019 lean -&gt; lean-3.4.2-linux\n/ext/lean$ cd lean-3.4.2-linux/\n/ext/lean/lean-3.4.2-linux$ ls\nbin  include  lib  mathlib  mathlib-lean-3.4.2\n/ext/lean/lean-3.4.2-linux$ lean --path\n{\n  &quot;is_user_leanpkg_path&quot;: true,\n  &quot;leanpkg_path_file&quot;: &quot;/home/user/.lean/leanpkg.path&quot;,\n  &quot;path&quot;: [\n    &quot;/ext/lean/lean-3.4.2-linux/bin/../library&quot;,\n    &quot;/ext/lean/lean-3.4.2-linux/bin/../lib/lean/library&quot;\n  ]\n}\n</pre></div>\n\n\n<p>Note that we have a copy of mathlib but it's not in either of the directories of the default lean search path, which might be why it doesn't work.  Should we move it into a subdirectory called \"library\"?</p>",
        "id": 188565163,
        "sender_full_name": "William Stein",
        "timestamp": 1582133125
    },
    {
        "content": "<p>The <code>library</code> subdirectory is for the core Lean library. I'm guessing you'd have trouble moving mathlib there. With your current setup, you can do the following:</p>\n<div class=\"codehilite\"><pre><span></span>~$ leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/\n</pre></div>\n\n\n<p>(don't do it inside <code>/ext/lean/lean-3.4.2-linux/</code>, apparently). This is a global install of mathlib so it should be available whenever you open a Lean file -- you might need  to restart the Lean server if it was running already.</p>",
        "id": 188566515,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582134050
    },
    {
        "content": "<p>This is fine if your users are okay with a fixed version of Lean and mathlib.</p>",
        "id": 188566571,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582134118
    },
    {
        "content": "<p>One can think that users of CoCalc don't need many versions of mathlib (they would use Lean locally if they were that serious about it). But I'm worried for teachers: what if I start a course using mathlib and suddenly CoCalc updates mathlib? What I did last year was to distribute a compiled mathlib using CoCalc distribution mechanism. Let's dream a bit here. Let's say some script downloads a mathlib nightly on the first of every month and call it <code>mathlib_january</code> etc. Then users could add a leanpkg dependency to <code>mathlib_february</code> or something. Then every year automatically erases ancient mathlibs.</p>",
        "id": 188567078,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582134426
    },
    {
        "content": "<p>This shouldn't be a Lean specific issue however. What happens to existing projects when Sage is updated? I guess Sage has some breaking changes from times to times.</p>",
        "id": 188567134,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582134475
    },
    {
        "content": "<blockquote>\n<p>This shouldn't be a Lean specific issue however. What happens to existing projects when Sage is updated? I guess Sage has some breaking changes from times to times.</p>\n</blockquote>\n<ol>\n<li>\n<p>We keep all past versions of Sage, and have a sage_select command so users can choose a default.  Right now things are extra complicated because the last Sage update was python2 --&gt; python3!    With Jupyter the situation is very good since there is no default sage version  for Jupyter notebooks  -- you have to explicitly choose a version the first time, and then it defaults to that afterwards and is encoded in the ipynb file, so you get that version henceforth when using that notebook.  If an instructor prepares course materials with Sage-8.9, then all students will be using sage-8.9 when they open that notebook, even if we installed sage-9.1... unless sage-8.9 isn't available and then they get a message and select from the closes related kernel.       This is one thing  Jupyter really got right. </p>\n</li>\n<li>\n<p>We do have several point in time <em>snapshots</em> of the entire (several hundred GB) install stack for a project, which can be selected in project settings.  Then no matter what upgrades happen for a default cocalc project, they don't happen for that project.   People asked for this, but in practice don't use it much -- for most software, people tend to prefer the newest version with whatever bugfixes are in it (plus documentation parity with the web) to a static version.   We also have many completely custom images (using the mybinder spec) and some classes use this for the whole class.    We could do more to make this more straightforward to use though.</p>\n</li>\n</ol>",
        "id": 188569371,
        "sender_full_name": "William Stein",
        "timestamp": 1582135915
    },
    {
        "content": "<p>We'll try <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code>since this will at least be a good start.   Would this break people being able to install their own mathlib locally that overrides the global one?</p>",
        "id": 188569552,
        "sender_full_name": "William Stein",
        "timestamp": 1582136029
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188566515\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188566515\">said</a>:</p>\n<div class=\"codehilite\"><pre><span></span>```\n~$ leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/\n```\n(don&#39;t do it inside `/ext/lean/lean-3.4.2-linux/`, apparently).\n</pre></div>\n\n\n<p>Sorry, I'm not 100% sure about that. Does it matter in which directory I run that <code>leanpkg install</code> ? Not inside the one you mention?</p>",
        "id": 188569885,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582136264
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116034\">William Stein</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188569552\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188569552\">said</a>:</p>\n<blockquote>\n<p>We'll try <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code>since this will at least be a good start.   Would this break people being able to install their own mathlib locally that overrides the global one?</p>\n</blockquote>\n<p>I'm not sure -- will try to test locally. Maybe someone else here knows off the top of their head? :)</p>",
        "id": 188570395,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582136604
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"137337\">Harald Schilly</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188569885\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188569885\">said</a>:</p>\n<blockquote>\n<p>Sorry, I'm not 100% sure about that. Does it matter in which directory I run that <code>leanpkg install</code> ? Not inside the one you mention?</p>\n</blockquote>\n<p>Running <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code> anywhere outside of <code>/ext/lean</code> should be fine, is my guess. I got weird errors when I did it there, but then I switched to <code>~</code> and it worked.</p>",
        "id": 188570620,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582136758
    },
    {
        "content": "<p>Oh, I think it has to be done somewhere you have write access.</p>",
        "id": 188570770,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582136880
    },
    {
        "content": "<p>That's why it didn't work in <code>/ext/lean</code>.</p>",
        "id": 188570828,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582136897
    },
    {
        "content": "<p>ok, I tried that <code>leanpkg install ...</code>and all that happened was it changed files in my <code>$HOME/.lean</code> directory.</p>\n<p>So, just to clarify: what we here at cocalc aim for is to have lean + mathlib + other libs (if there is a need) at a global location, which is read-only. That directory is accessible from each and every project on cocalc. Then, when lean starts, it should pick up that global mathlib. With Linux or Python, it is possible to tweak a <code>PATH</code> or <code>PYTHONPATH</code> variable, containing a list of directories where it should search for binaries or a library. I suppose with LEAN there is nothing like that and you have to configure this in your local directory? If that's the case, this might only work if we install mathlib + other libs in that <code>builtin_path</code> directory (I saw that in a <code>leanpkg.path</code> file)</p>",
        "id": 188570886,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582136941
    },
    {
        "content": "<p>ok, hmm, I think I should read up in detail what the install command is doing.</p>",
        "id": 188571005,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582137006
    },
    {
        "content": "<p>Note: Rob points out that some of this post is incorrect</p>\n<p>I think <code>install</code> is how a user installs dependencies for their project. For example many mathematics projects have a dependency on mathlib. The <code>install</code> command, for me, would edit <code>leanpkg.toml</code> to indicate that my project relies on mathlib (or more precisely on a certain commit of mathlib). Then <code>leanpkg configure</code> would download that particular commit and put it into <code>_target</code>, and then, if you have all the user tools installed, <code>update-mathlib</code> would download compiled binaries for the version of mathlib you chose. </p>\n<p>Having a stable version of Lean is eminently sensible. 3.5.1 is just a bugfix for 3.4.2 really, I think, so you should probably use that. But I have always downloaded my own mathlibs when using lean on cocalc, because different project rely on different things and mathlib changes can be non-backwards-compatible.</p>",
        "id": 188571390,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582137305
    },
    {
        "content": "<p>I just tried typing <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code> in a cocalc project, then creating a lean file and putting a bunch of code that uses mathlib from <a href=\"https://github.com/leanprover-community/mathlib/blob/master/docs/theories/naturals.md\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/master/docs/theories/naturals.md\">here</a> in, and it works (no errors in output).</p>",
        "id": 188571963,
        "sender_full_name": "William Stein",
        "timestamp": 1582137712
    },
    {
        "content": "<p>Kevin, <code>leanpkg install</code> is different than <code>leanpkg add</code>.</p>",
        "id": 188572058,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582137760
    },
    {
        "content": "<p>Hmm. When you're outside a Lean project (ie no leanpkg.toml in a directory below you), the <code>leanpkg_path_file</code> value shown by <code>lean --path</code> is different. It doesn't exist on my machine. I wonder if creating that file would act as a \"default\" path file, and what exactly needs to go in to direct it to a default mathlib install.</p>",
        "id": 188572277,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582137912
    },
    {
        "content": "<p>I could make it so that when cocalc is about to start the lean server it first checks to see if ~/.lean is empty, and in that case runs <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code>.  Then mathlib would work for random users (esp without internet access on cocalc), but if anybody needs to do something custom, they can just delete and customize ~/.lean however they want and it won't get touched.</p>",
        "id": 188572285,
        "sender_full_name": "William Stein",
        "timestamp": 1582137922
    },
    {
        "content": "<p>Anyway, making a change to run a leanpkg install of mathlib when first running lean wouldn't be too hard...  it also doesn't waste disk space.</p>",
        "id": 188572401,
        "sender_full_name": "William Stein",
        "timestamp": 1582138002
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"116034\">William Stein</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188572285\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188572285\">said</a>:</p>\n<blockquote>\n<p>I could make it so that when cocalc is about to start the lean server it first checks to see if ~/.lean is empty, and in that case runs <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code>.  Then mathlib would work for random users (esp without internet access on cocalc), but if anybody needs to do something custom, they can just delete and customize ~/.lean however they want and it won't get touched.</p>\n</blockquote>\n<p>That would work, except manually editing a hidden directory isn't the normal way people will try to update mathlib. More likely they'll have a local Lean project and run <code>leanpkg add ...</code> to get a copy from GitHub. The pre-installed one might still be available and cause conflicting imports, I'm not sure.</p>",
        "id": 188572459,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582138047
    },
    {
        "content": "<p>My main motivation is new students and random people who want to solve some problems using mathlib + lean that say <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  tweets about.   They wouldn't have access to github if they are using cocalc for free, and anyways it would be nice to avoid the friction of opening a terminal and using <code>leanpkg add</code>.  The question is if both of these audiences can be served without confusion.</p>",
        "id": 188572689,
        "sender_full_name": "William Stein",
        "timestamp": 1582138209
    },
    {
        "content": "<p>Right. It seems like a reasonable default.</p>",
        "id": 188572755,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582138272
    },
    {
        "content": "<blockquote>\n<p>That would work, except manually editing a hidden directory isn't the normal way people will try to update mathlib. </p>\n</blockquote>\n<p>If one does <code>leanpkg install /ext/lean/lean-3.4.2-linux/mathlib-lean-3.4.2/</code> in a clean account, then later does <code>leanpkg add ...</code>, what happens?   Maybe the second command gives them the latest mathlib version and all is good?</p>",
        "id": 188572765,
        "sender_full_name": "William Stein",
        "timestamp": 1582138278
    },
    {
        "content": "<p>I've made this issue, which I'll look into later today (have to go now): <a href=\"https://github.com/sagemathinc/cocalc/issues/4393\" target=\"_blank\" title=\"https://github.com/sagemathinc/cocalc/issues/4393\">https://github.com/sagemathinc/cocalc/issues/4393</a></p>",
        "id": 188572960,
        "sender_full_name": "William Stein",
        "timestamp": 1582138406
    },
    {
        "content": "<p>I'm starting a VM to try it from a clean slate.</p>",
        "id": 188572962,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582138406
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> thanks.   You can also easily get a new anonymous throw-away cocalc project by opening the following link in a private browsing session:  <a href=\"https://cocalc.com/app?anonymous=true\" target=\"_blank\" title=\"https://cocalc.com/app?anonymous=true\">https://cocalc.com/app?anonymous=true</a>  </p>\n<p>Never mind -- that wouldn't have internet access.</p>",
        "id": 188573083,
        "sender_full_name": "William Stein",
        "timestamp": 1582138480
    },
    {
        "content": "<p>Okay, I think you're safe with this setup. Run <code>leanpkg install /ext/...</code> in/below <code>~</code>. If someone creates a Lean project anywhere in <code>~</code>, the new <code>leanpkg.path</code> seems to override the global install. This happens whether or not mathlib is added to the project with <code>leanpkg add</code>. The global install is unavailable in the project as soon as the project is created.</p>",
        "id": 188574943,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582139651
    },
    {
        "content": "<p>I implemented this and it is NOW live in CoCalc.  mathlib will \"just work\" with no manual intervention by users for any newly started (or restarted) project that doesn't already have a ~/.lean directory.   In particular, <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> you could post lean files on <a href=\"http://share.cocalc.com\" target=\"_blank\" title=\"http://share.cocalc.com\">share.cocalc.com</a> that rely on mathlib, and when people open that content (e.g, as an anonymous user), it'll work (or at least lack of mathlib won't be the issue).</p>\n<p>Here's an example on the share server: <a href=\"https://share.cocalc.com/share/df81e09e5b8f16f28b3a2e818dcdd4560e7818ae/support/2020-02-19-lean-natural-numbers.lean?viewer=share\" target=\"_blank\" title=\"https://share.cocalc.com/share/df81e09e5b8f16f28b3a2e818dcdd4560e7818ae/support/2020-02-19-lean-natural-numbers.lean?viewer=share\">https://share.cocalc.com/share/df81e09e5b8f16f28b3a2e818dcdd4560e7818ae/support/2020-02-19-lean-natural-numbers.lean?viewer=share</a></p>\n<p>If somebody clicks the green button to open the document it should work, automatically adding support for mathlib on first use of lean and they will see this:</p>\n<p><a href=\"/user_uploads/3121/fTdoCsfC6n-NMherT6YEj4uK/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/fTdoCsfC6n-NMherT6YEj4uK/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/3121/fTdoCsfC6n-NMherT6YEj4uK/pasted_image.png\"></a></div><p>I'm guessing the error involving <code>example (p : ℕ) : prime p → p ≥ 2 := prime.two_le</code> is due to our version of mathlib being slightly old.   <span class=\"user-mention\" data-user-id=\"137337\">@Harald Schilly</span> should update the mathlib version soon and then it'll work, presumably (I don't know).</p>",
        "id": 188600629,
        "sender_full_name": "William Stein",
        "timestamp": 1582158830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> <span class=\"user-mention\" data-user-id=\"137337\">@Harald Schilly</span> Wow! Thanks a lot for all your effort.</p>",
        "id": 188614366,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582181683
    },
    {
        "content": "<p>Thanks for this William. I'm giving a talk in Oxford today and if I get it working before then I'll showcase it</p>",
        "id": 188617055,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582185694
    },
    {
        "content": "<p>Awesome!</p>",
        "id": 188617518,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582186240
    },
    {
        "content": "<p>A small note, if you're going to update the mathlib version you might as well update the Lean version as well. I'd recommend using 3.5.1 from here: <a href=\"https://github.com/leanprover-community/lean/releases\" target=\"_blank\" title=\"https://github.com/leanprover-community/lean/releases\">https://github.com/leanprover-community/lean/releases</a></p>",
        "id": 188617638,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582186396
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188617638\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188617638\">said</a>:</p>\n<blockquote>\n<p>... recommend using 3.5.1 ...</p>\n</blockquote>\n<p>thank you, I discovered that already. However, regarding mathlib, my impression is that it is fine to grab the master-tip of the repository, but there are also \"snapshot\" like releases in it's repo. Last one from Oct'19, though. I'm aware of that mathlib-tool, and reading the sources of that script, it looks like grabbing the nightly build is what I should do. For me, as an \"outsider\" to lean, this is a little bit confusing ^^</p>",
        "id": 188619668,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582188887
    },
    {
        "content": "<p>I think it's extra complicated because the CoCalc install isn't (and shouldn't be) following the \"standard\" installation model.</p>",
        "id": 188620172,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189434
    },
    {
        "content": "<p>I have no idea what the snapshot releases in the mathlib repo are for. Maybe we should delete those?</p>",
        "id": 188620223,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189458
    },
    {
        "content": "<p>Using the master tip of mathlib is fine, if you're building it yourself. There are supporting scripts for downloading pre-built olean files. But there's no need to install them in CoCalc. You could do it locally to create the mathlib image if you wanted.</p>",
        "id": 188620317,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189559
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 188620407,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189614
    },
    {
        "content": "<p>The easiest way to get a fully built mathlib repo manually is through the CI. Download the build artifact here: <a href=\"https://github.com/leanprover-community/mathlib/runs/456786112\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/runs/456786112\">https://github.com/leanprover-community/mathlib/runs/456786112</a></p>",
        "id": 188620505,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189685
    },
    {
        "content": "<p>That will give you the master version of mathlib with pre-built oleans.</p>",
        "id": 188620532,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582189731
    },
    {
        "content": "<p>thank you <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> … yes, it's different. So, what I ended up is writing a script to grab the latest nightly build of mathlib from the mathlib-nightly repo. Just one minor detail was off: it extracts as \"src/*\" without these two toml and path files. I ended up writing them on my own, without specifying the lean version. With what <span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> came up with will point to the matlib path, which will be next to the default version of lean we at cocalc symlink to. Therefore, the mathlib package will correspond to whatever the default version is, i.e. 3.5.1 right now.</p>",
        "id": 188622620,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582191584
    },
    {
        "content": "<p>net result: the file william shared yesterday will process fine, see screenshot below. This isn't live on cocalc yet, but will be part of our next update (during the weekend). </p>\n<p><a href=\"/user_uploads/3121/TQg6twJfkNI-F4HCDdkl4ttN/2020-02-20-lean-mathlib-3.5.1-cocalc.png\" target=\"_blank\" title=\"2020-02-20-lean-mathlib-3.5.1-cocalc.png\">2020-02-20-lean-mathlib-3.5.1-cocalc.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/TQg6twJfkNI-F4HCDdkl4ttN/2020-02-20-lean-mathlib-3.5.1-cocalc.png\" target=\"_blank\" title=\"2020-02-20-lean-mathlib-3.5.1-cocalc.png\"><img src=\"/user_uploads/3121/TQg6twJfkNI-F4HCDdkl4ttN/2020-02-20-lean-mathlib-3.5.1-cocalc.png\"></a></div>",
        "id": 188622884,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582191778
    },
    {
        "content": "<blockquote>\n<p>I have no idea what the snapshot releases in the mathlib repo are for. Maybe we should delete those?</p>\n</blockquote>\n<p>Does anyone has enough admin power to get rid of those? They are useless and confusing.</p>",
        "id": 188622900,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582191790
    },
    {
        "content": "<p>Nice! Sounds good to me :)</p>",
        "id": 188624357,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582192988
    },
    {
        "content": "<p>Yeah, let's figure out how to delete the snapshots. We're certain they aren't used for anything, right?</p>",
        "id": 188624379,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582193013
    },
    {
        "content": "<p>The dates clearly prove they aren't used for anything.</p>",
        "id": 188624624,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582193251
    },
    {
        "content": "<p>The snapshot is related to some kind of package manager <span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> was working on at some point. I'm not going to delete that one.</p>",
        "id": 188625589,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582194060
    },
    {
        "content": "<p>The others are gone.</p>",
        "id": 188625596,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582194069
    },
    {
        "content": "<p>Harald and William, how does all this conversation relate to <a href=\"https://github.com/sagemathinc/cocalc/issues/3589\" target=\"_blank\" title=\"https://github.com/sagemathinc/cocalc/issues/3589\">https://github.com/sagemathinc/cocalc/issues/3589</a>? Did you also solve that?</p>",
        "id": 188626020,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582194497
    },
    {
        "content": "<p>The ticke is still open, so I assume the server starts in the home directory. </p>\n<p>One question about the logic: if running <code>lean -p</code> in the directory where the <code>.lean</code> file is says <code>is_user_leanpkg_path</code> is <code>true</code> → start the lean server in <code>$HOME</code>. If it is <code>false</code> → start it in the directory where <code>leanpkg_path_file</code> is. Correct?</p>",
        "id": 188628614,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582197252
    },
    {
        "content": "<p>We should make the logic crystal clear on the ticket, that's all. The implementation shouldn't be hard...</p>",
        "id": 188628652,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582197329
    },
    {
        "content": "<p>It would be nice if someone who knows more about when Lean does could have a look. Maybe Gabriel or Rob?</p>",
        "id": 188645722,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582211285
    },
    {
        "content": "<p><a href=\"https://share.cocalc.com/share/f014cd1885a22e8665a728be825e563fc79b7e1f/Maths_Challenges/?viewer=share\" target=\"_blank\" title=\"https://share.cocalc.com/share/f014cd1885a22e8665a728be825e563fc79b7e1f/Maths_Challenges/?viewer=share\">Maths challenges for the Lean curious on CoCalc</a> got demoed in Oxford today and it was slow but ultimately worked fine. In particular mathlib imports work fine (I couldn't get them to work with shared projects yesterday).</p>",
        "id": 188649030,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582213308
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"116034\">@William Stein</span> is it slow because Oxford is a long way from Seattle or something?</p>",
        "id": 188649089,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582213333
    },
    {
        "content": "<p>I find it distracting that CoCalc is constantly displaying help on the tactic under cursor. VScode doesn't do that.</p>",
        "id": 188651786,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582214894
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188649089\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188649089\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"116034\">William Stein</span> is it slow because Oxford is a long way from Seattle or something?</p>\n</blockquote>\n<ol>\n<li>What precisely was slow?  2. the CoCalc servers are on the east coast of the US.</li>\n</ol>",
        "id": 188673735,
        "sender_full_name": "William Stein",
        "timestamp": 1582229914
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188651786\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188651786\">said</a>:</p>\n<blockquote>\n<p>I find it distracting that CoCalc is constantly displaying help on the tactic under cursor. VScode doesn't do that.</p>\n</blockquote>\n<p>Can you clarify this? Do you mean that a panel off to the right is displaying something when it shouldn't?  What's a minimal example to reproduce this?    CoCalc just takes exactly the same LSP language server protocol data as VSCode and displays it, though how it does so is different.</p>",
        "id": 188673868,
        "sender_full_name": "William Stein",
        "timestamp": 1582230005
    },
    {
        "content": "<p>Compare <a href=\"/user_uploads/3121/6_GRBHMTAiHS112R1HhhXnc1/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a> and <a href=\"/user_uploads/3121/C3xc17pNA59rAAvP8x9KsejV/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/6_GRBHMTAiHS112R1HhhXnc1/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/3121/6_GRBHMTAiHS112R1HhhXnc1/pasted_image.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/3121/C3xc17pNA59rAAvP8x9KsejV/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/3121/C3xc17pNA59rAAvP8x9KsejV/pasted_image.png\"></a></div>",
        "id": 188674277,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582230321
    },
    {
        "content": "<p>This is the exact same Lean code with the cursor at the same place.</p>",
        "id": 188674302,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582230345
    },
    {
        "content": "<p>But the CoCalc version has an extra line at the bottom right, documenting the sorry tactic.</p>",
        "id": 188674355,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582230372
    },
    {
        "content": "<p>Thanks.  In VSCode how does one display the help?      In CoCalc it would probably be very easy to change things so that the help is always displayed in a completely separate panel, and if you don't want to see it, you just close that panel...   Would that work for you?</p>",
        "id": 188675291,
        "sender_full_name": "William Stein",
        "timestamp": 1582231133
    },
    {
        "content": "<p>(By the way, CoCalc has dark mode editor themes, and also an overall dark mode for the whole UI -- look in Account --&gt; Preferences.)</p>",
        "id": 188675329,
        "sender_full_name": "William Stein",
        "timestamp": 1582231176
    },
    {
        "content": "<p>In VScode that help would show up as a tooltip if you hover over \"sorry\".</p>",
        "id": 188675404,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582231232
    },
    {
        "content": "<p>The solution you describe would work.</p>",
        "id": 188675419,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582231245
    },
    {
        "content": "<p>I have a memory that in the community web editor the behaviour is the same as in CoCalc. But I can't get the community web editor to work right now.</p>",
        "id": 188675479,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582231293
    },
    {
        "content": "<p>I've created an issue: <a href=\"https://github.com/sagemathinc/cocalc/issues/4403\" target=\"_blank\" title=\"https://github.com/sagemathinc/cocalc/issues/4403\">https://github.com/sagemathinc/cocalc/issues/4403</a></p>",
        "id": 188676090,
        "sender_full_name": "William Stein",
        "timestamp": 1582231736
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 188676447,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582231950
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> this is implemented and now live at <a href=\"https://cocalc.com\" target=\"_blank\" title=\"https://cocalc.com\">https://cocalc.com</a>.  Refresh your browser to see the change.  The panel layout doesn't change for files you already have open, but a new \"Help\" panel appears for newly opened files.  Also, help only goes to the help panel (starting now, even with existing files).</p>",
        "id": 188679503,
        "sender_full_name": "William Stein",
        "timestamp": 1582233766
    },
    {
        "content": "<p>Kevin's stuff is not responding right now. I tried logging in my account and accessing the Lean project where we tried stuff last year but it simply hangs at Parsing at line 1.</p>",
        "id": 188680259,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234292
    },
    {
        "content": "<p>Unfortunately this is my typical CoCalc experience. When it works it's great, but when it doesn't work there is nothing you can do or investigate.</p>",
        "id": 188680351,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234341
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/SP9KAD_Z2NobQg-4MPHPTf2W/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/SP9KAD_Z2NobQg-4MPHPTf2W/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/3121/SP9KAD_Z2NobQg-4MPHPTf2W/pasted_image.png\"></a></div>",
        "id": 188680490,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234435
    },
    {
        "content": "<p>Now I have a lot of error messages:</p>\n<div class=\"codehilite\"><pre><span></span>invalid import: data.real.basic\n/home/user/_target/deps/mathlib/data/real/basic.lean:275:13: error: unexpected token\n 4:10 error\nexcessive memory consumption detected at &#39;is_def_eq&#39; (potential solution: increase memory consumption threshold)\n 6:0 error\nexcessive memory consumption detected at &#39;replace&#39; (potential solution: increase memory consumption threshold)\n</pre></div>",
        "id": 188680727,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234584
    },
    {
        "content": "<p>This is all in the project we share.</p>",
        "id": 188680736,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234594
    },
    {
        "content": "<p>But it works in my teaching project from last year.</p>",
        "id": 188680890,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582234685
    },
    {
        "content": "<p>I've just released the software update, that includes the newer lean/mathlib setup. So, in CoCalc, projects have a \"software environment\" setting (in project settings → project control). \"Default\" is what I just updated and if your project is still running from before the update, you have to restart it to get the update. If you're set to \"Experimental\", you're one step ahead and use what will be the Default soon.</p>",
        "id": 188715408,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582277467
    },
    {
        "content": "<p>In any case, I just tested it <a href=\"https://share.cocalc.com/share/f014cd1885a22e8665a728be825e563fc79b7e1f/Maths_Challenges/?viewer=share\" target=\"_blank\" title=\"https://share.cocalc.com/share/f014cd1885a22e8665a728be825e563fc79b7e1f/Maths_Challenges/?viewer=share\">with these challenges</a> via an anonymous account. clicking the button copies all these files into a fresh project and when I open up a solution, it works.</p>",
        "id": 188715513,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582277535
    },
    {
        "content": "<p>I'll try to remember posting here when we're about to update anything regarding LEAN. If there are any requests, you can ping me as well.</p>",
        "id": 188715538,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582277574
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 188715785,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582277811
    },
    {
        "content": "<p>Kevin, how did you setup up the challenges so that anyone can play via anonymous accounts?</p>",
        "id": 188715813,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582277832
    },
    {
        "content": "<p>By the way, I just tried the first challenge and it worked perfectly.</p>",
        "id": 188715832,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1582277859
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188715813\" title=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/188715813\">said</a>:</p>\n<blockquote>\n<p>Kevin, how did you setup up the challenges so that anyone can play via anonymous accounts?</p>\n</blockquote>\n<p>this is all via <a href=\"https://doc.cocalc.com/share.html\" target=\"_blank\" title=\"https://doc.cocalc.com/share.html\">https://doc.cocalc.com/share.html</a> .. i.e. make a directory, put files in it, go to the parent of that directory (or home dir) and select just this directory and then publish it as such a \"share\". all files inside of it will end up being public as well.</p>",
        "id": 188720271,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582281530
    },
    {
        "content": "<p>when you open it (anonymously, or a fresh project), cocalc's lean editor will start, notices that there is no config in ~/.lean and creates it (that's what william coded up one or two days ago).</p>",
        "id": 188720335,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582281592
    },
    {
        "content": "<p>Nice! That works really smoothly. And for my test it was really responsive. This is cool!</p>",
        "id": 188725219,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582286443
    },
    {
        "content": "<p>quick update from my perspective at cocalc: I tried to upgrade to lean 3.6.0 + mathlib 2020-02-27 nightly, but it doesn't work. I have no idea why. The symptoms are high (never ending) cpu usage and then it fails with \"excessive memory usage error\" or the whole cocalc interface is unresponsive. So, something must have changed that causes an issue. Hence there won't be 3.6.0 on cocalc for now.</p>",
        "id": 189197701,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582795325
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> <span aria-label=\"up\" class=\"emoji emoji-2b06\" role=\"img\" title=\"up\">:up:</span></p>",
        "id": 189197801,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795473
    },
    {
        "content": "<p>One thing you could try is this: upgrade the Lean binary to 3.6, upgrade the mathlib Lean files, and then compile them yourself with <code>lean --make src</code> in the mathlib root directory. It will take a while but it might be the easiest way to just make everything work.</p>",
        "id": 189197822,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582795503
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"137337\">@Harald Schilly</span> Currently mathlib is not compatible with <code>lean 3.6.0</code></p>",
        "id": 189197840,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795514
    },
    {
        "content": "<p>Oh!</p>",
        "id": 189197853,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582795530
    },
    {
        "content": "<p>Lean 3.6.0 was released yesterday, and we'll first have to fix mathlib.</p>",
        "id": 189197858,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795536
    },
    {
        "content": "<p>ahh!</p>",
        "id": 189197861,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582795538
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/blob/master/leanpkg.toml\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/master/leanpkg.toml\">https://github.com/leanprover-community/mathlib/blob/master/leanpkg.toml</a></p>",
        "id": 189197888,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795558
    },
    {
        "content": "<p>Still says <code>3.5.1</code> <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 189197928,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795567
    },
    {
        "content": "<p>ok. that explains everything. hence just updating mathlib nightly ^^</p>",
        "id": 189197946,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1582795600
    },
    {
        "content": "<p>No worries.</p>",
        "id": 189197953,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795609
    },
    {
        "content": "<p>Probably in a couple of days there will be a big change in mathlib. From then on mathlib wont work with lean 3.4.2 anymore but only with lean 3.6.*</p>",
        "id": 189197987,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795653
    },
    {
        "content": "<p>3.5.1 exists as some sort of transition.</p>",
        "id": 189198046,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1582795683
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"137337\">@Harald Schilly</span> If you're installing versions of Lean manually (i.e. you're not using the version manager <code>elan</code>), you'll always need to check by hand that your lean and mathlib versions match. This is a \"nonstandard\" installation. For the most part we expect people to be using <code>elan</code>.</p>",
        "id": 189200188,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1582797642
    },
    {
        "content": "<p>hi, I am trying to update lean + mathlib on CoCalc. When I looked into this the last time, I wrote a script to get the latest nightly mathlib build, but somehow it stopped being updated. That makes me suspicious.  If I download the latest nightly of mathlib, is there a way for me to know, for which version of lean it is? (there is no toml file in it)</p>",
        "id": 197419393,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589379641
    },
    {
        "content": "<p>I think everything works completely different now.</p>",
        "id": 197419462,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589379676
    },
    {
        "content": "<p>You should use <code>leanproject</code> to download mathlib (and any other Lean repo)</p>",
        "id": 197419514,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589379702
    },
    {
        "content": "<p>It does all the dirty work behind the scenes</p>",
        "id": 197419542,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589379714
    },
    {
        "content": "<p>ok, thank you, never heard of it. I hope it support these global installations like they're on cocalc? I'll check what it is, though.</p>",
        "id": 197419700,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589379772
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/get_started.html\">https://leanprover-community.github.io/get_started.html</a></p>",
        "id": 197420618,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380163
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/toolchain.html\">https://leanprover-community.github.io/toolchain.html</a></p>",
        "id": 197420652,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380177
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/install/linux.html\">https://leanprover-community.github.io/install/linux.html</a></p>",
        "id": 197420708,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380200
    },
    {
        "content": "<p>These may or may not be helpful. The bottom of the first page are links. The second page is an explanation of what's going on, and the third is explicit linux install instructions, although there are also quicker installation procedures for e.g. Ubuntu</p>",
        "id": 197420832,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380249
    },
    {
        "content": "<p>The overview is: you shouldn't install Lean, you should install <code>elan</code> which is a tool which works out which version of Lean you should be using, and if necessary downloads it. For CoCalc you might want to consider downloading all ten or so recent versions of Lean, or you might want to offer one by default and let users download more if they want. I had problems with sharing Lean projects on CoCalc precisely because they were written with the wrong version of Lean (and new Lean releases come at the rate of one per month right now, which is not a problem for us because of elan but which might be a problem for CoCalc if it doesn't want to adopt elan).</p>",
        "id": 197421098,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380372
    },
    {
        "content": "<p>Mathlib in contrast updates several times per day, and to help with this we use a tool called <code>leanproject</code>.</p>",
        "id": 197421156,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380397
    },
    {
        "content": "<p><code>leanproject</code> downloads mathlib binaries, updates your mathlib and so on. It has only been around for a couple of months but it seems to currently be the solution to all our problems and I can't imagine it changing much any time soon.</p>",
        "id": 197421313,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380458
    },
    {
        "content": "<p>Speaking personally, as a Lean user I want the world. I want to be able to develop using bleeding edge Lean and bleeding edge mathlib on CoCalc, and I want the <code>leanpkg.toml</code> file in my Lean project to tell CoCalc which version of Lean and mathlib to use. Furthermore, if I share a Lean file, perhaps one which depends on a local installation of mathlib in my Lean project in my CoCalc project, and runs on Lean 3.9.0 because I didn't update to 3.11 yet, it would be brilliant if this <em>just worked</em>.</p>",
        "id": 197421607,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380582
    },
    {
        "content": "<p>You must have the same problems with Sage, there are lots of versions of Sage. But realistically I don't know how easy it would be to implement my dreams.</p>",
        "id": 197421686,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380619
    },
    {
        "content": "<p>Here is the reason that you at CoCalc might be motivated to make the system so flexible: if I have a Lean project stored on CoCalc and I want to share one file with the world, and this file has other local files as imports as well as mathlib imports, then currently there is no easy way for me to do this unless I set up my own web editor. CoCalc will be fussy about which version of Lean I use, and which version of mathlib, and I never figured out how to get it to play well with local imports unless I zipped up the entire project and shared it as a zip file, which is very inefficient; start-up times are already bad. Your main rival is the <a href=\"https://leanprover-community.github.io/lean-web-editor/\">Lean Web Editor</a> and here I can share a file given e.g. its URL, but the only imports I am allowed are imports from mathlib. The mathlib is very up to date though. This means that a sharing of a file might break if I don't maintain it.</p>",
        "id": 197422109,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380822
    },
    {
        "content": "<p>thank you for all the explanations. there are certain constraints which make some aspects impossible. so, one solution could be that there is no default lean on cocalc any more and therefore simple sharing of lean projects will not work out of the box.</p>",
        "id": 197422167,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589380849
    },
    {
        "content": "<p>How does sharing work? Here is what I could imagine. One looks for a file and sees if it is in some directory which contains a <code>leanpkg.toml</code> file, and if it is then it reads the version of Lean from the toml file. This is exactly what <code>elan</code> does if I'm not mistaken.</p>",
        "id": 197422368,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380934
    },
    {
        "content": "<p>sage and all other software packages are much easier to setup, because they have consistent releases and don't require internet access when someone wants to run them.</p>",
        "id": 197422374,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589380936
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>buzzard@bob:~/lean-projects$ <span class=\"nb\">cd</span> lean-perfectoid-spaces\nbuzzard@bob:~/lean-projects/lean-perfectoid-spaces$ lean --version\nLean <span class=\"o\">(</span>version <span class=\"m\">3</span>.5.1, commit d3a94649bdb4, Release<span class=\"o\">)</span>\nbuzzard@bob:~/lean-projects/lean-perfectoid-spaces$ <span class=\"nb\">cd</span> ..\nbuzzard@bob:~/lean-projects$ <span class=\"nb\">cd</span> mathlib\nbuzzard@bob:~/lean-projects/mathlib$ lean --version\nLean <span class=\"o\">(</span>version <span class=\"m\">3</span>.10.0, commit 2c578165cc85, Release<span class=\"o\">)</span>\nbuzzard@bob:~/lean-projects/mathlib$ <span class=\"nb\">cd</span> ..\nbuzzard@bob:~/lean-projects$ lean --version\nLean <span class=\"o\">(</span>version <span class=\"m\">3</span>.4.2, commit cbd2b6686ddb, Release<span class=\"o\">)</span>\nbuzzard@bob:~/lean-projects$\n</code></pre></div>",
        "id": 197422444,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589380974
    },
    {
        "content": "<p>I don't know anything about lean or elan, so, I don't know. there is a tool that picks up configuration information for lean. I don't remember if this was elan or lean itself.</p>",
        "id": 197422504,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589381005
    },
    {
        "content": "<p>elan is that tool</p>",
        "id": 197422529,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381016
    },
    {
        "content": "<p>You can see it in action in the shell session above. Just moving between directories changes which lean I am running</p>",
        "id": 197422559,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381034
    },
    {
        "content": "<p>If I have a project with internet access then I can download Lean locally.</p>",
        "id": 197422665,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381069
    },
    {
        "content": "<p>We <a href=\"https://github.com/leanprover-community/mathlib/pull/2576\">stopped updating the mathlib-nightly releases</a> because one of the programs used in the CI script stopped compiling and we didn't realize that anyone was still using the nightly releases. If it would help make Lean easy to use on cocalc, we could try to restart the nightly releases again. <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> what do you think?</p>",
        "id": 197422688,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1589381080
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/197422529\">said</a>:</p>\n<blockquote>\n<p>elan is that tool</p>\n</blockquote>\n<p>ok, well, I thought <code>lean --path</code> is how to look up which lean environment you're using. we're probably both right, just or different aspects.</p>",
        "id": 197422946,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589381176
    },
    {
        "content": "<p>Yes, I think that <code>lean</code> isn't a binary, I don't really know how it works. What I don't understand is why I can't share a project and have it run with the version of Lean which it says in the project.</p>",
        "id": 197423207,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381299
    },
    {
        "content": "<p>(I'm not saying \"you have to do this\", I'm saying \"I'm ignorant\", of course)</p>",
        "id": 197423260,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381331
    },
    {
        "content": "<p>so, elan is not easy to install either. there is just one script (something from rust?) and I would have to audit what it is doing before I can run it. it would be better if there is somewhere a short explanation what it is supposed to do or few steps to do it manually.</p>",
        "id": 197423381,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589381394
    },
    {
        "content": "<p>because locally this is what is happening with me. I download projects with <code>leanproject</code>(which imports all the correct mathlib binaries) and open them in VS Code and they run with the correct version of Lean because of some <code>elan</code> magic.</p>",
        "id": 197423387,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381397
    },
    {
        "content": "<p>Yes, unfortunately I am not someone who knows what is actually going on, I am just someone with an understanding of what seems to be happening from the user perspective</p>",
        "id": 197423495,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381439
    },
    {
        "content": "<p>well, one of the constraints in cocalc is, that you can't in general assume that you can download anything from the web. besides that, it would mean you have to store all the files for all projects separately.</p>",
        "id": 197423519,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589381452
    },
    {
        "content": "<p>I just occasionally type things like <code>pip install --upgrade leanproject</code> and don't worry about anything else.</p>",
        "id": 197423578,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381467
    },
    {
        "content": "<p>ok, I see, thank you for the links</p>",
        "id": 197423616,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589381481
    },
    {
        "content": "<p>What I have been doing in CoCalc is that all my projects live in different directories and each one has a different mathlib in it</p>",
        "id": 197423678,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381504
    },
    {
        "content": "<p>My Leans I store in <code>~/.elan/toolchains</code></p>",
        "id": 197423771,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381531
    },
    {
        "content": "<p>I currently seem to have 17 versions of Lean on this computer</p>",
        "id": 197423836,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381556
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>buzzard@bob:~/.elan/toolchains$ ls -l\ntotal <span class=\"m\">68</span>\ndrwxr-xr-x <span class=\"m\">6</span> buzzard buzzard <span class=\"m\">4096</span> Feb  <span class=\"m\">8</span> <span class=\"m\">14</span>:10 <span class=\"m\">3</span>.3.0\ndrwxrwxr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar <span class=\"m\">24</span>  <span class=\"m\">2019</span> <span class=\"m\">3</span>.4.2\ndrwxrwxr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> May  <span class=\"m\">7</span> <span class=\"m\">18</span>:33 leanprover-community-lean-3.10.0\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> May <span class=\"m\">10</span> <span class=\"m\">13</span>:57 leanprover-community-lean-3.11.0\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Feb <span class=\"m\">12</span> <span class=\"m\">21</span>:38 leanprover-community-lean-3.5.1\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar  <span class=\"m\">7</span> <span class=\"m\">21</span>:54 leanprover-community-lean-3.6.1\ndrwxrwxr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar <span class=\"m\">18</span> <span class=\"m\">18</span>:54 leanprover-community-lean-3.7.0\ndrwxrwxr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar <span class=\"m\">19</span> <span class=\"m\">20</span>:56 leanprover-community-lean-3.7.1\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar <span class=\"m\">21</span> <span class=\"m\">23</span>:21 leanprover-community-lean-3.7.2\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Apr <span class=\"m\">11</span> <span class=\"m\">15</span>:07 leanprover-community-lean-3.8.0\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Apr <span class=\"m\">22</span> <span class=\"m\">22</span>:18 leanprover-community-lean-3.9.0\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> May  <span class=\"m\">8</span> <span class=\"m\">14</span>:30 leanprover-community-lean-9.9.9\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Dec <span class=\"m\">28</span> <span class=\"m\">18</span>:29 nightly-2018-04-06\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Apr <span class=\"m\">14</span>  <span class=\"m\">2019</span> nightly-2018-04-20\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Apr <span class=\"m\">28</span>  <span class=\"m\">2019</span> nightly-2018-06-21\ndrwxrwxr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Oct <span class=\"m\">22</span>  <span class=\"m\">2019</span> nightly-2019-01-13\ndrwxr-xr-x <span class=\"m\">5</span> buzzard buzzard <span class=\"m\">4096</span> Mar <span class=\"m\">24</span>  <span class=\"m\">2019</span> stable\nbuzzard@bob:~/.elan/toolchains$\n</code></pre></div>",
        "id": 197423887,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381581
    },
    {
        "content": "<p>and more appear on the fly, because <code>elan</code> downloads them automatically</p>",
        "id": 197423992,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589381627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"123965\">Bryan Gin-ge Chen</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/197422688\">said</a>:</p>\n<blockquote>\n<p>We <a href=\"https://github.com/leanprover-community/mathlib/pull/2576\">stopped updating the mathlib-nightly releases</a> because one of the programs used in the CI script stopped compiling and we didn't realize that anyone was still using the nightly releases. If it would help make Lean easy to use on cocalc, we could try to restart the nightly releases again. <span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> what do you think?</p>\n</blockquote>\n<p>I don't like creating an extra distribution system to make it easier to use mathlib in an unsupported way.  You can get the almost the same thing as the mathlib nightlies by running <code>leanproject get mathlib</code> (instead of downloading a zip file from the release page).</p>",
        "id": 197424481,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589381831
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"137337\">Harald Schilly</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20installation.20in.20CoCalc/near/197423381\">said</a>:</p>\n<blockquote>\n<p>so, elan is not easy to install either. there is just one script (something from rust?) and I would have to audit what it is doing before I can run it. it would be better if there is somewhere a short explanation what it is supposed to do or few steps to do it manually.</p>\n</blockquote>\n<p>You can compile <code>elan</code> yourself.  It builds a small rust program called <code>elan-init</code>.  You then just need to install it to <code>/usr/bin/elan-init</code> and then symlink <code>elan-init</code> to <code>/usr/bin/elan</code>, <code>/usr/bin/lean</code>, <code>/usr/bin/leanpkg</code>, and <code>/usr/bin/leanchecker</code> if you're installing it manually.</p>",
        "id": 197425233,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589382108
    },
    {
        "content": "<p>ok, I'll try that. installing elan on cocalc isn't supported, because it want's to download files into the user's home directory – but it must be global. I could try moving files around, but who knows if that will help at all.</p>",
        "id": 197425336,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589382135
    },
    {
        "content": "<p>I really strongly suggest to use <code>elan</code>, Lean has no backward or forward compatibility.</p>",
        "id": 197425347,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589382139
    },
    {
        "content": "<p>ahh! so I actually don't have to run <code>elan-init</code> .. ok ok</p>",
        "id": 197425478,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589382200
    },
    {
        "content": "<p>By default, elan will look for toolchains in <code>~/.elan</code>.  I would suggest that you preinstall all Lean versions (like every single one from 3.4.2 to 3.11.0).  You can either symlink <code>~/.elan</code> to <code>/opt/elan</code>, or set the environment variable <code>ELAN_HOME=/opt/elan</code>.</p>",
        "id": 197425510,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589382217
    },
    {
        "content": "<p>Assuming that you have the global installation at <code>/opt/elan</code>, you can pick whatever directory you like.</p>",
        "id": 197425690,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589382290
    },
    {
        "content": "<p>yes, directories will be different. so, I also assume, that all cocalc projects then will have to set <code>ELAN_HOME=/ext/lean/elan</code> ?</p>",
        "id": 197425945,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589382405
    },
    {
        "content": "<p>My suggestion is to either make a symlink <code>~/.elan -&gt; /ext/lean/elan</code> or set <code>ELAN_HOME=/ext/lean/elan</code> in all cocalc projects.</p>",
        "id": 197426048,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1589382452
    },
    {
        "content": "<p>I ran <code>elan toolchain install stable</code> → which installed 3.11 it in a global toolchain repository. good. :-)</p>",
        "id": 197426225,
        "sender_full_name": "Harald Schilly",
        "timestamp": 1589382530
    }
]