[
    {
        "content": "<p>I'm trying to use the lean game maker and I'm having some trouble running it. I think I have managed to install it on my Windows pc using the Ubuntu WSL (but maybe I messed this up). In any case I can run make-lean-game in the directory and it does produce a <code>html</code> folder with some files, but the website I get is empty. It also doesn't create a zipped version of the olean files and no <code>game_data</code> file. The error I'm getting is <code>Error: [Errno 2] No such file or directory: 'leanpkg'</code> which is strange because there is such a file in the same directory where the <code>game_config</code> file is. </p>\n<p>Does anyone have any idea what might be going wrong?</p>",
        "id": 286035987,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655194391
    },
    {
        "content": "<p>I don't know about game maker (and don't have it nor windows in front of me to check), but that error condition in other contexts usually indicates a PATH issue -- does the error change or go away if you add the directory that leanpkg is in to your PATH explicitly?</p>",
        "id": 286058667,
        "sender_full_name": "Julian Berman",
        "timestamp": 1655207374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"389019\">@Chris Birkbeck</span> you may use the template at <a href=\"https://github.com/mmasdeu/topologygame\">https://github.com/mmasdeu/topologygame</a> to create your own game. It gets automatically served from github pages and has some custom additions (like wildcard expansion for levels, or show-source button).</p>",
        "id": 286082428,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1655217765
    },
    {
        "content": "<p>Yes that's what I was trying to use. I'm at the point that if I run <code>make-lean-game --nolib</code> then it seems to create the right files, but since it doesn't create the library it doesn't work as a \"game\". I installed everything on the WSL now and if I run <code>make-lean-game</code> it now finds the <code>leanpkg</code> file, but its trying to build all of mathlib it seems. Is this normal? I thought it would only build the project.</p>",
        "id": 286083093,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655218020
    },
    {
        "content": "<p>It should be getting the right oleans and thus not compile the whole library. Also be aware that it sometimes takes some time (read hours) for it to work. As far as I understood, it has nothing to do with compiling, it's just that some things get cached in your browser and/or servers and it takes time for them to get forgotten.</p>",
        "id": 286083805,
        "sender_full_name": "Marc Masdeu",
        "timestamp": 1655218295
    },
    {
        "content": "<p>With NNG it would always compile mathlib, or at least enough of it to get the game running</p>",
        "id": 286091957,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1655221292
    },
    {
        "content": "<p>Ok I got it working now. It seems there was some issues with finding the olean files. But making a new project and starting there seems to have worked.  It now seems to not compile all of mathlib, but only the bits needed.</p>",
        "id": 286092596,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655221571
    },
    {
        "content": "<p>I hope this is for a number theory game!</p>",
        "id": 286104534,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1655226712
    },
    {
        "content": "<p>That'll be the next one! I'm trying out a logic one since here at UCL they are running a summer course for students and I think it would be fun to try and make it into a game.</p>",
        "id": 286116587,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655232563
    },
    {
        "content": "<p>Right, so I've made it through the library.zip document for my game in Lean. However, an error appears in the terminal: Error: [Errno 2] No such file or directory: \"msguniq\". Is solving this error indispensable to run the game ??</p>",
        "id": 292613507,
        "sender_full_name": "Luisitoon",
        "timestamp": 1660063014
    }
]