[
    {
        "content": "<p>So I have been invited to give a plenary lecture at the International Congress of Mathematicians, the conference where they hand out the Fields Medals. The talk takes place in July 2022 and there is also some sort of write-up, which for some reason has to be finished by September 2021, although when my advisor spoke at the ICM he released an \"official version\" of his talk and also an \"expanded version\", which was the one everyone read because it was the one on his website.</p>\n<p>This gives us a \"deadline\". Ever since 2017 this community has been achieving bigger and bigger mathematical goals, doing stuff which is not in the other provers (even though sometimes it could have been). One can certainly be optimistic that by July 2022 we will have achieved some sort of approximation to the Scholze challenge -- whether we will have achieved it might depend on the small print, but for sure Johan and the team will have achieved something which will be easy to sell. </p>\n<p>Thinking of other big projects, there are two very natural ones which could be in really good shape by July 2022. Note that I am not too worried about whether it's Lean 3 or Lean 4, the audience will not know the difference.</p>\n<p>1) <a href=\"https://leanprover-community.github.io/sphere-eversion/\">Sphere eversion</a>. </p>\n<p>What we have learnt from experience is that a successful non-trivial formalisation project seems to benefit from  the following:</p>\n<p>*) A blueprint -- a careful mathematical explanation of what is going on<br>\n*) A mathematical leader/leaders -- someone who knows all the maths, can deal with questions arising from the blueprint.<br>\n*) A formalisation leader/leaders -- someone who is constantly thinking \"what is the next thing that can be achieved, and who is going to do it\" -- and if they don't know anyone working on it, they may well start on it themselves.</p>\n<p>For sphere eversion we have a mathematical leader in Patrick, and a beautiful <a href=\"https://leanprover-community.github.io/sphere-eversion/blueprint/index.html\">online blueprint</a> also made by Patrick. But Patrick has not yet had the time to be a formalisation leader, he is busy with other things (like writing Lean courses for undergraduates and literate tactics). If we can find a formalisation leader, this project could be in really good shape by July 2022. Note that you do not have to know all the mathematics back to front to start to do this job -- Johan has been the formalisation leader for the LTE and he learnt the mathematics (i.e. read the relevant part of Scholze's document extremely carefully) whilst figuring out how to lead, i.e. working out which bits could be broken off as individual files with sorries in which other people could work on.</p>\n<p>2) Formalising algebraic geometry.</p>\n<p>This is a more open-ended goal, and there are several things one can target.</p>\n<p>Firstly I think a flagship definition would be the etale cohomology of schemes. On paper this looks highly feasible. Bhavik has developed a very general theory of sheaves on sites, and Scott might well have made the crucial breakthrough with a definition of a derived functor. The definition and basic properties of etale morphisms of rings should be easily do-able, because Lean seems to be very strong at this kind of commutative algebra, we already have a plethora of results at this kind of level. Whether this translates into a definition and basic properties of etale morphisms of schemes is not something that we, or anyone in the formal verification community, know yet. But if it does then this will be all we need.</p>\n<p>Another thing we could do is projective schemes/morphisms; I have been thinking about graded rings for weeks now, and will start making PR's this week.</p>\n<p>Note that the computer scientists are always keen on theorems to go with definitions, but nontrivial theorems might well be over a year away.</p>\n<p>However there is something else which one can think about here, which is Lean integration with the Stacks Project. This is something which everyone seems to be keen on, but again never seems to happen, mostly because I'm the most enthusiastic one at this end and I don't know what a yaml file is so never quite know where to start. </p>\n<p>3) Other stuff.<br>\nAre there any other projects which we think might look impressive to mathematicians and could well be in good shape within 13 months? Once we have group cohomology (now on the horizon) we can get to Galois cohomology and hence state the main theorems of class field theory, but proving them will be a long way away. A student on my PhD program, Jamie Bell, has formalised <a href=\"https://github.com/jamiebell2805/BSD-conjecture/blob/b953fce05e50526b4541eb56bf5d1237dec5c859/src/elliptic_curve.lean#L243\">the statement of BSD in Lean</a> -- he sorries plenty of Props but no data (and there is a slip in that file, a typo in the definition of doubling which we only discovered when filling in sorries, so let that be a warning about this approach, as if we needed one. Perhaps the reason that the mathematicians are far less fussed about this sort of thing than the computer scientists is that we are so used to dealing with typos in LaTeX documents :-) ). Hales was talking about formalising the Clay problems this way back in 2017. I think that an ICM audience might be interested to hear about progress in this area.</p>",
        "id": 240160956,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1621934073
    },
    {
        "content": "<p>Congratulations! This is really cool!</p>",
        "id": 240162560,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1621935150
    },
    {
        "content": "<p>I wonder if we have a <code>lean-gptf</code> PR that is non-trivial enough to suggest the promised land? If there exists a PR where it golfed a proof in some way that was surprising to a mathematician, it might just be worth mentioning.</p>",
        "id": 240165333,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1621936926
    },
    {
        "content": "<p>Congratulations!!</p>",
        "id": 240166963,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1621937965
    },
    {
        "content": "<p>That's great! How could a Cambridge second year undergraduate fit in such a project?<br>\nOn my part, I am expecting Szemerédi's Theorem to be a much bigger project than what can fit in a summer, but I lack knowledge of the proofs to compare its size to the other projects.</p>",
        "id": 240167708,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1621938447
    },
    {
        "content": "<p>My impression with Szemerédi is that you should spend July working on it with Bhavik and by that time you will have a very clear idea about what is feasible and what is not, and we can go from there.</p>",
        "id": 240172994,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1621942035
    },
    {
        "content": "<p>Which proof of Szemeredi are you going to consider? I have a L3 student from ENS Lyon doing an internship with me currently, on the ergodic theory proof by Furstenberg, so if this is the proof you are going to look at I could put you in touch!</p>",
        "id": 240175871,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1621943862
    },
    {
        "content": "<p>If you are doing the regularity proof I will try my best to help! I haven't got a lot of experience with Lean but a project would be great for that.</p>",
        "id": 240177214,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1621944698
    },
    {
        "content": "<p>Oh! I didn't know other people were working on Szemerédi as well! We will follow either of Gowers' proofs. I am leaning towards the hypergraph proof because it is a proper generalisation. As a starter, I'm proving the usual regularity lemma on the <code>szemeredi</code> branch (<a href=\"https://github.com/leanprover-community/mathlib/blob/szemeredi/src/combinatorics/szemeredi/regularity.lean\">https://github.com/leanprover-community/mathlib/blob/szemeredi/src/combinatorics/szemeredi/regularity.lean</a>).<br>\nSo yeah I'm not doing Furstenberg's ergodic proof but Sébastien feel free to put us in touch either way <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> (I might actually start talking about Lean in French! What a crazy thought)<br>\nAnd Mauricio that would be nice for you to help! But of course, I'm not obliging you in doing my internship <span aria-label=\"stuck out tongue wink\" class=\"emoji emoji-1f61c\" role=\"img\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span>. When do you have time? We will really start only by the end of June.</p>",
        "id": 240201622,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1621955181
    },
    {
        "content": "<p>End of June sounds great! I have a big deadline on June 18th so I'll have more free time after that. Really like the idea of doing Gowers' hypergraph proof too</p>",
        "id": 240205965,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1621956831
    },
    {
        "content": "<p>Yael and I did discuss the other approaches to Szemeredi's theorem, and we decided against formalising Furstenberg's one since it would involve formalising a good amount of measure theory and ergodic theory (and also involve Yael learning such)</p>",
        "id": 240211768,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1621959016
    },
    {
        "content": "<p>I agree with you: there are too many prerequisites in ergodic theory for Furstenberg's proof, so going the Gowers way is a better idea for formalization (for now :-)</p>",
        "id": 240218970,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1621962182
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20at.20the.20ICM/near/240160956\">said</a>:</p>\n<blockquote>\n<p>Note that I am not too worried about whether it's Lean 3 or Lean 4, the audience will not know the difference.</p>\n</blockquote>\n<p>I think Kevin is right that we don't need the big projects to be in Lean 4 before his talk. But hopefully we'll see a massive surge of interested people after his talk, and we really <em>really</em> don't want to be stuck in the middle of the Lean 4 transition at that time. We need a fully ported <em>and</em> documented mathlib4 before July 2022. We won't get another opportunity like this (unless the AI people really do what they promise).</p>",
        "id": 240221005,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1621963142
    },
    {
        "content": "<blockquote>\n<p>We need a fully ported and documented mathlib4 before July 2022.</p>\n</blockquote>\n<p>This is a good goal, but to be perfectly frank I think it is setting expectations too high, and might put too much pressure on the lean 4 team.</p>",
        "id": 240221280,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1621963267
    },
    {
        "content": "<p>And I also agree with Kevin that we can definitely get the sphere eversion project done before then. Right now it's not moving at all because I prioritized contributing to the liquid tensor experiment. But there is no reason why it couldn't move. If we put a tenth of the energy that went into the liquid tensor experiment into sphere eversion it will be done in a couple of month.</p>",
        "id": 240221289,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1621963273
    },
    {
        "content": "<p>I don't want to put any pressure on the Lean 4 team. Only on us when we'll have to do manual porting.</p>",
        "id": 240221348,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1621963308
    },
    {
        "content": "<p>Mario, this is 2022, not 2021.</p>",
        "id": 240221371,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1621963322
    },
    {
        "content": "<p>Yes I know</p>",
        "id": 240221415,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1621963329
    },
    {
        "content": "<p>It's dinner time, but I'd be curious to read more about why you think July 2022 is too optimistic, so don't hesitate to continue writing while I'm away.</p>",
        "id": 240221547,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1621963397
    },
    {
        "content": "<p>Porting mathlib in ~1 year implies that lean 4 is usable for mathlib by the end of that time, so it does put pressure on lean 4 (indirectly, by us when some issue in lean 4 prevents us from porting something)</p>",
        "id": 240221560,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1621963403
    },
    {
        "content": "<p>It's what I would call a stretch goal. It's possible, but requires a lot of concerted effort from all quarters. We will know much better how feasible this is at the end of the summer, since that's when most of the porting setup work should take place. We need to be ready to systematically port a file by the end of that period, and bring in an army of volunteers to actually do the work, and have documentation for them to follow</p>",
        "id": 240222235,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1621963693
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>  Congratulations!</p>",
        "id": 240619122,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1622215219
    },
    {
        "content": "<p>I missed this information, but many congratulations <strong>Kevin Buzzard</strong>  ! This is amazing :) In addition, the perspective of hearing about Lean during a plenary talk of the ICM is really exciting !</p>",
        "id": 253763205,
        "sender_full_name": "Amaury Hayat",
        "timestamp": 1631893907
    }
]