[
    {
        "content": "<p>I am trying to increase the memory limit for lean (i.e. the equivalent of <code>lean.memoryLimit</code>) via <code>lean-language-server</code>, but as far as I can tell, there isn't a way to pass through command line options.</p>\n<p>I found <a href=\"https://github.com/leanprover/lean-client-js/blob/master/lean-language-server/src/index.ts#L30\">https://github.com/leanprover/lean-client-js/blob/master/lean-language-server/src/index.ts#L30</a> which I think is what'll run when running <code>lean-language-server --stdio</code>, but that line will always pass <code>[]</code> as <code>argv</code> to the <code>lean</code> subprocess.</p>\n<p>Can someone just confirm I didn't miss something there / whether there's some command line option to <code>lean-language-server</code> that indeed will passthrough to <code>lean</code>?</p>",
        "id": 218936743,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607177498
    },
    {
        "content": "<p>That looks right. It shouldn't be too hard to modify that line to read options from the command line; for reference, <a href=\"https://github.com/leanprover/vscode-lean/blob/master/src/server.ts#L100\">here's the analogous part of the vscode-lean code</a>.</p>\n<p>Can I ask what you're using <code>lean-language-server</code> for?</p>",
        "id": 218939955,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1607182798
    },
    {
        "content": "<p>OK thanks, will have a look. I'm using it to talk to from vim's LSP.</p>",
        "id": 218940131,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607183061
    },
    {
        "content": "<p>Well, I managed to get this working the caveman way, by taking extra argv and passing it along.</p>\n<p>I would have liked to get it working in a more native LSP way, the same way the vscode extension does it (by supporting <code>workspace/configuration</code> requests) but it looks like the version of <code>vscode-languageserver</code> used by <code>lean-language-server</code> is too old, and upgrading to the newest one has other changes that make it not work.</p>\n<p>Wish I knew slightly more about LSP than I do I suppose... Will give it one more go maybe tomorrow and if I can't get it to work will give up and do it the easier way.</p>",
        "id": 219020696,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607289777
    }
]