[
    {
        "content": "<p>Hi everyone! <span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span>  and I are organizing a Lean workshop in Amsterdam, Jan 7-11 2019. <a href=\"https://lean-forward.github.io/lean-together/2019/\" target=\"_blank\" title=\"https://lean-forward.github.io/lean-together/2019/\">https://lean-forward.github.io/lean-together/2019/</a> The meeting will also be a \"kickoff\" for Jasmin Blanchette's new project, Lean Forward: <a href=\"https://lean-forward.github.io/\" target=\"_blank\" title=\"https://lean-forward.github.io/\">https://lean-forward.github.io/</a></p>",
        "id": 129082918,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530708235
    },
    {
        "content": "<p>Please put the dates in your calendars. We'd love to see lots of you there.</p>",
        "id": 129082971,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530708255
    },
    {
        "content": "<p>So lean-forward is doing number theory in Lean, but there are no number theorists involved? This is just like the ERC grant which Cambridge holds -- they want to do maths but there are no mathematicians? Is this some big grant which was recently funded? CS grant funding agencies are funding computer scientists again and again to do mathematics, but mathematics funding agencies do not seem to be (other than Sloan and Hales I guess). I should probably apply for some money. I wonder what the maths funding agencies would think? They might have real trouble getting referees :-/</p>\n<p>What does \"Our vehicle will be Lean, a disruptive proof assistant developed at...\" mean? Is it any more disruptive than any other proof assistant?</p>",
        "id": 129084695,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1530710374
    },
    {
        "content": "<p>Do you mean <a href=\"http://www.few.vu.nl/~sdn249/publications.html\" target=\"_blank\" title=\"http://www.few.vu.nl/~sdn249/publications.html\">http://www.few.vu.nl/~sdn249/publications.html</a> is not number theory?</p>",
        "id": 129084773,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1530710472
    },
    {
        "content": "<p>Sander Dahmen is very closely involved with the project: <a href=\"http://www.few.vu.nl/~sdn249/\" target=\"_blank\" title=\"http://www.few.vu.nl/~sdn249/\">http://www.few.vu.nl/~sdn249/</a></p>",
        "id": 129084778,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530710478
    },
    {
        "content": "<p>I think he considers himself a number theorist! He certainly approved the text in the grant proposal before it was submitted, at the very least.</p>",
        "id": 129084827,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530710535
    },
    {
        "content": "<p>As for the \"disruptive\" language, you'd have to ask Jasmin exactly what he meant.</p>",
        "id": 129084857,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530710634
    },
    {
        "content": "<p>He probably meant he wanted the money</p>",
        "id": 129084906,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1530710651
    },
    {
        "content": "<p>That looks very much like grant proposal language to me.</p>",
        "id": 129084912,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1530710666
    },
    {
        "content": "<p>That would be my guess. :)</p>",
        "id": 129084914,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1530710667
    },
    {
        "content": "<blockquote>\n<p>Do you mean <a href=\"http://www.few.vu.nl/~sdn249/publications.html\" target=\"_blank\" title=\"http://www.few.vu.nl/~sdn249/publications.html\">http://www.few.vu.nl/~sdn249/publications.html</a> is not number theory?</p>\n</blockquote>\n<p>Oh that's <em>definitely</em> number theory! It is also completely impossible to do in Lean :-/ This needs all of the Wiles/TW machinery -- is the proposal to do that in Lean? ;-)</p>",
        "id": 129086096,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1530712180
    },
    {
        "content": "<p>Indeed Sander Dahmen is actually employed by a mathematics department! i retract my assertion that there are no mathematicians involved :-)</p>",
        "id": 129086164,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1530712232
    },
    {
        "content": "<blockquote>\n<p>Russell quipped that \"the method of 'postulating' what we want has many advantages; they are the same as the advantages of theft over honest toil.\" However, for most mathematicians, this fundamentalism is unappealing and unrealistic. Modern research on Diophantine equations often depends on the modularity of elliptic curves, which constitutes the final step in the proof of Fermat's last theorem and relies on an overwhelming amount of theory. Full formalization being unrealistic, we will embrace flexible levels of formality.</p>\n</blockquote>",
        "id": 129086181,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1530712269
    },
    {
        "content": "<p>from the website</p>",
        "id": 129086185,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1530712274
    },
    {
        "content": "<p>Also, Freek Wiedijk understands how mathematicians think and what they want. For example he is a CS guy that doesn't care about being constructive!</p>",
        "id": 129086933,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1530713197
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> Will there be video recordings of Lean Together?</p>",
        "id": 129272505,
        "sender_full_name": "Amin Bandali",
        "timestamp": 1530997882
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"111976\">@Amin Bandali</span> We're nowhere close to planning those kinds of details yet. We can certainly look into it closer to the event, though.</p>",
        "id": 129291347,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1531041266
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> Thanks, that'd be much appreciated.</p>",
        "id": 129300771,
        "sender_full_name": "Amin Bandali",
        "timestamp": 1531058345
    },
    {
        "content": "<p>Bumping this thread up to the top! We've added a bit more information to the Lean Together website. <a href=\"https://lean-forward.github.io/lean-together/2019/index.html\" target=\"_blank\" title=\"https://lean-forward.github.io/lean-together/2019/index.html\">https://lean-forward.github.io/lean-together/2019/index.html</a></p>\n<p>If you're free the week of January 7-11 and want to make the trip to Amsterdam, we'd love to see you there.</p>",
        "id": 135605684,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539262275
    },
    {
        "content": "<p>I don't know how to coordinate video recordings of the talks. But I plan to figure it out before January 7.</p>",
        "id": 135605699,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539262310
    },
    {
        "content": "<p>The hotel explanations on <a href=\"https://lean-forward.github.io/lean-together/2019/index.html\" target=\"_blank\" title=\"https://lean-forward.github.io/lean-together/2019/index.html\">https://lean-forward.github.io/lean-together/2019/index.html</a> are a bit vague, so we may end up very scattered if everyone tries to find a hotel independently. It would be friendlier if we coordinate a bit. Are there already people here who studied the question and decided something?</p>",
        "id": 135789752,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1539544744
    },
    {
        "content": "<p>It's a bit vague because I don't know anything about hotels in Amsterdam and just copied from Jasmin's last workshop website. <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span> If I remember right, some people at that workshop stayed at the Amsterdam Forest Hotel and didn't complain. It's close to the university, farther from the more exciting parts of town.</p>",
        "id": 135791113,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539547080
    },
    {
        "content": "<p>I'm not complaining, I really mean what I wrote: I'd prefer to stay in the same hotel as other participants, so let's coordinate.</p>",
        "id": 135791226,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1539547262
    },
    {
        "content": "<p>Sometimes conferences have deals with specific hotels. That might kill two birds with one stone</p>",
        "id": 135791244,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1539547303
    },
    {
        "content": "<p>I am pretty sure that my _department_ has various agreements with specific local hotels.</p>",
        "id": 135791309,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1539547380
    },
    {
        "content": "<p>Sure -- if you decide on something I'm happy to update the website and point people in that direction. Our university has some kind of arrangement with some hotels, but I'm told they're expensive and the closer hotels aren't part of it.</p>",
        "id": 135791452,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539547653
    },
    {
        "content": "<p>Not sure if our little workshop has the sway to negotiate a group rate, heh.</p>",
        "id": 135791500,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539547714
    },
    {
        "content": "<p>It should be university level negociation, not workshop level</p>",
        "id": 135791508,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1539547742
    },
    {
        "content": "<p>Yeah, ideally, but based on what I'm told about booking hotels through the university, someone's already messed that negotiation up.</p>",
        "id": 135791640,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539547989
    },
    {
        "content": "<p>just to confirm, is there an attendance fee?</p>",
        "id": 136050344,
        "sender_full_name": "Rudi Grinberg",
        "timestamp": 1539876064
    },
    {
        "content": "<p>No attendance fee. Coffee breaks are on us, but you're all paying for your own lunches. <span class=\"emoji emoji-263a\" title=\"smile\">:smile:</span></p>",
        "id": 136051065,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539876818
    },
    {
        "content": "<p>You have a lot to learn about attracting grad students. No free food? Tsk tsk tsk</p>",
        "id": 136059752,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1539884991
    },
    {
        "content": "<p>I thought it was more important to give our visitors the traditional Dutch experience: overpaying for individual slices of bread and cheese at the cafeteria. Typisch nederlands!</p>",
        "id": 136065118,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539890085
    },
    {
        "content": "<p>Will there be videos of the talks, or a webpage collecting all the speakers' slides? For those who can't attend because they're too far away?</p>",
        "id": 136066693,
        "sender_full_name": "Simon Cruanes",
        "timestamp": 1539891645
    },
    {
        "content": "<p>Slides, for sure. Videos/streaming will be available assuming I (or someone else) can figure out how to do it.</p>",
        "id": 136067166,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1539892147
    },
    {
        "content": "<p>A reminder, now that the meeting in Freiburg is over: we'll meet again in Amsterdam, Jan 7-11. There are 46(!) registered participants so far. We'll have a number of talks, including from Sebastian about Lean 4 and Tom Hales about progress on the Formal Abstracts project. All are welcome to join, and if you'd like to give a talk yourself, please tell me reasonably soon.</p>",
        "id": 146965038,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1541603881
    },
    {
        "content": "<p><a href=\"https://lean-forward.github.io/lean-together/2019/index.html\" target=\"_blank\" title=\"https://lean-forward.github.io/lean-together/2019/index.html\">https://lean-forward.github.io/lean-together/2019/index.html</a></p>",
        "id": 146965106,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1541603929
    },
    {
        "content": "<p>Hi all, we've posted a very tentative schedule of talks: <a href=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vTE9MXMytWN-IQm6xBvSsWCa4Rc0QMFrp2P81pfDr9zqS-kf0wTLhU5UGVbgVzMxGieeiBLzKtyDdiG/pubhtml\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vTE9MXMytWN-IQm6xBvSsWCa4Rc0QMFrp2P81pfDr9zqS-kf0wTLhU5UGVbgVzMxGieeiBLzKtyDdiG/pubhtml\">https://docs.google.com/spreadsheets/d/e/2PACX-1vTE9MXMytWN-IQm6xBvSsWCa4Rc0QMFrp2P81pfDr9zqS-kf0wTLhU5UGVbgVzMxGieeiBLzKtyDdiG/pubhtml#</a><br>\nNow is your chance to complain about the timing! If you were hoping to give a talk but never told me, you should tell me soon. And if you haven't sent me a title yet, you should do that before I start making them up for you.</p>",
        "id": 147966265,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1542635097
    },
    {
        "content": "<p>(Notice that there are tabs at the top of that page. You can click on them to see all the titles and abstracts we've gotten so far.)</p>",
        "id": 147966428,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1542635276
    },
    {
        "content": "<p>I am really looking forward to Lean Together! You've got a fantastic crowd of people coming together.</p>",
        "id": 148015646,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542687309
    },
    {
        "content": "<p>(Scroll down to the bottom if you want to read the question first <span class=\"emoji emoji-1f643\" title=\"upside down\">:upside_down:</span>) Here is one challenge that we might want to think about. There will be a bunch of mathematicians attending the conference that have no prior experience with ITPs as far as I know. (I know at least three participants come from the Dutch arithmetic geometry community.) The goal of this workshop, and of Lean Forward in general, is to work towards ITPs that are actually used by mathematicians; and that is exactly what my goal is (and Scott's, Patrick's, Kevin's goal as well). I know that mathematicians have not shown very much dedication towards ITPs, and this might be frustrating for some people from the CS side. To make these people stay we will have to address the following issue:<br>\nThese people work with abelian schemes, Galois representations, F-isocrystals, Artin stacks, etc... these notions are not fancy for them, they are their basic Lego blocks. These concepts have been around for at least 30 years, more like 60. When they visit Johannes's talk on what's in mathlib, they will find that schemes and perfectoid spaces haven't made it into mathlib, even though Kevin (and Kenny, Patrick, me) have been working on them for around a year.<br>\nAnd then they will remember the talk from the day before, about Lean 4, and how that's around the corner. And they will hear some chat during the coffee breaks that porting to Lean 4 is going to be a bit of a nasty issue. And they will realise that none of their basic building blocks has ever made it into Coq, Isabelle, Mizar, or whatever.<br>\nSo... long story short: how are we going to convince them (and me?) that all this formalisation effort is not ephemeral, and that ITPs should stabilise in the near future?</p>",
        "id": 148015963,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542687950
    },
    {
        "content": "<p>hmm, but I don't think they will stabilize in the near future</p>",
        "id": 148016139,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688254
    },
    {
        "content": "<p>it is ephemeral, but each bit of code reduces the effort needed to write it again when the next best thing comes out</p>",
        "id": 148016158,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688311
    },
    {
        "content": "<p>After all, a translation of a book is much easier to write than coming up with the original ideas to begin with...</p>",
        "id": 148016202,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688336
    },
    {
        "content": "<p>We currently are only translating mathlish to Lean. And its taking forever...</p>",
        "id": 148016211,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542688388
    },
    {
        "content": "<p>We don't even have a working definition of perfectoid spaces yet. And that definition is completely useless without theorems about them. To prove interesting theorems requires at least 10x as much work as defining them. So there we are 3 mathematicians working on a definition for 1 year. My guess is that we are 10 years away from using \"almost mathematics\" to compare the \"etale site\" of a \"perfectoid field\" with its \"tilt\". That theorem would be immensely useful, but all those words need a lot of work to get them into Lean. We could crowd source this, but the crowd will only help if their work doesn't become obsolete before it is even finished.</p>",
        "id": 148016307,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542688585
    },
    {
        "content": "<p>Ahh, I would agree with Leo here - ITPs are probably not for you if all you are interested in is the mathematics</p>",
        "id": 148016374,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688696
    },
    {
        "content": "<p>after all, it takes years to become an expert user like Mario or Johannes</p>",
        "id": 148016378,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688719
    },
    {
        "content": "<p>you can't even convince programmers to formally verify their software :p so why should the working mathematician? even so, I appreciate that people are interested in ITPs, and these early adopters will surely influence future progress in the area</p>",
        "id": 148016392,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542688780
    },
    {
        "content": "<blockquote>\n<p>how are we going to convince them (and me?) that all this formalisation effort is not ephemeral, and that ITPs should stabilise in the near future?</p>\n</blockquote>\n<p>Because now that Lean makes it possible for even mathematicians to write new tactics, we're seeing all sorts of new kinds of automation appearing, reducing the barrier of drudgery usually imposed by an ITP.</p>\n<p>(And this automation runs quickly, and is being enthusiastically adopted in the mathematical library, and .... oh.)</p>",
        "id": 148016525,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542688968
    },
    {
        "content": "<blockquote>\n<p>(And this automation runs quickly, and is being enthusiastically adopted in the mathematical library, and .... oh.)</p>\n</blockquote>\n<p>Well... we're working on the caching, right (-;</p>",
        "id": 148016545,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> So your answer is... maybe Lean 3.4.x is just good enough for us. And otherwise we'll make one more transition to Lean 4, but then we should be fine?</p>",
        "id": 148016593,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689093
    },
    {
        "content": "<p>No... There's another decade at least of throwing out old theorem provers in favour of new ones.</p>",
        "id": 148016655,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689188
    },
    {
        "content": "<p>And maybe we never get there; it's not as if programmers have run out of enthusiasm for new programming languages, 64 years after FORTRAN.</p>",
        "id": 148016675,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689230
    },
    {
        "content": "<p>But maybe we'll get something like TeX: good fundamentals, extensible enough you never need to throw it out, that the mathematicians can happily grow old with. :-)</p>",
        "id": 148016684,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689261
    },
    {
        "content": "<p>I think we should be enthusiastic about throwing out theorem provers.</p>",
        "id": 148016729,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689290
    },
    {
        "content": "<p>I think in some ways it's a bit sad that there are relatively few \"converts\" from Coq and Isabelle/HOL to the Lean world. Those worlds did a great job of building community, funding, infrastructure, jobs for people, etc, and so of course they have strong attachments. But it's too much to expect individuals to change. :-)</p>",
        "id": 148016774,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689375
    },
    {
        "content": "<p>But how can we ever work with perfectoid spaces if we are constantly change theorem provers?</p>",
        "id": 148016825,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689413
    },
    {
        "content": "<p>Just remember that when Mean comes along, even if you're at the time invested in Lean 7, to advise the youngsters to try it out instead. :-)</p>",
        "id": 148016826,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689428
    },
    {
        "content": "<p>We'll spend all our time reproving Hilbert basis.</p>",
        "id": 148016827,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689429
    },
    {
        "content": "<p>Depressing, isn't it.</p>",
        "id": 148016829,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689448
    },
    {
        "content": "<p>I don't think it will be that big of a change, after all, it will still be based on dependent type theory</p>",
        "id": 148016840,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542689474
    },
    {
        "content": "<p>the tactics may change but the lemma and theorem statements, and how they are constructed from underlying building blocks, i.e., the theory design, that will be the same</p>",
        "id": 148016848,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542689507
    },
    {
        "content": "<p>We really need something as stable as TeX. And I don't see why we can't. We just need to convince Knuth to dedicate TAOCP 4.d to ITP's instead of whatever is on his list.</p>",
        "id": 148016849,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689508
    },
    {
        "content": "<p>It will be a great opportunity to rewrite proofs in a more readable and maintainable form. :-)</p>",
        "id": 148016850,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689513
    },
    {
        "content": "<p>Yeah, I've decided to just be naively optimistic that Lean 3 to Lean 4 will be a doable migration.</p>",
        "id": 148016906,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689592
    },
    {
        "content": "<p>Right, but why do you think mathematicians should get involved, if you also want to change their tooling every 2 years?</p>",
        "id": 148016960,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689653
    },
    {
        "content": "<p>I mean, in the long run, what's this bullshit about <code>begin ... end</code> blocks and this strange Haskell like syntax for writing mathematics? I want to work with an interactive theorem prover inside a <code>\\begin{proof} ... \\end{proof}</code> block, in natural language.</p>",
        "id": 148016966,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689664
    },
    {
        "content": "<p>Until we get there, we'll keep throwing out ITPs.</p>",
        "id": 148016970,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689689
    },
    {
        "content": "<p>I mean, they don't have to change their tooling... you are welcome to fix a Coq release version, or HOL, as you like</p>",
        "id": 148016979,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542689713
    },
    {
        "content": "<p>and indeed, that is what industrial users do</p>",
        "id": 148016982,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1542689720
    },
    {
        "content": "<p>Right so we want to write an ITP in COBOL <span class=\"emoji emoji-1f600\" title=\"grinning\">:grinning:</span></p>",
        "id": 148016984,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689721
    },
    {
        "content": "<p>Once we get there, you can upgrade under the hood as long as your upgrade can still read all the old (natural language) proofs, or at least go over to a blackboard with the previous version and hash it out. :-)</p>",
        "id": 148016989,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110025\">@Andrew Ashworth</span> But maths is such a big interconnected web that we need the entire world-wide community to fix the same version.</p>",
        "id": 148017026,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689764
    },
    {
        "content": "<p>Otherwise I can't make use of my collaborators library.</p>",
        "id": 148017034,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689782
    },
    {
        "content": "<p>It's just a long project. Wishing that everyone could fix on a version is no good if that version is as hopeless as Lean is today.</p>",
        "id": 148017044,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689838
    },
    {
        "content": "<p>Catch 22</p>",
        "id": 148017046,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1542689861
    },
    {
        "content": "<p>(And I mean that in the most positive way possible: Lean is awesome compared to the alternatives, in my view.)</p>",
        "id": 148017048,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1542689864
    },
    {
        "content": "<blockquote>\n<p>When they visit Johannes's talk on what's in mathlib, they will find that schemes and perfectoid spaces haven't made it into mathlib, even though Kevin (and Kenny, Patrick, me) have been working on them for around a year.</p>\n</blockquote>\n<p>I think it's a bit misleading to say we've been working on perfectoids for around a year. One year ago I was about to install Lean (Github says I managed to install Lean on November 25th, it's almost my  Lean birthday!) and you were pretty far away if I remember correctly. Since then we (Kevin, you and me) have been using Lean only part-time, and the perfectoid project began on June 2nd. More importantly, as I told you in Freiburg, we need to read again and again the second message in the perfectoid thread: <a href=\"#narrow/stream/116395-maths/subject/Perfectoid.20spaces/near/127308229\" title=\"#narrow/stream/116395-maths/subject/Perfectoid.20spaces/near/127308229\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/subject/Perfectoid.20spaces/near/127308229</a> We asked \"what should  we do?\" to one of the (two or three?) people who worked from the beginning to the end on the single huge pure math formalization project ever. And then we completely ignored the answer, and didn't write a detailed roadmap. I think there is hope for more efficient future projects.</p>",
        "id": 148024717,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1542702936
    },
    {
        "content": "<p>Indeed, I have no desire to try to tell a crowd of mathematicians that \"all this formalisation effort is not ephemeral, and that ITPs should stabilise in the near future.\" Neither of these statements are true, at least from a mathematical perspective. But that doesn't mean that there's no value in working on these projects right now, and it shouldn't stop people from doing that work if they understand the situation.</p>\n<p>The audience here won't be a random selection of people. They'll all have been convinced to attend a workshop specifically about formal mathematics. If they learn the current state of things and get scared off, it doesn't bother me so much -- we won't have to deal with them complaining about why nothing works. :) The point is to catch the people who are interested enough to deal with all the shortcomings, and get them to help fix some of those shortcomings.</p>\n<p>With that said, there's probably a better ordering of talks that puts some more optimistic ones earlier on. The schedule is guaranteed to shift around before January and I'll keep this in mind!</p>",
        "id": 148030949,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1542710797
    },
    {
        "content": "<p>Maybe proofs written in a hierarchical style (with intermediate steps spelled out with <code>have φ₁; have φ₂; …</code>) would help make them robust and portable across versions? One could rely on ATPs to re-prove the low-level steps when changing versions…</p>",
        "id": 148050181,
        "sender_full_name": "Simon Cruanes",
        "timestamp": 1542730702
    },
    {
        "content": "<p>We now have 60 people registered for Lean Together. That's, like, twice as many as we were expecting. Exciting!</p>",
        "id": 151269510,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1544445814
    },
    {
        "content": "<p>For those who were asking about recordings a while back: the talks will be streamed and recorded by people from the VU A/V department. Much better than me pointing a webcam at the front of the room.</p>",
        "id": 151269595,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1544445933
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> <span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span> I guess all speakers will be using slides for their talk; at least I will. But is there also a blackboard in the lecture room?</p>",
        "id": 154164615,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1546418981
    },
    {
        "content": "<p>I might want to do some improvised sketches using chalk...</p>",
        "id": 154164661,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1546419007
    },
    {
        "content": "<p>I think there's a whiteboard. Definitely either a whiteboard or a blackboard, but I can't remember which.</p>",
        "id": 154169311,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546427049
    },
    {
        "content": "<p>Did you prepare a large supply of whiteboard pens?</p>",
        "id": 154169329,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546427099
    },
    {
        "content": "<p>Of course, there's a large supply in the department office next to my office.</p>",
        "id": 154169557,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546427423
    },
    {
        "content": "<p>I definitely want to do some improvised sketches using whiteboard pens. I am not even sure I will have any pdf slides, but I will want to use Lean with my laptop.</p>",
        "id": 154172330,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1546431844
    },
    {
        "content": "<p>Do lecture rooms still come with chalkboards? I haven't seen one since the 90s.</p>",
        "id": 154172919,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1546432877
    },
    {
        "content": "<p>Sure!</p>",
        "id": 154172928,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546432919
    },
    {
        "content": "<p>But probably only in maths departments...</p>",
        "id": 154172970,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546432934
    },
    {
        "content": "<p>I did read that there was a huge uproar when some Japanese manufacturer of chalk went out of business. <a href=\"https://gizmodo.com/why-mathematicians-are-hoarding-this-special-type-of-ja-1711008881\" target=\"_blank\" title=\"https://gizmodo.com/why-mathematicians-are-hoarding-this-special-type-of-ja-1711008881\">https://gizmodo.com/why-mathematicians-are-hoarding-this-special-type-of-ja-1711008881</a></p>",
        "id": 154173004,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1546433029
    },
    {
        "content": "<p>hagoromo, I'm sure</p>",
        "id": 154173051,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1546433093
    },
    {
        "content": "<p>only time I've ever seen brand loyalty for chalk</p>",
        "id": 154173060,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1546433123
    },
    {
        "content": "<p>I had no idea people actually liked chalkboards better than whiteboards until I read that article</p>",
        "id": 154173117,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1546433207
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I remember there was lots of confusion in Orsay about when someone qualifies as a mathematician. Maybe we finally have some sort of binary test <span class=\"emoji emoji-1f606\" title=\"lol\">:lol:</span></p>",
        "id": 154173558,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1546433978
    },
    {
        "content": "<p>I miss blackboards</p>",
        "id": 154175760,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1546437158
    },
    {
        "content": "<p>I still use whiteboards, especially when lecturing to 3rd or 4th years</p>",
        "id": 154175780,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1546437204
    },
    {
        "content": "<p>Hello! I'm currently on the bus from Schiphol to Amstelveen and I'm staying at the Amsterdam Forest Hotel in case anybody wants to meet up.</p>",
        "id": 154413011,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1546613180
    },
    {
        "content": "<p>I'll stay there too, but my train should arrive in Amsterdam on Sunday at 20:44, so I guess I'll see people only on Monday morning</p>",
        "id": 154413289,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546613465
    },
    {
        "content": "<p>I should arrive at the hotel at around the same time</p>",
        "id": 154416679,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1546616645
    },
    {
        "content": "<p>But I guess you'll have dinner before arriving, right?</p>",
        "id": 154416710,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546616692
    },
    {
        "content": "<p>Haven't planned that far yet...</p>",
        "id": 154416922,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1546616904
    },
    {
        "content": "<p>Can someone post some instructions on how to get from \"Vrije Universiteit Amsterdam, De Boelelaan 1105\" (which google maps can find) to \"Main building, room Agora 1 (floor 3)\" (which I can't get it to find)? Or a direct google maps link to the main building or whatever? PS I will be arriving late on Sunday and am not staying at Forest (too slow; I only bought tickets etc after my course had finished).</p>",
        "id": 154417448,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1546617478
    },
    {
        "content": "<p>De Boelelaan 1105 is the main building. Don't be confused if Google Maps calls it the Hoofdgebouw. There are signs inside that will direct you to the Agora rooms.</p>",
        "id": 154417571,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546617589
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> Are you travelling together with Kenny? He speaks Dutch...</p>",
        "id": 154417692,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1546617706
    },
    {
        "content": "<p>There's also a map on the website that identifies the main building. The Agora rooms are roughly right above where it says 1105, I think.</p>",
        "id": 154417748,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546617733
    },
    {
        "content": "<p>Note for the Americans coming, European \"floor 3\" is really the 4th floor. <span class=\"emoji emoji-1f642\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 154417781,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546617778
    },
    {
        "content": "<p>Great, thanks. No, I'm not travelling with Kenny, I think Kenny and Chris sorted their flights out ages ago; I only just bought mine a few days ago.</p>",
        "id": 154418166,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1546618131
    },
    {
        "content": "<p>I have a better plan for finding the room. Is there anyone staying at the forest hotel who knows how to go to the lecture room, and how long it takes? If yes then I'd  this person to tell me at what time we should meet for breakfast.</p>",
        "id": 154418793,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546618695
    },
    {
        "content": "<p>I just made a new stream for the workshop so we can avoid spamming people who aren't coming. <a class=\"stream\" data-stream-id=\"179818\" href=\"/#narrow/stream/179818-Lean-Together-2019\">#Lean Together 2019</a></p>",
        "id": 154419662,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1546619680
    },
    {
        "content": "<p>Don't they deserve to be spammed?</p>",
        "id": 154419678,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1546619697
    }
]