[
    {
        "content": "<p>I'm noticing more and more things posted here where I think \"that's cool, but doesn't fit in mathlib.\" Unfortunately, with the rate mathlib changes, these things are very susceptible to bit rot. It's time to address this!</p>\n<p>I put together the beginnings of a <a href=\"https://github.com/leanprover-contrib/leanprover-contrib\">project repository</a> earlier today. There's a script that (when it's finished) will try to build all <code>lean-3.*.*</code> branches of checked in projects, with respect to the latest corresponding version of mathlib (and the latest versions of other dependencies, if there are any).</p>\n<p>The idea right now is not that mathlib contributors are expected to update the collected projects. But if mathlib changes break a project, the project owners will be notified as soon as the CI script runs. (Once a day?) We could also potentially add this as a CI step on mathlib, displaying failures but not blocking merges. </p>\n<p>This is very much WIP so comments and suggestions are appreciated. And it's yet another thing that I don't really have time for right now, so if anyone is interested in collaborating/taking charge, let's talk.</p>",
        "id": 205496337,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124396
    },
    {
        "content": "<p>I also remembered halfway into building this that <span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> had started on something similar a while back. I may have just rediscovered a bunch of ideas he already had! Sorry Simon, maybe you have suggestions here?</p>",
        "id": 205496464,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124452
    },
    {
        "content": "<p>Yes indeed, I have such a project which I haven't touched in a while. The idea is to curate sets of projects in such a way that there's always a known answer to \"which version of which packages do I need\"</p>",
        "id": 205496717,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596124582
    },
    {
        "content": "<p>The script is runnable right now, if you figure out what Python packages you need. It assumes you have <code>lean</code> (via <code>elan</code>), <code>leanpkg</code>, and <code>leanproject</code> in the path. It will check out a bunch of stuff and pollute whatever directory you run it in.</p>",
        "id": 205496728,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124588
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110026\">Simon Hudon</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205496717\">said</a>:</p>\n<blockquote>\n<p>Yes indeed, I have such a project which I haven't touched in a while. The idea is to curate sets of projects in such a way that there's always a known answer to \"which version of which packages do I need\"</p>\n</blockquote>\n<p>Hmm, that sounds slightly different. Do you have this project hosted somewhere?</p>",
        "id": 205496951,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124681
    },
    {
        "content": "<p>That question doesn't always have an answer, does it?</p>",
        "id": 205497032,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124704
    },
    {
        "content": "<p>The point is helping create an answer when possible. Basically, select generations of packages, build them together and report which project is broken, leaving it to the author of the package to decide to fix the breakage or not be a part of that generation</p>",
        "id": 205497240,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596124806
    },
    {
        "content": "<p>Here is where I put it: <a href=\"https://github.com/leanprover-community/mathlib-tools/tree/lean-depot\">https://github.com/leanprover-community/mathlib-tools/tree/lean-depot</a></p>",
        "id": 205497259,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596124813
    },
    {
        "content": "<p>Cool, thanks. I'll take a look. This sounds very much like what I've done, except I've defined \"generations\" by Lean versions.</p>",
        "id": 205497597,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596124968
    },
    {
        "content": "<p>If you know you want to use packages x, y, and z, you should be able to ask the tool if there are any Lean versions where x, y, and z all build against the last mathlib commit for that version.</p>",
        "id": 205497867,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125072
    },
    {
        "content": "<p>It may not turn out to be a problem but one worry I had was that the repository would become large, of uneven quality and that mathlib maintainers (or specifically me) we become responsible for fixing the breakage.</p>",
        "id": 205497871,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596125074
    },
    {
        "content": "<p>This is definitely a worry. It's a matter of setting up the right expectations and rules around entering the repo. Having outdated projects in there isn't a problem, especially if other projects don't depend on them. I think we just need to emphasize that project owners are responsible for updating their own projects.</p>",
        "id": 205498144,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125190
    },
    {
        "content": "<p>We may decide that some subset of projects are \"blessed\" and get to participate in mathlib CI in some way. Obviously we'd need criteria to make this decision.</p>",
        "id": 205498192,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125224
    },
    {
        "content": "<p>That sounds reasonable. And you may resort to submodules to decentralize the organization</p>",
        "id": 205498250,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596125263
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110026\">Simon Hudon</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205498250\">said</a>:</p>\n<blockquote>\n<p>That sounds reasonable. And you may resort to submodules to decentralize the organization</p>\n</blockquote>\n<p>Hmm, what do you mean by that?</p>",
        "id": 205498435,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125365
    },
    {
        "content": "<p>The sign-up process I have right now is just adding a link to a repo. There's no checking in code. The build script clones all the relevant repos every time it runs.</p>",
        "id": 205498554,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125412
    },
    {
        "content": "<p>If I have a repo and I want to be part of that collection, <code>git</code> has a <code>submodule</code> feature that lets you reference my repo from yours. Then updating my repo doesn't automatically break your build and your submodule reference must be explicitly updated to follow my official versions.</p>",
        "id": 205498636,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596125476
    },
    {
        "content": "<p>Aha. Yeah, I think that isn't needed with the current architecture.</p>",
        "id": 205498754,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125544
    },
    {
        "content": "<p>It might be time to rid of the lean-xyz branches now.</p>",
        "id": 205498897,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596125605
    },
    {
        "content": "<p>And move to releases/tags instead?</p>",
        "id": 205499290,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596125794
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205498754\">said</a>:</p>\n<blockquote>\n<p>Aha. Yeah, I think that isn't needed with the current architecture.</p>\n</blockquote>\n<p>I'm not sure about that. I feel like if it's necessary to have your code hosted in that repo, it denies people control of their own projects. I think it's worth considering</p>",
        "id": 205499415,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596125864
    },
    {
        "content": "<p>My first thought this morning was to fork every checked-in repo to the <code>leanprover-contrib</code> organization, and to automatically update revisions in <code>leanpkg.toml</code>s to point to these forks. But it sounded very messy. Why do we want to deny people control of their own projects?</p>",
        "id": 205499874,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596126065
    },
    {
        "content": "<p>I am looking at this as more of a CI thing, less of a package manager. Maybe this is where the difference lies.</p>",
        "id": 205499920,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596126090
    },
    {
        "content": "<p>I like the idea of my projects being able to track master very much. What happened with the perfectoid project would be that we'd leave it for a bit, or try to get some of it into mathlib and worry about that, and then we'd try to bump mathlib and the project would break in ways I didn't understand because I don't keep up with all mathlib changes. To hear \"a change to mathlib in the last 24 hours just broke your project\" is a very welcome piece of news in this situation.</p>",
        "id": 205500186,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596126222
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> more like only having master.  The separation into lean versions is not particularly useful, its much more important to know the mathlib version.  The lean-xyz branches just cause headaches.</p>",
        "id": 205500576,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596126402
    },
    {
        "content": "<p>The lean-xyz branches are good as synchronization points though. If every project only has master, and gets updated every few weeks/months to the latest mathlib, how could you ever start a new project with two separate dependencies?</p>",
        "id": 205501168,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596126719
    },
    {
        "content": "<p>Haha, with the current release cadence the lean version is kind of a proxy for the mathlib version.. You could always look for commits with matching date manually.  But I won't push this.  Its only a few more days until the clover blooms.</p>",
        "id": 205501956,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596127116
    },
    {
        "content": "<p>Yeah, a mathlib release schedule would be just as good. But that'd probably be pegged to a Lean release schedule to some degree, hah.</p>",
        "id": 205502306,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596127297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> I don't think handling submodules will add so much to your setup and I think if could make a big difference for people who want their package in that archive</p>",
        "id": 205504650,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596128551
    },
    {
        "content": "<p>IMHO, a great strength of the AFP for Isabelle is that everything is updated to be compatible with the last release. They have official releases of Isabelle every 8 months, a snapshot of the AFP at that date where everyting compiles, and then the AFP is updated together with master, where someone making a change in master is responsible for fixing what breaks in the AFP.</p>",
        "id": 205507682,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596130337
    },
    {
        "content": "<p>So what happens when they refactor subgroups?</p>",
        "id": 205508211,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596130617
    },
    {
        "content": "<p>They fix everything. But it's stable enough that they don't need to refactor subgroups every day.</p>",
        "id": 205508649,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596130837
    },
    {
        "content": "<p>I'm not sure it's such a good idea that contributors to mathlib would be responsible for a potentially very diverse set of libraries. Especially since I think there should be almost no barrier to entry for that archive so a lot of it can be pretty bad code.</p>",
        "id": 205508970,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596131019
    },
    {
        "content": "<p>For the AFP, there is a barrier entry, in the sense that the AFP maintainers check that the code is not crazy. But the bar is not too high either, just reasonable.</p>",
        "id": 205509285,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596131177
    },
    {
        "content": "<p>What would be something that is acceptable for the AFP but not acceptable for mathlib?</p>",
        "id": 205509747,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596131403
    },
    {
        "content": "<p>If you want to formalize something that is interesting to you but not to the community (logic puzzles from a book, that you want to formalize the way you want), for instance.</p>",
        "id": 205510042,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596131570
    },
    {
        "content": "<p>Or 10 different versions of graph libraries that are mutually incompatible.</p>",
        "id": 205510070,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596131585
    },
    {
        "content": "<p>I think we might be better off reserving that treatment for only parts of the repository. I think there's a big review load already.</p>",
        "id": 205510869,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596131993
    },
    {
        "content": "<p>Yes, I agree that it's not necessary that everything is fixed along the way, especially when the core library is seeing a lot of refactors. It might become an option when things are much more stable. But I think it is important that some things are fixed along with mathlib (for instance books and tutorials)</p>",
        "id": 205511214,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1596132122
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 205512618,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596132713
    },
    {
        "content": "<p>Probably projects that are used by many others too</p>",
        "id": 205512673,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596132726
    },
    {
        "content": "<p>This is what I was trying to capture by:<br>\n<span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205498192\">said</a>:</p>\n<blockquote>\n<p>We may decide that some subset of projects are \"blessed\" and get to participate in mathlib CI in some way. Obviously we'd need criteria to make this decision.</p>\n</blockquote>\n<p>The LFTCM tutorials could be blessed. Changes to mathlib that break them would raise a big flag. There would be at least a social obligation to fix the tutorial if you make a PR that raises this flag.</p>",
        "id": 205514955,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596133755
    },
    {
        "content": "<p>But I do think we should move away from putting everything important in the mathlib repo. People who want to use the tutorials shouldn't have to clone the mathlib repo. It should be a Lean project like the LFTCM repo was.</p>",
        "id": 205515081,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596133807
    },
    {
        "content": "<p>I'm familiar with the Isabelle AFP model and it's an ideal to keep in mind. But I'm pretty sure mathlib still changes too drastically too quickly for it to be practical right now. We'd need a serious review process on entries and the mathlib maintainers are already stretched thin.</p>",
        "id": 205515190,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596133883
    },
    {
        "content": "<p>My image here is much lighter weight. It's a way for smaller projects to get a bit of visibility and a bit of automatic updating.</p>",
        "id": 205515372,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596133974
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110026\">Simon Hudon</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205504650\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> I don't think handling submodules will add so much to your setup and I think if could make a big difference for people who want their package in that archive</p>\n</blockquote>\n<p>Could you expand on this? I'm really not sure what the benefit is.</p>",
        "id": 205515479,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134031
    },
    {
        "content": "<p>This is a great idea! Is the plan that all projects in the list should pass with latest mathlib  as much as possible? I was thinking it would be good to have  a community maintained  list of projects with interesting work in, this list could do that role also if there was a flag for included in CI or not, as there are already many projects which contain interesting work but are way behind mathlib master.</p>",
        "id": 205515634,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1596134080
    },
    {
        "content": "<p>It will track the latest version of mathlib that a project compiles with, and flag the project owner if/when the project breaks. So yeah, it will be very easy to make a list of checked in projects and their status (if they compile with new mathlib/the last version they work with).</p>",
        "id": 205516140,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> The idea is to make it a decentralized organization. That we can add a project to this archive without relinquishing control of the project or abandoning the github data (issues, pull requests, etc)</p>",
        "id": 205516167,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596134388
    },
    {
        "content": "<p>But that's already possible? All you have to do is add your project repo name to <a href=\"https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml\">https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml</a></p>",
        "id": 205516324,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134466
    },
    {
        "content": "<p>Ah ok, it's more similar to what I was doing. I thought you were storing the code there</p>",
        "id": 205516389,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596134505
    },
    {
        "content": "<p>Well, technically the script doesn't do that yet, it only fetches from the leanprover-contrib repo. But that's what I wrote in the readme :p</p>",
        "id": 205516411,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134521
    },
    {
        "content": "<p>My original thought was to fork repos to this organization but I decided against that. Just haven't updated the couple lines of relevant code since the test repos were in this org anyway, heh.</p>",
        "id": 205516552,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134597
    },
    {
        "content": "<p>The one thing you lose with this setup is auto-updating the checked in repos when there's no breakage. But this gets complicated quick and I don't think it's worth the trouble.</p>",
        "id": 205516864,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134763
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205516864\">said</a>:</p>\n<blockquote>\n<p>The one thing you lose with this setup is auto-updating the checked in repos when there's no breakage. But this gets complicated quick and I don't think it's worth the trouble.</p>\n</blockquote>\n<p>You mean as opposed to hosting the code itself?</p>",
        "id": 205516935,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596134816
    },
    {
        "content": "<p>Yes, if we hosted the code ourselves we could update the dependencies automatically. Otherwise we need write permission to the checked in repo.</p>",
        "id": 205517127,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134913
    },
    {
        "content": "<p>But if we keep our own version and update it, it diverges (slightly) from the main version, needing someone to keep them aligned.</p>",
        "id": 205517213,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596134970
    },
    {
        "content": "<p>Yeah. I think hosting the blessed projects only might be sufficient.</p>",
        "id": 205517452,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596135093
    },
    {
        "content": "<p>The builder could also submit a PR to the affected project (like the nolints PR).</p>",
        "id": 205517471,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596135100
    },
    {
        "content": "<p>Or maybe an issue?</p>",
        "id": 205517566,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596135128
    },
    {
        "content": "<p>Technically, a PR is an issue (they have the same API and numbering on github).</p>",
        "id": 205517590,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596135149
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205517471\">said</a>:</p>\n<blockquote>\n<p>The builder could also submit a PR to the affected project (like the nolints PR).</p>\n</blockquote>\n<p>This gets super awkward when you have project 1 depending on project 2 and project 2 needs to update. Then you need to update project 1 to a commit of project 2 that may not exist, depending on if your PR gets squashed, rebased, whatever.</p>",
        "id": 205517654,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135188
    },
    {
        "content": "<p>It also just seems kind of annoying, there will be one PR every day like clockwork unless we magically have a day with no mathlib commits...</p>",
        "id": 205517826,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135261
    },
    {
        "content": "<p>Fair enough, this also rules out one issue per day.  Can we at least spam the owners via email?</p>",
        "id": 205517914,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596135298
    },
    {
        "content": "<p>We should definitely open an issue when things break. I don't think spamming them to update helps much of anything.</p>",
        "id": 205517983,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135341
    },
    {
        "content": "<p>In fact, we should just publish an action script to update and build once a day and let people install that themselves.</p>",
        "id": 205518055,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135371
    },
    {
        "content": "<p>That kind of does 90% of the job of this repo, heh.</p>",
        "id": 205518086,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135391
    },
    {
        "content": "<p>It just doesn't handle dependencies very well.</p>",
        "id": 205518133,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135412
    },
    {
        "content": "<p>Ah so it opens one issue, and doesn't open a new one until the first one is closed?  That sounds good to me.<br>\nDo you get a notification if a cron job action fails?</p>",
        "id": 205518865,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596135762
    },
    {
        "content": "<p>Yeah, someone gets a notification. Whoever last modified the .yml file maybe? The cron job could also open an issue though.</p>",
        "id": 205519111,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596135873
    },
    {
        "content": "<p>I wonder who should be spammed for the <code>tutorials</code> or other projects that have multiple maintainers.  Opening an issue is probably the easiest way to notify all interested parties.</p>",
        "id": 205519345,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596135981
    },
    {
        "content": "<p>I need to look into what <code>leanpkg</code> does with conflicting dependencies. This project repo might not be necessary at all...</p>",
        "id": 205520415,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596136446
    },
    {
        "content": "<p>If you depend on multiple versions of mathlib, the last one \"wins\" (in the order the dependencies are traversed).</p>",
        "id": 205520456,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596136484
    },
    {
        "content": "<p>Hmm. Then I think there is a place for the project repo. <code>leanpkg upgrade</code> isn't recursive, right? It won't updgrade the mathlib revision of a dependency?</p>",
        "id": 205520747,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596136683
    },
    {
        "content": "<p>I have completely forgotten what <code>leanpkg upgrade</code> does.  But I'm pretty sure it isn't recursive.</p>",
        "id": 205524376,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596138762
    },
    {
        "content": "<p>I think we can be sure that any way it might resolve conflicts won't result in choosing one version of mathlib that will work with all dependencies. I think the need for the project archive is certain</p>",
        "id": 205524668,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1596138895
    },
    {
        "content": "<p>Not sure if this makes sense, but perhaps the project repository could store, for each project, the most recent mathlib commit it works with. Then you could have automation that regularly checks all the projects against current mathlib, and for each project, either updates the project repository (if it still works) or files an issue on the project (if it doesn't). Then you'd only have the daily (or whatever) commits in the project repository, but the maintainers of the projects can still be confident that they <em>can</em> upgrade when they want to</p>",
        "id": 205526054,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1596139580
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"307953\">Ruben Van de Velde</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205526054\">said</a>:</p>\n<blockquote>\n<p>Not sure if this makes sense, but perhaps the project repository could store, for each project, the most recent mathlib commit it works with. Then you could have automation that regularly checks all the projects against current mathlib, and for each project, either updates the project repository (if it still works) or files an issue on the project (if it doesn't). Then you'd only have the daily (or whatever) commits in the project repository, but the maintainers of the projects can still be confident that they <em>can</em> upgrade when they want to</p>\n</blockquote>\n<p>I'm not quite sure what you mean by the \"project repository\" here -- do you mean a fork of the project to <code>leanprover-contrib</code>?</p>",
        "id": 205533079,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596143432
    },
    {
        "content": "<p>Terminology is a little confusing :)<br>\nI was thinking you'd have the projects.yml file include a link to the git repository of the project plus a mathlib commit hash</p>",
        "id": 205533436,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1596143631
    },
    {
        "content": "<p>So the automation would just update the hash in <a href=\"https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml\">https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml</a> , not the git repository that holds the actual code</p>",
        "id": 205533510,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1596143659
    },
    {
        "content": "<p>Might be completely off base, but it avoids the issue of pushing changes to all the different git repositories every day</p>",
        "id": 205533571,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1596143704
    },
    {
        "content": "<p>Ah, I see what you mean. Even better, I think it should store a table: every time CI runs, store the mathlib commit hash and the commit hash of every project that builds wrt that mathlib.</p>",
        "id": 205533719,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596143804
    },
    {
        "content": "<p>That way, if you know that you need packages x, y, z working together, you look for the most recent mathlib hash in the table that also has hashes for x, y, and z.</p>",
        "id": 205533754,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596143840
    },
    {
        "content": "<p>I definitely don't want to push changes from the CI repo to the projects. I think we should write a (separate) Action script that they can install on their own, to do daily updates.</p>",
        "id": 205533888,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596143925
    },
    {
        "content": "<p>This is \"live,\" in that you can sign up your project and it will get checked periodically and open some issues if things are broken. See the <a href=\"https://github.com/leanprover-contrib/leanprover-contrib\">readme</a> for details.</p>",
        "id": 205605300,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596209546
    },
    {
        "content": "<p>It stores some history <a href=\"https://github.com/leanprover-contrib/leanprover-contrib/blob/store-version-history/version_history.yml\">here</a>.</p>",
        "id": 205605382,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596209587
    },
    {
        "content": "<p>At some point I'll move this to the leanprover-community org. Since the plan is no longer to fork projects, there's no need for a separate org.</p>",
        "id": 205605452,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596209634
    },
    {
        "content": "<p>And it will be more powerful with some local Actions scripts on the project repos, coming later.</p>",
        "id": 205605561,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596209687
    },
    {
        "content": "<p>Adding <code>lean-x.y.z</code> branches is a massive commitment, is there a chance to make it test <code>master</code>?<br>\nIf I were to add a <code>lean-3.17.1</code> branch today, will the bot at least try to upgrade it to <code>lean-3.18.4</code> in a few days?</p>",
        "id": 205606640,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596210319
    },
    {
        "content": "<p>I only care about building my projects against mathlib master</p>",
        "id": 205607519,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596210760
    },
    {
        "content": "<p>My plan is to write an action for the project repo to install, that will mirror each commit to master to the right <code>lean-x.y.z</code> branch. I don't think it should be the job of this tool to guess the \"last\" project commit for a particular Lean version. Same with trying to upgrade to new Lean versions. If it's done by an action in the project repo, it can automatically push the new branch when a successful upgrade can be done.</p>",
        "id": 205607546,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596210774
    },
    {
        "content": "<p>Assuming these actions are in place in the project repo, the project master will always be up to date with a <code>lean-x.y.z</code> branch, so there's no need to test master too.</p>",
        "id": 205607634,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596210830
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> your projects don't have any dependencies besides mathlib, do they?</p>",
        "id": 205607717,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596210864
    },
    {
        "content": "<p>No</p>",
        "id": 205607727,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1596210875
    },
    {
        "content": "<p>You'll be welcome to add them to this repo, but it won't do anything you can't do locally. I'm going to make a GitHub action you can install on your own project. It will try to upgrade your <code>master</code> to mathlib <code>master</code> every night (or however often you want).</p>",
        "id": 205607839,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596210956
    },
    {
        "content": "<p>So if I don't upgrade the lean version, then the repo won't notify if changes in mathlib have broken my project?  If I upgrade the lean version, then I need to upgrade mathlib as well.  So everything needs to be done manually, and the bot doesn't help me.</p>",
        "id": 205608202,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596211155
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205607839\">said</a>:</p>\n<blockquote>\n<p>You'll be welcome to add them to this repo, but it won't do anything you can't do locally. I'm going to make a GitHub action you can install on your own project. It will try to upgrade your <code>master</code> to mathlib <code>master</code> every night (or however often you want).</p>\n</blockquote>\n<p>Now that I think about it, this exact action is already running in the tutorial repo. <a href=\"https://github.com/leanprover-community/tutorials/blob/master/.github/workflows/main.yaml\">https://github.com/leanprover-community/tutorials/blob/master/.github/workflows/main.yaml</a> You could copy this directly into the same directory in your own repo and it will update it once a week if it can. Change the funny number at the top to do it more often.</p>",
        "id": 205608357,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596211229
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205608202\">said</a>:</p>\n<blockquote>\n<p>So if I don't upgrade the lean version, then the repo won't notify if changes in mathlib have broken my project?  If I upgrade the lean version, then I need to upgrade mathlib as well.  So everything needs to be done manually, and the bot doesn't help me.</p>\n</blockquote>\n<p>An action running in your repo will upgrade the Lean and mathlib versions and push to a new <code>lean-x.y.z</code> branch. It can do this regardless of whether your project builds with the upgrade. Then the bot will pick it up.</p>",
        "id": 205608646,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596211400
    },
    {
        "content": "<p>The tutorials action doesn't seem to update the <code>lean-x.y.z</code> branch though.</p>",
        "id": 205610172,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1596212148
    },
    {
        "content": "<p>No, that script is ancient, almost two months old! From before I knew there was any need for the <code>x.y.z.</code> branches. But it will do <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> 's job of checking his master against mathlib master just fine.</p>",
        "id": 205617503,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596216310
    },
    {
        "content": "<p>I just want to add a contrary note here, that I think this whole concept may be harmful. I think already we miss out on lots of good material that is developed in other  repositories, which then bitrots. I'm unpersuaded so far that this proposal will improve this; in fact by blessing it as standard practice it may make it worse, and just leave us with an excellent reference list of broken projects.</p>\n<p>Rather, I think we should be encouraging everyone to do their new work on branches of mathlib, and actively discourage even creating new repositories.</p>\n<p>I appreciate this is being contrary; hopefully just food for thought and discussion. (Of course I'm happy to help out and contribute if this new system is the way to go.)</p>",
        "id": 205652858,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596239153
    },
    {
        "content": "<p>Uh, so my response turned into a short essay, sorry... posting this in pieces.</p>",
        "id": 205677083,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280732
    },
    {
        "content": "<blockquote>\n<p>Rather, I think we should be encouraging everyone to do their new work on branches of mathlib, and actively discourage even creating new repositories.</p>\n</blockquote>\n<p>Doing work on a mathlib branch doesn't accomplish anything unless that work gets PRed. And I don't think it's maintainable to say that every Lean project should be PRed to mathlib.</p>",
        "id": 205677087,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280740
    },
    {
        "content": "<p>First, there's the PR process. We can't assume that anyone making a PR to mathlib will stick around to maintain their own code. So the community needs to be willing and able to keep additions up to date. There's a burden on the person making the PR to get their code into reasonable shape. There's a huge burden on the reviewers to guide them through this process and check that the code actually is reasonable -- you know as well as I do how much effort it can take to get a rough PR into shape.<br>\nAnd any lapses here make a burden for future contributors, who may not even know or care about this material, but need to change something that it depends on.</p>",
        "id": 205677094,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280752
    },
    {
        "content": "<p>Saying that everything should be PRed to mathlib is telling everyone involved that it's always worth it to take on these burdens. I don't think this is fair: I can absolutely imagine someone doing something cool in Lean, that they'd like to keep reasonably up to date, that they don't think is worth the effort of PRing. I  guarantee this has happened before.</p>",
        "id": 205677099,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280768
    },
    {
        "content": "<p>Second, there's the question of what material \"belongs\" in mathlib. Obviously this is subjective. I don't want to debate the edge cases here, but I can name two projects I've looked at in the last week that I think clearly <em>don't</em> belong and are clearly worth archiving in some way: the Mathematica link and verified Sudoku. I don't know of any programming language where every project written in that language is distributed as part of its standard library.</p>",
        "id": 205677100,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280776
    },
    {
        "content": "<p>Mathlib is a resesarch project in its own right and also a standard library. As a project, I think some of its strengths are that it does things at high levels of generality and is surprisingly interconnected and coherent. We don't (or we try not to) have multiple APIs for the same content, similar things are glued together as much as possible, etc.</p>",
        "id": 205677102,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280784
    },
    {
        "content": "<p>Opening it up with an \"anything goes\" approach would contradict all this. I can imagine getting five different pedagogical developments of intro calc, based on different first principles, unconnected to each other, unused and unusable in the rest of the library. All have perfectly good value as Lean projects. None fit in mathlib as a research project. And why should they be part of a standard library? It's like five different markdown parsers in Python. If you want to use one, you start your own Python project and <code>pip install</code> that package. Same here: if you want to build material based on someone else's intro calc, you start your own Lean project and <code>leanpkg add</code> that package, which you find on a list on our website, generated from the repository I'm proposing.</p>",
        "id": 205677103,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280791
    },
    {
        "content": "<p>(end of essay)</p>",
        "id": 205677155,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280849
    },
    {
        "content": "<p>Of course none of this is to say that we shouldn't pull in material from other projects when it seems appropriate. And a centralized project repository makes it easier to see what's been done in other projects.</p>",
        "id": 205677209,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596280926
    },
    {
        "content": "<p>Maybe we should do both: set up this infrastructure, and at the same time work out of more systematic way to encourage anyone working on something (plausibly) \"library-worthy\" that we really hope their contribution will make it into mathlib, not just as CI-checked repository, and a good way to do this is to do work in branches of mathlib.</p>",
        "id": 205677587,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596281649
    },
    {
        "content": "<p>I am waiting for the discussions to settle down so I can put my project that is worth keeping up to date (with me as maintainer, not mathlib) but not worth distributing to everyone</p>",
        "id": 205677813,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282131
    },
    {
        "content": "<p>My view on this is similar to Kevin's: I want my project to be built against current master, and if a mathlib change breaks it I would like to be notified, but after that if I don't pick it up then it should just be marked as abandoned so that it doesn't bother the global tracker</p>",
        "id": 205677831,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282221
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205677813\">said</a>:</p>\n<blockquote>\n<p>I am waiting for the discussions to settle down so I can put my project that is worth keeping up to date (with me as maintainer, not mathlib) but not worth distributing to everyone</p>\n</blockquote>\n<p>Does your project meet the criteria <a href=\"https://github.com/leanprover-contrib/leanprover-contrib#what-to-do-as-a-project-owner\">here</a> / can you make one <code>lean-3.17.1</code> branch mirroring master? If so, please add it as a test!</p>",
        "id": 205677890,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282350
    },
    {
        "content": "<p>Clearly more testing is needed. For instance, I see from last night's run that I got the case wrong where mathlib changes but no project does.</p>",
        "id": 205677939,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282410
    },
    {
        "content": "<p>This seems to require that I pin down the version? I just said I don't want to do that (it is too high maintenance)</p>",
        "id": 205677945,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282437
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205677831\">said</a>:</p>\n<blockquote>\n<p>My view on this is similar to Kevin's: I want my project to be built against current master, and if a mathlib change breaks it I would like to be notified, but after that if I don't pick it up then it should just be marked as abandoned so that it doesn't bother the global tracker</p>\n</blockquote>\n<p>As with Kevin, the only part of this that can't be done locally is publicity -- it sounds like you just want an action that tries to update your project every day.</p>",
        "id": 205677985,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282506
    },
    {
        "content": "<p>every month would be fine for my abandoned projects</p>",
        "id": 205677997,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282555
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205677945\">said</a>:</p>\n<blockquote>\n<p>This seems to require that I pin down the version? I just said I don't want to do that (it is too high maintenance)</p>\n</blockquote>\n<p>This repo is 48 hours old, not all features are there. For now one version branch is fine.</p>",
        "id": 205677998,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282556
    },
    {
        "content": "<p>I'm thinking this is just an upkeep operation on old projects</p>",
        "id": 205678006,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282587
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205608357\">said</a>:</p>\n<blockquote>\n<p>Now that I think about it, this exact action is already running in the tutorial repo. <a href=\"https://github.com/leanprover-community/tutorials/blob/master/.github/workflows/main.yaml\">https://github.com/leanprover-community/tutorials/blob/master/.github/workflows/main.yaml</a> You could copy this directly into the same directory in your own repo and it will update it once a week if it can. Change the funny number at the top to do it more often.</p>\n</blockquote>",
        "id": 205678052,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282615
    },
    {
        "content": "<p>Keeping a project that depends only on mathlib up to date is a local task. There's no global activity needed there.</p>",
        "id": 205678080,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282712
    },
    {
        "content": "<p>The job is harder when you have projects with multiple or transitive dependencies.</p>",
        "id": 205678121,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596282743
    },
    {
        "content": "<p>I don't think I want to be a first adopter for this kind of thing though. I'll wait until after the tutorials come out</p>",
        "id": 205678208,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1596282952
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110087\">Scott Morrison</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205677587\">said</a>:</p>\n<blockquote>\n<p>Maybe we should do both: set up this infrastructure, and at the same time work out of more systematic way to encourage anyone working on something (plausibly) \"library-worthy\" that we really hope their contribution will make it into mathlib, not just as CI-checked repository, and a good way to do this is to do work in branches of mathlib.</p>\n</blockquote>\n<p>Sure. I have no picture of what a systematic way to do this would be, but of course I'm not against the idea.</p>",
        "id": 205678807,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596283986
    },
    {
        "content": "<p>As a newcomer, I really love this prototype and the ideas behind it.</p>",
        "id": 205681645,
        "sender_full_name": "Utensil Song",
        "timestamp": 1596288871
    },
    {
        "content": "<p>The \"monolithic\" philosophy behind Mathlib is crucial to absorb important formalized mathematics as much as possible. Every project out there should seriously consider PRing part of it (if not all of it) into mathlib, especially the foundation part of the project that most likely should be kept interconnected and coherent with other parts of Mathlib, be kept general, maintainable, efficient to the standard of mathlib, and encapsulate the foundation into high-level primitives and theorems friendly to users who are less sophisticated in math.</p>",
        "id": 205681649,
        "sender_full_name": "Utensil Song",
        "timestamp": 1596288877
    },
    {
        "content": "<p>On the other hand, the reality is, as it should be, that there're satellite projects such as tutorials, games, workshop repos to form the ecosystem, as well as formalized projects, domain-specific stand-alone projects, educational projects like in Xena projects. An ecosystem like this is the model that scales.</p>",
        "id": 205681656,
        "sender_full_name": "Utensil Song",
        "timestamp": 1596288891
    },
    {
        "content": "<p>What's lacking for these projects, are the generic tooling to keep them in good shape. There're lots of tools to help Mathlib to be maintainable but can't be easily reused for a stand-alone project, arguably this is one of the reasons for the projects that are not PRed into Mathlib to rot.</p>",
        "id": 205681664,
        "sender_full_name": "Utensil Song",
        "timestamp": 1596288903
    },
    {
        "content": "<p>Understandably, the work on generalizing these tools (or merge some tools into a toolkit, e.g. leanproject, format_lean, doc_gen, blueprint etc.) to work for the whole ecosystem is currently marked to have a low priority by core members of Mathlib. This is an inevitable resource bottleneck in the current stage. But these're mostly just hard work (i.e. no hard technical barrier) and definitely can be solved when there're more users of Lean and Mathlib and the motivations accumulate. This prototype sends a signal for these coming goodies.</p>",
        "id": 205681673,
        "sender_full_name": "Utensil Song",
        "timestamp": 1596288913
    },
    {
        "content": "<p>Here's a first action: <a href=\"https://github.com/leanprover-contrib/update-versions-action\">https://github.com/leanprover-contrib/update-versions-action</a></p>",
        "id": 205726452,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596372773
    },
    {
        "content": "<p>Install this and it will keep your <code>lean-x.y.z</code> branches mirroring master. Going forward, anyway. It won't create anything historical.</p>",
        "id": 205726469,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596372827
    },
    {
        "content": "<p>Assuming you don't use <code>lean-x.y.z</code> branches, this action will seem to do nothing for you, which is good. It's just keeping your repo structure compatible with the project repository.</p>",
        "id": 205726587,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596373021
    },
    {
        "content": "<p>And here's a second action: <a href=\"https://github.com/leanprover-contrib/lean-upgrade-action\">https://github.com/leanprover-contrib/lean-upgrade-action</a></p>",
        "id": 205781864,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596452606
    },
    {
        "content": "<p>Install this and it will try to upgrade your project once a day. It will push the result if the upgrade succeeds and open an issue if the upgrade fails.</p>",
        "id": 205781894,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596452634
    },
    {
        "content": "<p>I promise this action has bugs and needs testing.</p>",
        "id": 205781942,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596452651
    },
    {
        "content": "<p>Rob, as you can see <a href=\"https://github.com/leanprover-community/tutorials/pull/24\">here</a> whatever <a href=\"https://github.com/leanprover-community/tutorials/blob/master/.github/workflows/main.yaml\">this script</a> is meant to do didn't report a mathlib update breakage. Should I get rid of it and try your latest action?</p>",
        "id": 205791626,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596460417
    },
    {
        "content": "<p>Hah. That's because it should say <code>lean src --make</code>.</p>",
        "id": 205792020,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596460627
    },
    {
        "content": "<p>But yes, please do switch to the action.</p>",
        "id": 205792030,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596460636
    },
    {
        "content": "<p>I think it's fine to keep it scheduled for once a week. The demo workflow for the action schedules it for once a day.</p>",
        "id": 205792063,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596460668
    },
    {
        "content": "<p>In fact, let's install both of the new actions and add it to the project repo.</p>",
        "id": 205792160,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596460709
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> a website question while you're here. The project repository stores the success/failure of the builds like this: <a href=\"https://raw.githubusercontent.com/leanprover-contrib/leanprover-contrib/store-version-history/version_history.yml\">https://raw.githubusercontent.com/leanprover-contrib/leanprover-contrib/store-version-history/version_history.yml</a></p>\n<p>I'd like to display this on the website as a table.</p>\n<div class=\"codehilite\"><pre><span></span><code>             | 3.16.3 | 3.17.0 | 3.17.1 | 3.18.4\nmathematica  | build  |        | build  |\ntest-repo-1  | build  | fail   | build  | fail\ntest-repo-2  |\nanother-test |\n</code></pre></div>\n\n\n<p>etc. I can put the data in whatever format is convenient. What would be the way to do this that fits in with the rest of the website generation?</p>",
        "id": 205793881,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596461662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205792160\">said</a>:</p>\n<blockquote>\n<p>In fact, let's install both of the new actions and add it to the project repo.</p>\n</blockquote>\n<p>I'm not sure I understand this sentence.</p>",
        "id": 205794139,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596461788
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/tutorials/issues/25\">tutorials#25</a></p>",
        "id": 205794272,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596461870
    },
    {
        "content": "<p>Thanks</p>",
        "id": 205794411,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596461923
    },
    {
        "content": "<p>About the website question: do you want a new web page in the community website displaying this table?</p>",
        "id": 205794509,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596461966
    },
    {
        "content": "<p>Yeah, that was the plan.</p>",
        "id": 205794560,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596461993
    },
    {
        "content": "<p>Do you like the tables from the mathlib stats page?</p>",
        "id": 205794637,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596462016
    },
    {
        "content": "<p>We can have a page that lists all the projects that are checked in with some information about them, and displays this table at the end, to show which projects are compatible with which Lean versions.</p>",
        "id": 205794691,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596462053
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/205794637\">said</a>:</p>\n<blockquote>\n<p>Do you like the tables from the mathlib stats page?</p>\n</blockquote>\n<p>Sure, I'm not picky. Those are higher tech than I was imagining for this.</p>",
        "id": 205794728,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596462072
    },
    {
        "content": "<p>But if the tools are there, no reason not to reuse them!</p>",
        "id": 205794803,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596462121
    },
    {
        "content": "<p>They are very cheap to generate, they use <a href=\"http://tabulator.info/\">http://tabulator.info/</a>. See <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/templates/mathlib_stats.html#L180-L188\">https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/templates/mathlib_stats.html#L180-L188</a></p>",
        "id": 205795004,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596462213
    },
    {
        "content": "<p>In that case the data comes from <a href=\"https://leanprover-community.github.io//mathlib_stats/gitstats.js\">https://leanprover-community.github.io//mathlib_stats/gitstats.js</a></p>",
        "id": 205795124,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596462258
    },
    {
        "content": "<p>Search for <code>authors =</code> and <code>authors_cols = </code> in the js data file</p>",
        "id": 205795206,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596462313
    },
    {
        "content": "<p>Simply staring at those examples should be enough to build what you want very easily.</p>",
        "id": 205795353,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1596462372
    },
    {
        "content": "<p>Okay, cool, thanks. I'll take a look.</p>",
        "id": 205795441,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1596462421
    },
    {
        "content": "<p>Just to update people on the status here: I've written some Github Actions scripts that will help maintain your projects. See the recommendations <a href=\"https://leanprover-community.github.io/ci.html\">here</a>. These are still in beta so please report bugs/annoying behavior.</p>\n<p>If your project depends only on mathlib (or on nothing at all), and nothing depends on your project, these scripts are really all you need for CI. But you should add it to the <a href=\"https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml\">contrib repository</a> anyway. This will help if other people want to use your project as a dependency. It will also help with publicity -- I have a draft of a page for the leanprover-community site that will display the checked-in projects with compatibility information.</p>",
        "id": 207983954,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598372185
    },
    {
        "content": "<p>Thanks! Should you add the tutorials project there?</p>",
        "id": 207985254,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598372843
    },
    {
        "content": "<p>Or even MIL?</p>",
        "id": 207985271,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598372855
    },
    {
        "content": "<p>Both of those should definitely use the actions scripts. We can also check them in to the repo, but there's less benefit there. I don't think either will be used as a dependency and they might be out of place on the display page. But that depends what else goes in to the repo I guess.</p>",
        "id": 207985863,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598373105
    },
    {
        "content": "<p>I was asking about the repo, the script case is clear.</p>",
        "id": 207985955,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598373136
    },
    {
        "content": "<p>Sorry this wasn't clear.</p>",
        "id": 207985967,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598373143
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/121\">https://github.com/leanprover-community/leanprover-community.github.io/pull/121</a> introduces the page that displays checked in projects.</p>",
        "id": 207989165,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598374565
    },
    {
        "content": "<p>Does this picture means your script can't build the perfectoid project? Our CI says it builds (with an ancient mathlib of course).</p>",
        "id": 207989487,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598374719
    },
    {
        "content": "<p>The picture says it doesn't build with mathlib's <code>lean-3.5.1</code> branch. It uses the version branches as \"releases.\"</p>",
        "id": 207989718,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598374818
    },
    {
        "content": "<p>My guess is, if you found the last commit before you upgraded from 3.4.2 and put that on a branch called <code>lean-3.4.2</code>, you'd get a check mark in that column.</p>",
        "id": 207989798,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598374855
    },
    {
        "content": "<p><code>lean-3.5.1</code> means right before mathlib moved to whatever the next version of Lean was, right?</p>",
        "id": 207989932,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598374917
    },
    {
        "content": "<p>Right.</p>",
        "id": 207989986,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598374926
    },
    {
        "content": "<p>If we are lucky maybe that was not too long after we stopped bumping mathlib in the project.</p>",
        "id": 207990026,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598374944
    },
    {
        "content": "<p>Johan or Kevin, do you feel some motivation?</p>",
        "id": 207990075,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598374962
    },
    {
        "content": "<p><code>leanpkg upgrade</code> should bump mathlib to its last commit on the <code>lean-3.5.1</code> branch, if you want to try.</p>",
        "id": 207990108,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598374979
    },
    {
        "content": "<p>The checkmarks update once a day sometime in the middle of the night European time.</p>",
        "id": 207990411,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598375106
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/207989718\">said</a>:</p>\n<blockquote>\n<p>The picture says it doesn't build with mathlib's <code>lean-3.5.1</code> branch. It uses the version branches as \"releases.\"</p>\n</blockquote>\n<p>To explain this a bit more: the idea with that table is that, if you want to import e.g. <code>mathlib</code>, <code>topos</code>, and <code>lean-perfectoid-spaces</code> in the same project, you need to pick a Lean version that they all support. But there's another compatibility issue, since <code>topos</code> and <code>lean-perfectoid-spaces</code> both depend on <code>mathlib</code>, you need a <code>mathlib</code> version that's compatible with both. So we assume that for any project <code>A</code> depending on <code>B</code> on Lean version <code>x.y.z</code>, the head commit on <code>A</code>'s  <code>x.y.z</code> branch should build using the head commit of <code>B</code>'s <code>x.y.z</code> branch. That's what the check marks are testing. If you need three projects and they all have check marks on the same Lean version, the head commits on those branches are all compatible so you're in luck.</p>",
        "id": 207992069,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598375783
    },
    {
        "content": "<p>The story the graph tells now is \"there's not much compatibility,\" hah. Best you can do is <code>super2</code>, <code>mathematica</code>, and <code>mathlib</code> on 3.17.1.</p>",
        "id": 207992196,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598375844
    },
    {
        "content": "<p>Or <code>super</code>, <code>mathematica</code>, and <code>mathlib</code> on 3.4.1, but that's cheating, because neither <code>super</code> nor <code>mathematica</code> use <code>mathlib</code>.</p>",
        "id": 207992252,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598375874
    },
    {
        "content": "<p>Not a big surprise...</p>",
        "id": 207992391,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598375926
    },
    {
        "content": "<p>The picture would be rosier if there were more <code>x.y.z</code> branches, which those actions will help with going forward.</p>",
        "id": 207992591,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598376014
    },
    {
        "content": "<p>I think the main limiting ingredients are project depending on something else than mathlib.</p>",
        "id": 207993801,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598376534
    },
    {
        "content": "<p>(or, better, on mathlib and something else).</p>",
        "id": 207993831,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1598376547
    },
    {
        "content": "<p>Limiting ingredients for stress-testing the setup, for sure.</p>",
        "id": 207995007,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598377071
    },
    {
        "content": "<p>The fewer of those we have, the more check marks we should get.</p>",
        "id": 207995084,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598377089
    },
    {
        "content": "<p>Do we want this perfectoid thing compiling again?</p>",
        "id": 208005580,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1598381324
    },
    {
        "content": "<p>I linked this in another thread, but to repeat it here: <a href=\"https://leanprover-community.github.io/lean_projects.html\">here</a> are all the projects checked in so far. Add yours! And star the ones that are there so we look good.</p>",
        "id": 208364144,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1598631638
    },
    {
        "content": "<p>I should probably write a better description :)</p>",
        "id": 208390968,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1598646138
    },
    {
        "content": "<p>Darn, I should have looked more carefully for this an hour ago instead of essentially manually rewriting it and then looking after to see if someone else had done this :). This action should basically remove me needing to do these installs manually, right? <a href=\"https://github.com/Julian/lean-across-the-board/blob/main/.github/workflows/ci.yml#L20-L30\">https://github.com/Julian/lean-across-the-board/blob/main/.github/workflows/ci.yml#L20-L30</a></p>",
        "id": 209041475,
        "sender_full_name": "Julian Berman",
        "timestamp": 1599176355
    },
    {
        "content": "<p>In case it's useful feedback, I did try and find something like this but I looked for something called <code>setup-lean</code>, in line with what other actions use, or for something like <code>toolchain</code>, in line with what the rust (cargo) action uses (<a href=\"https://github.com/actions-rs/toolchain\">https://github.com/actions-rs/toolchain</a>)</p>",
        "id": 209041518,
        "sender_full_name": "Julian Berman",
        "timestamp": 1599176402
    },
    {
        "content": "<p>Hm. It won't though leave behind the <code>lean</code> binary on the host right, just in the container it's running in? So I wouldn't be able to run the <code>lean --make test</code> command afterwards?</p>",
        "id": 209041805,
        "sender_full_name": "Julian Berman",
        "timestamp": 1599176641
    },
    {
        "content": "<p>I believe it doesn't leave behind the binary, no. But it runs <code>leanpkg test</code> which first builds <code>src</code> and then <code>test</code> if it exists.</p>",
        "id": 209061605,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1599203372
    },
    {
        "content": "<p>I'm no expert at designing these things, happy to accept improvements.</p>",
        "id": 209061715,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1599203457
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/209061605\">said</a>:</p>\n<blockquote>\n<p>I believe it doesn't leave behind the binary, no. But it runs <code>leanpkg test</code> which first builds <code>src</code> and then <code>test</code> if it exists.</p>\n</blockquote>\n<p>Ah that's awesome! Didn't know that (sounds like you may indeed be an expert then :D)</p>",
        "id": 209087080,
        "sender_full_name": "Julian Berman",
        "timestamp": 1599222238
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20project.20repository.20prototype/near/207983954\">said</a>:</p>\n<blockquote>\n<p>Just to update people on the status here: I've written some Github Actions scripts that will help maintain your projects. See the recommendations <a href=\"https://leanprover-community.github.io/ci.html\">here</a>. These are still in beta so please report bugs/annoying behavior.</p>\n<p>If your project depends only on mathlib (or on nothing at all), and nothing depends on your project, these scripts are really all you need for CI. But you should add it to the <a href=\"https://github.com/leanprover-contrib/leanprover-contrib/blob/master/projects/projects.yml\">contrib repository</a> anyway. This will help if other people want to use your project as a dependency. It will also help with publicity -- I have a draft of a page for the leanprover-community site that will display the checked-in projects with compatibility information.</p>\n</blockquote>\n<p>OK yeah dropping in this action indeed worked perfectly :) thanks!</p>",
        "id": 209150411,
        "sender_full_name": "Julian Berman",
        "timestamp": 1599262799
    },
    {
        "content": "<p>Another reminder to people, set up some <a href=\"https://leanprover-community.github.io/ci.html\">CI</a> for your project and add it to the <a href=\"https://leanprover-community.github.io/lean_projects.html\">list of external projects</a>! Once the list is a little more populated we should start linking there.</p>",
        "id": 209494288,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1599647591
    },
    {
        "content": "<p>Out of curiosity, does this give me compiled oleans I can download somewhere like mathlib does?</p>",
        "id": 209692313,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1599764024
    },
    {
        "content": "<p>No, but we could potentially have the CI scripts create github actions artifacts and then maybe have <code>leanproject</code> try to get those for non-mathlib projects. (Maybe this is too much of a step backwards though, since we moved away from that sort of thing due to people hitting GitHub API limits.)</p>",
        "id": 209700698,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599767668
    },
    {
        "content": "<p>Aren't the projects already being compiled by CI when there's a new version of mathlib though - so the limits which could be hit are storage of oleans rather then computation usage</p>",
        "id": 209701174,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1599767862
    },
    {
        "content": "<p>Sorry, I was unclear. I meant that <code>leanproject</code> users (maybe it was still called <code>update-mathlib</code> then?) were hitting GitHub's API limits when they tried to download oleans that were hosted on GitHub.</p>",
        "id": 209701396,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599767959
    },
    {
        "content": "<p>Ah I see, makes sense</p>",
        "id": 209701585,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1599768057
    },
    {
        "content": "<p>Mathlib's olean files are hosted on Azure right now, and I think it would be difficult to allow random Lean projects to upload their own oleans while keeping the credentials secure.</p>",
        "id": 209701620,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599768076
    },
    {
        "content": "<p>Yeah, I agree with <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> here. We can't allow arbitrary repos to upload to Azure without making it \"free unlimited file storage for everyone.\" We could change the action to upload an artifact which you could download by hand. IIRC, at least when we started using Actions, there was no way to map a commit hash to a particular artifact. And this isn't even well defined, you can run the same action multiple times on the same commit. So \"leanproject but downloading from Actions artifacts instead of Azure\" doesn't work.</p>",
        "id": 209756066,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1599814972
    }
]