[
    {
        "content": "<p>My colleagues (<span class=\"user-mention\" data-user-id=\"385895\">@Jon Eugster</span>, <span class=\"user-mention\" data-user-id=\"507231\">@Marcus Zibrowius</span>, Immi Halupczok) and I are considering to organize a “Lean for the Curious Mathematician\" workshop in Düsseldorf in the week 04.–08 September, 2023.</p>\n<p>Now we’ve found out that <span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span>  and <span class=\"user-mention\" data-user-id=\"133635\">@Sander Dahmen</span> are organizing a similar workshop in the Netherlands in July;<br>\n<span class=\"user-mention\" data-user-id=\"519559\">@Dagur Ásgeirsson</span> and <span class=\"user-mention\" data-user-id=\"456608\">@Boris Kjær</span> are organizing a masterclass in Lean formalization in Copenhagen in June;<br>\nand <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> and <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> are organizing a workshop for women in Edinburgh.</p>\n<p>So we are thinking about whether the market for Lean workshops in 2023 is saturated already. I'd like to avoid a situation where we are competing against each other, especially regarding potential speakers. I'd be grateful about any thoughts on this.</p>",
        "id": 317306126,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671696343
    },
    {
        "content": "<p>In general, see <a href=\"https://leanprover-community.github.io/events.html\">https://leanprover-community.github.io/events.html</a> for a list of upcoming events.<br>\n<span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> <span class=\"user-mention\" data-user-id=\"133635\">@Sander Dahmen</span> <span class=\"user-mention\" data-user-id=\"260507\">@Heather Macbeth</span> <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> it looks like your events are not yet listed.</p>",
        "id": 317306549,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671696531
    },
    {
        "content": "<p>The Copenhagen event is somewhat specialized, so I don't think that causes \"competition\".</p>",
        "id": 317306900,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671696696
    },
    {
        "content": "<p>We still don't know the dates of our workshop (we have received confirmation that it was approved, but we are waiting for more details). Should we list it with date TBA?</p>",
        "id": 317308626,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1671697401
    },
    {
        "content": "<p>Yes, that sounds like a good idea</p>",
        "id": 317309351,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671697627
    },
    {
        "content": "<p>Does the format support that?</p>",
        "id": 317310189,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671697952
    },
    {
        "content": "<p>2023 sounds just so futuristic to me. I didn't realize it's in a few weeks!</p>",
        "id": 317379332,
        "sender_full_name": "Trebor Huang",
        "timestamp": 1671719501
    },
    {
        "content": "<p>Regarding LFTCM -- is this somehow going to become a \"flagship event\" organised by the community every two years, or is it more flexible? My understanding is that we had one in 2020 and 2022, and the 2024 meeting has already been booked.</p>",
        "id": 317384409,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671720840
    },
    {
        "content": "<p>I also talked to <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>  about this. Apparently there is a LFTCM admin team, and Jeremy is one of them. I don't know who the others are.</p>\n<p>I wasn't aware that it was supposed to be only every second year. In that case, we'll probably reconsider and only do a smaller workshop or none at all.</p>",
        "id": 317386160,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671721279
    },
    {
        "content": "<p>Well, I guess it could also be yearly... We just missed 2021...</p>",
        "id": 317390617,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1671722593
    },
    {
        "content": "<p>We don't have anything as specific as an LFTCM admin team! I fielded Alex's query as a member of the general <a href=\"https://leanprover-community.github.io/teams/admin.html\">admin team</a>, in our role as \"the first point of contact for the community as a whole.\"</p>\n<p>This raises the question as to how best to coordinate meetings. For now, the general feeling among the admin team and maintainers is that we don't need anything very formal yet. Someone who wants to hold a meeting is advised to check with the admin team first for information and advice, and then they are advised to announce the plans on a public Zulip stream for feedback. When plans are settled, the meeting should be listed on the <a href=\"https://leanprover-community.github.io/events.html\">events page</a>.</p>\n<p>Maybe, for planning purposes, it would be helpful to list tentative events on the events page, in a special category with the label \"tentative\" or \"in planning\"? That way, anyone planning to hold a meeting will be able to see what  others are working on. </p>\n<p>My personal opinion is that we shouldn't limit the LFTCM meetings. If the community can sustain a dozen a year, why not? We can distinguish them with location and year, e.g. \"Lean for the Curious Mathematician, Providence 2022\". It's really just a matter of having sufficient resources and having enough of an audience to make it worthwhile.</p>\n<p>On the other hand, I can see that it might be nice to have regularly scheduled Lean Together meetings with a standard format and community guidelines. If we get to that stage, we should probably set up a meetings team. (Conferences in CS have \"steering committees,\" whose main job is to twist arms to find organizers every year.)</p>",
        "id": 317392971,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671723223
    },
    {
        "content": "<p>With all that, I never addressed Alex's question. I don't know whether having two LFTCMs so close together (chronologically and geographically) makes sense, since it might mean that they are competing for participants. I wouldn't object to it, but it might make more sense to stagger them more. We still don't have a good sense of how many people an in-person meeting will draw.</p>",
        "id": 317394210,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671723602
    },
    {
        "content": "<p>I agree with the general comments Jeremy wrote. And also Leiden in July and Düsseldorf in September seems really close. However the Leiden thing is less specific. It will not be only about Lean.</p>",
        "id": 317394579,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723704
    },
    {
        "content": "<p>In particular the Leiden thing will definitely not be called LFTCM something.</p>",
        "id": 317394803,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723765
    },
    {
        "content": "<p>It seems to be called \"Machine-Checked Mathematics\". But maybe I was dreaming it will mix Coq and Lean based on the fact that Assia is an organizer.</p>",
        "id": 317395014,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723828
    },
    {
        "content": "<p><a href=\"https://www.lorentzcenter.nl/machine-checked-mathematics.html\">https://www.lorentzcenter.nl/machine-checked-mathematics.html</a></p>",
        "id": 317395126,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723853
    },
    {
        "content": "<p>It still feels like doing the Dusseldorf one a bit later would be better.</p>",
        "id": 317395318,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671723938
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317392971\">said</a>:</p>\n<blockquote>\n<p>My personal opinion is that we shouldn't limit the LFTCM meetings. If the community can sustain a dozen a year, why not? We can distinguish them with location and year, e.g. \"Lean for the Curious Mathematician, Providence 2022\". It's really just a matter of having sufficient resources and having enough of an audience to make it worthwhile.</p>\n</blockquote>\n<p>I agree with this.  The Sage community has \"Sage Days\" and they have now reached Sage Days 116.<br>\n<a href=\"https://wiki.sagemath.org/Workshops\">https://wiki.sagemath.org/Workshops</a></p>",
        "id": 317403129,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1671726338
    },
    {
        "content": "<p>Sage days are much lighter than LFTCM. Anyone can organize one to gather a couple of friends.</p>",
        "id": 317403283,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671726378
    },
    {
        "content": "<p>maybe we should encourage chill Lean events too :)</p>",
        "id": 317405854,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1671727124
    },
    {
        "content": "<p>Wasn't that what my September workshop was?</p>",
        "id": 317407386,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671727560
    },
    {
        "content": "<p>On a less chill note, if someone is going to look through this thread and round eveything up into some table it might be worth mentioning that AIM have just agreed to fund a virtual Lean workshop in formalising algebraic geometry, June 24-28, 2024, organised by myself, Johan Commelin, Adam Topaz and Joel Riou. There will be some more formal announcement nearer the time (this is over 18 months away!)</p>",
        "id": 317437414,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671737283
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317395318\">said</a>:</p>\n<blockquote>\n<p>It still feels like doing the Dusseldorf one a bit later would be better.</p>\n</blockquote>\n<p>Both our limited funding and human resources at Düsseldorf are tied to 2023, and September is the last month before teaching starts. So if we stick to a week long format, there's not much leeway.  If we limit ourselves to a weekend event, we could move it to later in the year.</p>",
        "id": 317446450,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740927
    },
    {
        "content": "<p>I have zero experience in organizing Lean workshops, but I'm much less worried about finding participants than finding speakers &amp; instructors for tutorial sessions.</p>",
        "id": 317446505,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740947
    },
    {
        "content": "<p>If we go in the direction of hands-on tutorials, then it would seem to me that 20-30 participants would already be a good number to work with, and surely it wouldn't be a problem to find that many participants across Germany??  I think we might even fill half the room with participants from Düsseldorf.  But even for this number of participants, we would need some experienced (non-local) instructors.</p>",
        "id": 317446524,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740954
    },
    {
        "content": "<p>If we go more in the direction of presentations, then the number of participants will strongly correlate with the number of high profile speakers, and again, this is where I imagine the bottleneck.</p>",
        "id": 317446546,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1671740964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317310189\">said</a>:</p>\n<blockquote>\n<p>Does the format support that?</p>\n</blockquote>\n<p>Does any want know this? I don't know how the <code>start_date</code> and <code>end_date</code> fields in <code>events.yaml</code> are processed.</p>",
        "id": 317530627,
        "sender_full_name": "María Inés de Frutos Fernández",
        "timestamp": 1671790369
    },
    {
        "content": "<p>The format doesn't support that  yet. I'll fix it. For future reference, those kind of questions are answered in <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/make_site.py\">https://github.com/leanprover-community/leanprover-community.github.io/blob/newsite/make_site.py</a>. If you search for <code>event</code> in that file you'll get an answer.</p>",
        "id": 317531598,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1671790720
    },
    {
        "content": "<p>Do you know <span class=\"user-mention\" data-user-id=\"392185\">@Clara Löh</span> ? She is in Germany and has been using lean in her teaching</p>",
        "id": 317533239,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671791266
    },
    {
        "content": "<p>I keep hearing about her, but we never met. She would definitely be a great speaker to have at the workshop.</p>",
        "id": 317533967,
        "sender_full_name": "Alexander Bentkamp",
        "timestamp": 1671791510
    },
    {
        "content": "<p>To add to the list (even though we are not as far with the organisation as we wanted to be ...): Philipp Rümmer, Denis-Charles Cisinski, and I are organising a workshop/summer school in Regensburg (Germany) 18--29 September 2023 on proof assistants and their use in mathematics and computer science. Thus, the scope will be wider on the theoretical and application side, and we will cover several proof assistants (including Lean, of course).</p>",
        "id": 317561158,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800231
    },
    {
        "content": "<p>My impression is that many math students are interested in learning more about this technology (and way of thinking/working) and that there overall might not be enough options in Germany to do so.</p>",
        "id": 317561447,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800330
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"129120\">@Alexander Bentkamp</span> of course, I would be happy to meet at some point :)</p>",
        "id": 317561513,
        "sender_full_name": "Clara Löh",
        "timestamp": 1671800350
    },
    {
        "content": "<p>Sorry to be slow to catch up. I spent yesterday on airplanes to traveling to visit my in-laws in San Diego, and now I am on California time. The good news is that we seem to have escaped a brutal winter storm that is pounding the most of the US.</p>\n<p>Since Marcus isn't worried about participants, I think we're all enthusiastic a meeting in Dusseldorf. <span class=\"user-mention\" data-user-id=\"129120\">@Alexander Bentkamp</span> <span class=\"user-mention\" data-user-id=\"507231\">@Marcus Zibrowius</span>, in a moment I'll start a private thread with Heather, Patrick, Johan, and me so that we can talk about organization.</p>\n<p>It's nice to see so much meeting activity! I guess this thread will serve as a place for people to share their plans.</p>",
        "id": 317623888,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1671821032
    },
    {
        "content": "<p>I’m thinking about launching a Lean for Curious Scientists and Engineers workshop here in Maryland / online. Nothing official yet. I’m thinking we’d cover a mix of topics around FPIL and TPIL, guiding students in writing a program that performs some basic scientific calculation (like SciLean) as well as a proof about the math / code. I’d want this fully in Lean 4; mathport progress would affect the extent of what we can prove - having single variable calculus and limits by then would be helpful.</p>",
        "id": 317712215,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1671882695
    },
    {
        "content": "<p>Will you need to relate <code>float</code> to <code>real</code>?</p>",
        "id": 317717545,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671884996
    },
    {
        "content": "<p>Good question. How are those related in Lean? Can we just write proofs with reals and implement them numerically with floats? </p>\n<p>I’m personally more interested in “the mathematics of the software corresponds to the theory” than in “let’s be sure that floating point arithmetic errors don’t accumulate and lead to qualitatively bad numerical results.” Though we do need the second to be <em>really</em> sure about the results, especially in certain contexts like stiff ODEs or ill-conditioned matrices, those are old problems; formalizing the high-level mathematics of software is a newer challenge, and more interesting to me.</p>",
        "id": 317738936,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1671894912
    },
    {
        "content": "<p>Right now they are 100% unrelated in lean, I believe.</p>",
        "id": 317744039,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671897752
    },
    {
        "content": "<p>There has been quite some discussion on how to relate them in <a class=\"stream\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4\">#lean4</a> before but iirc all the attempts to get this done in a quick fashion were fruitless. Furthermore the fact that we define <a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Float#doc\">docs4#Float</a> in Lean 4 in a way that makes them close to impossible to argue about in non trivial scenarios on their own already, because the <code>Float</code> type is really only a quick facade for C level floats with close to no support on the proving side of things, won't make establishing this connection easier either :/, not even taking into account the connection to reals stuff yet.</p>\n<p>We could in theory attempt to write meta programs that mechanically translate things on the reals to things on floats (of course not translating things from the reals that have a native float implementation such as say arithmetic and trigonometric functions) without a proof that they are equivalent (whatever equivalent might mean in this context) if that is of interest.</p>\n<p>If anyone does have concrete ideas or pointers for how to get this done in a way that does actually have these ideas of some form of equivalence and automated translation I'd be very interested in that, the problem has stayed on my mind ever since the mentioned <a class=\"stream\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4\">#lean4</a> discussions^^</p>",
        "id": 317748754,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671901156
    },
    {
        "content": "<p>I think there’s interest, beyond just me. For example, one way to do this is described here: <a href=\"https://arxiv.org/abs/1706.08605\">https://arxiv.org/abs/1706.08605</a></p>\n<p>“We have proved that our system is correct in an idealized mathematical context with infinite-precision real numbers. To actually execute the system we need to replace all real numbers in the program with floating-point numbers. Although doing so technically invalidates the specification and can introduce numerical instability in some cases, this class of errors is well understood (Higham, 2002), could be ruled out as well in principle (Harrison, 2006; Boldo et al., 2015; Ramananandro et al., 2016) and is conceptually distinct from the algorithmic and mathematical errors that our methodology is designed to eliminate.”</p>",
        "id": 317750048,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1671902263
    },
    {
        "content": "<p>So the way this stuff is implemented is rather hacky IMHO. Basically they have a definition of a tensor and the mathematical primitives here: <a href=\"https://github.com/dselsam/certigrad/blob/master/src/certigrad/tensor.lean\">https://github.com/dselsam/certigrad/blob/master/src/certigrad/tensor.lean</a> (they avoid doing all of the mathematics by stating all of this stuff as axioms, in principle I believe their approach could also work out when actually doing all of this mathematically) </p>\n<p>And then they have a Lean 3 fork that adds executable code for their library functions: <a href=\"https://github.com/leanprover/lean/blob/dd0ade03fc7c90825d03429fd6823b112e86cc67/src/library/vm/vm_eigen.cpp#L443\">https://github.com/leanprover/lean/blob/dd0ade03fc7c90825d03429fd6823b112e86cc67/src/library/vm/vm_eigen.cpp#L443</a> through eigen.</p>\n<p>This is more or less the same as if we told the Lean runtime that the real numbers are equivalent to floats and tagged all the primitive real functions with their native implementations, both achievable via the <code>@extern</code> attribute right now. If people want it to do this way (this is more or less the same as \"write meta programs that automatically do the conversion\" with the difference that the meta programs already exist in form of the Lean compiler) we can do that of course. But I have a feeling mathematicians might be opposed to the idea of essentially telling the runtime and compiler float = real.</p>",
        "id": 317758776,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671910297
    },
    {
        "content": "<p>I think one might in fact be able to derive False using this approach + <code>native_decide</code>.</p>",
        "id": 317758863,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671910347
    },
    {
        "content": "<p>using floats and native_decide you are already dangerously close to being able to prove false just by using oleans across architectures that vary in the implementation of floats</p>",
        "id": 317759052,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1671910511
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"395550\">Henrik Böving</span> <a href=\"#narrow/stream/113488-general/topic/Lean.20workshops.202023/near/317758776\">said</a>:</p>\n<blockquote>\n<p>So the way this stuff is implemented is rather hacky IMHO. Basically they have a definition of a tensor and the mathematical primitives here: <a href=\"https://github.com/dselsam/certigrad/blob/master/src/certigrad/tensor.lean\">https://github.com/dselsam/certigrad/blob/master/src/certigrad/tensor.lean</a> (they avoid doing all of the mathematics by stating all of this stuff as axioms, in principle I believe their approach could also work out when actually doing all of this mathematically) </p>\n</blockquote>\n<p>Oh I agree. Indeed, this was 5-6 years ago; with mathlib, we can do the mathematics right. We can also execute in Lean 4 or in compiled C, rather than link to a library like they do. But as a proof of concept for software development, I appreciate this.</p>",
        "id": 317760195,
        "sender_full_name": "Tyler Josephson ⚛️",
        "timestamp": 1671911623
    },
    {
        "content": "<p>No this is not the part that I find hacky. The axioms is just stuff that we know how to resolve in Lean already, they just did it this way because they didn't want to do the job of mathlib essentially, that's perfectly fine of course. The hacky part about this (to me) is how they make the connection between the reals/tensors and the computable floating point numbers. It is basically declaring an equivalence between them and while that's possible in Lean 4 easily, we'd just write</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">@[extern \"lean_float_add\"]</span>\n<span class=\"kd\">def</span> <span class=\"n\">Real.add</span> <span class=\"o\">:</span> <span class=\"n\">Real</span> <span class=\"bp\">-&gt;</span> <span class=\"n\">Real</span> <span class=\"bp\">-&gt;</span> <span class=\"n\">Real</span> <span class=\"o\">:=</span> <span class=\"bp\">...</span>\n<span class=\"c1\">-- the type declaration and integration gets a little bit trickier but still doable</span>\n</code></pre></div>\n<p>it feels very hacky since it is breaking the contract that the extern implementation should be equivalent to the one in the system which can actually break the system if you poke it hard enough. And that's something we do definitely not want in a fleshed out implementation. And the open question for Lean 4 is mostly, how do we tie reals and floats together in a way so this does not happen, the mathematics around reals, how we can interact with extern code is solved problems.</p>\n<p>And to my knowledge right now nobody has an idea how to teach this connection properly to Lean 4 :(</p>",
        "id": 317760894,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671912141
    },
    {
        "content": "<p>Fully expecting the answer no: are there functions <code>lower, upper : Float -&gt; Real</code> with the property that \"the real number modelled by <code>f : Float</code>\" (whatever that means, if it means anything at all) is in the closed inteval <code>[lower f, upper f]</code> and for all the operations in (whatever operations computer scientists deem are the canonical operations on <code>Float</code>) there are corresponding compatible interval arithmetic theorems in <code>Real</code>, e.g. <code>lower(f)+lower(g) &lt;= lower (f+g)</code> and <code>upper(f+g) &lt;= upper(f)+upper(g)</code>?</p>",
        "id": 317762481,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671913525
    },
    {
        "content": "<p>I'm fully expecting edge cases to break even naive hopes like this (I don't know the first thing about floats)</p>",
        "id": 317762502,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671913557
    },
    {
        "content": "<p>No, that one is not true even without float weirdness. There needs to be an interval extension of <code>+</code> in there somewhere, because you have provided no way for the bounds on a number to grow as you apply more operations</p>",
        "id": 317768057,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1671918356
    },
    {
        "content": "<p>The natural choice for <code>lower</code> and <code>upper</code> there are the rounding limits of the number, i.e. +- 1 ULP from the float's real value (in the finite case), but if you add two numbers with a 1 ULP bound you get a number with a 2 ULP bound</p>",
        "id": 317768159,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1671918430
    },
    {
        "content": "<p>Right -- I'm allowing the bounds to grow -- I'm only asking for inequalities. So the more stuff you do to real numbers the less accuracy you have.</p>",
        "id": 317772581,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671921764
    },
    {
        "content": "<p>I'm suggesting that you can link floats to interval arithmetic, but I'm not suggesting that you can get back.</p>",
        "id": 317772659,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1671921838
    },
    {
        "content": "<p>For examples of calculations of how ulp errors propagate in floating-point arithmetic, see e.g. the start of <a href=\"https://www.mpfr.org/algorithms.pdf\">https://www.mpfr.org/algorithms.pdf</a> (working with interval arithmetic is likely to be simpler in many cases, but also slower). Note that those calculations assume an unbounded exponent range; underflow and overflow add extra complications.</p>",
        "id": 317773439,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1671922380
    },
    {
        "content": "<p>Maybe relevant: <br>\nHales, <em><a href=\"https://link.springer.com/content/pdf/10.1007/s00454-009-9148-4.pdf\">A Revision of the Proof of the Kepler Conjecture</a></em> mentions floating point and MPFI in p.9-10 (section 4.1-4.2).<br>\n<em><a href=\"https://link.springer.com/article/10.1007/s10817-017-9448-y\">A Verified ODE Solver and the Lorenz Attractor</a></em> (\"Light-weight data refinement\")</p>\n<p>both in Isabelle/HOL, unsurprisingly.</p>",
        "id": 317793571,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1671943507
    },
    {
        "content": "<p>The second one refers to this: <a href=\"https://home.in.tum.de/~hoelzl/documents/hoelzl09realinequalities.pdf\">https://home.in.tum.de/~hoelzl/documents/hoelzl09realinequalities.pdf</a> which does make use of interval arithmetics on floating point numbers.</p>",
        "id": 317830050,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671971791
    },
    {
        "content": "<p>\"We overload the polymorphic constant real to interpret float values as real value\" /o\\ et tu!</p>",
        "id": 317831376,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1671972456
    },
    {
        "content": "<p>The author is apparently on this Zulip but the last activity was in 2019 ...</p>",
        "id": 317857131,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1671987338
    },
    {
        "content": "<p>Yes, Johannes Hoelzl is one of the founders of mathlib, although he's gone radio silent since he went to Apple</p>",
        "id": 317860345,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1671989613
    }
]