[
    {
        "content": "<p>It's been almost a year since I started learning about Lean while looking into Metamath, Linux administration, Git, and Web development. I've been able to do these because I took a leave of absence from Korea Aerospace University in the summer of 2020; it was challenging to spend time learning about things that aren't directly related to aerospace engineering when I was in university.</p>\n<p>On the other hand, each of my friends and other people stopped learning about Lean for one or more of the following reasons: it turned out they weren't interested in formal mathematics or functional programming; they had difficulty reading online textbooks and documents written in English; or they became busy with their work or research.</p>\n<p>I think it's safe to say that in South Korea, you can't find a professor in mathematics who uses a proof assistant to teach themselves and students how to formalize mathematics. This situation leads to a lack of students who wish to study formal mathematics; they aren't interested in it or don't have time to research it.</p>\n<p>As I said in <a href=\"#narrow/stream/113489-new-members/topic/Bulhwi.20Cha.20.26.20Seongwoo.20Shim.3A.20Introductions/near/292962002\">my introduction</a>, I aim to develop games for mathematics education and study symplectic geometry so I can formalize them. Ironically, it looks like I'd be better off using Lean and Metamath Zero to achieve my goals if I dropped out of university. Thus I decided to leave the university this summer. I hope future generations of students in my country won't have obstacles to formalization of mathematics using proof assistants.</p>",
        "id": 322719921,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674305663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488124\">@Hyunsik Chae</span> came to my undergraduate workshop -- he's another Korean lean user.</p>",
        "id": 322725306,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1674307862
    },
    {
        "content": "<p>We met each other online last September. But we haven't talked much because he's been busy finishing his Bachelor's thesis and preparing for graduate school.</p>",
        "id": 322794489,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674347813
    },
    {
        "content": "<p>Hello and happy new year! Bulwhi has been in touch with me for a couple of months but I was too busy for close connection due to my graduation. <br>\nBy the way, I would love to share that some professors in Korea have recently started to use Lean (unofficially). If you want to know more please let me know :)</p>",
        "id": 322795990,
        "sender_full_name": "Hyunsik Chae",
        "timestamp": 1674348939
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488124\">@Hyunsik Chae</span> Do they know about this Zulip chat?</p>",
        "id": 322816688,
        "sender_full_name": "Bulhwi Cha",
        "timestamp": 1674368892
    }
]