[
    {
        "content": "<p>When rereading Quinn's AMS article I realized that it does not contain a very extensive description of the \"definition-and-proof technology\" introduced around the turn of the last century, and why Quinn thinks it was (and is!) so successful with mathematicians. You find more in his (unpublished) book on <a href=\"https://intranet.math.vt.edu/people/fquinn/history_nature/nature0.pdf\">https://intranet.math.vt.edu/people/fquinn/history_nature/nature0.pdf</a> .</p>",
        "id": 204305311,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1595087154
    },
    {
        "content": "<p>Regarding the new logical foundations of the early 20th century, Quinn (in his AMS article linked by <span class=\"user-mention\" data-user-id=\"126734\">@Thomas Eckl</span> in the <a href=\"#narrow/stream/238830-Lean-for.20the.20curious.20mathematician.202020/topic/Previous.20discussions.20on.20Lean.20and.20HoTT/near/204216309\">earlier thread</a>) suggests an interesting advantage of rigour:</p>\n<blockquote>\n<p>this approach has unexpected advantages. Trying to fix gaps in first approximations to proofs can lead to conclusions we could not have imagined and would not have dared conjecture. They also make research more accessible: rank-and-file mathematicians can use the new methods confidently and effectively, while success with older methods was mostly limited to the elite.</p>\n</blockquote>",
        "id": 204306603,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1595089080
    },
    {
        "content": "<p>In his book, Quinn sketches a \"science of contemporary mathematics\" which aims to describe the practice of core mathematics where rigour plays an essential role, from many different angles: historical, sociological, pedagogical, philosophical, ... I particularly like the remarks using cognitive neuroscience which explain that mathematicians pack mathematical concepts into (equivalent) definitions, examples, first consequences  because this allows them to build internal models of perception, as humans do for all sorts of perceptions. These models can be more or less useful, and that's why in the beginning theories are so fluid: mathematicians look for the right way to package them into the brain. In the relevant chapter Quinn extensively discusses an algebraic hierarchy - a hint why Lean is so successful with formalizing maths. (-;</p>",
        "id": 204312807,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1595097948
    },
    {
        "content": "<p>I find work like Quinn's so important, because they give clues how the next revolution in mathematics can and should be shaped. There is a revolution ahead, since the methods of 20th century mathematics come to their limit, as all the entertaining examples of published proofs of important results that are in doubt or right away false show. And proof assistants are there to help us out, but then better design them in a way that makes them fit successfully into the core mathematician's practice, and even makes it more effective. That's how it worked last time around.</p>",
        "id": 204313430,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1595098943
    },
    {
        "content": "<p>Interesting thoughts! I would love to discuss this with you in more detail. But I should maybe first try to get my hands on that book by Quinn (-;</p>",
        "id": 204315667,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1595102809
    },
    {
        "content": "<p>Quinn's (draft) book is <a href=\"https://intranet.math.vt.edu/people/fquinn/history_nature/nature0.pdf\">freely available from quinn</a>. Thomas linked it earlier.</p>",
        "id": 204316135,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1595103628
    },
    {
        "content": "<p>Thanks, must have missed that other link</p>",
        "id": 204316206,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1595103725
    },
    {
        "content": "<p>In the last wave of formalization, more precise definitions led to famous counterexamples, which helped to convince mathematicians that these precise definitions were meaningful or necessary.  Quinn mentions the nowhere-differentiable function and the space-filling curve (in his AMS article), which are well-known.  In his book (section 9.2.1) he mentions a third example, about a definition I had not known was controversial at the time:</p>\n<blockquote>\n<p>We now know that analytic techniques require a ‘smooth structure’ and not all manifolds have them. However early proposals to work with smooth structures were rejected on philosophical grounds: manifolds should be objects, not structures on an object. Furthermore, smooth structures seemed to amount to assuming what you wanted to prove, and seemed intellectually dishonest if not logically circular.</p>\n</blockquote>\n<p>Apparently the modern definition of manifold was not fully accepted until Milnor's nonstandard smooth structures on the 7-sphere proved its necessity (in 1957!!).</p>\n<p>Most mathematicians believe that there are a certain number of wrong <em>theorems</em> out there, but probably most mathematicians think we have found the right <em>definitions</em>.  I wonder whether this wave of formalization will bring any wild counterexamples to change that consensus.</p>",
        "id": 204323431,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1595116916
    },
    {
        "content": "<p>The Milnor fact is extraordinary. Grothendieck was defining schemes to be structures on topological spaces in the late 50s.</p>",
        "id": 204341975,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1595152704
    },
    {
        "content": "<p>Finding such counterexamples would be a strong case for formalization. However, the problem at Milnor's time was that it was not universally accepted to peel off layers of structures of well-known (geometric) objects. Now, where is the current conceptual framework whose formal specification would lead to new (counter)examples by analysing the finer details?</p>",
        "id": 205056509,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1595777832
    },
    {
        "content": "<p>My bets are on the new ways to \"argue up to isomorphisms\" developed in homotopy type theory, but you may have different suggestions ...</p>",
        "id": 205056558,
        "sender_full_name": "Thomas Eckl",
        "timestamp": 1595777909
    }
]