[
    {
        "content": "<p>What is the policy on Lean Zulip server regarding external links to math papers and scientific articles? All papers and books from elsevier and sciencedirect can also be downloaded for free at other websites such as 3lib, libgen, sci-hub, tbp, and few others. All of them provide direct links to pdf files. However, in some countries, such websites are considered illegal.</p>\n<p>To put it simple, when I reference to a scientific paper or a book, am I allowed to post a direct link to the pdf file, or do I need to provide the official link that leads to the purchasing page? I am talking only about documents that are not intended (by their author) to be publicly accessible.</p>",
        "id": 264118070,
        "sender_full_name": "Patrick Johnson",
        "timestamp": 1638946248
    },
    {
        "content": "<p>We use a standard <code>bib</code> with URLs pointing to the official webpages (usually DOIs).</p>",
        "id": 264118344,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638946626
    },
    {
        "content": "<p>People who want to use sci-hub etc should know how to do it and whether it is legal or not in their country.</p>",
        "id": 264118368,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638946670
    },
    {
        "content": "<p>Note that in some cases you can be prosecuted for violating, e.g., US copyright law even if the violation took place outside of the US.</p>",
        "id": 264118437,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638946733
    },
    {
        "content": "<p>(I think that the authors should think about ability to post a paper to arXiv before submission, not violate copyright law afterwards; unfortunately, this doesn't work in many non-math fields and this doesn't work for pre-arXiv papers)</p>",
        "id": 264118582,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638946833
    },
    {
        "content": "<p>I think the question is about Zulip not mathlib. I wouldn't go around posting illegal links to copyright material if I were you. This is a serious research forum.</p>",
        "id": 264118734,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1638946995
    }
]