[
    {
        "content": "<p>Various people have been in touch with me concerning getting involved in various ways with Logipedia/Dedukti. Can anyone explain what these things are and what they have to do with Lean, in a way that a mathematician can understand? I'm not sure I know what Reverse Mathematics is, which doesn't help.</p>",
        "id": 189942579,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583535100
    },
    {
        "content": "<p>The files <a href=\"http://logipedia.inria.fr/theorems/download/download.php?sys=lean&amp;md=permutation&amp;id=transpose_transpose\" target=\"_blank\" title=\"http://logipedia.inria.fr/theorems/download/download.php?sys=lean&amp;md=permutation&amp;id=transpose_transpose\">here</a> look kind of terrifying.</p>",
        "id": 189942691,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583535217
    },
    {
        "content": "<p>Those files make me feel better about the comparative quality of the MM0 -&gt; lean translation :)</p>",
        "id": 189944189,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583536563
    },
    {
        "content": "<p>These files look automatically generated from a proof in first order logic</p>",
        "id": 189944210,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583536591
    },
    {
        "content": "<p>they axiomatize nat and other funny things that aren't necessary in lean</p>",
        "id": 189944224,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583536610
    },
    {
        "content": "<p>So the idea is that we can write one proof in one system and it turns into some very complicated things in lots of systems?</p>",
        "id": 189945181,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583537522
    },
    {
        "content": "<p>And then we end up not being able to prove the prime number theorem because it's about the wrong real numbers?</p>",
        "id": 189945227,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1583537543
    },
    {
        "content": "<p>Yes, that's usually what interchange languages end up doing. I think it is important to spend some time on making it look not-horrible though and that work clearly hasn't been put in for Dedukti -&gt; Lean. (I mean seriously, <code>((@foo) )</code> is just horrible formatting and double parens are never required.)</p>",
        "id": 189945729,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583538125
    },
    {
        "content": "<p>One way to clean it up pretty well is to pass it through lean after translation, that is, getting it parsed by lean and printed by the lean pretty printer, which of course knows a lot more about when <code>@</code> signs are needed, where parentheses go, how to use indentation and so on.</p>",
        "id": 189945819,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583538246
    },
    {
        "content": "<p>The approach I took was to skip all definitions that would otherwise be \"axioms\", like <code>nat.O</code>, and put them in a separate file for human review. By a manual process, the user makes these all definitions pointing to the correct thing (i.e. <code>def nat.O := nat.zero</code>) and then everything later will still typecheck and you don't need any axioms that aren't standard lean axioms.</p>",
        "id": 189945906,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1583538388
    }
]