[
    {
        "content": "<p>Has anyone seen <a href=\"https://github.com/magmide/magmide\">Magmide</a>?<br>\n<a href=\"https://github.com/magmide/magmide/blob/main/posts/design-of-magmide.md\">This file</a> shows their main design goals, apparently</p>",
        "id": 284366128,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1653916553
    },
    {
        "content": "<p>I looked at it a few weeks ago when it was posted on Reddit. The vision looked okay, but imo the project is hilariously overscoped. They want to create not just a dependently typed language with fancy metaprogramming but also an imperative object language and a program logic for it. It's just a lot, especially since the guy behind it doesn't seem to be an expert in any of these domains. So while I wish him luck, I wouldn't hold my breath.</p>",
        "id": 284396611,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1653936351
    },
    {
        "content": "<p>As someone who's worked on overambitious projects with little technical knowledge... man, I just wish them well</p>",
        "id": 284398214,
        "sender_full_name": "Violeta Hernández",
        "timestamp": 1653937655
    },
    {
        "content": "<p>Wow, this is very close in design goals to <a href=\"https://github.com/digama0/mm0\">MM0</a> / <a href=\"https://github.com/digama0/mm0/blob/master/mm0-rs/mmc.md\">Metamath C</a>. I'm with Jannis in that I'll hold off judgment until I actually see more than a tech startup pitch. (Obviously I'm very on board with the pitch.)</p>",
        "id": 284455921,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1653993727
    },
    {
        "content": "<p>...oh right, I had a conversation with the author about magmide back in November. He's clearly better at marketing than me based on the github stars, although I'm not brave enough to start marketing MM0 to general programmers yet</p>",
        "id": 284456912,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1653994361
    }
]