[
    {
        "content": "<p>What's the plan with branches for <code>mathlib</code>? We seem to have gone back and forth between using <code>master</code> and using <code>lean-3.4.1</code>. I'd just gone to the effort of creating <code>lean-3.4.1</code> branches in all my repos, and making them the default, so that <code>leanpkg upgrade</code> would successfully pull new changes from <code>mathlib</code>, but now it seems we've going back to using <code>master</code>.</p>",
        "id": 128338643,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457442
    },
    {
        "content": "<p>I'm happy to do whatever is required, but would like some instructions on how to set up repos with dependencies <code>mathlib &lt;--- repoA &lt;--- repoB</code>, so <code>leanpkg upgrade</code> does what I hope it does. :-)</p>",
        "id": 128338693,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457505
    },
    {
        "content": "<p>My guess is that the current instruction is: \"set <code>lean_version=master</code> in all your leanpkg.toml files, and work on the master branch of <code>repoA</code>\"</p>",
        "id": 128338708,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457568
    },
    {
        "content": "<p>I am still planning on keeping <code>lean-3.4.1</code> branch up to date with master, but I expect that it may drift behind from time to time. Maybe you can consider it the \"stable version\", but it's really just me being lazy :)</p>",
        "id": 128338773,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529457662
    },
    {
        "content": "<p>Nope, that doesn't work.. Maybe <code>lean_version=\"nightly\"</code>?</p>",
        "id": 128338787,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457703
    },
    {
        "content": "<p>If you want bleeding edge you should probably stick to the master branch</p>",
        "id": 128338789,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529457717
    },
    {
        "content": "<p>Nope: <code>error: binary package was not provided for 'darwin'</code></p>",
        "id": 128338790,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457718
    },
    {
        "content": "<p>I still really don't understand the algorithm <code>leanpkg upgrade</code> uses to pick which commit to go to. It seems to be affected by both the setting of <code>lean_version</code>, and perhaps the name of the branch you're currently in in your local repo?</p>",
        "id": 128338839,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529457782
    },
    {
        "content": "<p>Okay, I think the tooling is actually defective, and there's currently no way to have a chain of repos <code>mathlib &lt;--- repoA &lt;--- repoB</code> so that <code>leanpkg upgrade</code> tracks the master branch of mathlib.</p>",
        "id": 128344446,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529468828
    },
    {
        "content": "<p>(it _is_ possible to keep up with mathlib's 3.4.1 branch, by having repoA in a <code>lean-3.4.1</code> branch, and setting <code>lean_version=\"3.4.1\"</code> in all the leanpkg.toml files)</p>",
        "id": 128344514,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529468931
    },
    {
        "content": "<p>I think it's unreasonable to expect someone to continuously sync one branch to another, especially without being written down as part of a process or a checklist. It will certainly be forgotten. If you really want branches synced, it should be automated (e.g. by cron).</p>\n<p>I think mathlib — that is, both its users and its developers — would be better off following the standard practice of releasing numbered versions. A version provides a common checkpoint and ideally includes a description of changes from the last version. Mathlib versions will naturally change independently of Lean versions because they are independent projects.</p>",
        "id": 128347908,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529476108
    },
    {
        "content": "<blockquote>\n<p>I think mathlib — that is, both its users and its developers — would be better off following the standard practice of releasing numbered versions. A version provides a common checkpoint and ideally includes a description of changes from the last version. Mathlib versions will naturally change independently of Lean versions because they are independent projects.</p>\n</blockquote>\n<p>A huge +1 from my army of undergraduate users, who just want to be told \"install that version of mathlib and then do nothing until I tell you\". And +1 from cocalc too.</p>",
        "id": 128349762,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529479900
    },
    {
        "content": "<p>Numbered versions for mathlib would be fine, but we'd need to switch to a numbering system that is independent of Lean, as we know that Lean versions can get stuck for a long time! Is there some mechanism for leanpkg to understand independent versions for Lean and for mathlib? It seems not.</p>",
        "id": 128356374,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1529491362
    },
    {
        "content": "<p>Furthermore mathlib doesn't really have \"releases\" like a normal software project, it's basically a continuous stream of improvements, so the only reasonable versioning I can see is date-based</p>",
        "id": 128356507,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529491607
    },
    {
        "content": "<p>I agree with version numbers independent of Lean and with date-based version numbers. <a href=\"https://calver.org/\" target=\"_blank\" title=\"https://calver.org/\">CalVer</a> appears to be a new name for the latter.</p>",
        "id": 128356522,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529491677
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> But, just to be clear, a version number would label a “release” of sorts, right? I think the extreme alternative of considering every git commit hash a version creates too much work and confusion. From the developer's perspective, creating a new version generally involves some amount of work (e.g. documentation and packaging), so it should happen only occasionally. And from the user's perspective, it simplifies usage to work with batches of possibly-breaking changes rather than update with every single change.</p>",
        "id": 128356801,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529492087
    },
    {
        "content": "<p>I think we can merge this with plans to precompile mathlib easily enough</p>",
        "id": 128356821,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529492155
    },
    {
        "content": "<p>for example, have mathlib nightlies labeled by date</p>",
        "id": 128356863,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529492169
    },
    {
        "content": "<p>But nightlies represent in-progress work, not released work. You want a release version to indicate some stopping point that describes some meaningful change wrt the last version.</p>",
        "id": 128356938,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529492315
    },
    {
        "content": "<p>Using nightlies as versions is no better than using commit hashes.</p>",
        "id": 128356950,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529492351
    },
    {
        "content": "<p>But that's just my point. In most software projects there is \"in-progress\" which becomes \"release\", but in mathlib it is either always in progress or never in progress depending on your point of view. I try to make sure all commits build, and for a formal verification project that's really the only measure of correctness besides style concerns. So you can literally make any commit a release and all you need is the packaging stuff</p>",
        "id": 128357342,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493056
    },
    {
        "content": "<p>In metamath there is a <a href=\"http://set.mm\" target=\"_blank\" title=\"http://set.mm\">set.mm</a> project that gets commits whenever people want to do something, and then every day or so the website is built (theorem display pages and crosslinks) - this is the build artifact - and that's it. The latest build is also hosted on the website. There is no further versioning applied; you can look at an old version if you want by checking out its commit.</p>",
        "id": 128357411,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493209
    },
    {
        "content": "<p>A formal verification project acts like a software project in many ways, but this is one point of difference, I think.</p>",
        "id": 128357461,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493277
    },
    {
        "content": "<p>And my points are these:</p>\n<p>1. You've worked on computability features over multiple commits. There <em>is</em> a point at which you think you're finished. <em>That</em> is the point where you might make a release to describe to the world the changes you've introduced. (In this case, the release is a form of marketing.) You don't want to “release” every in-progress commit because the important news gets lost.</p>\n<p>2. Users of mathlib as a library want to be able to look at what is currently considered “stable.” They also want to see what changes have been made over time, esp. if a user is transitioning from an old version to a new version. Nightlies don't give any indication of this because they are just builds. Versioning needs documentation, documentation takes time, and one doesn't want to spend that time every day. Also, you don't want to overload users with a huge number of versions because that just adds noise to the signal.</p>",
        "id": 128357657,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493603
    },
    {
        "content": "<p>Is <code>set.mm</code> a software library used by others? Or is it more like verified documentation?</p>",
        "id": 128357669,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493646
    },
    {
        "content": "<p>It is neither. It is a collection of proven theorems, roughly laid out like a math textbook</p>",
        "id": 128357680,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493700
    },
    {
        "content": "<p>That sounds like documentation rather than software. In which case, I don't see the parallel to mathlib.</p>",
        "id": 128357722,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493725
    },
    {
        "content": "<p>I'm not sure I understand - mathlib is in the same position, except the documentation needs more work</p>",
        "id": 128357733,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493756
    },
    {
        "content": "<p>Can I take <code>set.mm</code> and build my own software with it?</p>",
        "id": 128357735,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493777
    },
    {
        "content": "<p>you can take <a href=\"http://set.mm\" target=\"_blank\" title=\"http://set.mm\">set.mm</a> and build your own theorems with it</p>",
        "id": 128357740,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493799
    },
    {
        "content": "<p>the curry howard isomorphism is not so relevant here</p>",
        "id": 128357742,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493820
    },
    {
        "content": "<p>I get that you think of mathlib as a software library, but it is currently much more a database of theorems than that</p>",
        "id": 128357789,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493869
    },
    {
        "content": "<p>Fair enough. Is that what people do? Or do people use <code>set.mm</code> as a source for the textbook.</p>",
        "id": 128357791,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493878
    },
    {
        "content": "<p>Of course it can be both at the same time</p>",
        "id": 128357793,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493880
    },
    {
        "content": "<blockquote>\n<p>I get that you think of mathlib as a software library, but it is currently much more a database of theorems than that</p>\n</blockquote>\n<p>I beg to differ. <span class=\"emoji emoji-1f604\" title=\"smile\">:smile:</span></p>",
        "id": 128357798,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493899
    },
    {
        "content": "<p>I think that mathlib is currently mostly used as a source of theorems and definitions that people can build on</p>",
        "id": 128357813,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493919
    },
    {
        "content": "<blockquote>\n<p>I think that mathlib is currently mostly used as a source of theorems and definitions that people can build on</p>\n</blockquote>\n<p>And how is that so different from a software library, which is  a collection of programs that people can build on?</p>",
        "id": 128357823,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529493954
    },
    {
        "content": "<p>You can read <a href=\"http://set.mm\" target=\"_blank\" title=\"http://set.mm\">set.mm</a> like a book if you want, learn set theory and what have you, or you can import it into your own theorems and prove something nontrivial without going through the basics</p>",
        "id": 128357869,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529493987
    },
    {
        "content": "<p>the same is true of mathlib, although the first goal needs work</p>",
        "id": 128357876,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494008
    },
    {
        "content": "<p>It's not so different</p>",
        "id": 128357888,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494037
    },
    {
        "content": "<p>However, what is there is already done, finished</p>",
        "id": 128357891,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494053
    },
    {
        "content": "<p>what is not finished is the larger story of how everything (in some area) comes together</p>",
        "id": 128357897,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494076
    },
    {
        "content": "<p>But things change in mathlib, as they should. If I'm using mathlib as a foundation for my work, I want to (a) be able to point at a version that I used and (b) look at newer versions to figure out how I need to change my work to fit the changes in mathlib.</p>",
        "id": 128357951,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494153
    },
    {
        "content": "<p>Mario, I think tagging something with a date is not so hard. So how about you \"release\" such a tag now and then? For example after the merge of a new \"feature\" (e.g. Scott's category theory) or something like quotient groups, or whatever.</p>",
        "id": 128357954,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494182
    },
    {
        "content": "<p>I see your point about the computability stuff, and I have been using mathlib as a place to store my project in progress. Arguably that should be a branch, and possibly there will be some reorganization to address this in the future</p>",
        "id": 128357957,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494186
    },
    {
        "content": "<p>This may not be standard practice for <code>set.mm</code>, but it is for software engineering in the real world, and it's that way for good reasons.</p>",
        "id": 128357997,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494203
    },
    {
        "content": "<p>However, everything that has been committed is done, and there is no issue with making reference to it if you wanted</p>",
        "id": 128358009,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494215
    },
    {
        "content": "<p>Mario, it is not about what is possible, but how easy it is for newbies.</p>",
        "id": 128358014,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494238
    },
    {
        "content": "<p>My point was not to say that you shouldn't include work-in-progress.</p>",
        "id": 128358017,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494250
    },
    {
        "content": "<p>Johan, I think nightlies address your concern; Sean seems to want more than this</p>",
        "id": 128358033,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494276
    },
    {
        "content": "<p>Mario, to play the devil's advocate: \"What do you even mean with 'work in progress'?\"</p>",
        "id": 128358037,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494288
    },
    {
        "content": "<p>If the commit builds, then it builds.</p>",
        "id": 128358042,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494306
    },
    {
        "content": "<p>I mean that I wrote 10 theorems, but I plan to prove a hundred more</p>",
        "id": 128358044,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494315
    },
    {
        "content": "<p>it doesn't make the 10 theorems wrong</p>",
        "id": 128358047,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494321
    },
    {
        "content": "<p>Exactly</p>",
        "id": 128358089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494326
    },
    {
        "content": "<p>But once you are done with the 100 theorems. That commit could be tagged with \"mathlib-2018-06-20\".</p>",
        "id": 128358096,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494353
    },
    {
        "content": "<p>But theorem names do change, or theorems get reorganized.</p>",
        "id": 128358097,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494357
    },
    {
        "content": "<p>So, while everything builds, that's not really the end of the story.</p>",
        "id": 128358109,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494385
    },
    {
        "content": "<p>And then people would see the tag and know: \"Hey, that was a commit in which a lot of theorems that belong together were finally all in mathlib\"</p>",
        "id": 128358113,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494391
    },
    {
        "content": "<p>So, I agree with Sean and Kevin and others that certain \"not-work-in-progress\" commits should get a bit of extra highlighting by <code>git tag</code></p>",
        "id": 128358122,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494440
    },
    {
        "content": "<p>That seems reasonable, but I would argue: what really makes that commit special that isn't shared by later commits?</p>",
        "id": 128358168,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494475
    },
    {
        "content": "<p>when you want to use a finished development, you just need to get some commit after it's all in, not the first</p>",
        "id": 128358174,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494502
    },
    {
        "content": "<p>True. Explain that to your local sysadmin.</p>",
        "id": 128358182,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494540
    },
    {
        "content": "<p>Mario, it is all about convenience for users.</p>",
        "id": 128358184,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494555
    },
    {
        "content": "<p>so all that matters is the news, the announcement \"project completed\"</p>",
        "id": 128358221,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494564
    },
    {
        "content": "<p><a href=\"http://set.mm\" target=\"_blank\" title=\"http://set.mm\">set.mm</a> has a news/announcements page for this</p>",
        "id": 128358226,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494579
    },
    {
        "content": "<p>Yes, with a recognizable tag so that sysadmins can easily pull the \"latest release\" and jot down the release tag in some notebook.</p>",
        "id": 128358229,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494617
    },
    {
        "content": "<p>which is just a bunch of blurbs marked by date (not even associated specifically to <a href=\"http://set.mm\" target=\"_blank\" title=\"http://set.mm\">set.mm</a> versions)</p>",
        "id": 128358236,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494624
    },
    {
        "content": "<p>They won't jot down commit hashes.</p>",
        "id": 128358239,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494624
    },
    {
        "content": "<p>If the sysadmin start updating software, he just wants to go to <a href=\"https://github.com/leanprover/mathlib/releases\" target=\"_blank\" title=\"https://github.com/leanprover/mathlib/releases\">https://github.com/leanprover/mathlib/releases</a> and grab the latest release.</p>",
        "id": 128358251,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494665
    },
    {
        "content": "<p>He doesn't care about other stuff.</p>",
        "id": 128358253,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494672
    },
    {
        "content": "<p>Here's what I think a version release should minimally involve:</p>\n<p>1. A name/number<br>\n2. A <code>git tag</code><br>\n3. Documentation of changes since the last release</p>\n<p>Bonus:</p>\n<p>1. Builds for various platforms as appropriate<br>\n2. Announcement blog post or whatever</p>",
        "id": 128358255,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494675
    },
    {
        "content": "<p>Right and a good measure of whether a commit is \"release-worthy\" is whether we have anything sensible to mention at point 3 (in a reasonably short message).</p>",
        "id": 128358316,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529494773
    },
    {
        "content": "<p>How do you feel about replacing (3) with a changelog?</p>",
        "id": 128358319,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494787
    },
    {
        "content": "<p>That <em>is</em> a change log, but it's wrt versions.</p>",
        "id": 128358363,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494812
    },
    {
        "content": "<p>I'm aware they carry the same information</p>",
        "id": 128358367,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494830
    },
    {
        "content": "<p>but I would rather have all changes logged in one place</p>",
        "id": 128358370,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494847
    },
    {
        "content": "<p>I think the significance of less-than-daily releases is important.</p>",
        "id": 128358382,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494872
    },
    {
        "content": "<p>Otherwise you have to go check the history every time to write the change log for that version</p>",
        "id": 128358388,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529494885
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> I'm not sure what exactly you're arguing for or against. I didn't mention where the documentation should take place. A change log (like <a href=\"https://github.com/spl/dlist/blob/master/ChangeLog.md\" target=\"_blank\" title=\"https://github.com/spl/dlist/blob/master/ChangeLog.md\">this one</a> in one of my Haskell packages) would be my first choice.</p>",
        "id": 128358440,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529494954
    },
    {
        "content": "<p>If the changelog is just updated incrementally, then it may as well just be like the news page I described</p>",
        "id": 128358457,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495008
    },
    {
        "content": "<p>it need not have those big version headers</p>",
        "id": 128358462,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495035
    },
    {
        "content": "<p>But a change log would make more sense if it described the points between which the changes were made.</p>",
        "id": 128358505,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529495085
    },
    {
        "content": "<p>That's where version numbers come in.</p>",
        "id": 128358510,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529495093
    },
    {
        "content": "<p>I'm arguing for the following: nightlies, plus changelog labeled by dates / nightly version numbers</p>",
        "id": 128358523,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495123
    },
    {
        "content": "<p>Mario, how often do you expect updates to the changelog?</p>",
        "id": 128358533,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529495149
    },
    {
        "content": "<p>big versions are meaningless, they are literally the sum of their parts here</p>",
        "id": 128358534,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495150
    },
    {
        "content": "<p>when a project finishes, some breaking change is made, large or small improvements worth note</p>",
        "id": 128358582,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495191
    },
    {
        "content": "<blockquote>\n<p>big versions are meaningless, they are literally the sum of their parts here</p>\n</blockquote>\n<p>Nope. They are the sum of their meaningful parts + epsilon cruft of work in progress.</p>",
        "id": 128358583,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529495197
    },
    {
        "content": "<p>it would basically be a place for advertising new stuff</p>",
        "id": 128358597,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495259
    },
    {
        "content": "<blockquote>\n<p>I think the significance of less-than-daily releases is important.</p>\n</blockquote>\n<p>I can't currently quantify that importance, but I think it makes a difference to users to document <em>batches</em> of changes rather than <em>individual</em> changes you'll get with daily/nightly releases.</p>",
        "id": 128358605,
        "sender_full_name": "Sean Leather",
        "timestamp": 1529495275
    },
    {
        "content": "<p>and it easily supports diffs with zero effort, just look at the dates</p>",
        "id": 128358649,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495308
    },
    {
        "content": "<p>Mario, I hope it is clear that we are not trying to convince you that less-than-daily releases will be a benefit for <em>you</em>.</p>",
        "id": 128358660,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1529495333
    },
    {
        "content": "<p>\"Oh, I haven't updated since mathlib of jun 1, let's look at the changelog to see what happened in the past 20 days\"</p>",
        "id": 128358669,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529495347
    },
    {
        "content": "<blockquote>\n<p>\"Oh, I haven't updated since mathlib of jun 1, let's look at the changelog to see what happened in the past 20 days\"</p>\n</blockquote>\n<p>My users will update mathlib never. My users are using things like cocalc which has explicitly said it wants to update rarely. My users are using things like the computers in our departmental computer room which have explicitly told me that they will update precisely once per year, over the summer, and will not tolerate anything else. It would be lovely to tell my users \"you're using mathlib v3.4.1\" or \"mathlib v1\" or whatever. My users do not want bleeding edge mathlib so all this talk of changelogs is irrelevant to them. I'm just pointing out the existence of a large body of users for whom a lot of this talk is irrelevant, and stability and clarity would be extremely convenient. We will achieve stability with a git hash, but not so much clarity. I know you (Mario) have consistently resisted just randomly making a release but given that the topic has come up yet again I thought I would once more try to explain how people using Lean in completely different ways to you (people who want or have to solve my example sheet questions this coming October and who would like to have the same version of lean/mathlib running on all their devices) might appreciate something less messy than a commit hash. I still occasionally consider forking and freezing, but I really feel like this should be a last resort because all that will happen when I tell people to download mathlib from my GH will be that I'll end up with a bunch of undergraduates who think that I wrote mathlib.</p>",
        "id": 128382330,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529527297
    },
    {
        "content": "<p>I understand that there are other ways to make use of mathlib, but that's your business, not mine. I don't see why you can't pick a version of mathlib and make a big deal of it on your own without my intervention. It sounds like you are building your own product, based on mathlib, and you can version that however you like. There is no need for any of this to affect mathlib versioning.</p>",
        "id": 128383237,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529528409
    },
    {
        "content": "<p>Just tell all your clients \"we are using mathlib-2018-06-20 for the next year\"</p>",
        "id": 128383290,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529528498
    },
    {
        "content": "<p>Whether it involves you or not, it might be useful to have a coalition of library developers to select versions of <code>mathlib</code> that we standardize on. Otherwise, if you rely on two independent packages, they may rely on two subtilely different versions of <code>mathlib</code>.</p>",
        "id": 128383518,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1529528776
    },
    {
        "content": "<p>A good place for documenting that choice would be <code>mathlib</code> itself</p>",
        "id": 128383531,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1529528811
    },
    {
        "content": "<blockquote>\n<p>Just tell all your clients \"we are using mathlib-2018-06-20 for the next year\"</p>\n</blockquote>\n<p>right -- that's exactly what I'm going to tell them. But probably with a commit hash.</p>",
        "id": 128383561,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529528876
    },
    {
        "content": "<p>It is fully possible that two independent packages can rely on slightly different versions of mathlib, and while this will not always cause an incompatibility (since in many cases you can update mathlib with no upstream changes), it might. But in this case, one or both packages is out of date, and should be updated to master.</p>",
        "id": 128383818,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529529156
    },
    {
        "content": "<p>If you would like an arbitrary standardization point (and nightlies are too fast for you), let's say to prefer commits that are the first of the month</p>",
        "id": 128383855,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529529223
    },
    {
        "content": "<p>But I can't think of any situation as a third party developer to want to update to a version of mathlib that is not the current master</p>",
        "id": 128384265,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529529332
    },
    {
        "content": "<p>i.e. if you say \"let's use version X from now on\", it should always be the case that X is the current master or nightly at the time of the announcement</p>",
        "id": 128384338,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1529529417
    }
]