[
    {
        "content": "<p>What's the protocol when merging two files (such as <a href=\"https://github.com/leanprover-community/mathlib/issues/10617\">#10617</a>), when the headers of file A and B have conflicting copyright information?</p>\n<p>If we use the header of file A, then we've essentially chosen to ignore the copyright claims by the authors of file B (something that strictly should require the copyright owner of B to reassign copyright), and vice versa. <del>If we try to have multiple copyright lines, then the linter complains.</del></p>",
        "id": 263712276,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1638629589
    },
    {
        "content": "<p>In this particular case I think that one of two files was an (almost) trivial addition to the other.</p>",
        "id": 263729398,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638649104
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> <span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> this is about <code>data.stream.basic</code>. I'm merging it with <code>data.stream.init</code> which came from core. Do you want to be mentioned in the <code>Authors:</code> line?</p>",
        "id": 263729657,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638649533
    },
    {
        "content": "<p>Having worked with public websites in the U.S. and having an attorney on the team, at the start of each year someone would claim in urgency that we needed to change the copyright on all of the web pages. So I asked our attorney and this was the response.</p>\n<p>If the work is new and has no copyright then the work gets a copyright notice with the current year.<br>\nIf the work has a copyright and no change was made then no need to change the copyright notice.<br>\nIf the work has a copyright and a change was made in the year of the copyright then no need to change the copyright notice.<br>\nIf the work has a copyright and a change was made in a year latter than the copyright then the copyright notice needs to be updated to the latter year.</p>\n<p>Since the work was done for a company,  the company held the copyright and the name did not change.</p>\n<hr>\n<p>These are other rules I learned.</p>\n<p>If the work is a combination of other works,  then include each copyright notice and add an additional copyright for the current year and the person creating the derived work.</p>\n<p>HTH</p>",
        "id": 263729875,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1638649805
    },
    {
        "content": "<p>We definitely don't list all copyright holders in the headers. I don't say that we shouldn't. I say that currently we don't do this.</p>",
        "id": 263736493,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638658687
    },
    {
        "content": "<p>Per the Apache license we are required to preserve the copyright notices literally afaict (as much as I'd like to standardize the mathlib copyright header to \"Copyright (C) 202x The Mathlib Community\").  In any case, you have my permission to merge/remove the copyright header of my contributions.</p>",
        "id": 263760339,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1638698762
    },
    {
        "content": "<p>What other opensource projects do about it?</p>",
        "id": 263762424,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1638701766
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110043\">Gabriel Ebner</span> <a href=\"#narrow/stream/113488-general/topic/Merging.20files.20with.20different.20copyright.20information/near/263760339\">said</a>:</p>\n<blockquote>\n<p>I'd like to standardize the mathlib copyright header to \"Copyright (C) 202x The Mathlib Community\"</p>\n</blockquote>\n<p>That I like it or not, leaving my name in copyright headers is an incentive to write more code. I'm sure a good chunk of what I did wouldn't be in mathlib today were it not for the copyright headers.</p>",
        "id": 263765680,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1638706720
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"387244\">@Yaël Dillies</span> I'm not sure I understand what you are saying. Would you mind to elaborate a bit?</p>",
        "id": 263766034,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1638707209
    },
    {
        "content": "<p>Yaël, are you talking about the author list?</p>",
        "id": 263766051,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1638707241
    },
    {
        "content": "<p>Both actually.</p>",
        "id": 263766053,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1638707249
    },
    {
        "content": "<p>I don't think that's very important. I just noticed it.</p>",
        "id": 263766054,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1638707258
    },
    {
        "content": "<p>I would also agree with replacing my name in the copyright line with \"mathlib contributors\", since it's otherwise a bit odd to contribute to / move lemmas from a file with someone else's copyright in the header. The authors line is good to keep though.</p>",
        "id": 263766122,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1638707356
    },
    {
        "content": "<p>Yeah, copyright is weirdly about who got there first, not who actually did the most/is the most knowledgeable about a file</p>",
        "id": 263766213,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1638707513
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"214703\">Yury G. Kudryashov</span> <a href=\"#narrow/stream/113488-general/topic/Merging.20files.20with.20different.20copyright.20information/near/263762424\">said</a>:</p>\n<blockquote>\n<p>What other opensource projects do about it?</p>\n</blockquote>\n<p>Git repositories such as GitHub are IMO one of the best ways to track contributions of work because often the individual lines and time of change can be determined. Having said that I don't think it would hold up in court for a Copyright suit.</p>\n<p>ANTRL requires <a href=\"https://www.antlr.org/license.html\">Developer's Certificate of Origin</a><br>\nSWI-Prolog has page for the <a href=\"https://www.swi-prolog.org/Contributors.html\">list of contributors</a><br>\nThis <a href=\"https://docs.automic.com/documentation/webhelp/english/AIR/12.6/DOCU/12.6/AIR%20Guides/Content/_Common/PageLayouts/third-partylicenses.htm\">site</a> list all of the third-party licenses.</p>\n<p>Needless to say, there is no standard.</p>",
        "id": 263766263,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1638707568
    },
    {
        "content": "<p>I don't know if Lean or any work done that contributes to Lean is from funding. An example of open source software that receives government funding is <a href=\"https://js.cytoscape.org/\">Cytoscape.js</a>. Here it notes how to <a href=\"https://js.cytoscape.org/#introduction/citation\">cite</a> Cytoscape.js</p>",
        "id": 263766716,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1638708269
    }
]