[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"479359\">Michael Stoll</span> has marked this topic as unresolved.</p>",
        "id": 296891520,
        "sender_full_name": "Notification Bot",
        "timestamp": 1662150803
    },
    {
        "content": "<p>Here is something weird: When I additionally <code>import analysis.normed.field.basic</code> in the example above, then I get an error message <code>rec_fn_macro only allowed in meta definitions</code> at the line <code>meta def prove_test : ...</code>.<br>\nThis does not occur when I instead <code>import</code> one of the files imported by <code>analysis.normed.field.basic</code>. What is going on here?<br>\nIn a similar situation, I get an error message <code>missing 'noncomputable' modifier, definition 'prove_foo' depends on 'rat.normed_field'</code>, which seems to be triggered by the use of <code>norm_num.prove_ne</code>. This is quite annoying...</p>",
        "id": 296891966,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1662151048
    },
    {
        "content": "<p>Coincidentally this came up within the last day or two on the Discord. You can fix it with <code>instance : ring ℚ := division_ring.to_ring ℚ</code>. See <a href=\"https://github.com/leanprover-community/mathlib/pull/16349\">#16349</a> which probably <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> should be alerted to...(and which will fix the problem if the PR is accepted, but the PR might cause other issues)</p>",
        "id": 296902077,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1662156188
    },
    {
        "content": "<p>Thanks, Kevin!<br>\nCan you also explain how this error arises? (Just out of curiosity.)</p>",
        "id": 296954208,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1662191667
    },
    {
        "content": "<p>The part I understand: the import makes the ring structure on the rationals noncomputable, because the typeclass inference system can find a new way to prove Q is a ring after the import, via <code>normed_ring</code> which is noncomputable, and by chance this is the preferred way after the import. The fix is to explicitly make the computable construction and explicitly add it into the system, which then prefers this choice and all of a sudden it's computable again. The part I don't understand is the <code>rec_fn_macro</code> error, I searched for it on this site and found several other occurrences, which all seemed to be to do with computability, but I can't say I understand the problem properly. The reason I tagged Mario in the previous post was two-fold; firstly to point out the PR to him (becuase there might be reasons against the change) but secondly to alert him to your error (which I think he understands quite well).</p>",
        "id": 296958840,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1662194315
    },
    {
        "content": "<p>The issue is when some auxiliary definition mistakenly gets marked computable when it shouldn't be, there is some edge case here that results in bad error messages</p>",
        "id": 296959076,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1662194433
    },
    {
        "content": "<p>I was hoping that I could fix everything by adding <code>noncomputable!</code> all over the place but I couldn't get rid of the error.</p>",
        "id": 296959170,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1662194489
    },
    {
        "content": "<p>IIRC if you put <code>noncomputable theory</code> too you can get noncomputable on that pesky internal definition</p>",
        "id": 296959343,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1662194592
    },
    {
        "content": "<p>It looked like <code>analysis.normed.field.basic</code> uses <code>noncomputable theory</code>, but I didn't look at it too closely.</p>",
        "id": 296960418,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1662195119
    },
    {
        "content": "<p>Yeah, we can make <code>rat.normed_field</code> computable using some trickery. I can do that if you want.</p>",
        "id": 297004010,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1662217497
    },
    {
        "content": "<p>For now, I am happy with the workaround that Kevin mentioned. But it would be nice, of course, if the error would not show up in the first place.</p>",
        "id": 297020550,
        "sender_full_name": "Michael Stoll",
        "timestamp": 1662227106
    }
]