[
    {
        "content": "<p>(This post is me trying to find out how wrong I am about what migration may look like, not any attempt to say how it will or should be!)</p>\n<p>Gabriel made an experiment a while ago in which he managed to import an <code>olean</code> file generated by Lean 3 directly into Lean 4 (right?). For my purpose now, it doesn't really matter if there's some intermediate processing step.</p>\n<p>I'm hoping that this is the case, and we may be able to follow a plan like this:</p>\n<ul>\n<li>rename all current <code>.lean</code> files to <code>.lean3</code> files, and change community Lean to expect this</li>\n<li>teach <code>leanproject</code> (or suitable replacement) to do \"dual compilation\", of a collection of <code>.lean3</code> and <code>.lean</code> files (using Lean 3 and <span aria-label=\"four leaf clover\" class=\"emoji emoji-1f340\" role=\"img\" title=\"four leaf clover\">:four_leaf_clover:</span>  respectively), where the <code>.lean</code> files can import <code>.lean3</code> files but not vice versa</li>\n<li>in CI, change the <code>all.lean3</code> we use to check that everything compiles compatibly back to <code>all.lean</code>, so it is processed by Lean 4</li>\n<li>declare victory <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></li>\n<li>...</li>\n<li>now start on the real work!</li>\n<li>during this phase new contributions to mathlib would be accepted that add new <code>.lean3</code> files (with the proviso you are now only allowed to import things that haven't been migrated), or that add new <code>.lean</code> files, or that migrate <code>.lean3</code> files to <code>.lean</code> files.</li>\n<li>we build some tooling in Lean4, e.g. to automatically rename declarations, to make switching to <code>CamelCase</code> sane</li>\n<li>we start reproducing some of the major tactics from Lean3 in Lean4, e.g. the simplifier</li>\n<li>we gradually start switching files across, using some hybrid of reproducing Lean3 tactic well enough that proofs can be reused and rewriting proofs --- whatever is easiest</li>\n<li>hopefully watch the graph of \"ratio of lean3 : lean4\" files gradually tend to zero (like we watch the size of <code>nolints.txt</code>)</li>\n</ul>\n<p>Is this hopelessly optimistic? Are we instead going to have to just make a new repository and work \"from the bottom up\"? Or is this not what we should be aspiring to in the first place?</p>",
        "id": 209990703,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1600082007
    },
    {
        "content": "<p>I think that gradual conversion as you propose is the only really feasible approach</p>",
        "id": 209991656,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1600082705
    },
    {
        "content": "<p>The problem is we need feasible <em>and</em> viable. :-)</p>",
        "id": 209993170,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1600083800
    },
    {
        "content": "<p>I find it hard to even speculate without a better sense of what we'll have to work with. It's probably a fair assumption that early releases, at least, will have bugs, performance issues, missing features, etc that won't become apparent until porting starts, and will presumably need breaking changes to be fixed. Not saying this as a complaint, just that we should expect a lot of instability early on. It might be better to iterate on some very small core of mathlib for a while at the beginning so we don't waste a ton of effort on things that we know will change.</p>",
        "id": 209994061,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1600084475
    }
]