[
    {
        "content": "<p>I suggest that we add (at least) two more pages to the community website:</p>\n<ol>\n<li>A webpage listing past and future Lean-related events with brief description (target audience, dates, venue, website, application deadline, is it lean-specific or not). Most of them are announced somewhere in this chat but this is not the best interface.</li>\n<li>A webpage listing university courses that use Lean in one way or another with brief descriptions.</li>\n</ol>\n<p>I can try to write some drafts tonight or tomorrow but these drafts will look better if you reply here with links to events and courses.</p>",
        "id": 271358616,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644446544
    },
    {
        "content": "<p>Event: ICERM is here <a href=\"https://icerm.brown.edu/topical_workshops/tw-22-lean/\">https://icerm.brown.edu/topical_workshops/tw-22-lean/</a> , it's July 2022, applications are open.</p>\n<p>Hot gossip: I just heard today that my Hausdorff Research Institute (Bonn) proposal \"Prospects of Formal Mathematics\" will be running May to August 2024. More details forthcoming.</p>\n<p>Courses: </p>\n<p>My formalising mathematics 2021 course has repo here <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics\">https://github.com/ImperialCollegeLondon/formalising-mathematics</a> and there are links to 9 blog posts covering an introduction and the 8 workshops in the repo.</p>\n<p>My formalising mathematics 2022 course is currently in progress; repo is here <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics-2022\">https://github.com/ImperialCollegeLondon/formalising-mathematics-2022</a> and course notes are here <a href=\"https://www.ma.imperial.ac.uk/~buzzard/xena/formalising-mathematics-2022/\">https://www.ma.imperial.ac.uk/~buzzard/xena/formalising-mathematics-2022/</a> and youtube playlist is here <a href=\"https://www.youtube.com/playlist?list=PLVZep5wTamMmRPvCLO4WVpCwkTi1F6OyF\">https://www.youtube.com/playlist?list=PLVZep5wTamMmRPvCLO4WVpCwkTi1F6OyF</a> (all currently increasing in size; course finishes end of March)</p>",
        "id": 271359761,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644447207
    },
    {
        "content": "<p>Can you share some information about the students who actually attended your courses (publicly or privately): how many tried? How many got credit for the course? Were they all math majors or students with other majors (cs?) attended too?</p>",
        "id": 271364484,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644450009
    },
    {
        "content": "<p>I want to suggest a course with formalized proofs and success stories from other universities can help.</p>",
        "id": 271364591,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644450108
    },
    {
        "content": "<p>Other events I know about: ITP, past lean together and lftcm meetings</p>",
        "id": 271364722,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644450206
    },
    {
        "content": "<p>What did I miss?</p>",
        "id": 271364740,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644450227
    },
    {
        "content": "<p>I also found <a href=\"https://popl22.sigplan.org/series/CPP\">https://popl22.sigplan.org/series/CPP</a></p>",
        "id": 271366217,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644451160
    },
    {
        "content": "<p>I have taught courses on interactive theorem proving a few times at Carnegie Mellon. The last time was in the fall of 2019. I had 19 students, 11 grad and 8 undergrad.  While Jesse Han was taking it, he and Floris van Doorn formalized the proof of the independence of the continuum hypothesis. Needless to say, he passed.</p>\n<p>I'll be teaching another course next fall, this time targeted specifically at undergraduate math majors.</p>",
        "id": 271371123,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1644453863
    },
    {
        "content": "<p>Rob Lewis taught one last semester, in the CS department at Brown: <a href=\"https://cs.brown.edu/courses/cs1951x/\">https://cs.brown.edu/courses/cs1951x/</a>.</p>",
        "id": 271371321,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1644453982
    },
    {
        "content": "<p>I taught our Transition to Advanced Mathematics here at USC in Fall 2020. This was a standard intro to proofing course for math majors. I followed Jeremy’s lead pretty strongly using Logic and Proof. The course was 1/3 homework, 1/3 presentations, 1/3 final project. The homework had a significant Lean component and most people elected to beat the NNG for their final project. There were 15 students and I found the Lean feedback overall very positive. </p>\n<p>Alas there is no outward facing material. It is all stuck behind MS Teams. </p>\n<p>Next fall will be a repeat of this course. I plan on getting auto-grading going properly and running it through GitHub classroom.</p>\n<p>In the spring, we are planning to run an honors course for undergraduates modeled on the <a href=\"https://lean-forward.github.io/logical-verification/2020/\">Vrije course</a></p>",
        "id": 271373901,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1644455953
    },
    {
        "content": "<p>My course is called \"Logic and computer assisted proofs\". It is attended by 50 to 60 students, first year undergrad with math/CS double major. Lecture notes and exercises can be found at <a href=\"https://www.imo.universite-paris-saclay.fr/~pmassot/enseignement/\">https://www.imo.universite-paris-saclay.fr/~pmassot/enseignement/</a> (MDD154 is the course code). In the exam students prove lemmas in Lean and then write the proof on paper. The main math content is proofs of properties of sequences of real number. There is very little pure logic.</p>",
        "id": 271397695,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1644480073
    },
    {
        "content": "<p>My two courses: </p>\n<p>The 2021 course ran on Discord and was part of the EPSRC Taught Course Centre program. It was attended by around 15 PhD students none of whom knew anything about Lean. Two of them needed a pass/fail grade so I made them write some code and then gave them a pass. </p>\n<p>The 2022 course is for final year undergrads and is part of our official undergraduate curriculum. It is examined by three projects; 21 students handed in projects for the first deadline last Friday and I strongly suspect I'll get 21 submissions for the other two (because once you've submitted a project you've committed to taking the class). Of the 21 students 20 are maths student and one is from the computing department (teaching is heavily department-based in the UK; you do not \"major in X\", you come to university with \"I do X\" stamped on your forehead and then only do classes from department X; the computing person had to explicitly ask for the rules to be bent and I had to argue for them).</p>",
        "id": 271399549,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644481497
    },
    {
        "content": "<p>PS <span class=\"user-mention\" data-user-id=\"306577\">@Matthew Ballard</span> all of my teaching material is stuck behind blackboard (our VLE). I don't know who this Xena guy is leaking it all to YouTube without asking the department's permission</p>",
        "id": 271400071,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644481908
    },
    {
        "content": "<p>I'm very much in favor of adding these pages to the website</p>",
        "id": 271439387,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644503773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110865\">Jeremy Avigad</span> <a href=\"#narrow/stream/113488-general/topic/Missing.20website.20pages/near/271371321\">said</a>:</p>\n<blockquote>\n<p>Rob Lewis taught one last semester, in the CS department at Brown: <a href=\"https://cs.brown.edu/courses/cs1951x/\">https://cs.brown.edu/courses/cs1951x/</a>.</p>\n</blockquote>\n<p>This course was also adapted from Jasmin's Logical Verification course at the VU. Taught to a mostly CS audience (with quite a few math-CS double majors), ranging from second-year undergrads to PhD students, 28 total</p>",
        "id": 271439648,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644503895
    },
    {
        "content": "<p>10 homework assignments and a required final project. The course was an experiment and I was really happy with how it turned out -- the final projects were, on the whole, far beyond what I was expecting to see</p>",
        "id": 271440078,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644504088
    },
    {
        "content": "<p>The same happened for my course. Three projects; I spent the weekend marking the first one. There were people like Jason KY who just submitted his PR of Egorov's theorem and a couple of other Lean experts, but there were some people who had come from 0 to proving the Bolzano-Weierstrass theorem or Cauchy &lt;-&gt; convergent in 3 weeks, and others just did totally random things like defined Dedekind cuts and proved a ton of stuff about them, or proved completeness and soundness for first order logic (that was a computing student) or some graph theory etc. It's interesting seeing what these people come up with.</p>",
        "id": 271472854,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644517336
    },
    {
        "content": "<p>Unfortunately, I recorded my lectures in MS Teams and they got uploaded to the local instance of MS Stream so everything is trapped within Office 365. I think it was more a function of lack of forethought. </p>\n<p>VLE = LMS? We have Blackboard here also. There is an API for interacting with it <a href=\"http://www.imsglobal.org/spec/lti/v1p3/\">LTI</a>. Obviously some should build a client in Lean 4 :) </p>\n<p>The course description for the previous was </p>\n<blockquote>\n<p>Rigor of mathematical thinking and proof writing via logic, sets, and functions. Intended to bridge the gap between lower-level (computational-based) and upper-level (proof-based) mathematics courses.</p>\n</blockquote>\n<p>We only expected the students to have passed calculus 2 and in practice the majority were freshmen or sophomores.</p>",
        "id": 271493312,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1644526761
    },
    {
        "content": "<p>I opened <a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/254\">https://github.com/leanprover-community/leanprover-community.github.io/pull/254</a> for one of these ideas -- will leave the courses page for later!</p>",
        "id": 271503496,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644531352
    },
    {
        "content": "<p>I'm not sure if it makes sense or not to list events like CPP and ITP. These aren't Lean-specific and typically only have a few Lean papers at them. On the other hand, they could be of interest to people who care about other events on the list.</p>",
        "id": 271503672,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644531460
    },
    {
        "content": "<p>There are different types of potential readers:</p>\n<ol>\n<li>People who want to know more about Lean. They probably don't want to see CPP and ITP on this webpage.</li>\n<li>People like me who came to Lean from traditional math and don't know how to turn their work into published papers. We should have a page that suggests \"prepare a paper for ITP\" as one of the possibilities.</li>\n</ol>",
        "id": 271512566,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1644537548
    },
    {
        "content": "<p>There was a <a href=\"https://proofassistants.stackexchange.com/questions/314/tutorials-for-formalizing-mathematical-definitions-statments-in-lean\">question on the proof assistants SE</a> of the form \"I'm a mathematician; I know some tactics but have no idea how to make my way around the API\" and it would be good if we had some kind of place to point these people. NNG makes an object and its API from scratch without using anything from mathlib other than tactics. The moment you want to deal with objects defined in mathlib you have to pick up some different skills. I spent the first month of my code t teaching tactics and using rcases to take terms apart and talking about definitional equality, but now in the second month I need to start teaching these people how to use library API and this is a different kind of problem to figuring out the difference between <code>apply</code> and <code>rw</code>.</p>",
        "id": 271540726,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644565506
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"214703\">Yury G. Kudryashov</span> <a href=\"#narrow/stream/113488-general/topic/Missing.20website.20pages/near/271512566\">said</a>:</p>\n<blockquote>\n<p>There are different types of potential readers:</p>\n<ol>\n<li>People who want to know more about Lean. They probably don't want to see CPP and ITP on this webpage.</li>\n<li>People like me who came to Lean from traditional math and don't know how to turn their work into published papers. We should have a page that suggests \"prepare a paper for ITP\" as one of the possibilities.</li>\n</ol>\n</blockquote>\n<p>I added some links to the draft, but then had two thoughts:</p>\n<ul>\n<li>The list should be generated from a yaml file, like other pages on the website, so we don't have to manually move things from \"future\" to \"past\"</li>\n<li>Would tagging events (\"CS conference\", \"workshop\", \"tutorial\", ...) help? And what should the categories be?</li>\n</ul>",
        "id": 271603420,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644598078
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/Ht2K6dZWaeakvQOa-JjaLJum/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/Ht2K6dZWaeakvQOa-JjaLJum/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/Ht2K6dZWaeakvQOa-JjaLJum/image.png\"></a></div>",
        "id": 271629170,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644609652
    },
    {
        "content": "<p>Feel free to add to the PR</p>",
        "id": 271629190,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644609657
    }
]