[
    {
        "content": "<p>Amazing,  <span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span>  got rid of the name <code>mul_lt_mul''''</code> just when I was feeling bad PRing code using it! <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span></p>",
        "id": 256060569,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1633354835
    },
    {
        "content": "<p>The background here is that mathport was having trouble with multiple primes (it sometimes needs to add primes itself, and we were getting name collisions because it couldn't anticipate not-yet-imported files also adding primes). That can be (has been?) fixed by adding <code>_'</code> instead, but in any case primes in names are pretty lame. :-)</p>\n<p>I would be happy if we limited ourselves to a single prime, and otherwise put more effort into thinking up names. :-) Even with a single prime, anytime we can articulate a class of reasons for adding a prime, we should think of a naming scheme that can reflect that reason.</p>\n<p>I was worried people would be annoyed at minor renaming like this, so I'm glad Patrick celebrated the demise of <code>mul_lt_mul''''</code>. :-)</p>",
        "id": 256155741,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1633393616
    },
    {
        "content": "<p>The lemmas related to <a href=\"https://leanprover-community.github.io/mathlib_docs/find/has_ordered_sub\">docs#has_ordered_sub</a> are a big source of primes, since they are usually variant of lemmas about <code>add_group</code>. <br>\nOne possibility is to use the naming convention that a subtraction with a <code>has_ordered_sub</code> instance is called <code>tsub</code> instead of <code>sub</code> (short for \"truncated subtraction\"). This is very similar to the distinction between <code>Inf</code> and <code>cInf</code>.<br>\nIs that a good idea?</p>",
        "id": 256406092,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1633525145
    },
    {
        "content": "<p><del>Note that you'll also get to rename <code>data.nat.psub</code>.</del> Sorry, got confused.</p>",
        "id": 256463774,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1633546060
    },
    {
        "content": "<p>Ok, there seems to be support for using <code>tsub</code>, so I'll do that after the other ordered sub PRs I am doing/planning now.</p>\n<p>Note: I'm planning to rename the lemmas for a variable type that use <code>tsub</code>, but not for specific types. So we will have <code>tsub_le_tsub_add_tsub</code> and <code>ennreal.lt_add_of_sub_lt</code>. Does that sounds reasonable? I think that is consistent with calling infimum on <code>ℝ</code> <code>Inf</code> and not <code>cInf</code>.</p>",
        "id": 256489822,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1633556733
    },
    {
        "content": "<p>No strong opinion, but I kind of wanted to rename the <code>Inf</code> on <code>ℝ</code> to <code>cInf</code>.</p>",
        "id": 256536979,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1633592845
    },
    {
        "content": "<p>I guess it's not actually an Inf so I can definitely get behind this idea</p>",
        "id": 256537068,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1633592886
    }
]