[
    {
        "content": "<p>OK, this is something that I would like to understand better: namely, how are commits relative to <code>mathlib</code> treated on branches? What happens to me is that I have a <code>mathlib</code> folder, and if I am on branch <code>master</code> everything is nice (and up to date). When I <code>checkout fae_H_space</code> and try a <code>leanproject get-cache</code> I get the <code>multiple viable caches from parent commits</code> and then, even if downloading all of them with <code>--fallback download-all</code>, VSCode still takes ages. So I would like some help both in making this work again and, most importantly, in understanding \"how\" my local set-up knows what <code>mathlib</code> a certain branch is depending on (and why sometimes it thinks it depends on several ones, which is how I interpret the error <code>multiple viable caches from parent commits</code>).</p>\n<p>[UPDATE] After 15 minutes or so, I did a new <code>leanproject get-cache</code> and got no <code>multiple viable caches from parent commits</code>, nor any compiling issue. Yet, I would like to understand the overall picture better.</p>",
        "id": 292120069,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1659686399
    },
    {
        "content": "<p>Every commit that gets built by CI gets a cache attached to it; the caching infrastructure doesn't know anything about <code>master</code> being more special than any other branch</p>",
        "id": 292121508,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1659687302
    },
    {
        "content": "<p>Ah good, this means that my branch gets compiled and when I do <code>get-cache</code> I get the oleans from that compilation on the branch?</p>",
        "id": 292121648,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1659687420
    },
    {
        "content": "<p>OK, but then what does this <code>multiple viable caches from parent commits</code> mean?</p>",
        "id": 292121706,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1659687456
    }
]