[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> No, I was not referring to you. I will try to be super clear from now on :) I was referring to <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> only.</p>",
        "id": 221088487,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1609186695
    },
    {
        "content": "<p>I realize that I have rather extreme views on the lengths to which a programming language should strive for formal correctness. Lean 3 and lean 4 go farther than most programming languages, but not far enough for my tastes. I'm just one user though, and a programming language that tries to satisfy many users has to make compromises sometimes.</p>\n<blockquote>\n<p>The key issue here for me is: Should we trust results proved using Lean?</p>\n</blockquote>\n<p>There are a few ways to read that. On one hand we have pure mathematics theorems such as you will find in mathlib. Here clearly we want the kernel to be sound, and also to use axioms that are recognizable to mathematicians and true. We're doing pretty okay on that in lean 3, and lean 4 is a bit more complex but it still basically upholds this soundness property.</p>\n<p>On the other hand we have that lean 3 has a VM, and lean 4 has a compiler, and both allow you to have code executed for things for which the logic has something to say. Here, \"trusting the results proved using Lean\"  means that if I prove that <code>f () = tt</code> then if I execute it I should get <code>tt</code> and not <code>ff</code>. Here I see lots of reasons to be concerned, because we are involving a lot of external and unverified components, and while it's still \"basically okay\" the track record is not as clean as with logical soundness. I think this is an important property that requires vigilance to uphold.</p>\n<blockquote>\n<p>If you are concerned so much about this problem, you should do it.</p>\n</blockquote>\n<p>By the way, your periodic encouragements for me to do something about this are part of the reason why Metamath Zero exists, so thank you for that.</p>",
        "id": 221088952,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609187208
    },
    {
        "content": "<p>I've changed the thread title to \"native.float equality is incorrect\" to avoid the logical consistency connotations of the word \"inconsistent\".</p>",
        "id": 221089957,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609188241
    },
    {
        "content": "<p>Thanks for changing the title. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 221090452,
        "sender_full_name": "Jason Rute",
        "timestamp": 1609188713
    },
    {
        "content": "<blockquote>\n<p>We don't need an export format in Lean 4 anymore. Users can traverse all data structures and export whatever they want using the format they want.<br>\nAs far as I know, Gabriel's external type checker can pretty-print the results it checked.</p>\n</blockquote>\n<p>To clarify, you are talking about <a href=\"https://github.com/gebner/trepplein\">trepplein</a>, right? This doesn't work on lean 4 AFAIK. While it's fine to say that users will write their own external typecheckers, we should have a good community story about what those typecheckers are, and how they coordinate (which necessitates a standardized export format whether or not the lean 4 core team is implementing it).</p>",
        "id": 221090631,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609188914
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> </p>\n<blockquote>\n<p>There are a few ways to read that. </p>\n</blockquote>\n<p>I disagree. You gave two ways to read it. We both agree on the first interpretation.<br>\nI believe most users here care primarily about this one: logical soundness. <br>\nThis is the most important property for users using systems such as Coq, Isabelle, and Lean.<br>\nThe second one is about: \"should we trust the code generated by Lean?\"<br>\nLean 3 is not a programming language, and I am not aware of anyone seriously using it as a programming language.</p>\n<p>Yes, we are trying to change that in Lean 4. Lean 4 is now a programming language too.<br>\nIn all public Lean 4 presentations, we clearly state that the compiler has not been verified, nor we intend to do it.<br>\nMost software developers are fine with this, and similar compromises have been done in real compilers such as ghc, clang, ocamlc, etc.<br>\nYou are free to disagree, but I think this is a very good and realistic compromise. <br>\nWe are making sure all mathematicians using Lean will still be able to trust the results proved using the system. <br>\nAt the same time, pragmatic software developers will have a new programming language with many unique features.</p>\n<blockquote>\n<p>I think this is an important property that requires vigilance to uphold.</p>\n</blockquote>\n<p>This is certainly an important property, and I care about it. For sure, Sebastian and I will fix bugs in the Lean 4 compiler and interpreter.</p>\n<blockquote>\n<p>By the way, your periodic encouragements for me to do something about this are part of the reason why Metamath Zero exists, so thank you for that.</p>\n</blockquote>\n<p>If it is important to you, I am happy to hear you are doing it.<br>\nI do not believe this is a \"pressuring issue\". ITPs are still not widely used tools. <br>\nWe can debate why they are not, but I am pretty sure it is not due to soundness issues.</p>",
        "id": 221093003,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1609191265
    },
    {
        "content": "<blockquote>\n<p>To clarify, you are talking about trepplein, right? This doesn't work on lean 4 AFAIK. </p>\n</blockquote>\n<p>Yes, I was referring to trepplein. My point was that even in Lean 3, users can already export their results, verify them with external type checkers, and to some extend print them using an external printer.</p>",
        "id": 221093136,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1609191371
    },
    {
        "content": "<p>I do expect users will write their own type checkers and visualizers for Lean 4. In particular, if they do not trust our implementation.</p>",
        "id": 221093172,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1609191442
    },
    {
        "content": "<blockquote>\n<p>Lean 3 is not a programming language, and I am not aware of anyone seriously using it as a programming language.</p>\n</blockquote>\n<p>There have been plenty of programming language-like usage of lean 3 that I have seen on this chat. The desire is certainly there, but the lean 3 VM can't quite keep up. Lean 4 is fixing this, and we're all eagerly anticipating it for this reason (among many others).</p>\n<blockquote>\n<p>In all public Lean 4 presentations, we clearly state that the compiler has not been verified, nor we intend to do it.</p>\n</blockquote>\n<p>The compiler doesn't need to be verified, it just needs to have no bugs in it. I think we agree that the most appropriate and pragmatic way to handle this is to wait for bug reports, treat them seriously as bugs and fix them then.</p>\n<blockquote>\n<p>If it is important to you, I am happy to hear you are doing it.<br>\nI do not believe this is a \"pressuring issue\". ITPs are still not widely used tools.<br>\nWe can debate why they are not, but I am pretty sure it is not due to soundness issues.</p>\n</blockquote>\n<p>I think lean and mathlib have done a tremendous job popularizing ITPs among pure mathematicians. I don't think that soundness is actually very important towards this goal, although there are some knock-on benefits of having a stable and predictable kernel. My own work is mainly to be able to maneuver \"under\" the user level, to eventually be able to validate all lean (and other theorem prover) proofs with a proven-correct verifier. This work is mostly orthogonal to user level use of lean 3/4, so I'm happy to prioritize \"good enough\" soundness and correctness guarantees in order to prioritize ITP popularization on the lean side.</p>",
        "id": 221093688,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609191981
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> </p>\n<blockquote>\n<p>The compiler doesn't need to be verified, it just needs to have no bugs in it. </p>\n</blockquote>\n<p>Yes, of course, but this is an unreasonable expectation. <br>\nThe compiler is very complex, performs non-trivial optimizations, and we will keep improving and extending it. <br>\nThere will be bugs, and we will fix them.<br>\nThis is the compromise we keep stating in every Lean 4 talk.<br>\nThat being said, I want to make it absolutely clear to everybody using Lean as a theorem prover that bugs in the Lean code generator will not affect the logical soundness of the system. <br>\nThis is not the first thread written by you that generates misunderstandings and confusion about logical soundness.<br>\nTo make it very clear. I am interpreting your original comments as FUD tactics (<a href=\"https://en.wikipedia.org/wiki/Fear,_uncertainty,_and_doubt\">https://en.wikipedia.org/wiki/Fear,_uncertainty,_and_doubt</a>).<br>\nI appreciate you corrected the title, and explicitly told Jason this is not a logical soundness issue.<br>\nHowever, you only did after I commented. Before I wrote the comment, Jason was clearly confused by your claims, figured out that there was no soundness issue by himself, and you replied with \"Yes, you can argue in this way. However, ...\". Really?</p>",
        "id": 221095653,
        "sender_full_name": "Leonardo de Moura",
        "timestamp": 1609193982
    },
    {
        "content": "<p>I missed Jason's post yesterday, and responded only to today's comment. I agree with all of the things you have said, although any FUD you are reading in my words is not intentional. I will continue to clarify my statements if any additional confusion arises.</p>",
        "id": 221095953,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609194268
    }
]