[
    {
        "content": "<p>I would like to introduce the Lean community to 4 new members:</p>\n<ul>\n<li>Lawrence Zhao</li>\n<li>Edward Kong</li>\n<li><span class=\"user-mention\" data-user-id=\"308764\">@Alex Dolcos</span> </li>\n<li>Nicholas Phillips</li>\n</ul>\n<p>They are high-school students (making them some of the youngest members of our community <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> ).</p>\n<p>They have been working with me over the past month on a summer research project (as part of a program run by the department of math<br>\nat University of Illinois at Urbana Champaign).  I myself am a graduate student and had some previous experience with Lean but for Lawrence, Ed, Alex and Nic, this is their first foray into theorem-proving territory.  I was delightfully surprised by how quickly they were able to warm up to Lean and were able to make substantial progress in such a short time.</p>\n<p>We are excited to share the results of our labor here.  We have attempted formalizing Euclid's and Hilbert's Geometry axioms in Lean and are looking for any feebback that the comminuty can offer us on how to improve things.  We have proved some lemmas and propositions but a lot<br>\nmore needs to be done.  Our goal is to formalize all 48 of Euclid's propositions (including the Pythagorean theorem) in Lean.</p>\n<p>We called our project LeanTeach2020. Link to code repo -- <a href=\"https://github.com/vaibhavkarve/leanteach2020\">https://github.com/vaibhavkarve/leanteach2020</a></p>",
        "id": 201437147,
        "sender_full_name": "Vaibhav Karve",
        "timestamp": 1592598853
    },
    {
        "content": "<p>What's the story with the sorrys in <code>tarski.lean</code> -- are they also axioms or should they be fillable?</p>",
        "id": 201437773,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592599274
    },
    {
        "content": "<p>How does it interact with Ali's stuff?</p>",
        "id": 201437804,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1592599301
    },
    {
        "content": "<p>Ali used variables not constants, and he probably proved more but he only did Tarski</p>",
        "id": 201437878,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592599333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Need.20feedback.20.3A.20Euclid.20and.20Hilbert/near/201437773\">said</a>:</p>\n<blockquote>\n<p>What's the story with the sorrys in <code>tarski.lean</code> -- are they also axioms or should they be fillable?</p>\n</blockquote>\n<p>They should be fillable. The story there is that we just found easier access to proofs in the Euclid and Hilbert system and hence we prioritized those over Tarski's.  We have all of Tarski's axioms in place but it's a very rough draft since we haven't really used them to prove any results.</p>",
        "id": 201438356,
        "sender_full_name": "Vaibhav Karve",
        "timestamp": 1592599679
    },
    {
        "content": "<p>Another interesting thing to do would be to show that the affine spaces which have just appeared in mathlib were a model for these axioms</p>",
        "id": 201793641,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592952293
    },
    {
        "content": "<p>And to show that the disk model of the hyperbolic plane is a model for a non-parallel-postulate variant!  IIRC this is on the Freek list.</p>",
        "id": 201794070,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1592952574
    },
    {
        "content": "<p>Aiming for a sorry-ftee Freek statement would be brilliant. Freek is specifically agnostic about the precise form of the statement you prove, he told me he did this  intentionally; anything that can be interpreted as a formalisation of the heart of the problem will do. You might be able to turn this into a little piece for the Exp Math special issue, the deadline is December</p>",
        "id": 201813873,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592978133
    },
    {
        "content": "<p>Whoa! These are great ideas. I will need to look more closely at what these models entail, but thanks a lot for the suggestions.</p>",
        "id": 202647658,
        "sender_full_name": "Vaibhav Karve",
        "timestamp": 1593661463
    }
]