[
    {
        "content": "<p>Today we've said goodbye to an old friend and welcomed a new one to the community. mergify[bot] has moved on to explore new opportunities. Stepping up in its place, helping the maintainers merge your pull requests: please welcome bors[bot]! Ignore its robotic exterior. bors[bot] is very gentle and caring on the inside.</p>\n<p>What this means to you: instead of seeing your PRs approved and tagged with a green label, you'll see the maintainers commenting <code>bors r+</code>. bors is more clever about queue management than mergify was. So instead of approved PRs landing on master one after the other, 1-3 hours apart, you'll notice them landing in batches. The overall wait time should be much lower. <del>Soon</del> The green labels will show up automatically.</p>\n<p>leanprover-community-bot and mergify[bot] never got along very well, but mergify[bot] was too timid to stand up for itself. bors[bot] is more assertive. So you'll see leanprover-community-bot making some pull requests instead of pushing directly to master.</p>\n<p>We owe a huge round of applause to <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> and <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> for setting this up! It's a huge improvement.</p>",
        "id": 193566384,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1586523693
    },
    {
        "content": "<p>Bryan wrote a fantastic explanation of the setup, which is in the docs folder here: <a href=\"https://github.com/leanprover-community/mathlib/blob/master/docs/contribute/bors.md\" title=\"https://github.com/leanprover-community/mathlib/blob/master/docs/contribute/bors.md\">https://github.com/leanprover-community/mathlib/blob/master/docs/contribute/bors.md</a></p>",
        "id": 193566718,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1586523868
    },
    {
        "content": "<p>One point that's relevant for contributors. If a mantainer comments <code>bors d+</code> (or <code>bors delegate+</code>) on your PR, it means that you can tell bors to start merging your PR whenever you're ready. You communicate this by commenting <code>bors r+</code> yourself.</p>",
        "id": 193566884,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1586523989
    },
    {
        "content": "<blockquote>\n<p>Commit messages are taken from the first post of the PR. This is much nicer than mergify / Github's default which just combines all commit subject lines into one. We have set things up so that the text after \"TO CONTRIBUTORS\" is automatically ignored. Note that contributions from other users will have to be added explicitly to the first post with \"Co-authored-by:\" trailers; they aren't automatically added like how mergify and Github previously did.</p>\n</blockquote>\n<p><span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> It's already so much better.<br>\nWhen creating a PR, does Github automatically build the first post of the PR from the commit message(s) in the branch plus the contributor template?</p>",
        "id": 193569322,
        "sender_full_name": "Reid Barton",
        "timestamp": 1586525879
    },
    {
        "content": "<p>I think so.</p>",
        "id": 193570009,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1586526288
    },
    {
        "content": "<p>One more important change worth announcing here: Previously with mergify, it was OK to add commits to a PR with the \"ready-to-merge\" label. Now, if you add commits to a PR after it's been approved with <code>bors r+</code> then the approval will be canceled and someone will have to re-approve it.</p>",
        "id": 193578716,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1586531176
    },
    {
        "content": "<p>To be honest that sounds like a step in the right direction!</p>",
        "id": 193585537,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586534587
    }
]