[
    {
        "content": "<p>I remember <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> once saying something of the form \"I wish people wouldn't start files with <code>noncomputable theory</code>\". It now occurs over 100 times in mathlib. Is what is going on the following? In a file with no <code>noncomputable theory</code> in it, If I incorrectly do or don't mark a definition as noncomputable then Lean will typically tell me. But if I start a file with <code>noncomputable theory</code> then this check is just switched off. Is it then the case that various possibly-computable functions get marked as noncomputable? Does this change anything? Could a combination of a linter and a way of temporarily switching off <code>noncomputable theory</code> do something about this, or have I just misunderstood what <code>noncomputable theory</code> is doing? Of course I'm not suggesting that <code>topology/metric_space/*</code> be made computable, this clearly shouldn't be done in mathlib which has made the decision to be resolutely classical (thank goodness!) -- but I'm just wondering whether we have computable functions incorrectly tagged as noncomputable.</p>",
        "id": 192772130,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585902985
    },
    {
        "content": "<p>I just made a file put noncomputable theory at the start and made a <code>def</code> and eval'd it, worked fine, so it seems adding noncomputable theory doesn't stop basic functions from being computable, just removes the warning when you \"accidentally\" make something noncomputable.</p>",
        "id": 192772742,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1585903353
    },
    {
        "content": "<p>I wonder why Mario was complaining then? Maybe I misremembered?</p>",
        "id": 192774748,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585904370
    },
    {
        "content": "<p><a href=\"#narrow/stream/113488-general/topic/computability/near/168198880\" title=\"#narrow/stream/113488-general/topic/computability/near/168198880\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/computability/near/168198880</a></p>",
        "id": 192775251,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1585904568
    },
    {
        "content": "<p>Me : \"I just don't get why computability is important to me if I just want to make mathematical objects and state and prove theorems about them.\"</p>\n<p>Mario : \"It's not, unless you are Anrdej Bauer\"</p>\n<p>This is not right. I might not be <em>interested</em> in it, but if I want to do mathematics in Lean \"the way mathmaticians do it\" then I am absolutely relying on it.</p>",
        "id": 192782206,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585908312
    },
    {
        "content": "<p>because I absolutely need high-powered tactics like <code>ring</code></p>",
        "id": 192782272,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585908351
    },
    {
        "content": "<p>I need <code>details_left_to_the_interested_reader</code>, that's the kind of tactic which will get generic mathematicians interested. <code>simp</code>on steroids.</p>",
        "id": 192782381,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585908394
    },
    {
        "content": "<p>I don't recall making this specific complaint</p>",
        "id": 192783166,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585908924
    },
    {
        "content": "<blockquote>\n<p>In a file with no noncomputable theory in it, If I incorrectly do or don't mark a definition as noncomputable then Lean will typically tell me. But if I start a file with noncomputable theory then this check is just switched off.</p>\n</blockquote>\n<p>Actually, the check isn't switched off, the <code>noncomputable</code> marking is inferred rather than checked. If you look at <code>def</code>s made in a file with <code>noncomputable theory</code>, you will see that they are still being marked <code>noncomputable</code>, you just don't have to write this keyword on the def yourself</p>",
        "id": 192783353,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585909018
    },
    {
        "content": "<p>and defs that are actually computable will not be unnecessarily marked <code>noncomputable</code></p>",
        "id": 192783419,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585909060
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192782206\" title=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192782206\">said</a>:</p>\n<blockquote>\n<p>Me : \"I just don't get why computability is important to me if I just want to make mathematical objects and state and prove theorems about them.\"</p>\n<p>Mario : \"It's not, unless you are Anrdej Bauer\"</p>\n<p>This is not right. I might not be <em>interested</em> in it, but if I want to do mathematics in Lean \"the way mathmaticians do it\" then I am absolutely relying on it.</p>\n</blockquote>\n<p>This is an argument for why you should care that tactics, i.e. programs meant to be run, are computable. It is not an argument for why e.g. real numbers, algebraic varieties, or multivariate polynomials should be computable. Tactics are already <code>meta</code>, which means they are essentially opting out to the \"proofy\" part of lean, which means if they didn't fit in the \"programming\" part of lean either they would be useless. So these functions are all expected to be computable. For non-<code>meta</code> functions, there is a proofy aspect, and you can opt out of the \"programming\" part by using <code>noncomputable</code>. My point is that in most or all of these cases, you the mathematician don't have to ever care about that marking, it only concerns programming applications.</p>\n<p>It may turn out that there is some part of lean that is in the intersection of both of these worlds, such as <code>nat</code> or <code>int</code> or <code>list A</code>, where we want the functions to be both non-<code>meta</code> and computable, because the types serve both purposes. However, it is often the case that the best way to represent something for programming is not the best way for proofs, so even in these cases having a distinction is useful. In fact, even in these three cases, this is exactly what happens. <code>nat</code> and <code>int</code> are only good for computation because of a dirty hack in the lean VM to replace the incredibly inefficient unary representation with a bignum arithmetic package. If you had to do this in lean the type <code>gmp_nat</code> would be significantly more complicated and would certainly not look like an inductive type with zero and succ. The computational content of <code>list A</code> is a singly linked list, which is well known not to be the best way to store lists of values in a computer by a pretty significant margin. Here we have the <code>buffer A</code> type as an alternative, but it's not as nice for proving theorems.</p>\n<p>So I think that to a first approximation there is little overlap between \"lean for proofs\" and \"lean for programming\". Having the ability to do both at once is nice, but usually this requires a trade off between the computationally efficient thing and the easy to prove thing. So when you are doing maths just forget about computability, and when you are doing programming choose the best types for the job.</p>",
        "id": 192784933,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585910005
    },
    {
        "content": "<p>Re list A and buffer A we can prove the theorems about lists and you can use the transfer tactic to port the theorems into theorems about buffers</p>",
        "id": 192790625,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585914019
    },
    {
        "content": "<p>The <code>ring</code> tactic works with the real numbers and I really need it on the real numbers for pedagogical purposes. The real numbers aren't computable but if there were no <code>ring</code> tactic I would have left long ago. Scott's tactic <code>obviously</code> make it clear that this is what we mathematicians are aiming for -- a system that can do the obvious bits</p>",
        "id": 192791131,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585914228
    },
    {
        "content": "<p>But for that all the computability stuff is super important</p>",
        "id": 192791205,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585914255
    },
    {
        "content": "<p>I'm just putting it all together that's all. Why doesn't a transfer tactic solve your buffer list woes?</p>",
        "id": 192791308,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1585914325
    },
    {
        "content": "<blockquote>\n<p>Re list A and buffer A we can prove the theorems about lists and you can use the transfer tactic to port the theorems into theorems about buffers</p>\n</blockquote>\n<p>Right, I think this should be the preferred method. This is how all the theorems about <code>num</code> are proved, and if we wrote a <code>gmp_nat</code> type it would also be presumably isomorphic to <code>nat</code> and hence we could do the same trick. But this is only underscoring the importance of separating the implementation type from the abstract mathematical type</p>",
        "id": 192795342,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585916740
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791131\" title=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791131\">said</a>:</p>\n<blockquote>\n<p>The <code>ring</code> tactic works with the real numbers and I really need it on the real numbers for pedagogical purposes. The real numbers aren't computable but if there were no <code>ring</code> tactic I would have left long ago. Scott's tactic <code>obviously</code> make it clear that this is what we mathematicians are aiming for -- a system that can do the obvious bits</p>\n</blockquote>\n<p>The <code>ring</code> tactic does not work on real numbers, it works on <code>expr</code>, which is a perfectly reasonable computable type. It just so happens that the <code>expr</code>s that it manipulates are talking about real numbers, but by moving to meta land even the most complicated noncomputable mathematical types become computable again because everything is an <code>expr</code></p>",
        "id": 192795535,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585916851
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791205\" title=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791205\">said</a>:</p>\n<blockquote>\n<p>But for that all the computability stuff is super important</p>\n</blockquote>\n<p>Nope, <code>ring</code> should demonstrate this fairly well - for tactics it doesn't matter at all if the type that is being discussed is computable</p>",
        "id": 192795695,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585916945
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791308\" title=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192791308\">said</a>:</p>\n<blockquote>\n<p>Why doesn't a transfer tactic solve your buffer list woes?</p>\n</blockquote>\n<p>I think it does, and in the proofs in <code>data.num.lemmas</code> I think you will actually see a poor man's transfer tactic in there. This kind of thing is one of the primary motivating examples for the transfer tactic</p>",
        "id": 192795856,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1585917034
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192790625\" title=\"#narrow/stream/113488-general/topic/noncomputable.20theory/near/192790625\">said</a>:</p>\n<blockquote>\n<p>Re list A and buffer A we can prove the theorems about lists and you can use the transfer tactic to port the theorems into theorems about buffers</p>\n</blockquote>\n<p>That sounds super useful for doing computations in Lean! Could it be used to transfer the lemmas about <code>data.finset</code> to lemmas about a red-black tree? Mathlib matrices to sparse matrices? Reals to floating point numbers up to some error margin?</p>",
        "id": 192907982,
        "sender_full_name": "Anton Lorenzen",
        "timestamp": 1586007453
    },
    {
        "content": "<p>I am not sure about the reals because those types are not isomorphic</p>",
        "id": 192908411,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586008128
    },
    {
        "content": "<p>As Kevin says, you need two equivalent types, so I'm not sure what the first example you mention means. The second is totally the sort of thing transfer should do. And as for the third fixed precision floating points are not the same as the reals, but perhaps the equivalence (cauchy sequences) &lt;-&gt; (cauchy sequences with a fixed convergence rate) is another example in the direction you are thinking.</p>",
        "id": 192908705,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1586008533
    },
    {
        "content": "<p>Actually <code>transfer</code> doesn't require isomorphism. It requires a couple things depending on what operators it sees, but for example you can enter a forall binder if the relation is bi-total, which means <code>(∀b, ∃a, R a b) ∧ (∀a, ∃b, R a b)</code></p>",
        "id": 192913121,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1586014418
    },
    {
        "content": "<p>The proof of properties of <code>int</code> by transfer from <code>nat x nat</code> is very much not an isomorphism</p>",
        "id": 192913192,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1586014485
    }
]