[
    {
        "content": "<p>For measure theory, we have in general used <code>α</code> for the underlying type of a measurable space and <code>μ</code> for a measure on <code>α</code>. Right now in the probability folder, most files continue to use this notation except for the <code>strong_law</code> file where the standard probability notations are used (i.e.<code>Ω</code> for the type and <code>ℙ</code> is the measure) . <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> said in <a href=\"https://github.com/leanprover-community/mathlib/pull/14933\">#14933</a> that using the probability notation will help more probability-inclined readers and I agree also. Should we change the notations in the probability folder to the probability notations? <br>\n(cc. <span class=\"user-mention\" data-user-id=\"373986\">@Kalle Kytölä</span> who also had opinions on this)</p>",
        "id": 292272469,
        "sender_full_name": "Jason KY.",
        "timestamp": 1659811245
    },
    {
        "content": "<p>/poll Change to probability notations?<br>\nYes<br>\nNo</p>",
        "id": 292272501,
        "sender_full_name": "Jason KY.",
        "timestamp": 1659811313
    },
    {
        "content": "<p>(Note that <code>ℙ</code> will not be a probability measure most of the time but a finite measure since a surprising amount of probability theorems remains to hold)</p>",
        "id": 292272726,
        "sender_full_name": "Jason KY.",
        "timestamp": 1659811561
    },
    {
        "content": "<p>I think notational cues are quite important for readability!</p>\n<p>Without a doubt, one will face some tough calls about what is probability theory and what is measure theory... But even <code>X</code> for the space (pretty neutral in measure theory, right?) is better than <code>α</code> (one never encounters <code>α</code> in this role in math texts).</p>",
        "id": 292274470,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1659813551
    },
    {
        "content": "<p>Another question is if we should actively change the existing conventions or take the more passive approach that in new additions we prefer better mathematical cues in the notation.... I don't have strong opinions about that, but if there is a reasonable consensus and someone is willing to improve the notation, then I'm obviously happy!</p>\n<p>(In the weak convergence file I have been planning to switch to either measure theory <code>X</code> or probability theory <code>Ω</code> at some point, but somehow started and got stuck with the mathlib's generic <code>(α : Type*)</code>...).</p>",
        "id": 292274538,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1659813604
    },
    {
        "content": "<p>I personally prefer consistency over whatever notations we choose so I think it's a good idea to change the notations to the older files to be consistent with whatever decision we decide to make (it will be a simple search and replace also so it's not too much work :))</p>",
        "id": 292274748,
        "sender_full_name": "Jason KY.",
        "timestamp": 1659813860
    }
]