[
    {
        "content": "<p>In <code>analysis/topology/topological_space.lean</code> we have s and t being used for more than one thing. Even in the definition of a topological space we have</p>\n<div class=\"codehilite\"><pre><span></span>(is_open_inter  : ∀s t, is_open s → is_open t → is_open (s ∩ t))\n(is_open_sUnion : ∀s, (∀t∈s, is_open t) → is_open (⋃₀ s))\n</pre></div>\n\n\n<p>Here s is an open set on one line, and a set of open sets on the next. Is this sort of thing regarded as OK? We're doing Xena tonight (it's usually Thursdays but I'm busy this Thurs) and a 2nd year undergraduate who has just learnt what a topological space is, is trying to read this mathlib file and this sort of notational trickery is not helping. Would <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> be interested in a PR which only contained changes of the form</p>\n<div class=\"codehilite\"><pre><span></span>(is_open_inter  : ∀s₁ s₂, is_open s₁ → is_open s₂ → is_open (s₁ ∩ s₂))\n(is_open_sUnion : ∀I, (∀s∈I, is_open s) → is_open (⋃₀ I))\n</pre></div>\n\n\n<p>? For me, that is more readable, but might not conform to some sort of mathlib style (I'm not sure about this). Later on in <code>is_open_sUnion</code> we have a <code>t</code> in the statement and a different <code>t</code> in the proof. Of course none of this is logically wrong, but it does strike me as a strange design decision in some sense. Maybe mathematicians don't label their theorems as well as computer scientists might want them to, but I think they label their objects in a more consistent manner than this (e.g it would be considered bad writing to have s representing more than one thing, particularly two different types in consecutive sentences -- although of course I've seen it happen!)</p>",
        "id": 123620935,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1520880673
    },
    {
        "content": "<p>I often use capital letters for higher order sets. So <code>is_open_sUnion</code> would become <code>∀S, (∀s∈S, is_open s) → is_open (⋃₀ S)</code></p>",
        "id": 123621019,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1520880809
    },
    {
        "content": "<p>I believe there is a similar convention of changing font registers in standard math</p>",
        "id": 123621034,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1520880833
    },
    {
        "content": "<p>I usually reserve <code>I</code> or <code>ι</code> for the index set of a type/set family, say if I was discussing the indexed union instead of the set union</p>",
        "id": 123621093,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1520880898
    }
]