[
    {
        "content": "<p>I just came across <a href=\"https://arxiv.org/pdf/2005.03089.pdf\">Experiences from Exporting Major Proof Assistant Libraries</a> by Michael Kohlhase and Florian Rabe.  They talk about their experiences translating the libraries of multiple proof assistants, specifically the ones of Coq, HOL Light, IMPS, Isabelle, Mizar, and PVS into a universal format: OMDoc/MMT.  The paper is a bit long so I've only skimmed it but here are some interesting points.</p>",
        "id": 198669349,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590413651
    },
    {
        "content": "<p>I think they export the libraries of these provers into a common format called MMT, which can recheck the proofs.  For many provers, this is a big undertaking and they outline the steps they took for each prover.  While this alone doesn't make these systems interoperable, it is one step closer.</p>",
        "id": 198669365,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590413666
    },
    {
        "content": "<p>They mention that Lean (and HOL4) are notably lacking.  They point out that even though Lean and Coq have similar foundations, what matters for this work is the implementation and they have very different implementations.</p>",
        "id": 198669380,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590413678
    },
    {
        "content": "<p>They also have some good quotes:</p>\n<ul>\n<li>\"Users of theorem provers often approach (and occasionally exasperate) developers with requests to be able to use, e.g., Coq’s tactics together with Isabelle’s sledgehammer tool, requests that sound simple to users but are infeasible for developers.\"</li>\n<li>\"Even a bug as blatant as accidentally generating all theorem files as empty strings (which then trivially recheck) can be surprisingly hard to notice because these exports involve large sets of large files often containing formalizations from domains that neither the prover expert nor the MMT expert understand.\"</li>\n</ul>",
        "id": 198669391,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590413688
    },
    {
        "content": "<p>In the final section, they have advice for designers of theorem provers and libraries (emphasis theirs).</p>\n<ul>\n<li>\"We have a single clear and important recommendation for developers of theorem provers and libraries: <em>design systems with exports in mind!</em>\"</li>\n<li>\"Provers should <em>trace user-level content</em> on its way through the elaboration pipeline into the kernel-level syntax.\"  (They however point out this needs to be balanced with performance.)</li>\n<li>\"Provers should commit to <em>maintaining a system-near export</em> in some standard data format such as XML or JSON and with a well-documented schema.\"</li>\n<li>\"Provers should <em>allow users to structure formalizations</em> with library integration in mind.\"  (I think they are saying here that in say Coq, one could check that a definition or theorem is actually compatible with HOL.  I don't think I understand the details.)</li>\n</ul>",
        "id": 198669423,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590413704
    },
    {
        "content": "<p>This also sounds similar in spirit to <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span>'s MMO project, but maybe I am mistaken.</p>",
        "id": 198670174,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590414196
    },
    {
        "content": "<p>Isn't Dedukti something like this?</p>",
        "id": 198670331,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590414266
    },
    {
        "content": "<p>Yes, Dedukti is meant to do exactly that.</p>",
        "id": 198670363,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1590414296
    },
    {
        "content": "<p><a href=\"https://vimeo.com/421123419\">This talk</a> from Thursday is probably relevant too (unfortunately I missed it and haven't watched it yet).</p>",
        "id": 198670441,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590414361
    },
    {
        "content": "<p>Here is the <a href=\"https://uniformal.github.io\">MMT project website</a>.</p>",
        "id": 198670793,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590414585
    },
    {
        "content": "<p>Isn't this insanity? How does MMT know that Lean's Banach spaces are the same as Isabelle's?</p>",
        "id": 198671049,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590414756
    },
    {
        "content": "<p>They don't.  They make it very clear that library alignment is a separate and hard problem.</p>",
        "id": 198671093,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590414793
    },
    {
        "content": "<p>So their goal is to make one system which contains the disjoint union of all the theorems in the other provers? With an emphasis on disjoint?</p>",
        "id": 198671135,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590414830
    },
    {
        "content": "<p>I think my operating system does that already</p>",
        "id": 198671163,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1590414842
    },
    {
        "content": "<p>I think the ultimate goal is alignment and interoperability (and they have written some papers on those topics), but I think they view this as a first step.  I don't know if their format is the correct one, but I imagine if Lean only lives in Lean and Isabelle only lives in Isabelle, then there is no hope at interoperability.  One needs an interchange format (that is better than Lean source code or .olean files).</p>",
        "id": 198671681,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590415172
    },
    {
        "content": "<p>It seems they mention Lean's export format once in passing. I wonder whether they did not include it as an example because it is already basically solved, or because there is something making the export format not usable.</p>",
        "id": 198671781,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590415240
    },
    {
        "content": "<p>I could also imagine that they don't have Lean, because they approached the Lean developers and they replied \"wait until we've built Lean 4\".</p>",
        "id": 198672034,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590415431
    },
    {
        "content": "<p>One of the coauthors of the paper sent me an email some time ago because they wanted to parse and type-check the Lean export format using my trepplein tool.  They were interested in it because both trepplein and MMT are written in Scala.</p>",
        "id": 198672328,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1590415579
    },
    {
        "content": "<p>But apparently they didn't use it after all..</p>",
        "id": 198672422,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1590415629
    },
    {
        "content": "<p>Just for my own information, where can I find more on Lean's export format?  Is this what is in .olean files?  Is it also the information accessible in the \"environment\" in Lean?</p>",
        "id": 198673324,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590416198
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/lean/blob/master/doc/export_format.md\">https://github.com/leanprover-community/lean/blob/master/doc/export_format.md</a></p>",
        "id": 198673349,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590416213
    },
    {
        "content": "<p>I don't think it contains all of that information (e.g., notation is absent I think), just the important stuff.</p>",
        "id": 198673377,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590416240
    },
    {
        "content": "<p>Probably attributes are absent too. Important = important for an external type checker to verify the proofs.</p>",
        "id": 198673426,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590416274
    },
    {
        "content": "<p>No position information either.</p>",
        "id": 198673503,
        "sender_full_name": "Reid Barton",
        "timestamp": 1590416302
    },
    {
        "content": "<blockquote>\n<p>Regarding elaboration, Isabelle is special among proof assistants in that it a very complex processing pipeline from heterogeneous user-level declarations to homogeneous kernel-level declarations.</p>\n</blockquote>\n<p>I must be missing something.  Isabelle's term-level syntax is extremely close to the kernel syntax, no hidden implicit arguments, etc.  Data types are elaborated similar to HOL.  And Isar is just as close to the kernel proofs as ssreflect tactics are to Coq proof terms.</p>",
        "id": 198673535,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1590416323
    },
    {
        "content": "<p>If it helps, here is a separate paper just on the Isabelle export: <a href=\"https://arxiv.org/pdf/2005.08884.pdf\">https://arxiv.org/pdf/2005.08884.pdf</a></p>",
        "id": 198673783,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590416509
    },
    {
        "content": "<p>I don't know enough about Isabelle to comment more.</p>",
        "id": 198673827,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590416523
    },
    {
        "content": "<p>Calling Lean a reimplementation of Coq is harsh</p>",
        "id": 198674094,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1590416683
    },
    {
        "content": "<blockquote>\n<p>they are neither binary nor source compatible with Coq</p>\n</blockquote>\n<p>They say it like it's a bad thing.</p>",
        "id": 198674525,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1590416934
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110032\">@Reid Barton</span>  I don't think from their point of view the Lean export format is really a solution.  They seem to be interested in keeping user-level information, such as the tactics used in the proofs.  I'm less sure I understand the motivation of their project, so I can't comment on why they want that information.  However, I can comment on my own machine learning purposes.  Proof recording at the tactic level is really important for building systems like TacticToe.  For my own purposes, I've found ways to hack the Lean tactic library to record the information I need.  I would be great if theorem provers made it easy to do this without hacks.</p>",
        "id": 198676506,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590418202
    },
    {
        "content": "<p>And I think Lean 4 might have some cool features in that regard which I look forward to seeing!</p>",
        "id": 198678239,
        "sender_full_name": "Jason Rute",
        "timestamp": 1590419317
    }
]