[
    {
        "content": "<p>In <a href=\"https://github.com/leanprover-community/mathlib/issues/6587\">#6587</a> I am trying to refactor the definition of <code>order_of</code> to make sense of infinite groups. The main file is compiling, but there are two issues that I'm unable to fix. </p>\n<p>1) In the file <code>group_theory.perm.cycles</code> the proof breakes because somehow lean doesn't understand that <code>order_of</code> makes sense. It somehow doesn't recognise that <code>perm \\alpha</code> being a <code>fintype</code> implies that <code>order_of</code> is well-defined. It gets a bit better if I add <code>haveI := fintype_perm</code> in that the second <code>order_of</code> now makes sense, but the first still doesn't. Any idea why that is?</p>\n<p>2) The decidability-classical linter reports two problems in the <code>order_of</code> file, the first is in <code>is_cyclic_of_order_of_eq_card</code>, the second one is in <code>is_cyclic.card_order_of_eq_totient</code>. It reports that I should replace <code>decidable_eq \\alpha</code> by <code>classical</code> in the proof. However, if I try that, the <code>refl</code> in the end don't seem to work although at least in the infoview the terms look the same.</p>\n<p>Does someone have an idea what is going on in either of these?</p>",
        "id": 229810657,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615450536
    },
    {
        "content": "<p>You can always try <code>congr'</code> if <code>refl</code> is causing you trouble. This is the problem we see a lot when people try reasoning about finite types. The two ways to fix it are to either become an expert in constructive finiteness or switch to existential finiteness like I do in the fincard branch</p>",
        "id": 229811013,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615450770
    },
    {
        "content": "<p>Basically I would argue that someone like you would be better off with the hypothesis <code>nonempty (fintype alpha)</code> but then the problem is that some of the theorems you'll need are not proved in this generality, computable versions are proved instead so you have to port everything to a non-computable setting. I think elements of infinite order should have order 0 and one shouldn't even ask for any finiteness hypotheses. Then you prove the theorem saying that g^n=1 iff n is a multiple of the order.</p>",
        "id": 229811334,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615450947
    },
    {
        "content": "<p>This non-computable finiteness is something else which is long overdue, like ideals in noncommutative rings</p>",
        "id": 229811420,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615451025
    },
    {
        "content": "<p>The definition of <code>order_of</code> has two decidability assumptions <code>[Π a : α, decidable_pred (λ n, 0 &lt; n ∧ a ^ n = 1)] [Π a : α, decidable (∃ n, 0 &lt; n ∧ a ^ n = 1)]</code> that should be axed</p>",
        "id": 229811712,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451168
    },
    {
        "content": "<p>If you want this to be computable, you should instead have a typeclass <code>has_order_of</code> so that you can supply an implementation and prove it equivalent to the real <code>order_of</code></p>",
        "id": 229811800,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451228
    },
    {
        "content": "<p>it's very unrealistic to assume that <code>[Π a : α, decidable (∃ n, 0 &lt; n ∧ a ^ n = 1)]</code> is directly decidable on concrete computable groups</p>",
        "id": 229811861,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451271
    },
    {
        "content": "<p>So, I understand correctly that I should make the definition noncomputable and remove the two assumptions and then it could be a second step to supply an implementation later?</p>",
        "id": 229812034,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615451348
    },
    {
        "content": "<p>yeah, if you don't care to have a computable <code>order_of</code> now then just remove those assumptions and use <code>by classical; exact</code> local to the definition of <code>order_of</code></p>",
        "id": 229812112,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451402
    },
    {
        "content": "<p>I don't think you should expose a theorem that talks about <code>nat.find</code> directly as in <code>order_of_of_finite_order</code>; instead expose the definitional axioms of <code>nat.find</code> rewritten for use with <code>order_of</code></p>",
        "id": 229812339,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451489
    },
    {
        "content": "<p>I don't care about it being computable now, but <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> remarked in the PR process that it would be nice to be able to use dec_trivial to compute orders of elements in finite groups of order less than 10 in the future. As far as I can see, this is not used in mathlib so far.</p>",
        "id": 229812449,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615451534
    },
    {
        "content": "<p>I think it's worth specifically investigating this in its own PR, because the naive implementation is not at all practical</p>",
        "id": 229812580,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451599
    },
    {
        "content": "<p>In particular, <code>decidable (∃ n, 0 &lt; n ∧ a ^ n = 1)</code> has no instance even in the case where <code>A</code> is a decidable fintype</p>",
        "id": 229812826,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451716
    },
    {
        "content": "<p>because it contains an unbounded existential nat quantifier</p>",
        "id": 229812869,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615451736
    },
    {
        "content": "<p>Thanks for the advice. I'll go classical then for now.</p>",
        "id": 229814372,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615452463
    },
    {
        "content": "<p>There are two things pulling in different directions here. One is theoretical mathematicians like Julian and <span class=\"user-mention\" data-user-id=\"329425\">@Peter Nelson</span> coming along and saying \"we are finding <code>fintype</code> and <code>finset</code>difficult to use in practice\", which can I believe be solved with this finsum approach, and then there's the other extreme where we'd like to be able to show off to the undergraduates by computing the order of some explicit element of S3 using dec_trivial. These are incompatible in some sense -- and I don't think we should be telling newcomer mathematicians that they need to learn all the arcane tricks in order to prove theorems about the order of an element of a finite group. But the <code>dec_trivial</code> proof is not the correct one, we all know that Lean will hang on the dihedral group D37 anyway with this approach. Telling students we can compute the order of elements in S3 but not S8 is not a good look when software like GAP is out there.</p>",
        "id": 229814381,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615452470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317890\">@Julian Külshammer</span> Just to be clear: I don't consider the <code>dec_trivial</code> thing very important. So let's go classical.</p>",
        "id": 229817489,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1615454021
    },
    {
        "content": "<p>But we'll need a way to easily show that <code>-1 : units int</code> has order 2</p>",
        "id": 229817520,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1615454039
    },
    {
        "content": "<p>Mario, doesn't the linked PR provide such an instance?</p>",
        "id": 229818187,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1615454353
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> I'll keep that in mind and try to add an example or lemma about that.</p>",
        "id": 229818207,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615454370
    },
    {
        "content": "<p>It does, but only in the trivial case where it is always true, in which case it may as well be a <code>fact</code> instead of a <code>decidable</code> assumption</p>",
        "id": 229821646,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615456132
    },
    {
        "content": "<p>but really, a statement with this much quantifier complexity should be packed behind a definition if you actually want typeclass inference to work on it</p>",
        "id": 229821753,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1615456180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I don't think it was a particular issue with <code>fintype</code> in this case though. It was possible to make it work with some decidability assumption like: If it is possible to decide if the order of this element is finite, then you can use a computable definition. However, as Eric pointed out, there is then a problem with rewrites not working nicely, e.g. lean couldn't figure out that if a has finite order and a=1, then order of 1 makes sense and got stuck. Then I switched to the all-or-nothing approach according to Eric's advice: In practice, probably it is reasonable to ask that finite order is decidable for every element of a group (e.g. finite groups or free groups) rather than just a specific one. But this was also difficult to use (because of too many quantifiers according to Mario). So, now everything is noncomputable and works fine. Lean now reports that there are some unused arguments in <code>dihedral</code>: Since the dihedral group associated to 0 is defined to be the infinite dihedral group, the order of the elements can be given uniformly without assuming finite dihedral group, i.e. n&gt;0.</p>",
        "id": 229999228,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615541441
    },
    {
        "content": "<p>I wasn't able to fix problem 2 though, refl still doesn't work and I wasn't able to make congr' work either. If anyone has an advice there, let me know.</p>",
        "id": 229999338,
        "sender_full_name": "Julian Külshammer",
        "timestamp": 1615541500
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 229999488,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1615541577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317890\">@Julian Külshammer</span> yes this exactly the problem with <code>fintype</code> -- rewrites don't work nicely (experts can often work around individual problems). This is what the noncomputable approach solves in a far simpler way, by removing the issue completely.</p>",
        "id": 230002280,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1615542899
    }
]