[
    {
        "content": "<p>Recently we've been splitting a lot of files. Let me state a few reasons why we should be careful while doing so:</p>\n<ul>\n<li>Having many files means that similar lemmas will likely be spread across several, which hinders discoverability. One way to fix this is to cross-reference files, but from experience I know that cross-references evolve much slower than the actual content of the files.</li>\n<li>The more files we split, the more opportunities to split we create. Because each file holds less lemmas, it's much easier (and tempting), to get rid of each. Reciprocally, we will be more and more reluctant to add imports to already-existing files even though those imports make sense from a theory point of view and would have already been there had we had less files.</li>\n</ul>",
        "id": 315186654,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1670754699
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"455791\">@Yuyang Zhao</span>, please read this.</p>",
        "id": 315186676,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1670754711
    },
    {
        "content": "<p>It's always a trade-off - importing too much can also make <code>library_search</code> grind to a halt and you can lose sight of the forest for the trees when looking for a result manually in a huge file. Bigger files also increase the chance of ending up with an import loop. But certainly, not every file that can be split should be split.</p>",
        "id": 315219779,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1670771526
    },
    {
        "content": "<p>I haven't timed it, but I would suspect that <code>library_search</code> timeouts are less likely in Lean 4, but I agree that mindlessly splitting files is not a good idea. If performance is increased by splitting files, then I am generally in favor of them (running Lean 3 on a rather old Laptop can be really painful at times) and splitting huge files (&gt;1000 loc) makes me happy as well.<br>\nAs for discoverability, I think this is a totally independent issue: arguably most important mathematical results need additional technology to prove them, so they are more likely be in their own file, which means they will not be easily found by <code>library_search</code> or <code>simp</code>. I think the only good answer is a external search tools (Hoogle for Lean, but even better). Finding theorems by browsing the docs is not a pleasant experience if you are not familiar with the structure/level of abstractions in mathlib and we cannot do anything about that. I don't think that splitting files has a major impact there.</p>",
        "id": 315272163,
        "sender_full_name": "Moritz Doll",
        "timestamp": 1670806324
    },
    {
        "content": "<p>I definitely agree your points: splitting files is not an unqualified good. Certainly there are tradeoffs for each point on the spectrum between lumping everything into one huge file and giving every declaration its own file, and the optimal position for mathlib is likely not at one of the extremes. However, I am rather sure that generally mathlib without active splitting efforts tends towards the too-lumpy side of optimal and so splitting efforts generally improve the situation.</p>",
        "id": 315337801,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1670842612
    }
]