[
    {
        "content": "<p>tl;dr: what are the binding powers of <code>Π  _ , _</code> and <code>→</code> in Lean's dependent type theory? Does this even make sense?</p>\n<p>I have around seven half-written blog posts and I'm trying to get some of them into shape (all part of my general moving back into more active Leaning now my course has finished). One of them is a very basic post about how you can use <code>#print notation</code> to figure out how Lean will parse <code>a + b * c</code> or <code>a ^ b ^ c</code> (i.e. how to find out that <code>*</code> has a higher precedence than <code>+</code>, and that <code>^</code> is right associative).</p>\n<p>But I can't work out how to figure out how <code>∀ n : ℕ, n = 1 → true</code> will parse, short of just tying it. The problem is that <code>∀</code> and <code>→</code> are not notation, they are inbuilt. The comma is also playing a role here, I think; I guess it's part of the forall notation. Are there binding powers at play here that I cannot see? I know forall = Pi. I don't know how to work out whether the example is <code>(∀ n : ℕ, n = 1) → true</code> or <code>∀ n : ℕ, (n = 1 → true)</code> (short of trying it and discovering that it's the latter). There is presumably some underlying logic here.</p>",
        "id": 156445528,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1547920119
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><span class=\"bp\">#</span><span class=\"kn\">print</span> <span class=\"kn\">notation</span> <span class=\"bp\">-&gt;</span>\n<span class=\"c1\">-- _ `-&gt;`:25 _:24 := #1 → #2</span>\n</pre></div>\n\n\n<p>If <code>→</code> is supposed to be exactly the same as <code>-&gt;</code> then this is evidence that the binding power of <code>→</code> is 25 (and the 24 agrees with the fact that <code>→</code> is right associative). But I don't know how to check this short of experimentation.</p>",
        "id": 156446241,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1547921445
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>`Σ`:1024 binders `,`:0 (scoped 0) := #0`\n`Pi`:0 binders `,`:0 (scoped 0) := #0\n</pre></div>\n\n\n<p>Vast difference there between <code>Pi</code> and <code>Σ</code>.</p>",
        "id": 156446351,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1547921667
    },
    {
        "content": "<p>From init/core: <code>def std.prec.arrow : nat := 25</code></p>",
        "id": 156447636,
        "sender_full_name": "François G. Dorais",
        "timestamp": 1547923996
    },
    {
        "content": "<p>ha ha, that does look relevant doesn't, it -- although I don't know for sure that this is referring to <code>→</code> it certainly looks like it is. So what about <code>Π</code> and <code>∀</code>? Here's another one I found in <code>#print notation</code> output:</p>\n<div class=\"codehilite\"><pre><span></span>`∃`:1024 binders `,`:0 (scoped 0) := #0`\n</pre></div>\n\n\n<p>which agrees with <code>Σ</code>.</p>",
        "id": 156448140,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1547924972
    },
    {
        "content": "<p>OK so the only difference between the 1024 and the 0 with <code>Σ</code> and <code>Pi</code> is that <code>Σ</code> eats the binders more greedily, and it seems to me that binders are highly restricted in what they can look like, so all attempts so far by me to construct terms  <code>Σ X, Y</code> and <code>Π X, Y</code> that parse seriously differently have failed. I think the key point is the <code> ``,``:0 </code>which just means in practice \"evaluate everything after this first and then eat the lot\" for both sigma and pi.</p>",
        "id": 156449546,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1547927547
    },
    {
        "content": "<p>I don't think that first binding power matters at all. Binders are a special parse mode anyway,  it's not clear how binding power would affect it. The important part is the <code> `,`:0</code>, which means that everything after the comma is parsed with very low precedence, so that <code>\\all x, P op Q</code> will always parse as <code>\\all x, (P op Q)</code> for any choice of <code>op</code>.</p>",
        "id": 156451293,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1547930915
    },
    {
        "content": "<p>Precedence on tokens sets their <em>left-binding power</em>, i.e. influences things to their left. For example, the first precedence means that <code>a × Π X, Y</code> does not parse while <code>a × Σ X, Y</code> does, because 1024 is higher than the rbp <code>34</code> specified in the <code>prod</code> notation. Similarly, the rbp <code>0</code> on the <code>scoped</code> action is actually the part that influences how far a Pi or Sigma stretches after the comma. Precedences on tokens after the first one in a notation, like <code>,</code> here, shouldn't matter in general.</p>",
        "id": 156761781,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1548324749
    },
    {
        "content": "<p>(Does it make sense that Pi and Sigma do not have the same precedences? Probably not)</p>",
        "id": 156761797,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1548324770
    }
]