[
    {
        "content": "<p>Hi, I'm trying to parse a string as the current goal, e.g. <code>false</code>.  </p>\n<p>The problem was mentioned in <a href=\"https://leanprover-community.github.io/archive/stream/113488-general/topic/Parsing.20a.20string.20into.20an.20expression.html\">this thread</a> but it seems no solution was found.</p>",
        "id": 270469816,
        "sender_full_name": "Tung Tran",
        "timestamp": 1643841344
    },
    {
        "content": "<p>You can do it in the <code>parser</code> monad</p>",
        "id": 270473096,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1643843068
    },
    {
        "content": "<p>The situation has improved since I started that thread. Search for other threads (probably in reverse chronological order) where I talk about the parser monad.  (And if you need to set a new goal, that is also possible.)</p>",
        "id": 270866970,
        "sender_full_name": "Jason Rute",
        "timestamp": 1644120207
    },
    {
        "content": "<p>It might however help if you explain your use case.</p>",
        "id": 270867061,
        "sender_full_name": "Jason Rute",
        "timestamp": 1644120282
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span>  Thanks for the help! I was actually trying to modify the goal (e.g. add hypothesis, remove cases). I'm using the code found in one of the libraries in your PACT paper. Even though they are extremely helpful, it's hard to work with Lean's metaprogramming as I didn't have function programming experience. </p>\n<p>Extending from the paper, I want to put GPT into a feedback loop with something like the hindsight experience replay. I relax a wrong answer by modifying the goal to fit the response, and pretending it was the goal we want to prove from the start. Would something like that work?</p>",
        "id": 271072064,
        "sender_full_name": "Tung Tran",
        "timestamp": 1644286449
    },
    {
        "content": "<p>HER (similar to say <a href=\"https://openreview.net/forum?id=QDDVxweQJy0\">https://openreview.net/forum?id=QDDVxweQJy0</a>) should work for tactic proofs but you will have to work out the logic exactly.  You might have luck working in strings, but I suspect you will have a more robust system working directly with the lean objects.  (Specifically taking the Lean goal output and manipulating that according to HER.)  But yes, that involves a lot of meta programming since you don’t just have to access the goal statement but also the local context.  Here is some code which serializes the tactic state to JSON and deserializes it.  <a href=\"https://github.com/jesse-michael-han/lean-tpe-public/blob/master/src/tactic_state.lean\">https://github.com/jesse-michael-han/lean-tpe-public/blob/master/src/tactic_state.lean</a>  Theoretically when you understand how it all works you should be able to manipulate the goal in the way you need for HER.</p>",
        "id": 271074320,
        "sender_full_name": "Jason Rute",
        "timestamp": 1644288610
    },
    {
        "content": "<p>But if you just want to get started playing with ideas, it might be easier to just take the pretty printed tactic state and do text manipulations on that and the use the parser to reload the manipulated goal string back into lean.</p>",
        "id": 271074451,
        "sender_full_name": "Jason Rute",
        "timestamp": 1644288763
    },
    {
        "content": "<p>Wow I've been trying to find something similar but to no avail. Thank you!</p>",
        "id": 271074787,
        "sender_full_name": "Tung Tran",
        "timestamp": 1644289091
    },
    {
        "content": "<p>And I just realized there's a meta-programming thread here. <em>facepalm</em><br>\nI'm messing with <a href=\"https://github.com/jasonrute/communicating-with-lean/blob/master/communicate_with_lean.ipynb\">the notebook</a> you wrote actually, just to create a proof of concept.</p>",
        "id": 271075166,
        "sender_full_name": "Tung Tran",
        "timestamp": 1644289334
    },
    {
        "content": "<p>To give some history, that notebook was also my first attempt playing around.  It worked ok, but wasn’t really that practical. It was also before we had the ability to parse a string into a Lean expression via <a href=\"https://leanprover-community.github.io/mathlib_docs/find/lean.parser.run_with_input\">https://leanprover-community.github.io/mathlib_docs/find/lean.parser.run_with_input</a>.</p>",
        "id": 271075615,
        "sender_full_name": "Jason Rute",
        "timestamp": 1644289686
    }
]