[
    {
        "content": "<p>There has been a discussion about performance issues with the refactor <a href=\"https://github.com/leanprover-community/mathlib/issues/7574\">#7574</a> .</p>\n<p>I'm all in favour for checking this, but I have no idea where to start.  Also, given the option, I would like to test out the alternative approach that I had in mind, which would only introduce 2 typeclasses instead of 16, but each one taking two functions as inputs.</p>\n<p>Where can I start to learn about checking these things?  Would simply pushing to the github and monitoring the time CI takes to build the PRs be a good measure?  Would comparing the local build times on my machine be better?  I am really completely a novice in this, so any commentary, however silly it might appear, could be an eye-opener for me!</p>\n<p>Thanks!</p>",
        "id": 238369011,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620761486
    },
    {
        "content": "<p><code>set_option profiler true</code> can help you time specific proofs</p>",
        "id": 238369538,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1620761700
    },
    {
        "content": "<p>Ok, but I get somewhat inconsistent timings when I use it: recompiling the same lemma does not always give the same time.  I have an impression that we are talking about a small discrepancy on average, which might be difficult to spot on a single lemma.  Maybe I am wrong though...</p>",
        "id": 238369716,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620761782
    },
    {
        "content": "<p>I think compiling the whole library is the only relevant measure here, since it is the addition of a lot of small stuffs. How to get reliable timings when compiling the whole library is outside of my competence domain, though (one-threaded? No heavy task running at the same time?)</p>",
        "id": 238370904,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1620762270
    },
    {
        "content": "<p>it may be worth at some point branching the library 5 times or something, and running a full CI suite on it to see what the variance on times are<br>\n(obviously at a quiet CI time)</p>",
        "id": 238371005,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1620762321
    },
    {
        "content": "<p>Ok, thanks for the suggestions!  Right now, I am waiting for the first successful build of the first branch.  On my machine it built with no errors, so I am hopeful!</p>",
        "id": 238371569,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620762590
    },
    {
        "content": "<p>Later this week, I hope to prepare the \"competitor\" PR and see how they compare, so there is plenty of time for further suggestions and how to implement them! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 238371712,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620762633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> has (used to have?) a build server that can do these kinds of timings.</p>",
        "id": 238386321,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1620769267
    },
    {
        "content": "<p>I can make a timing of this branch on the hardware (or rather VM) used for the benchmark bot. It's not amazingly precise, but it'll spot bigger performance regressions. Just give me the relevant commit.</p>",
        "id": 238399231,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1620776942
    },
    {
        "content": "<p>Jannis, that would be great!  If you could time commit</p>\n<p>df080022c2ba78f1969f15da0975295fd5e384f7</p>\n<p>I would be very grateful!  I will be preparing a second PR to compare it with this one, but for the moment, simply seeing how this one compares with the current master would be awesome!</p>\n<p>Thanks a lot!  And let me know if you need anything else!</p>",
        "id": 238419439,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620793486
    },
    {
        "content": "<p>For definiteness, I would like to compare these two commits:</p>\n<ul>\n<li>\n<p>current-ish <code>master</code><br>\na7e1696f5b1bd29f1575d99162e9f80141b28e4c</p>\n</li>\n<li>\n<p>first working refactor in <code>adomani_new_order_typeclasses_2</code><br>\ndf080022c2ba78f1969f15da0975295fd5e384f7</p>\n</li>\n</ul>",
        "id": 238425871,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620799770
    },
    {
        "content": "<p>Once I have a working alternative refactor, I will post the commit hash as well, so that the three can be compared for relative performance.</p>\n<p><span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> , let me know if this is asking too much, of course!  I realize that it is not fun to have a computer building stuff just to see what is faster/slower!</p>",
        "id": 238426118,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620799939
    },
    {
        "content": "<p>Actually, <span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> , if you have not started the timings, it might be better to hold off a little bit.  I just realized that the version of master that I proposed was one where Mario made a change to avoid some timeouts, whereas the version of the commit that I wanted to compare does not have those changes!</p>\n<p>So, I am now building two branches with the two proposed refactors, but with the current master.  Once I am sure that they pass all the tests, I will give the commit hashes for these branches so that the three versions can be timed!</p>\n<p>Again, thanks a lot for your help!</p>",
        "id": 238429493,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620802451
    },
    {
        "content": "<p>No worries! All I need to do is log on to the server and type one command, so it's no big deal. Please ping again when you have the relevant commits.</p>",
        "id": 238462485,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1620821241
    },
    {
        "content": "<p>Ok, thanks <span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> !</p>\n<p>Here are the three commits that I would like to test for relative speed (they just finished building):</p>\n<ul>\n<li>\n<p>the version of <code>master</code> out of which the two commits below branched<br>\na7e1696f5b1bd29f1575d99162e9f80141b28e4c</p>\n</li>\n<li>\n<p>the refactor in <code>adomani_new_order_typeclasses_2</code>, with 16 new typeclasses<br>\n88d6a72d98b13d5bcae1a4560260cae17f60d309</p>\n</li>\n<li>\n<p>the refactor in <code>adomani_ordered_stuff</code>, with 2 new typeclasses<br>\n03b502c386905abef9892d59d09c36220c04a0da</p>\n</li>\n</ul>\n<p>Unless I messed up, I merged the commit of <code>master</code> above into the two branches below, fixed what needed fixing and then I would like to time the three commits.  This should hopefully minimize time unrelated to the specific changes that I am interested in, since they all contain the \"same\" copy of <code>master</code>.</p>",
        "id": 238470125,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620824951
    },
    {
        "content": "<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span> The builds are running now. They'll probably take until tomorrow since I'm doing single-threaded builds on weak hardware.</p>",
        "id": 238481089,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1620829111
    },
    {
        "content": "<p>That's great, thank you very much!</p>\n<p>I do not mind if they take long, I am in no rush and I prefer to get more reliable relative timing than \"smartest and quickest possible build time\"!</p>",
        "id": 238481712,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620829325
    },
    {
        "content": "<p>If it takes longer, then the precision might actually be increased!</p>",
        "id": 238484912,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1620830421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256311\">@Jannis Limperg</span> , while I am not in a rush, I am curious to know the outcome of the timing: any results yet? <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 238607594,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620903986
    },
    {
        "content": "<ul>\n<li><code>a7e1696f5b1bd29f1575d99162e9f80141b28e4c</code>: 2h15m49s/2h16m15s</li>\n<li><code>88d6a72d98b13d5bcae1a4560260cae17f60d309</code>: 2h17m16s/2h16m3s</li>\n<li><code>03b502c386905abef9892d59d09c36220c04a0da</code>: 2h12m28s</li>\n</ul>\n<p>I did two runs per commit but the second run for the last commit failed for some strange reason (not related to the code). But I think the picture is clear enough anyway. The build time typically fluctuates +/- 1min, so the difference between the first two commits is probably not significant.</p>",
        "id": 238609226,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1620905344
    },
    {
        "content": "<p>Ok, great, thank you very much for this!!</p>",
        "id": 238611791,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1620907232
    }
]