[
    {
        "content": "<p>Disclaimer IANAP (I am not a philosopher). But sometimes I like to dabble in it a bit. And it seems that the people at CMU have close ties to philosophy, so maybe they can help me out. Here is a proposition:</p>\n<blockquote>\n<p>Pen and paper proofs destroy the immediate aspect of mathematics. Formally verified proofs in a computer proof assistant destroy it even further.</p>\n</blockquote>\n<p>I'm probably not the first person with thoughts in this direction. If anyone has written something down about this, I'd be glad to be handed a pointer.<br>\nBut I'd also be interested in a general discussion here on Zulip. All (un)thoughtful comments welcome!</p>",
        "id": 181837341,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574698726
    },
    {
        "content": "<p>What does \"destroy the immediate aspect of mathematics\" mean? This is not some trick question -- I just don't understand the phrase.</p>",
        "id": 181837412,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574698783
    },
    {
        "content": "<p>Well, when someone explains you a proof in person, there is this feeling that the ideas just flow towards you. When you read a pen and paper proof, you have to work a lot harder to \"reconstruct\" the <em>actual</em> maths. With a formal proof you are even further bound to some <em>representation</em> of the mathematics. But it is not the maths itself.<br>\nSomething like the map is not the territory. Or the way a score is not the actual music.</p>",
        "id": 181837717,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574698953
    },
    {
        "content": "<p>Maybe I'm just discovering how much of a Platonist I am? I feel like formal proofs are tying maths down into the realm of bits and bytes... and that has been an itching me for a rather long time now</p>",
        "id": 181838060,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574699174
    },
    {
        "content": "<p>I wonder if people recognize that itch</p>",
        "id": 181838066,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574699182
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> In your MO answer to \"What is a perfectoid space?\" you say that a perfectoid space is a term of type <code>PerfectoidSpace</code>. And of course you meant it as a joke. But sometimes I fear that theorem provers would actually become common practice in maths departments, then your answer would cease to be a joke. And that feels wrong to me.</p>",
        "id": 181838308,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574699329
    },
    {
        "content": "<p>I'm also not really a philosopher, but I think you might be reaching toward what some people call \"mathematical understanding.\" Talking about \"actual maths,\" \"maths itself,\" this is really hard to do without a lot of awkward metaphysical commitments. But the feeling of \"ideas flowing toward you\" is a little easier to get a grasp on.</p>",
        "id": 181838596,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574699473
    },
    {
        "content": "<p>The obligatory paper link is from our very own, of course. <a href=\"http://www.andrew.cmu.edu/user/avigad/Papers/understanding2.pdf\" target=\"_blank\" title=\"http://www.andrew.cmu.edu/user/avigad/Papers/understanding2.pdf\">http://www.andrew.cmu.edu/user/avigad/Papers/understanding2.pdf</a></p>",
        "id": 181838619,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574699489
    },
    {
        "content": "<p>Thanks for the link</p>",
        "id": 181838738,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574699545
    },
    {
        "content": "<p>I think it explicitly avoids the metaphysical questions you're trying to ask.</p>",
        "id": 181838787,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574699570
    },
    {
        "content": "<p>The abstract is very interesting!</p>",
        "id": 181838910,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574699631
    },
    {
        "content": "<p>Yeah uncommented code is not written to be read. The big difference between talking to someone and reading a pen and paper proof is that talking to someone is a two-way thing so the explainer can adapt to the explainee. Sure formalising a proof destroys it even further. But putting comments in your code gets you to a state where you're better than a book, because now you're a book where people can right-click on what they don't understand.</p>",
        "id": 181839432,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574699930
    },
    {
        "content": "<p>I think most of the CMU-trained philosophers and \"philosophers\" would rather read your question as one about practice, instead of about real mathematical objects. How do we interact with mathematical concepts and explanations, and how does that interaction change when we read a formal proof vs an informal proof vs listen to a talk.</p>",
        "id": 181839457,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574699942
    },
    {
        "content": "<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> In your MO answer to \"What is a perfectoid space?\" you say that a perfectoid space is a term of type <code>PerfectoidSpace</code>. And of course you meant it as a joke. But sometimes I fear that theorem provers would actually become common practice in maths departments, then your answer would cease to be a joke. And that feels wrong to me.</p>\n</blockquote>\n<p>I'm not sure whether this is what you're trying to get at, but I don't agree with \"a perfectoid space is a term of type <code>PerfectoidSpace</code>\". Rather, there's some \"standard model\" of Lean in set theory which tells us how to write down a particular set (which lives in the \"actual mathematical universe\") which corresponds to the type <code>PerfectoidSpace</code>, and a perfectoid space is an element of that set.</p>",
        "id": 181839806,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574700130
    },
    {
        "content": "<p>In other words there's no shift in what a perfectoid space \"is\" (or a group, or a real number), we're just being much more precise in the kind of language we use, to the extent that even a computer can follow along.</p>",
        "id": 181840337,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574700441
    },
    {
        "content": "<p>This seems related to your mention of Platonism, but less related to \"ideas flowing towards you\", etc.</p>",
        "id": 181840384,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574700479
    },
    {
        "content": "<p>I do agree that as you pass from a heuristic argument to a proof sketch, to a proof, to a formalized proof, while you gain something at each step, you also lose something else.</p>",
        "id": 181840633,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574700604
    },
    {
        "content": "<p>It's a different kind of work recovering what you lost though, as you go from one way to the other. And if it's someone else's work I greatly prefer going from the formalised proof to the intuitive understanding, as opposed to wrestling trying to recreate the details of a sloppily-written paper that's done a great job of explaining the basic ideas and is now doing a crappy job of showing me the details. This might be personal taste though; I've always liked details and I've learnt that not everyone is like that.</p>",
        "id": 181841152,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1574700973
    },
    {
        "content": "<p>It's hard to say exactly what it is that is lost, but I think the proposition is still testable: a proof that's more \"fully realized\" tends to be harder to understand (for someone with the appropriate expertise), if only because it's longer, and harder to adapt to other settings</p>",
        "id": 181841210,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574701020
    },
    {
        "content": "<p>Thanks for the comments so far! I feel like I don't really have the language yet to express my thoughts. Also my thoughts are still very messy. But these comments are helping me in the right direction.</p>",
        "id": 181842066,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574701561
    },
    {
        "content": "<p>At least in computer science, I have come around to wanting well-commented code rather than a high level description of any given algorithm. I have spent so much time trying to recreate details lost in papers; and while I understand that a brief pseudocode description is more terse it's utterly useless if you actually want to use a result, which is the end goal (hopefully).</p>",
        "id": 181843204,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1574702398
    },
    {
        "content": "<p>What do you mean by \"use a result\"?</p>",
        "id": 181843362,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574702484
    },
    {
        "content": "<p>Do you mean, actually implement and run on a physical computer?</p>",
        "id": 181843376,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574702499
    },
    {
        "content": "<p>Get actual running code that I can apply to whatever problem I'm trying to solve</p>",
        "id": 181843383,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1574702503
    },
    {
        "content": "<p>As far as I can see, this doesn't really have an analogue in math</p>",
        "id": 181843475,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574702563
    },
    {
        "content": "<p>I've been burned multiple times reading signal processing papers that promise a great new algorithm for doing something, but the performance improvement is only theoretical or only applies to a certain dataset that is not like my own data in some way. </p>\n<p>Yes, I don't know if it's really analogous in math.</p>",
        "id": 181843518,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1574702600
    },
    {
        "content": "<p>Do people often read mathematical papers that promise a great new technique or refinement of an approach, then try to apply it and get lost in the details, perhaps finding it's not applicable?</p>",
        "id": 181844010,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1574702962
    },
    {
        "content": "<p>Not really in the way you were describing, I think</p>",
        "id": 181845058,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574703737
    },
    {
        "content": "<p>Although we certainly can get lost in details</p>",
        "id": 181845076,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574703757
    },
    {
        "content": "<p>But we can also choose to ignore them when things get murky</p>",
        "id": 181845089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574703773
    },
    {
        "content": "<p>Just the same way you could ignore division_by_zero errors in your code. If you run <code>a/random_int(10^6)</code> it will only fail once in a million times. Who cares? <span aria-label=\"boom\" class=\"emoji emoji-1f4a5\" role=\"img\" title=\"boom\">:boom:</span></p>",
        "id": 181845141,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574703824
    },
    {
        "content": "<p>If only one in a million proofs are broken? Who cares?</p>",
        "id": 181845190,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574703845
    },
    {
        "content": "<blockquote>\n<p>Just the same way you could ignore division_by_zero errors in your code. If you run <code>a/random_int(10^6)</code> it will only fail once in a million times. Who cares? <span aria-label=\"boom\" class=\"emoji emoji-1f4a5\" role=\"img\" title=\"boom\">:boom:</span></p>\n</blockquote>\n<p>Please never write airplane software, Johan!</p>",
        "id": 181845237,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1574703892
    },
    {
        "content": "<p>I think \"technique\" is being used in different senses. It sounds like you're using \"technique\" in the sense of algorithm--let's say a paper presents a new algorithm for sorting. We already knew we could sort lists, but here is another way to do it.<br>\nIn math, this should correspond to a new proof of a theorem. But in math, from a logical point of view, a proof is always \"applicable\"--either the theorem is true or it's not, and if it's true, then as long as the hypotheses of the theorems hold, we can apply it. There are no considerations like \"performance improvement\".<br>\nThus, in math, the value of a new proof of a known theorem is in understanding the ideas that went into the proof. From a practical standpoint, this means being able to reuse those ideas to prove new theorems. This is roughly what we mean by \"technique\".<br>\nIn CS, the best example of this kind of technique that I could come up with is dynamic programming.</p>",
        "id": 181846631,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574704724
    },
    {
        "content": "<p>Anyways, I was specifically not arguing that some points on this spectrum are better than others. Different points are better for different purposes. Best would be to have multiple points of view on \"the same proof\" (whatever that means). I think you get at this with your \"well-commented code\". Suppose your options were pseudocode in a paper or a 10M binary blob--then your preference would depend on the situation, surely?</p>",
        "id": 181846944,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574704935
    },
    {
        "content": "<p>(And let's suppose the 10M code blob also comes along with a 100M blob that is a formal proof of correctness of the code.)</p>",
        "id": 181847013,
        "sender_full_name": "Reid Barton",
        "timestamp": 1574704985
    },
    {
        "content": "<blockquote>\n<p>There are no considerations like \"performance improvement\".</p>\n</blockquote>\n<p>well, there was the SAT proof of one special case of the Erdős discrepancy problem,  and there was the proof by Terry Tao. The methods that Tao employed came from other proofs that allowed a much better proof of the special case that some giant SAT certificate.</p>",
        "id": 181963506,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1574802106
    },
    {
        "content": "<blockquote>\n<p>Disclaimer IANAP (I am not a philosopher). But sometimes I like to dabble in it a bit. And it seems that the people at CMU have close ties to philosophy, so maybe they can help me out. Here is a proposition:</p>\n<blockquote>\n<p>Pen and paper proofs destroy the immediate aspect of mathematics. Formally verified proofs in a computer proof assistant destroy it even further.</p>\n</blockquote>\n<p>I'm probably not the first person with thoughts in this direction. If anyone has written something down about this, I'd be glad to be handed a pointer.<br>\nBut I'd also be interested in a general discussion here on Zulip. All (un)thoughtful comments welcome!</p>\n</blockquote>\n<p>Hello Johan,</p>\n<p>you may be interested in my <a href=\"https://arxiv.org/abs/1710.02723\" target=\"_blank\" title=\"https://arxiv.org/abs/1710.02723\">article</a>, in particular section 3.<br>\n<span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span></p>",
        "id": 182038385,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1574874294
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"125073\">@Anthony Bordg</span> Thanks for the link, I'm putting it on my reading list.</p>",
        "id": 182057565,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574887814
    },
    {
        "content": "<p>The previous suggestion by Rob (Jeremy's article) was also a big success. I very much enjoyed reading it</p>",
        "id": 182057588,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1574887851
    },
    {
        "content": "<p>I'm blushing.</p>",
        "id": 182061936,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1574891794
    }
]