[
    {
        "content": "<p>Can someone remind me why have I got a 429 page pdf about polynomial functors open on my desktop?</p>",
        "id": 123006369,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519667997
    },
    {
        "content": "<p>I think it was something to do with something someone said in the old chat</p>",
        "id": 123006427,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519668024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"intoverflow@gmail.com\" data-user-id=\"110028\">@Tim Carstens</span> the coolest thing about w-types (imho) is that they give an account of the whole \"derivative of a type\" thing (eg zippers), by way of their use of polynomial endofunctors, which themselves have a differential theory (best notes i've seen: <a href=\"http://mat.uab.es/~kock/cat/polynomial.pdf\" target=\"_blank\" title=\"http://mat.uab.es/~kock/cat/polynomial.pdf\">http://mat.uab.es/~kock/cat/polynomial.pdf</a>)<br>\nthis is one of the things i wanted to show when i was studying the category of lean types last year, but i didn't make it all the way :(</p>",
        "id": 123006491,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1519668172
    },
    {
        "content": "<p>What is a zipper?</p>",
        "id": 123006559,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519668279
    },
    {
        "content": "<p>that's a good question. I found this paper: <a href=\"https://www.st.cs.uni-saarland.de/edu/seminare/2005/advanced-fp/docs/huet-zipper.pdf\" target=\"_blank\" title=\"https://www.st.cs.uni-saarland.de/edu/seminare/2005/advanced-fp/docs/huet-zipper.pdf\">https://www.st.cs.uni-saarland.de/edu/seminare/2005/advanced-fp/docs/huet-zipper.pdf</a></p>",
        "id": 123006625,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1519668380
    },
    {
        "content": "<p>The short version is that it's a data structure that allows you to record the state of traversal of another data structure. For instance, if you traverse a list, you can record the state of that traversal by keeping the list of elements you already visited, the current element and the list of elements to come.</p>",
        "id": 123006652,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1519668477
    },
    {
        "content": "<p>Oh I knew I'd heard the phrase before. It's the very end bit of learnyouahaskell</p>",
        "id": 123006693,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519668489
    },
    {
        "content": "<p>sorry, i was in a meeting. yeah, years ago i read some stuff by Conor McBride about derivatives of types. basically, if you have a type T (X : Type) : Type (like T = list or T = binarytree or whatever), the derivative of T wrt X gives a new type that's \"shaped like T but with an X-shaped hole.\" The derivative of T can be used to describe strategies for traversing data of type T.</p>",
        "id": 123007871,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1519670509
    },
    {
        "content": "<p>That's crazy stuff. I am hoping as a mathematician that I don't need to think too hard about these things...</p>",
        "id": 123008176,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519671006
    },
    {
        "content": "<p>I am not used to traversing data</p>",
        "id": 123008180,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519671016
    },
    {
        "content": "<p>The combinatorialists have a similar thing going on with generating functions and a thing they call \"combinatorial schemes\" (not related to scheme theory from algebraic geometry). It turns out that in this formulation, generating functions correspond to certain \"analytic functors,\" and you can take a sort of formal derivative of such things. Turns out that analytic functors are examples of polynomial endofunctors, and the formal derivative of an analytic functor coincidences with the derivative of a polynomial endofunctor.</p>",
        "id": 123008268,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1519671219
    },
    {
        "content": "<p>That sounds like some crazy analogue of differentiating a power series term by term.</p>",
        "id": 123008316,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519671289
    },
    {
        "content": "<p>We were talking about that back in the old days on gitter, with a ring theory result which needed differentiation term by term although <span class=\"user-mention\" data-user-email=\"rwbarton@gmail.com\" data-user-id=\"110032\">@Reid Barton</span> came up with a neat suggestion which I didn't fully chase up yet but which must surely work.</p>",
        "id": 123008336,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1519671350
    },
    {
        "content": "<p>So anyway, by definition every W-type T is the initial algebra of some functor F : C -&gt; C. In Lean or similar environments, this functor will be polynomial (iirc it'll be functor adjoint to pullback along the coproduct of the term constructors, or something like that), and the derivative of the type T is none other than the initial algebra of the derivative of F</p>",
        "id": 123008493,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1519671571
    },
    {
        "content": "<p>this level of abstract nonsense is not useful for actually writing programs as far as I can tell; certainly it's a horrible way to work with inductive types in Lean, which already has good syntax for working with inductives</p>",
        "id": 123008578,
        "sender_full_name": "Tim Carstens",
        "timestamp": 1519671668
    }
]