[
    {
        "content": "<p>Hi,<br>\nThis is not a technical question and I'm not sure if this is the right place to put it either. Apologies beforehand if it is so.<br>\nI'm writing a piece on Lean and how it can take over mathematician's work in the future for an inter-university magazine here in India. Current popular science articles on Lean all seem to have a different approach on what prerequisites to explain. <br>\nI'm not as experienced myself to come up with the perfect plan, but the strategy was to elucidate on topics in the following order:<br>\n-set theory<br>\n-drawbacks in proofwriting/checking process<br>\n-type theory<br>\n-how it helps Lean as a language </p>\n<ul>\n<li>interactive proofs</li>\n<li>the big proof data base and assisted proofs<br>\n-how essentially in the future Lean could draw from the database of proofs and as an AI deliver theorems/proofs on its own</li>\n</ul>\n<p>Please excuse my lack of knowledge and any assumptions I've made that may be wrong. <br>\nFor an article intended for undergrad and master's students, would you make any changes to the above strategy(article length is about 2000 words)</p>\n<p>Thanks a lot.</p>",
        "id": 221196318,
        "sender_full_name": "Agamdeep Singh",
        "timestamp": 1609314716
    },
    {
        "content": "<p>Some of us believe the dream that one day software such as this will help the modern mathematician in the same way that usual maths packages help them, but I would not be surprised if people have been dreaming this for 30 years and one certainly can't argue that it's happening right now, Lean has given me some insights into undergraduate teaching but has told neither me nor anyone else anything useful about the Langlands Philosophy or anything else fancy</p>",
        "id": 221196811,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609315549
    },
    {
        "content": "<p>We can dream but it wouldn't surprise me if people have been dreaming for decades. What's different here is that it seems to me that a whole bunch of what I would snobbishly refer to as \"proper mathematics\" (eg all the advanced BSc and MSc algebra going into lean right now) is all currently appearing in one library in one system, so at the very least the groundwork is being done to make some sort of system which might be able to help people do MSc level algebra in some way. This didn't seem to be happening before, other systems just have a bunch of disparate projects with no underlying goal. But whether this will be a game changer very much remains to be seen</p>",
        "id": 221197025,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609315845
    },
    {
        "content": "<p>Thanks for taking the time Dr. Buzzard. It was your talk that actually introduced me to Lean.</p>",
        "id": 221197776,
        "sender_full_name": "Agamdeep Singh",
        "timestamp": 1609316751
    },
    {
        "content": "<p>Right now popularisation is important because it would be interesting to know what happens if eg you type in all the stacks project into lean, and that's not going to happen until we have PhD students doing it for fun</p>",
        "id": 221198016,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609317005
    },
    {
        "content": "<p>Because the alternative is a multimillion dollar grant focused on doing the job, and maths funders are reluctant to fund such a project because it's not new maths</p>",
        "id": 221198049,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609317064
    },
    {
        "content": "<p>I completely agree sir. And my generation, which has grown up with computers in their back pockets, does see the fun in that, hopefully we also get to be PhD students. <br>\nIs it alright if I quote the message you wrote prior to this one in the article? (just to you know tell people, not get too ahead of themselves either and expect a sentient \"Theorem Generator\" soon from Lean)</p>",
        "id": 221199319,
        "sender_full_name": "Agamdeep Singh",
        "timestamp": 1609318724
    },
    {
        "content": "<p>I personally too plan to start contributing to the mathlib database soon.</p>",
        "id": 221199354,
        "sender_full_name": "Agamdeep Singh",
        "timestamp": 1609318800
    },
    {
        "content": "<p>I think you shouldn't insist so much about set theory vs type theory. I really don't think this is a key point, it's technical and it's frightening.</p>",
        "id": 221199775,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1609319369
    },
    {
        "content": "<p>When mathematicians use set theory, they use sets to do two distinct jobs -- one solution for two problems. Some of the mathematician's sets are things called Types. For example when a mathematician says \"let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>R</mi></mrow><annotation encoding=\"application/x-tex\">R</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.00773em;\">R</span></span></span></span> be a ring\", they mean \"let <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>R</mi></mrow><annotation encoding=\"application/x-tex\">R</annotation></semantics></math></span><span aria-hidden=\"true\" class=\"katex-html\"><span class=\"base\"><span class=\"strut\" style=\"height:0.68333em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.00773em;\">R</span></span></span></span> be a type with a ring structure\". But sometimes when a mathematician is talking about a set, they are talking about a subset of a set. For example, theorems about growth of prime numbers might be expressed as \"theorems about the set of prime numbers\" by mathematicians, but they are actually theorems about the subset of natural numbers which are prime, and its identification as a subset here is crucial -- it gives the prime number a primitive notion of size. But because mathematicians use the word \"set\" for both these meanings, they find it surprising at first when you tell them that actually every set they ever saw was of this form.</p>",
        "id": 221202338,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609322682
    },
    {
        "content": "<p>Lean advertises \"quotient types\" but this is just an implementation detail -- it's easy to make noncomputable quotient types in Lean just by using equivalence classes.</p>",
        "id": 221202442,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609322813
    },
    {
        "content": "<p>Is that last remark true? I thought that the design of quotients in lean meant that you could computable compute anything you like with them, and the equivalence class you use only affects the decidability of equality</p>",
        "id": 221203154,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1609323677
    },
    {
        "content": "<p>I don't know, I don't really care about this stuff. All I'm saying is that adding quotients as an axiom the way it's done in Lean doesn't change which theorems you can prove, it just changes which theorems you can prove by <code>rfl</code>.</p>",
        "id": 221213722,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609336347
    },
    {
        "content": "<p>Things that you can prove with <code>rfl</code> still make a difference when you have dependent types.</p>",
        "id": 221213785,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1609336403
    },
    {
        "content": "<p>I guess so</p>",
        "id": 221213793,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609336414
    },
    {
        "content": "<p>but that's only because you're all scared of <code>heq</code>. Chris uses it and says it's fine.</p>",
        "id": 221213812,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609336432
    }
]