[
    {
        "content": "<p>how do I make a PR that uses code from another one, and is marked as depending on it? Do I create a new branch from the branch of the PR, then make my changes and PR the result? Then the dependent issues bot will mark it accordingly? Or is it all a more manual process.<br>\nI want to PR a proof that the almost-everywhere pointwise limit of ae_measurable functions is ae_measurable (in a metric, borel space), but I need a result from PR <a href=\"https://github.com/leanprover-community/mathlib/issues/5688\">#5688</a></p>",
        "id": 222399739,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1610437369
    },
    {
        "content": "<p>My approach to that problem until now has been to simply wait for the other PR to be merged. After all, there is no hurry.</p>",
        "id": 222400816,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1610438435
    },
    {
        "content": "<p>I have just reviewed the PR, but I have a comment so I won't merge it right away.</p>\n<p>For your question, you can merge the changes of the other PR into your own PR to get it to compile (or build directly your branch on top of the other one). To indicate that your PR is built on top of the other one, you should add at the end of your PR main comment the lines</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"c1\">---</span>\n<span class=\"bp\">-</span> <span class=\"o\">[</span> <span class=\"o\">]</span> <span class=\"n\">depends</span> <span class=\"n\">on</span><span class=\"o\">:</span> <span class=\"bp\">#</span><span class=\"mi\">5688</span>\n</code></pre></div>",
        "id": 222401116,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1610438695
    },
    {
        "content": "<p>Thanks! I suppose that I would then get a merge conflict if the other one is changed between the moment I merge it into my branch and the moment it gets merged into master, which I would resolve by merging master into my branch.</p>",
        "id": 222401578,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1610439116
    },
    {
        "content": "<p>Yes, you will need to merge master in any case.</p>",
        "id": 222401634,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1610439146
    },
    {
        "content": "<p>On the topic of the content of my coming PR: for measurable functions, measurability of the a.e. limit requires a complete measure, but that completeness is not required for the corresponding statement with ae_measurable functions, which I find really nice. Now I can remove that hypothesis of my proofs of the completeness of Lp spaces. Thanks for introducing those ae_measurable functions!</p>",
        "id": 222402175,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1610439594
    },
    {
        "content": "<p>In fact almost everywhere measurability is equivalent to measurability for the completed measure, so it is not suprising that this has such a nice behavior. This fact is not proved in mathlib (yet) because it is not really necessary for the development of the theory.</p>\n<p>Sketch of proof that, if <code>f</code> is null-measurable, then it is ae-measurable (the other direction is trivial). Composing with <code>arctan</code> if necessary, we can assume that <code>f</code> is null-measurable and bounded. Take a canonical sequence of simple functions <code>s_n</code> approximating it. These simple functions are also null-measurable. Since they are simple, it is easy to modify them to obtain <code>s'_n</code> which is measurable and coincides almost everywhere with <code>s_n</code>. Then <code>s'_n</code> is a Cauchy sequence in <code>L^1</code>. Taking a subsequence if necessary, it converges almost everywhere, to a measurable function <code>f'</code> (which is given by the limit where convergence holds, and by <code>0</code> elsewhere). Then <code>f</code> coincides almost everywhere with <code>f'</code>.</p>",
        "id": 222404989,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1610441691
    },
    {
        "content": "<p>If this isn't formalized, is it at least in some module docstring?</p>",
        "id": 222405202,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1610441845
    },
    {
        "content": "<p>It is in a commit message (of the PR introducing almost everywhere measurability). Not in a docstring as far as I remember.</p>",
        "id": 222407108,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1610443277
    }
]