[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> I suggested a feature on the vscode plugin repo about adding a button export the lean code to some formatted extensions like md and html. Do you think it can be useful? I thought about having it centralized in one plugin because the syntax json is already being maintained there. This is the issue link: <a href=\"https://github.com/leanprover/vscode-lean4/issues/60\">https://github.com/leanprover/vscode-lean4/issues/60</a></p>",
        "id": 258715387,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1634911169
    },
    {
        "content": "<p><del>I'm not sure I see the point in exporting to <code>md</code>, isn't that literally just surrounding the text in <code> ``` </code>? I assume the idea in the HTML export would be to output static syntax-highlighted code, rather than just surrounding the text in <code>&lt;code&gt;</code>?</del></p>",
        "id": 258717520,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1634912053
    },
    {
        "content": "<p>Sorry, I should have read the link first.</p>",
        "id": 258717598,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1634912088
    },
    {
        "content": "<p>Replied on the PR:</p>\n<p>This doesn't really belong in the vscode-lean4 extension. Instead there should be a generic tool to translate a <code>.lean</code> file to a <code>.md</code> file. However this is hard to do on a single file basis, because of course imports and definitions should be linkified to their declarations in other files. Really the tool should take a whole project (e.g. with a <code>leanpkg.toml</code> file, or looking to the future <code>lakefile.lean</code>) and output a directory full of <code>.md</code> files. So at this point you're not so far off the documentation generation that supports <a href=\"https://leanprover-community.github.io/mathlib_docs/\">https://leanprover-community.github.io/mathlib_docs/</a>. Maybe it's better start working on improving that?</p>\n<p>I agree, however, that the VSCode extension should eventually provide a <code>Generate documentation</code> command in the command palette. But this is a one-line change to the extension once <code>lake doc</code> or whatever is ready.</p>",
        "id": 258796906,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1634954376
    }
]