[
    {
        "content": "<p>Currently, files in the probability folder are either in the <code>measure_theory</code>(files on martingales) or the <code>probability_theory</code>(independence and SLLN files) namespace. There were some discussions in <a href=\"https://github.com/leanprover-community/mathlib/pull/16517\">#16517</a> which said we should change to the <code>probability_theory</code> namespace for the entire folder. </p>\n<p>I am currently rewriting the definition of variance (as discussed <a href=\"#narrow/stream/113488-general/topic/Definition.20of.20variance\">here</a>) which lives in the <code>probability_theory</code>namespace and I would like to make a lemma using dot notation in the form of <code>mem_ℒp.foo</code>. But since everything in that namespace is in <code>probability_theory</code>, I have to name the lemma <code>_root_.measure_theory.mem_ℒp.foo</code> in order for the dot notation to work. I feel like this situation will come up quite often so I think we should have everything in the probability folder to live in the <code>measure_theory</code> namespace in contrast to what was said in <a href=\"https://github.com/leanprover-community/mathlib/pull/16517\">#16517</a>. Is this a reasonable argument?</p>",
        "id": 301619397,
        "sender_full_name": "Jason KY.",
        "timestamp": 1664536048
    },
    {
        "content": "<p>I guess the alternative is to say that <code>mem_ℒp.foo</code> belongs in the measure theory folder and not in the probability one. Do you want to put it there because the proof uses some probability?</p>",
        "id": 301621797,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1664536925
    },
    {
        "content": "<p>It is a lemma about <code>variance</code> so I don't think it should go in the measure theory folder</p>",
        "id": 301622875,
        "sender_full_name": "Jason KY.",
        "timestamp": 1664537345
    },
    {
        "content": "<p>I don't see any problem with having lemmas named <code>_root_.something</code>. It happens quite frequently in fact.</p>",
        "id": 301626361,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1664538507
    }
]