[
    {
        "content": "<p>Dear Lean enthusiasts,</p>\n<p>we are organizing another edition of the proving competition workshop \"Proof Ground\", which will take place virtually just before ITP 2021.<br>\nPlease take note of our Call for Problems, and spread the word!</p>\n<hr>\n<p>Call for Problems</p>\n<hr>\n<hr>\n<p>Proof Ground 2021<br>\nInteractive Proving Contest<br>\nJune 28, 2021<br>\n<a href=\"https://www21.in.tum.de/~wimmers/proofground/\">https://www21.in.tum.de/~wimmers/proofground/</a></p>\n<hr>\n<p>at ITP 2021<br>\nInteractive Theorem Proving<br>\nJune 29 - July 2, 2021,  (originally in) Rome, Italy, now fully virtual<br>\n<a href=\"https://easyconferences.eu/itp2021/\">https://easyconferences.eu/itp2021/</a></p>\n<hr>\n<p>This workshop brings together researchers of the ITP community to compete in a \"proving contest\".</p>\n<p>While programming contests (e.g. ACM ICPC, International Olympiad in Informatics) challenge large numbers of participants to solve algorithmic problems within a short time, we envision proving contests to entice proof engineers to formally prove small but interesting problems from mathematics or computer science.</p>\n<p>A <a href=\"https://do.proof.in.tum.de\">contest system</a> is currently used for teaching and hosting proving contests in Coq, Isabelle, and Lean.</p>\n<p>Proof Ground 2021 is affiliated with the conference on <a href=\"https://easyconferences.eu/itp2021/\">Interactive Theorem Proving 2021</a>.</p>\n<p>As the main conference will happen as virtual conferences due to the ongoing Covid-19 pandemic, Proof Ground 2021 will also take a purely virtual format.</p>\n<p>The <a href=\"https://www21.in.tum.de/~wimmers/proofground2019/\">first edition</a> of the workshop has been held at <a href=\"https://itp19.cecs.pdx.edu/\">ITP 2019</a>. The <a href=\"https://www21.in.tum.de/~wimmers/proofground2020/\">second edition</a> was affiliated with <a href=\"https://ijcar2020.org/\">IJCAR 2020</a>.</p>\n<h2>Important Dates</h2>\n<ul>\n<li>Submission deadline: May 30, 2021</li>\n<li>Workshop and Competition:  June 28, 2021</li>\n</ul>\n<h2>Call for Problems</h2>\n<p>In order to conduct a stimulating contest we solicit interesting tasks.</p>\n<p>A contest typically lasts for two hours and consists of around five<br>\n   problems with varying difficulty.</p>\n<p>A problem:</p>\n<ul>\n<li>should contain an informal statement of the problem together with a template for the formal proof;</li>\n<li>should come with a reference solution (in any ITP);</li>\n<li>should be solvable (including formal proof) within 30 minutes;</li>\n<li>should be easy to state in any proof assistant, without requiring too much background library;</li>\n<li>could be from any part of mathematics, software verification, or your daily work with ITPs, and could also be a logic puzzle/riddle;</li>\n<li>could contain several subproblems which lead to partial points.</li>\n</ul>\n<p>Submissions from (potential) competition participants are allowed.</p>\n<p>Examples can be found at the current \"Proving for Fun\" contest system, e.g. <a href=\"https://do.proof.in.tum.de/competitions/contest/6/\">here</a>.</p>\n<p>Submissions can be made via email to wimmers [at] in [dot] tum [dot] de by the date indicated above.</p>\n<h2>Organizers</h2>\n<p>Maximilian P. L. Haslbeck<br>\n   Simon Wimmer<br>\n   Tobias Nipkow</p>",
        "id": 232236611,
        "sender_full_name": "maximilian p.l. haslbeck",
        "timestamp": 1617008217
    }
]