[
    {
        "content": "<p>In \\cite[p~7}{Mour15} \"Elaboration in Dependent Type Theory\", there is an example of a semigroup structure which extends a has_mul structure.<br>\nThe elaborator figures out this \"chain\" while defining \"mul_assoc\".</p>\n<p>Axiom has similar separate structures (we call them categories, ... don't ask) that have a similar kind of chaining. Axiom has its own elaborator, although it is just a part of the compiler.</p>\n<p>Does Lean provide a command / api to output fully elaborated structures?</p>",
        "id": 167556229,
        "sender_full_name": "Tim Daly",
        "timestamp": 1559894547
    },
    {
        "content": "<p>Beware this paper is about Lean 2, not the current version or the next one.</p>",
        "id": 167556383,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559894679
    },
    {
        "content": "<p>Do you have titles? I'll look them up and put them in the lean.bib file.</p>",
        "id": 167556482,
        "sender_full_name": "Tim Daly",
        "timestamp": 1559894739
    },
    {
        "content": "<p>Titles of what?</p>",
        "id": 167556681,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559894920
    },
    {
        "content": "<p>I assumed that if the elaboration has changed there is a paper that describes the new elaborator.</p>",
        "id": 167556731,
        "sender_full_name": "Tim Daly",
        "timestamp": 1559894976
    },
    {
        "content": "<p>I don't think so, but you should ask <span class=\"user-mention\" data-user-id=\"110024\">@Sebastian Ullrich</span>.</p>",
        "id": 167556812,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559895030
    },
    {
        "content": "<p>or <span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span></p>",
        "id": 167556815,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1559895034
    },
    {
        "content": "<p>There isn't</p>",
        "id": 167556930,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1559895130
    },
    {
        "content": "<p>Is there a command / api to show the full elaboration?</p>",
        "id": 167556995,
        "sender_full_name": "Tim Daly",
        "timestamp": 1559895223
    },
    {
        "content": "<p>Axiom has general type constructs like Group, Ring, Field which exports 'signatures' of functions that must be implemented (e.g. a multiply operator) by any domain (e.g. polynomials need to implement multiply). What Axiom lacks, and I am working to provide, are the 'axioms' that a Ring needs to satisfy and specifications of polynomials (e.g. the multiply operation) that define the operations. To do this I have to re-implement the Axiom compiler for the Axiom language (called Spad, short for Scratchpad). </p>\n<p>The new compiler (called Sane) has the dual job of producing Axiom compatible code (common lisp functions) and Lean compatible proofs. I have done a 'first-cut' deep dive into the Lean source code. It seems that the Sane compiler needs to compile to Lean syntax (as well as common lisp). This is basically a 'dual tail' compiler.</p>\n<p>Such a compiler would make Axiom's computer algebra functions available in Lean.</p>\n<p>There are, of course, 'second level issues', such as proving the Sane compiler lisp output is correct. But, as we all know, \"it's kittens all the way down\" so it is not a simple job. But it does seem to be a realistic path forward, merging Axiom and Lean.</p>",
        "id": 167642197,
        "sender_full_name": "Tim Daly",
        "timestamp": 1559984376
    }
]