[
    {
        "content": "<p>hi guys! what if i have python installed with anaconda? should i just reinstall python?</p>",
        "id": 272343881,
        "sender_full_name": "Leon Xie",
        "timestamp": 1645143861
    },
    {
        "content": "<p>This is presumably regarding <code>leanproject</code>/<code>mathlibtools</code>? What operating system are you on?</p>",
        "id": 272345756,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1645145328
    },
    {
        "content": "<p>i'm on windows...ended up reinstalling python so it should be okay?</p>",
        "id": 272348281,
        "sender_full_name": "Leon Xie",
        "timestamp": 1645147489
    },
    {
        "content": "<p>But didn't it work with anaconda? I use miniconda and it works just fine (I use Ubuntu though)</p>",
        "id": 272348461,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1645147655
    },
    {
        "content": "<p>The problem with anaconda on any system is that it's not always the case that the conda environment that has your library installed is the one that is on in whatever shell you're in</p>",
        "id": 272352585,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1645151392
    },
    {
        "content": "<p>Right. I have a line in my <code>.bashrc</code> file that says <code>conda activate exp</code>. So my terminal sessions are always using that environment by default</p>",
        "id": 272358461,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1645157287
    },
    {
        "content": "<p>Right, so if another user didn't rig up their setup to do that, or didn't source properly, then it would make sense that they thought <code>leanproject</code> would work and it didn't.</p>",
        "id": 272361237,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1645161008
    },
    {
        "content": "<p>It's true but it would probably work if they installed <code>mathlibtools</code> on anaconda's default environment <code>base</code>.</p>\n<p>Btw, I think we're missing guidance on the setup page for users that already have an environment management tool installed. The fact that Leon felt the need to get rid of anaconda (which is more potent and sometimes safer) altogether was a bit unfortunate</p>",
        "id": 272377555,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1645175722
    }
]