[
    {
        "content": "<p>I was looking through Freek Wiedijk's \"The QED manifesto revisited\". A quote from it:</p>\n<blockquote>\n<p>Finally, a multi-contributor library of formal mathematics should be created<br>\nthat is well-organized. As I claimed in Section 2, the sociological puzzle has<br>\nnot been solved yet of how to set up a library in such a way that it both<br>\nadmits many contributors, but also stays well-organized. Current attempts<br>\nthat have not yet been very successful in this respect are:</p>\n<ul>\n<li>\n<p>multi-contributor, but not really well-organized:<br>\n∗ MML<br>\n∗ Coq contribs<br>\n∗ AFP</p>\n</li>\n<li>\n<p>well-organized, but not really multi-contributor:<br>\n∗ HOL Light library<br>\n∗ C- CoRN [4]<br>\nA good first goal for this library will be to formalize ‘all of undergraduate<br>\nmathematics’. This will take more than a hundred man-years [20], which<br>\nmeans that it will need the involvement of a non-trivial number of con-<br>\ntributors. Also, with something like that it will be clear whether it is well-<br>\norganized or not.</p>\n</li>\n</ul>\n<p>The success of Wikipedia suggests that it might be possible to solve the<br>\npuzzle of having both many contributors and still also have a well-organized<br>\nwhole. However, aiming for a ‘Wikipedia for formalized mathematics’ is for<br>\nme too much like hoping that someone else will do the work. I will believe<br>\nthat such an approach can be successful when I see it happening.</p>\n</blockquote>\n<p>I guess the next time I see him I should ask him whether he can see it happening. He asked me in Pittsburgh how much of our 1st and 2nd year material had not yet been formalised in Lean, and Chris Hughes gave him a very complete answer. The big hole is complex analysis.</p>",
        "id": 188887301,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582497283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"217807\">@Freek Wiedijk</span> do you see these notifications?</p>",
        "id": 188887317,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1582497337
    }
]