[
    {
        "content": "<p>Hmm, quite annoying when I think my PR is ready for review, and I have labeled at that, and I’m patiently waiting for a review only to notice a few days later that CI wasn’t actually happy, and nobody is likely to look at it, and I only notice if I happen to check my open PRs. I wonder how best to avoid that? Maybe a bot that looks at PRs that are labeled <code>awaiting-review</code>, but CI is red, and that comment &amp; relabel the PR? Or maybe do that if nothing else is happening for a few days (no need to have bots annoy us when there is activity)?</p>",
        "id": 280332697,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1651056981
    },
    {
        "content": "<p>You can look at either of <a href=\"https://github.com/leanprover-community/mathlib/branches/yours\">your Github branches</a> and of <a href=\"https://github.com/leanprover-community/mathlib/pulls/nomeata\">your open PRs</a>.</p>",
        "id": 280332831,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1651057067
    },
    {
        "content": "<p>You can setup github to send you emails when CI fails; I think this might even be the default</p>",
        "id": 280333347,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1651057281
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"470149\">@Joachim Breitner</span> I'm sorry to hear that. I agree this can be annoying, because it's sometimes not clear where the responsibility for a PR lies, and so they can fall through the cracks.<br>\nI like your idea of a bot that draws some attention to such PRs.</p>",
        "id": 280333523,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1651057378
    },
    {
        "content": "<p>(oh, and I hope it’s not negative to call this “rant”, I’m not blaming anyone or such. It’s just nice to speakout what is bothering a bit.)<br>\nI think I might even get these emails, but they are also sent for PRs that I haven’t submitted for review, or for cancelled builds, so most of them are noise and that’s why I probably miss the relevant one.</p>",
        "id": 280333770,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1651057496
    },
    {
        "content": "<p>Indeed, clear responsibilities are probably a good idea. Assuming we only expect reviews on CI-green PRs by default (maybe there is a separate way to indicate “this doesn’t pass yet, and I know, but I still would like a review”), then that label plus a red CI is an invalid state that could be reconciled by a bot, by assigning to the user? But I’m worried it might cause too much noise…</p>",
        "id": 280334042,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1651057625
    },
    {
        "content": "<p>There is also a slight difference between \"red because mathlib did not build correctly\" and \"red but the olean's are available\".  I would say that flagging the first one is more important than the second one.</p>",
        "id": 280334205,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1651057731
    },
    {
        "content": "<p>If you look at <a href=\"https://bit.ly/3zVLgqR\">#queue</a>, it's just a fixed URL with some filtering parameters. I see two options:</p>\n<ul>\n<li>Creating a #broken_queue (or something along those lines) which points to such PRs</li>\n<li>You can create a URL of your own with red PRs labeled as <code>awating_review</code> and include <code>author:joachim</code> as a parameter so you can see your broken PRs from time to time</li>\n</ul>",
        "id": 280334246,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1651057758
    },
    {
        "content": "<p>I do look at my PRs from time to time, that’s how I find these stuck PRs right now. But I’m spoiled and lazy, and would like someone (better something) alert me when I made a mistake  :-)</p>",
        "id": 280334363,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1651057823
    }
]