[
    {
        "content": "<p>Recently, <code>reindex_linear_equiv</code> was generalized from being an <code>R</code>-linear equiv between matrix algebras over <code>R</code> to an <code>R</code>-linear equiv between matrix algebras over an <code>R</code>-module <code>A</code>.<br>\nMathematically speaking, this is strictly more general. At the same time</p>\n<ol>\n<li>I think matrices over a module that isn't an algebra don't show up often in practice. As soon as <code>A</code> is an algebra, one can use <code>restrict_scalars</code> to turn an <code>A</code>-linear equiv into an <code>R</code>-linear one.</li>\n<li>Unification now cannot guess both <code>R</code> and <code>A</code>, so they have become explicit. But in the common case, <code>R = A</code>, and so unification <em>should</em> have been able to figure it out.</li>\n</ol>\n<p>What do people think of the following proposal: the strictly more general version gets renamed <code>reindex_linear_equiv'</code>, and the \"old\" version gets reinstated, defined in terms of the primed version, and points to the primed version in its docstring.</p>\n<p>More generally, is there some principal that we can succinctly extract here, and possibly standardize throughout the library? My guess is that this is not possible, and that we need human judgment calls in all the separate cases. But I would love to be wrong there.</p>",
        "id": 244999719,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1625552674
    },
    {
        "content": "<p>I made this generalization only because it looked like <span class=\"user-mention\" data-user-id=\"300245\">@Filippo A. E. Nuccio</span> (who's currently on vacation) wanted it, and they were building it from scratch rather than using what we had already. Maybe I should have stopped to ask why they wanted it!</p>",
        "id": 245000008,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1625552989
    },
    {
        "content": "<p>Not that I'm not opposed to the generalization! It's just that I wonder whether it should be the main interface or not.</p>",
        "id": 245000089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1625553057
    }
]