[
    {
        "content": "<p>Do you guys think it would be useful to have a post-merge script that posts notifications on open PRs about changes (lines removal only) on <code>master</code> that involve the files the PR is changing or the files that those files import? Example:</p>\n<blockquote>\n<p>Commit &lt;commit hash hyperlink&gt; removed line(s) on the file(s) that are related to this PR.</p>\n</blockquote>",
        "id": 259787206,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1635685732
    },
    {
        "content": "<p>What situation do you have in mind where that's useful?</p>",
        "id": 259787345,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1635685934
    },
    {
        "content": "<p>Often the presence of a merge conflict is enough information</p>",
        "id": 259787379,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1635685998
    },
    {
        "content": "<p>Just being notified about times I'd really need to manage a master merge into my branch because  some API changed</p>",
        "id": 259787426,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1635686047
    },
    {
        "content": "<p>Because some changes that don't cause conflicts can also make my branch break silently, especially if they happen on a file that my file imports</p>",
        "id": 259787434,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1635686080
    },
    {
        "content": "<p>I can list you the recent changes that broke stuff.</p>",
        "id": 259787519,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635686258
    },
    {
        "content": "<p>The biggest is <code>nat</code> lemmas and more generally <code>has_ordered_sub</code> lemmas that got their <code>sub</code> renamed to <code>tsub</code> (for truncated subtraction). There are some more and the best way to be aware of them is to watch the queue, but that's definitely some attention drain.</p>",
        "id": 259787574,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635686336
    },
    {
        "content": "<p>But your suggestion doesn't fix that anyway. A best solution would be a \"What broke\" stream where people create topics for what they broke/renamed when they PR and what suddenly got broked in their branch when they merge master.</p>",
        "id": 259787623,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635686411
    },
    {
        "content": "<p>But also you can solve most problems yourself by knowing where to look.</p>",
        "id": 259787633,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635686432
    },
    {
        "content": "<p>Note that <code>bors</code> already protects against silently broken branches</p>",
        "id": 259787959,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1635686900
    },
    {
        "content": "<p>If it's broken once merged into master, bors will reject it</p>",
        "id": 259787961,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1635686912
    },
    {
        "content": "<p>Just to put this into some context Arthur, you have leapt into Lean in this amazing way, trying to resurrect a stale branch by creating some other branch in some area where other people are working at the same time, are running into all kinds of problems, are gritting your teeth and solving them in this <em>incredibly</em> tenacious way, at a time where the rate of merged PRs is for some reason extremely high. Many of the maintainers and other people writing \"competing\" code right now are very active on Zulip and if at the end of it you come out unscathed it will be a tribute to both your tenacity and that of the community for helping you through. I have seen many people start on Lean and honestly I don't think any of them <em>started</em> with a project which was so technically complex in terms of the sheer number of issues which you are faced with, and are solving. I would just keep asking questions because in almost every case if you say \"look at this branch, this line used to work and now it didn't\" you might well get a quick answer from Yael or Kyle or one of the other experts of the form \"oh yeah, this happened, fix it like this\"</p>",
        "id": 259787968,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635686939
    },
    {
        "content": "<p>I was initially frustrated with the branch you were working on because it had errors unrelated to what you were doing and I was too lazy to think about how to fix them, but now these are fixed, questions of the form \"this line on this branch no longer works after I merged master, help!\" will probably be answered effectively -- you have got the community's attention.</p>",
        "id": 259788043,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635687042
    },
    {
        "content": "<p>Also I want to note that this branch is very much not stale but rather \"thought about without actively modifying it\" <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span><br>\nYou just happen to arrive when I don't have time to sink in that branch, and that's great that you're making it work!</p>",
        "id": 259788058,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635687081
    },
    {
        "content": "<p>Welcome aboard Arthur. It is not usually a baptism of fire like this!</p>",
        "id": 259788063,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635687095
    },
    {
        "content": "<p>(I'm out of the loop; which branch is Arthur trying to revive?)</p>",
        "id": 259788334,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1635687520
    },
    {
        "content": "<p><code>walks_and_trees</code>, the branch where Kyle compiled all the graph theory stuff people wrote in branches when I asked about what was the state of paths and such.</p>",
        "id": 259788519,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635687820
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/issues/8737\">#8737</a></p>",
        "id": 259788522,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635687825
    },
    {
        "content": "<p>It's back on track now, initially it was a branch that changed multiple files and wasn't even compiling</p>",
        "id": 259788568,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635687851
    },
    {
        "content": "<p>Btw, I will soon need connectivity and hamiltonian cycles.</p>",
        "id": 259788668,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635688029
    },
    {
        "content": "<p>Would be great to see them land in mathlib.</p>",
        "id": 259788673,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635688052
    },
    {
        "content": "<p>I see. Thanks for the clarifications! Yeah it's been a thrilling experience learning Lean while trying to solve already existing issues. I like to learn stuff with a very hands on approach. This time around I was a bit unlucky that I wasn't aware the branch was not working properly. But I appreciate all the support and patience from the community. <span aria-label=\"pray\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"pray\">:pray:</span></p>",
        "id": 259793057,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1635694385
    },
    {
        "content": "<p>It's somewhat frustrating to keep hearing how my branch was broken and had compiler errors -- it would be nice if whomever decides to merge master into someone else's branch would make sure they didn't break anything.  I had a PR in the meantime renaming <code>simple_graph.sym</code> to <code>simple_graph.symm</code> (and similarly for subgraphs), which affects most simple graph branches pre Sep 10.</p>",
        "id": 259814686,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1635723592
    },
    {
        "content": "<p>Uh, I temporarily broke it, but then fixed it until sorryland. And I killed all remaining broken stuff when remerging for Arthur.</p>",
        "id": 259814955,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635723993
    },
    {
        "content": "<p>(22 days is certainly temporary <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> thanks for getting it all up to date)</p>",
        "id": 259815186,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1635724438
    }
]