[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> You said that the <code>mem</code> relation is better (in the sense of: more idiomatic) than <code>get</code> when working with <code>roption</code>.<br>\nDoes that mean that you would think it's a good idea of things like <code>enat</code> and <code>multiplicity</code> were refactored to use the mem relation?</p>",
        "id": 167440581,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1559779480
    },
    {
        "content": "<p>It depends on what you want to say. <code>enat</code> is a perfectly good totally ordered semiring, and you can use it like that; you can assert that an enat is less/greater than a nat by embedding the nat, and so it's also natural to talk about a finite enat using the standard coercion. This should be proven equivalent to using the mem relation though.</p>",
        "id": 167440742,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1559779713
    },
    {
        "content": "<p>I marginally prefer <code>a \\in o</code> to <code>o = some a</code> for <code>option</code> and <code>roption</code></p>",
        "id": 167440762,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1559779748
    },
    {
        "content": "<p>it also generalizes nicely to functional relations like the derivative</p>",
        "id": 167440831,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1559779815
    },
    {
        "content": "<p>What I mean is that currently every other line in those files has <code>get ...</code> in it. I was wondering if we should replace those statements by some <code>... \\in ...</code> statement.</p>",
        "id": 167442273,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1559781774
    },
    {
        "content": "<p>You need to use <code>get</code> when making a total function from a partial function that is provably total, but the use should be hidden behind a definition, as we often do with <code>classical.some</code></p>",
        "id": 167443516,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1559783633
    }
]