[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/116395-maths/topic/Distribution.20theory/near/267588953\">said</a>:</p>\n<blockquote>\n<p>I don't think that should be out of scope. Sure, we can't do that now. But we shouldn't paint ourselves in a corner. It's good to look far ahead (-;</p>\n</blockquote>\n<p>Sorry for sidetracking, but is there something in the mathematical academic world that's out of the scope of mathlib? or is it the case that mathlib could eventually reach state of the art math research on (almost) every field?</p>",
        "id": 267589849,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641911868
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths/topic/Distribution.20theory\">#maths &gt; Distribution theory</a> by <span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span></p>",
        "id": 267591698,
        "sender_full_name": "Notification Bot",
        "timestamp": 1641912602
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"451983\">@Arthur Paulino</span> My personal opinion is that 99% should be in scope <em>in theory</em>. Of course it's a cool challenge to do this in practice. For that we would need to scale up massively. And that's what we are trying to do.</p>\n<p>But some stuff might be out of scope.</p>\n<ul>\n<li>There's a bunch of maths that is completely out of fashion. I don't think we should spend a lot of energy on trying to support that.</li>\n<li>Some maths is so imprecise that it's unclear if it can ever be formalized in its current form. For example, Hales commented in his Big proofs talk that he didn't know how to formalize the Milleniums problem statement for Yang Mills. I guess, what I'm saying is that some conjectures are so imprecise, they are out of scope for formalization.</li>\n<li>I don't think we'll have native support for alternative logics or foundations anytime soon.</li>\n</ul>",
        "id": 267592578,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641912938
    },
    {
        "content": "<p>I see. So anything that's interesting and precise enough could very well part of mathlib someday</p>",
        "id": 267593093,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641913156
    },
    {
        "content": "<p>Anything which is precise enough could be done <em>in Lean</em>, however mathlib has made its intentions clear -- we are focussing on the kind of mathematics which is happening in maths departments in 2022 (both in the undergraduate lecture theatre and in the researcher's office) for the simple reason that this is the stuff which is important to mathematicians in 2022.</p>",
        "id": 267600694,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1641916183
    },
    {
        "content": "<p>There are plenty of dusty old books in our library which nobody has borrowed for 50 years</p>",
        "id": 267600778,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1641916205
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/scope.20of.20mathlib/near/267600694\">said</a>:</p>\n<blockquote>\n<p>...happening in maths departments in 2022 (both in the undergraduate lecture theatre and in the researcher's office)...</p>\n</blockquote>\n<p>Undergraduate lecture theatres? That's so 2019. In 2022, undergraduate lectures are happening from the researcher's office. (Ok, ok... Let's hope we'll soon be back in the theatres!)</p>",
        "id": 267646886,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1641936171
    },
    {
        "content": "<p>Do we draw a line between Math and Computer Science? I prefer not to; however, my opinion is not the one that matters.</p>",
        "id": 268176617,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642328094
    }
]