[
    {
        "content": "<p>When I type <code>lean --make</code> in Ubuntu, in the directory <code>/home/buzzard/Encfs/Computer_languages/Lean/lean-projects/lean-perfectoid-spaces/_target/deps/mathlib</code>, I get a lot of output which scrolls and scrolls because it's a lot more than 80 characters long. If I make my terminal window super-big and the font super-small so that everything fits onto one line then the scrolling doesn't happen, and it's better when the scrolling doesn't happen because then any errors are far more apparent (I would not expect errors in mathlib but say I'm compiling one of my own projects). Is there any way of stopping the scrolling somehow? I notice that in Windows there doesn't seem to be any output <em>at all</em>. If I redirect STDOUT to /dev/null I could reproduce this -- but then do I still see errors reported? Are they piped to STDERR?</p>\n<p>Related I guess -- is it safe to stop compilation with Ctrl-C and then type <code>lean --make</code> again?</p>",
        "id": 157927512,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1549713107
    },
    {
        "content": "<p>I think you can pipe lean through a command to disable the progress reporting (i.e. the windows experience). Does <code>lean --make | cat</code> work?</p>",
        "id": 157927847,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1549713752
    },
    {
        "content": "<p>It's safe to stop compilation with Ctrl-C on Linux. I've noticed this doesn't work in the msys2 shell on Windows, but I've never investigated, maybe there's an easy fix.</p>",
        "id": 157927924,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1549713925
    },
    {
        "content": "<p>I have never had an issue, but possibly you have to Ctrl-C twice</p>",
        "id": 157928081,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1549714241
    },
    {
        "content": "<p>It locks up the whole terminal for me more often than not, and I have to kill Lean from the process manager.</p>",
        "id": 157928190,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1549714471
    },
    {
        "content": "<p>But yeah, if it works for you then there's probably an easy fix for me that I should look for!</p>",
        "id": 157928247,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1549714577
    },
    {
        "content": "<p>I'd rather see the names of the files flashing by all on one line without any scrolling, and then a scroll iff there's a sorry / error</p>",
        "id": 157928368,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1549714876
    }
]