[
    {
        "content": "<p>A minor advertisement for <code>data/semiquot</code> because I think it's a cool idea. I've mentioned this approach before, but this data type makes it easy to work with nondeterministic functions using quotient types.</p>\n<p>An application is in <code>fp/basic</code>, floating point numbers. Previously, we had to keep track of messy NaN payload data, which is not reliably handled across different processors, causing some unavoidable nondeterminism. Now, there is only one NaN value, and functions that leak NaN payload data (like <code>float.sign</code>) are <code>semiquot</code> so that they are allowed to return anything in that case. (We don't currently have a <code>float.bits</code> function that gives the bitwise representation of a float, but that would of course leak NaN payload data so it would also be <code>semiquot</code>.)</p>",
        "id": 126308546,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1525861706
    },
    {
        "content": "<p>Is this meant only for programming or could be useful for maths?</p>",
        "id": 126309020,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1525862822
    },
    {
        "content": "<p>It has some interesting mathematical structure, being an ordered monad with some filter-like closure properties, but in classical lean it is equivalent to the collection of nonempty subsets of A</p>",
        "id": 126309082,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1525862964
    },
    {
        "content": "<p>It's most interesting when viewed constructively</p>",
        "id": 126309145,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1525863016
    },
    {
        "content": "<p>Ok, thanks for confirming I was not in the target audience of this message.</p>",
        "id": 126309153,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1525863058
    },
    {
        "content": "<p>I think the correct answer is it is meant for <em>verified</em> programming, which of course involves both programming and math, but the math is probably not so interesting to you</p>",
        "id": 126309234,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1525863185
    },
    {
        "content": "<p>Thanks for the advertisement anyway, I think it's a good idea to advertise each new stuff in mathlib here</p>",
        "id": 126311762,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1525868060
    }
]