[
    {
        "content": "<p>I see there are many things that I would like to add as simp rules. For instance <code>le_refl</code>. And all de Morgan's rules that take a <code>not</code> and push it inside logical connectives, to get to some kind of a normal form, like <code>theorem not_or_distrib : ¬ (a ∨ b) ↔ ¬ a ∧ ¬ b</code>. Are there good reasons not to do it?</p>",
        "id": 150877417,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1543956019
    },
    {
        "content": "<p>I think a normal form for propositions is not a good idea unless it is a component in a full proof a la <code>tauto</code></p>",
        "id": 150877616,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956216
    },
    {
        "content": "<p>most of the time this just mucks things up for manual proof</p>",
        "id": 150877625,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956228
    },
    {
        "content": "<p>I don't see a problem with <code>le_refl</code> as a simp rule; what other things are in scope here?</p>",
        "id": 150877720,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956305
    },
    {
        "content": "<p>What do you mean?</p>",
        "id": 150877737,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1543956334
    },
    {
        "content": "<p>I definitely wouldn't want <code>not_or_distrib</code> as a simp lemma. The right hand side is only obviously simpler after you've made a particular choice about what your normal form is.</p>",
        "id": 150877881,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1543956470
    },
    {
        "content": "<p>My question about normal forms is because I ended up in a proof with several expressions of the form <code>¬(¬ a ∨ b)</code>, or things like that. I can definitely add the right rule to expand stuff, but I am under the impression that most of the time it is the right thing to do.</p>",
        "id": 150877902,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1543956482
    },
    {
        "content": "<p>simp lemmas should have right hand sides that are \"unambiguously\" simpler.</p>",
        "id": 150877933,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1543956487
    },
    {
        "content": "<p>if I'm trying to prove <code>A -&gt; B</code> and <code>simp</code> decides to \"helpfully\" replace it with <code>not A or B</code> I will be annoyed</p>",
        "id": 150877935,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956491
    },
    {
        "content": "<p>If a normal form exists for some class of objects, we want a tactic that rewrites into that normal form, but if not everyone wants to use that normal form all the time, that tactic shouldn't be <code>simp</code>.</p>",
        "id": 150877979,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1543956547
    },
    {
        "content": "<p>Of course, <code>A -&gt; B</code> should not be simplified like you say. I only want to add in the ones that push <code>¬</code> as far inside as possible, which looks simpler to me as <code>¬</code> is more basic than and or or. But if you all agree that it is a bad idea, let's forget about it.</p>",
        "id": 150878008,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1543956584
    },
    {
        "content": "<p>I think that propositional structure in lean quite often reflects a certain structure of proof, according to its intuitionistic reading</p>",
        "id": 150878142,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956682
    },
    {
        "content": "<p>even if we are being classical, lean is still easier to use when you \"go with the flow\" of the logic, and other stuff requires applying theorems explicitly</p>",
        "id": 150878221,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1543956729
    }
]