[
    {
        "content": "<p>I think <code>simp_attr</code> is a great idea that will help us speed up many proofs and that we should use this extensively. What do you think?</p>",
        "id": 133724617,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536664617
    },
    {
        "content": "<p>if we tag a bunch of lemmas with a certain attribute, then we can avoid having <code>simp</code> to try every <code>simp</code> lemmas, but only the lemmas with a certain attribute</p>",
        "id": 133724629,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536664645
    },
    {
        "content": "<p>so maybe you have a bunch of simp lemmas associated with perfectoid spaces, then you can tag them all with an attribute <code>[perfectoid]</code>, and then if you say <code>simp only with perfectoid</code> then <code>simp</code> will only try those lemmas</p>",
        "id": 133724696,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536664695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> <span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span>  is this understanding correct?</p>",
        "id": 133724704,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536664710
    },
    {
        "content": "<p>Yes, this is what the <code>simp_attr</code> attribute is for. I'm just not sure what a good way of splitting the simp set is. Also I'm not sure where the simplifier loses a lot of time. One problem might acutally building up the simpset, which get more expensive when do not use the standard simp set, but add our own! The simp lemmas are indexed by their head symbol. The simplifier looks at the current position and has a fast way to select all possible rewrite rules for the current head symbol. So the simplifer does not necessarily get slower with a lot of simp lemmas.</p>",
        "id": 133725007,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665061
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I think you would like this. A long time ago you talked to a student about speeding up simp</p>",
        "id": 133725023,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536665080
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110294\">@Johannes Hölzl</span> from my experience, a single <code>simp</code> application can take 2000 ms, while a <code>simp only</code> will only take 300 ms</p>",
        "id": 133725058,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536665112
    },
    {
        "content": "<p>but <code>simp only</code> will get long, so if we have a set set of simp rules for a particular purpose, then we can make it shorter while still preserving the speed</p>",
        "id": 133725085,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536665153
    },
    {
        "content": "<p>You don't know where the simplifier loses its time. It might very well be that it checks a lot of simp lemmas, but it might also be that it is the construction of the simp set itself.</p>",
        "id": 133725141,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665170
    },
    {
        "content": "<p>what do you mean that building the simpset will get more expensive when [we] do not use the standard simp set?</p>",
        "id": 133725167,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536665219
    },
    {
        "content": "<p>My guess is: adding a couple of rules to the standard simp set is a fast operation, copying and adding a couple of new entries to a hash table should be a fast operation. But merging multiple simp sets (i.e. hash tables) with a lot of clashing head symbols could be expensive in itself.</p>",
        "id": 133725297,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665338
    },
    {
        "content": "<blockquote>\n<p>from my experience, a single <code>simp</code> application can take 2000 ms, while a <code>simp only</code> will only take 300 ms</p>\n</blockquote>\n<p>I've seen the same thing. Consequently, I've occasionally considered looking through mathlib and replacing easy <code>simp</code>s with <code>simp only</code> to speed up the build.</p>",
        "id": 133725321,
        "sender_full_name": "Sean Leather",
        "timestamp": 1536665368
    },
    {
        "content": "<p>I should say that this is just a guess. I only roughly know how the simplifier manages its simp set.</p>",
        "id": 133725325,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665372
    },
    {
        "content": "<p>I would be very careful with the 2000ms number. In my experience this is only the case if the simp set is not cached. So if you work interactively you often run into this case. If you run the theory in batch mode it is usually cashed from the previous tactic calls.</p>",
        "id": 133725412,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665448
    },
    {
        "content": "<p>I remember some instances where Lean told me that the simplifier needed 1s or 2s to build its simp set, but it didn't show up in the batch run.</p>",
        "id": 133725435,
        "sender_full_name": "Johannes Hölzl",
        "timestamp": 1536665498
    },
    {
        "content": "<p>I don't work interactively. I only run <code>lean --make</code>.</p>",
        "id": 133725441,
        "sender_full_name": "Sean Leather",
        "timestamp": 1536665515
    },
    {
        "content": "<p>I should say that I was referring to the relative time difference, not the specific times that Kenny found.</p>",
        "id": 133725500,
        "sender_full_name": "Sean Leather",
        "timestamp": 1536665567
    },
    {
        "content": "<p>It could also be that the lemmas we could easily exclude by switching to a specialized simp set are ones which simp can immediately or cheaply reject based on the types not matching anyways.</p>",
        "id": 133725503,
        "sender_full_name": "Reid Barton",
        "timestamp": 1536665576
    },
    {
        "content": "<p>so if we have a specialized simp set, the things inside can't be immediately or cheaply rejected?</p>",
        "id": 133725525,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1536665626
    },
    {
        "content": "<p>Well it may turn out that way--if you're trying to prove a statement in topology then excluding lemmas about rings from the simp set may not save very much time</p>",
        "id": 133726751,
        "sender_full_name": "Reid Barton",
        "timestamp": 1536667142
    },
    {
        "content": "<p>I'm not sure.</p>",
        "id": 133726758,
        "sender_full_name": "Reid Barton",
        "timestamp": 1536667146
    },
    {
        "content": "<p>It could depend on how you form the smaller simp sets.</p>",
        "id": 133727033,
        "sender_full_name": "Reid Barton",
        "timestamp": 1536667426
    }
]