[
    {
        "content": "<p>I would like to start a conversation about PRing my work on <a href=\"https://github.com/asouther4/lean-social-choice\">Social Choice Theory in Lean</a>. Right now, my repo has two main files: </p>\n<ol>\n<li>\n<p>In the <code>basic</code> file, I have been slowly formalizing the first chapter of <a href=\"https://www.hup.harvard.edu/catalog.php?isbn=9780674919211\">Collective Choice and Social Welfare</a> by Amartya Sen.  I have just been working through and formalizing each definition and lemma as they come, without much thought yet towards building a user-friendly library. </p>\n</li>\n<li>\n<p>In the <code>arrows_theorem</code> file, I have formalized a proof of <a href=\"https://en.wikipedia.org/wiki/Arrow%27s_impossibility_theorem\">Arrow's Impossibility Theorem</a>. </p>\n</li>\n</ol>\n<p>Some maintainers have expressed interest in getting this work on mathlib. What should a PR look like for this work? Should I start with Arrow's Theorem and then PR bit-by-bit from there if people are interested in more? Where should I even plan to put these files? </p>\n<p><span class=\"user-mention\" data-user-id=\"110087\">@Scott Morrison</span> once  suggested putting social choice theory and combinatorial game theory in their own home. I have long-term hopes to formalize more results in social choice theory, game theory, and microeconomic theory if that affects how we think about this.</p>",
        "id": 262196373,
        "sender_full_name": "Andrew  Souther",
        "timestamp": 1637431483
    },
    {
        "content": "<p>Start by opening some PR for the preliminary lemmas. Then you can PR Arrow's theorem in several go. I don't quite know where it belongs. <code>combinatorics.social</code> or <code>order.social</code> both sound like decent places to me.</p>",
        "id": 262196638,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1637431824
    },
    {
        "content": "<p>Also, I have been in contact with Eric Pacuit and Wesley Holliday who wrote <a href=\"https://arxiv.org/abs/2110.08453\">this paper</a> on Voting Theory in Lean. In the next few months, we plan to merge our code into one unified framework. They are real experts in social choice theory (I am not), and they have offered to help guide the conversation about design choices for a useful social choice library going forward.</p>",
        "id": 262196750,
        "sender_full_name": "Andrew  Souther",
        "timestamp": 1637431972
    },
    {
        "content": "<p>Then I would advise you to coordinate with them first. You do not have a huge amount of code, so PRing to mathlib should go smoothly. I see <span class=\"user-mention silent\" data-user-id=\"414747\">Eric Pacuit</span> is already here, by the way!</p>",
        "id": 262197147,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1637432451
    }
]