[
    {
        "content": "<p>Here's an idea to shoot down: could the PR-check linting step be run only over <code>git diff --name-only HEAD $(git merge-base HEAD $basebranch)</code> (where the <code>$basebranch</code> is usually going to be <code>master</code>)? If not, could we split up the lints into two chunks, one which is safe to run on that diff and one which is not? Linting has so far taken 17mins and counting on <a href=\"https://github.com/leanprover-community/mathlib/runs/3915905265\">https://github.com/leanprover-community/mathlib/runs/3915905265</a>, and I assume that's normal.</p>",
        "id": 257865402,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1634422189
    },
    {
        "content": "<p>Linting usually takes about 35 minutes (though it looks like the linting run you linked finished in about 23 minutes; I guess Rob's office computer is faster than the machines most of our runners are on..). I don't think we could split linting up as you describe because some of the linters (especially the simp lemma linter) are explicitly meant to check interactions between all parts of the library at once.</p>",
        "id": 257866183,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1634422855
    },
    {
        "content": "<p>I've also wondered about this, I think it should definitely be possible to have an attribute <code>needs_context</code> for linters that we can manually set to specify those that can be run independently of the enviroment (and hence declarations can't break if only later imports change for instance). However I think first we should check which linters are really the ones using time and why, maybe there are more low hanging fruit there, or maybe the simp linter is the slowst for example. With CI times increasing all the time it seems any more refined checks we can do will make everyones workflow easier.</p>",
        "id": 257872960,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1634429968
    },
    {
        "content": "<p>The linting time is completely dominated by the simp linter.</p>",
        "id": 257892592,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1634451117
    },
    {
        "content": "<p>I guess if it's just one really slow linter, and lean4 has very different performance properties to lean3, and the port is happening Soon (TM), then it's probably better to wait until after the port before optimising things like this?</p>",
        "id": 257897810,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1634456561
    },
    {
        "content": "<p>On a tangentially related note, it would be cool to have a github bot that prints all of the changed declarations in a PR, even if that information doesn't help the linter much</p>",
        "id": 257905516,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1634464253
    },
    {
        "content": "<p>Especially for file-move PRs</p>",
        "id": 257905526,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1634464267
    },
    {
        "content": "<p>This would be really great, also for metaprogramming changes, where it's hard to know if you inadvertently changed the meaning of something. Even just a diff of the doc-gen before and after would be pretty revealing</p>",
        "id": 257906667,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1634465374
    },
    {
        "content": "<p>Note that file moves are rather fine. Only imports can go wrong. What's more problematic is file splits.</p>",
        "id": 257906743,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1634465435
    },
    {
        "content": "<p>And yes I'm absolutely for this. I'd really suggested it somewhere.</p>",
        "id": 257906769,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1634465459
    }
]