[
    {
        "content": "<p>Back in 2018 Kenny and I formalised some tags in <a href=\"https://stacks.math.columbia.edu/\">the stacks project</a>, in a bad way. I am thinking of coming back to this project over the summer, but perhaps in a more sensible way. Let me just paint the most glorious picture I can imagine.</p>\n<p>Say a Lean user is interested in a particular stacks project tag. Let's say for the sake of argument that it's a theorem, like <a href=\"https://stacks.math.columbia.edu/tag/0052\">tag <code>0052</code></a>. Wouldn't it be great if there were some kind of repo/website/whatever, where they could type in the tag name, and it would say what has already been done with that tag from a Lean perspective. If the statement of the theorem is not formalised then there would be a way of letting a user upload a theorem statement, and if the proof is not formalised then there would be a way of letting a user upload a proof. I'm not expecting miracles, everything would have to be refereed, but just that basic infrastructure alone would perhaps be interesting to mathematicians who know some algebraic geometry and some Lean.</p>",
        "id": 197956234,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589817785
    },
    {
        "content": "<p>This would be easy to make. You only need to invest some time and energy.</p>",
        "id": 197956587,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1589817925
    },
    {
        "content": "<p>Is the correct infrastructure just a copy of the stacks project where you sometimes add links to files or <code>decl</code>s to a tag?</p>",
        "id": 197957671,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1589818366
    },
    {
        "content": "<p>Yes, I think the chapters and sections should probably be preserved. One file per section maybe?</p>",
        "id": 197959861,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589819224
    },
    {
        "content": "<p>We could probably use something very similar to the <code>100.yaml</code> that we're in the process of setting up.</p>",
        "id": 197963108,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1589820534
    }
]