[
    {
        "content": "<p>William Stein says:</p>\n<p>\"Kevin - which of the modes listed here is closest to working for lean code?</p>\n<p><a href=\"https://codemirror.net/mode/index.html\" target=\"_blank\" title=\"https://codemirror.net/mode/index.html\">https://codemirror.net/mode/index.html</a></p>\n<p>I can modify an existing syntax highlighting mode to make it work properly...\"</p>",
        "id": 128609810,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529944957
    },
    {
        "content": "<p>More details from someone else at cocalc:</p>",
        "id": 128610110,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529945303
    },
    {
        "content": "<p>\"Regarding code editor syntax highlighting, I haven't found a good highlighting. Maybe we can create one for codemirror, though. Is there a simple language definition, where we for example can get a concise list of all keywords? I also checked what they are doing for that online live \"lean\" editor. This interface is based on the \"monaco\" editor [1]. They seem to have written their own plugins for it. CoCalc doesn't use Monco, but CodeMirror, though.\"</p>",
        "id": 128610116,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1529945314
    },
    {
        "content": "<p>I know that this is four years old, but I was hoping that we could revisit this topic. There are several applications that use CodeMirror for syntax highlighting. We already have syntax highlighting files for VS Code and NVIM. It should be fairly straightforward to configure a CodeMirror syntax highlighting file. It's essentially just a rewrite of the NVIM syntax highlighting configuration into JavaScript. Has this been revisited in the last four years?</p>",
        "id": 313322132,
        "sender_full_name": "Ian Riley",
        "timestamp": 1669912958
    },
    {
        "content": "<p>A word of warning about codemirror from another topic:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113488-general/topic/.E2.9C.94.20VSCode.20puts.20error.20lines.20in.20the.20wrong.20place/near/282852819\">said</a>:</p>\n<blockquote>\n<p>Apparently its editor, CodeMirror, doesn't handle things that use two UTF-16 code units</p>\n</blockquote>\n<p>So some lean files contain characters that CodeMirror doesn't support</p>",
        "id": 313330053,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1669914993
    },
    {
        "content": "<p>That's good to know. So my interest in CM is actually because of this <a href=\"https://github.com/deathau/cm-editor-syntax-highlight-obsidian\">https://github.com/deathau/cm-editor-syntax-highlight-obsidian</a> I'd like to start putting Lean code into my Obsidian notes. I have an active PR atm to add lean support to the execute code plugin so that lean snippets can be executed in Obsidian MD but they don't have syntax highlighting without CM support.</p>",
        "id": 313423447,
        "sender_full_name": "Ian Riley",
        "timestamp": 1669954136
    }
]