[
    {
        "content": "<p>Hi all (perhaps <span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> and/or <span class=\"user-mention\" data-user-id=\"121918\">@Edward Ayers</span> specifically?)</p>\n<p>What is the current state of calling Lean from javascript? Say I wanted to create a webpage that did not show a text editor at all, but some other interface, but I wanted to make calls to Lean under the hood. Is this possible? Is there some <code>lean.js</code> I can add in a script tag and do something with?</p>\n<p>Is it possible to do this in a way that would work both in a standalone webpage, and in a widget in VSCode?</p>",
        "id": 204413744,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1595246670
    },
    {
        "content": "<p>So the current model of widgets is that the logic and html are entirely done in lean and are connected to specific point in the lean source document. So I think what you are describing could be done with a modified version of widgets but probably not with what is there right now. idk if there is a way of directly getting values from the Lean VM using lean.js</p>",
        "id": 204414930,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595247618
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"121918\">@Edward Ayers</span>, does this mean that running javascript in a widget that then talks to the server API is currently out of scope?</p>",
        "id": 204417199,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1595249079
    },
    {
        "content": "<p>yes that's right. Once you are in a widget all of the UI logic etc has to be written in Lean</p>",
        "id": 204417260,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595249138
    },
    {
        "content": "<p>I guess you could make the entire webapp as a widget</p>",
        "id": 204417269,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595249147
    },
    {
        "content": "<p>But then you wouldn't be able to use javascript libraries</p>",
        "id": 204417335,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595249180
    },
    {
        "content": "<p>I think for your use case it would be more useful to have an api where javascript communicates with lean and idk if that exists currently</p>",
        "id": 204417575,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595249367
    },
    {
        "content": "<p>When I made widgets the purpose was for inserting little bits of interactive UI without having to manage lean, C++, javascript every time you change something. It might be possible one day to build a full web app in lean but that's out of scope for me rn.</p>",
        "id": 204417974,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1595249612
    },
    {
        "content": "<p>Yes, it's possible, but it's a bit more complicated at the moment than using just a <code>&lt;script&gt;</code> tag.</p>\n<p>Here's a quick demo I just whipped together from <a href=\"https://github.com/bryangingechen/lean-client-js/blob/cache/lean-client-js-browser/lib_test.html\">a test file</a> in <a href=\"https://github.com/bryangingechen/lean-client-js/tree/cache/lean-client-js-browser#lean-client-js-browser\">my fork of <code>lean-client-js-browser</code></a>: </p>\n<p><a href=\"https://bl.ocks.org/bryangingechen/5dd3910365d477dc01fc5c3577d96278/f871317dc4d4468a3e28ecbc513cf5d98f3efb91\">https://bl.ocks.org/bryangingechen/5dd3910365d477dc01fc5c3577d96278/f871317dc4d4468a3e28ecbc513cf5d98f3efb91</a></p>\n<p>Basically, I've packaged lean-client-js-browser into a \"UMD module\" and then loading it asynchronously using <a href=\"https://github.com/d3/d3-require\">d3-require</a>. I'm using the same <code>leanBrowser.js</code> UMD module in my Observable notebooks. Happy to expand on anything above or to help out with any project you have in mind.</p>\n<p>I don't think there's an easy way to do it in both a webpage and a widget in VS Code yet, but maybe <span class=\"user-mention\" data-user-id=\"121918\">@Edward Ayers</span> has some ideas...</p>",
        "id": 204436279,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1595258604
    },
    {
        "content": "<p>Ah, I didn't see Ed's message when I was responding since I was focused on the \"Mentions\" stream. My answer above addresses only \"What is the current state of calling Lean from javascript? Say I wanted to create a webpage that did not show a text editor at all, but some other interface, but I wanted to make calls to Lean under the hood. Is this possible?\"</p>",
        "id": 204436415,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1595258666
    }
]