[
    {
        "content": "<p>I remember sometime ago watching a Xena Project video that suggested formalizing Tao's Analysis using Lean. I was wondering if anyone knows if that project was ever undertaken?</p>",
        "id": 250825575,
        "sender_full_name": "Lucas Teixeira",
        "timestamp": 1630005830
    },
    {
        "content": "<p>Not that I know of. But <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> has a better overview of which projects are going on.</p>",
        "id": 250833455,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1630009029
    },
    {
        "content": "<p>I don't know of any analysis being developed in any places other than melon e branches</p>",
        "id": 250844805,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1630014190
    },
    {
        "content": "<p>This could be a good exercise. Ideally every numbered lemma in Tao's Analysis (or indeed, in any high-quality \"standard\" textbook) would be a one-liner given what is in mathlib. Three types of contributions to mathlib that could follow from this ideal:</p>\n<ol>\n<li>adding statements to mathlib where it's not already a one-liner from existing material</li>\n<li>adding cross-references to the textbook in doc-strings. (I think having only a handful of these is not valuable, but personally I would be excited about a PR that added a cross-reference to every result in entire chapter(s) of a book like this.)</li>\n</ol>",
        "id": 250862503,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1630025279
    },
    {
        "content": "<p>Historically, however, it seems very few books have been exhaustively formalised in Lean. More likely people pick an end-goal, and then when they discover something is tough to formalise they sometimes pick a bourbaki-type book to help guide the design, but still only implement from that source what is necessary for their goal.</p>",
        "id": 250862612,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1630025362
    }
]