[
    {
        "content": "<p>To my great happiness, I have reached a point in my <a href=\"https://github.com/BoltonBailey/formal_baby_snark\">formalization of SNARKs</a> project where there is a full proof of the soundness of (one version of) the well-known Groth '16 SNARK. Thanks to everyone on this forum for answering questions along the way, <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> in particular for all of his help with tactic programming.</p>\n<p>I'm currently doing what I can to try to speed up the proof a little. My approach for benchmarking the proof has mainly been to just remove the olean file, then run <code>time lean --make src/snarks/groth16typeIII/knowledge_soundness.lean</code>. This has been roughly consistent - <code>time</code> reports that it takes about 33 minutes of cpu time on average, with a standard deviation of maybe 3 minutes or so.</p>\n<p>Are there any good ways of making more fine-grained measurements of the amount of time taken by individual parts of the proof?</p>",
        "id": 259829507,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1635746026
    },
    {
        "content": "<p>You might try <code>set_option profiler true</code>.</p>",
        "id": 259829891,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1635746462
    },
    {
        "content": "<p>You might also want to include a CI script that auto-updates mathlib, and makes an issue when mathlib master is incompatible with your repo. This makes maintaining mathlib parity much more straightforward.</p>",
        "id": 259830398,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1635747193
    },
    {
        "content": "<p>(There's an example script on the community website <a href=\"https://leanprover-community.github.io/ci.html#upgrade-lean-and-mathlib-versions-on-schedule\">here</a>.)</p>",
        "id": 259830483,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1635747326
    }
]