[
    {
        "content": "<p>Hallelujah! <em>Theorem Proving in Lean</em> is finally updated, running with Lean 3.18.4 and using the community online version of Lean. I also did lots of searching and replacing to favor the use of <code>Type*</code> everywhere over writing <code>universe u</code> and <code>Type u</code> or just <code>Type</code>. I wasn't completely uniform, but second chapter lists all the variations and explains that they are equivalence.</p>\n<p>TPiL can probably use other updates, revisions, and expansions, but for now I will focus efforts in <em>Mathematics in Lean</em> instead, since that is more focused on mathlib and the mathlib style of writing proofs.</p>",
        "id": 206212825,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1596759613
    },
    {
        "content": "<p>Amazing, thanks so much Jeremy! As a newcomer this is super helpful :)</p>",
        "id": 206219836,
        "sender_full_name": "Sam Estep",
        "timestamp": 1596769119
    },
    {
        "content": "<p>Just as a sanity check to make sure my installation is correct, I'm trying to run the tests locally but I'm again running into a bit of a snag even with the updated TPiL version (for reproducibility I'm using <a href=\"https://gitlab.com/sestep/lean-docker/-/blob/8846c6c9/Dockerfile\">a custom Docker image</a> which should just be Ubuntu 20.04 with Lean 3.18.4 installed according to the <a href=\"https://leanprover-community.github.io/install/debian_details.html\">community instructions</a>):</p>\n<div class=\"codehilite\"><pre><span></span><code>$ docker run -it registry.gitlab.com/sestep/lean-docker:9e940742\n# git clone https://github.com/leanprover/theorem_proving_in_lean.git\n# cd theorem_proving_in_lean\n# git checkout 24e75ef\n# lean --version\nLean (version 3.18.4, commit f539be1e867c, Release)\n# make install-deps\n# make leantest 2&gt;&amp;1 &gt;/dev/null | grep &#39;: error: &#39; | wc -l\n262\n</code></pre></div>\n\n\n<p>As shown above, I seem to still be hitting quite a few errors; could someone correct my method here? From <a href=\"#narrow/stream/113489-new-members/topic/ASCII.20equivalents.20for.20angle.20brackets/near/206212468\">Jeremy's message earlier this evening</a> I'm guessing I'm missing a <code>leanproject up</code> command somewhere, but when I run that, it doesn't seem to create a <code>leanpkg.toml</code> file as I had expected.</p>",
        "id": 206219843,
        "sender_full_name": "Sam Estep",
        "timestamp": 1596769127
    }
]