[
    {
        "content": "<p>I've just received this and I haven't seen this posted here yet.  I'm not sure if the talk mentions Lean at any point, but maybe you'll find it interesting nevertheless.</p>\n<hr>\n<p>As coorganizers, Sneha and I would like to extend our warmest invitation to you all for our next (eighth) talk in the Mathematics Seminar Series on September 1, 2020, Tuesday from 17:30 to 18:30 hours IST. Our speaker for this talk is Prof. Jeremy Avigad who is Professor of Philosophy with an appointment in the Department of Mathematical Sciences at Carnegie Mellon University, United States. His talk is titled \"The History of Dirichlet’s Theorem on Primes in an Arithmetic Progression”. It is my understanding that Prof. Avigad will touch upon both mathematical and philosophical aspects of this important number theory theorem. Please find the talk's abstract and a brief bio of Jeremy Avigad is in the poster below. Finally, for the sake of drumming some further interest (!), next below are the two articles referenced in his bio.</p>\n<ol>\n<li>\n<p>\"The Mechanization of Mathematics\": <a href=\"https://www.ams.org/journals/notices/201806/rnoti-p681.pdf\">https://www.ams.org/journals/notices/201806/rnoti-p681.pdf</a></p>\n</li>\n<li>\n<p>\"Principia. Is it possible that, in the new millennium, the mathematical method is no longer fundamental to philosophy?\":<br>\n<a href=\"https://aeon.co/essays/does-philosophy-still-need-mathematics-and-vice-versa\">https://aeon.co/essays/does-philosophy-still-need-mathematics-and-vice-versa</a></p>\n</li>\n</ol>\n<p>Looking forward to seeing you all on Tuesday, and I’m really excited about this talk! Stay safe, stay sane!</p>\n<p><em>Date and Time: Tuesday, September 1, 17:30 to 18:30 hours IST</em> (Vienna time; local times <a href=\"https://www.timeanddate.com/worldclock/fixedtime.html?msg=IIIT-Delhi+Mathematics+Seminar+Series&amp;iso=20200901T1730&amp;p1=176&amp;ah=1\">here</a>)</p>\n<p><em>Title: The History of Dirichlet’s Theorem on Primes in an Arithmetic Progression</em></p>\n<p><em>Abstract: Please see poster below</em></p>\n<p><em>Zoom meeting link:</em> <a href=\"https://zoom.us/j/94670346653?pwd=UFVuRmRIZVlGbm5HSkE5Ymp4WFlDUT09\">https://zoom.us/j/94670346653?pwd=UFVuRmRIZVlGbm5HSkE5Ymp4WFlDUT09</a></p>\n<p><em>Other notes:</em> The organizers wish to request potential attendees to please download Zoom for your platform from <a href=\"https://zoom.us/download\">https://zoom.us/download</a> well ahead of time. Please also consider registering at <a href=\"https://zoom.us/signup\">https://zoom.us/signup</a> for attending this talk though this is not required.</p>\n<p><em>BYOB/Bring your own beverage!</em></p>\n<p>-Kaushik</p>",
        "id": 208326431,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1598610664
    },
    {
        "content": "<p>The talk won't have anything to do with Lean (except to the extent that everything has something to do with Lean), but it's a nice story about 19th century mathematics. Be careful, IST is between most time zones; for example, I'll be lecturing at 8am EST.</p>",
        "id": 208350129,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1598625207
    },
    {
        "content": "<p>Thanks for pointing this out!  I thought IST referred to something completely different than a timezone...</p>",
        "id": 208350793,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1598625557
    }
]