[
    {
        "content": "<p>Can we and how to undeclare variables? I'm working on <code>data.equiv.basic</code> where mostly <code>{α β γ : Sort*}</code> is used, but I have a series of lemmas that instead need <code>{α β γ : Type*}</code>.</p>",
        "id": 266966229,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1641404596
    },
    {
        "content": "<p>AFAIK you just need to use new variables. One might argue that this would be good practice anyway so that the reader can see that the type has changed, except that the computer scientists seem to want to call every variable by the next available Greek letter and are happy to let the user guess whether alpha is a group or a linear order or something-which-might-be-a-Prop.</p>",
        "id": 266966426,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1641404697
    },
    {
        "content": "<p>This doesn't seem to be possible, but certainly it would be nice if it was</p>",
        "id": 266967338,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1641405175
    },
    {
        "content": "<p>Usually the approach is to have different sections when you want to reuse a name for something else</p>",
        "id": 266967413,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1641405207
    },
    {
        "content": "<p>Yeah of course. I just don't feel entitled to resection all of <code>data.equiv.basic</code>, but maybe I should.</p>",
        "id": 266967514,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1641405244
    },
    {
        "content": "<p>You can also shadow the variables in the statement itself, this is what I usually do (although you have to repeat any typeclass arguments; on the other hand this is useful for getting a different set of typeclass args as well)</p>",
        "id": 266969088,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1641405973
    },
    {
        "content": "<p>Yeah, and that's what's currently done. But it's annoyingly making the line slightly go over 100 chars, which is why I'm trying to pull them out in the first place.</p>",
        "id": 266969265,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1641406075
    },
    {
        "content": "<p>You can split the file into 2 <code>section</code>s, one about <code>Sort*</code>, another about <code>Type*</code>.</p>",
        "id": 266978699,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1641410525
    },
    {
        "content": "<p>Is undeclared variables the same idea as functional code with recursion where each call to the function is a push on the stack with new variables? If so then should there not be a library for such? This sounds a lot like monads. </p>\n<p>Also in other programming languages when lines get long the use of term rewriting comes in handy to shorten the visible code (input for the term rewriter) but the rewritten code (output from the term rewriter) is still the really long lines one has to manually enter and is what is passed to the parser/compiler.</p>",
        "id": 267039613,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641460756
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/Undeclare.20variables/near/266966426\">said</a>:</p>\n<blockquote>\n<p>except that the computer scientists seem to want to call every variable by the next available Greek letter and are happy to let the user guess whether alpha is a group or a linear order or something-which-might-be-a-Prop.</p>\n</blockquote>\n<p>Very true! <span aria-label=\"laughter tears\" class=\"emoji emoji-1f602\" role=\"img\" title=\"laughter tears\">:laughter_tears:</span> </p>\n<p>I suspect this may be due to clashing conventions. The convention is for types to be Greek letters in Lean, which I suspect is inherited from math, and math tends to use letters that have some historical and/or logical connection to the type/set/object in question.  Computer scientists, on the other hand, tend to either use multi-character or multi-word names for meaningful type names or  essentially meaningless capital letters like T, U, V (in alphabetic order) for generic types (e.g. fully polymorphic types like that of <code>id</code>). As Greek letters are generally unheard of in practical computer science, it is likely hard for such individuals to draw meaningful connections from such letters. Thus, I imagine users of that ilk tend to liken Lean's convention to the  meaningless usage of the alphabetical T, U, V names in other languages than to meaningful symbols and thus name their variables accordingly. After all, if Greek letters are all just meaningless symbols to such a user, why not just use the next  available one? </p>\n<p>On the flip side, one place in the computer science oriented part of the Lean core where meaningful Greek letters <em>are</em> used is in monads (e.g., sigma for state and rho for read-only contexts).</p>",
        "id": 267099318,
        "sender_full_name": "Mac",
        "timestamp": 1641495337
    },
    {
        "content": "<p>Yes exactly. I noticed very early on that this greek letter convention was less than ideal for more \"advanced\" (if you want to call it that) mathematical files. There's things in maths called rings, and there are certain functions between rings called ring homomorphisms (maps that preserve the ring structure). There are special kinds of rings called fields, and there are certain theorems you can prove about ring homomorphisms between fields which are not true for general rings. In a gigantic mathlib file about ring homomorphisms, if every ring and field is called alpha, beta, gamma etc then this can get confusing <em>to a mathematician</em>, because they see some lemma about ring homomorphisms from alpha to beta and think \"well this isn't true! What is going on!\" and it turns out that 200 lines further up there's <code>[field alpha] [field beta]</code> variables, and the lemma is true for fields. The mathematical convention is that there are \"ringy\" variables such as R and A and B, and there are \"fieldy\" variables such as K and L (and of course there are \"groupy\" variables G, H, \"topological space\" variables X Y etc), and using these variable conventions in the more mathy parts of mathlib really helps with readability as far as mathematicians are concerned.</p>",
        "id": 267100296,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1641495795
    }
]