[
    {
        "content": "<p>Is there a way that I can set user definable options that can be parsed by tactics?  I have some proofs that take a while to run, and I'd like to be able to have an option at the file or lean package level that let me configure whether they ran or not.  e.g., during interactive development I disable proofs I'm not actually working on, but in a regression test they are enabled.<br>\nI noticed within a single run of the tactic monad, I can set custom option names (e.g., <code>set_options (opt.set_bool \"enable_unsafe_tac\" tt)</code>), but the value doesn't appear to show up in tactics farther down the file.  The set_option command also doesn't allow custom options.</p>",
        "id": 154955190,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1547249000
    },
    {
        "content": "<p><code>set_option</code> accepts only built-in options, but using the <code>set_options</code> primitive should work. Did you execute that code in a <code>run_command</code>?</p>",
        "id": 154982882,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1547297176
    },
    {
        "content": "<p>Sorry for the delay; I didn't see this until today.  Here's a sample script:</p>\n<div class=\"codehilite\"><pre><span></span>open tactic\n\nmeta\ndef get_my_opt : tactic unit := do\n  o ← get_options,\n  trace (repr (o.get_bool &quot;foo&quot; ff))\n\nmeta\ndef set_my_opt : tactic unit := do\n  o ← get_options,\n  set_options (o.set_bool &quot;foo&quot; tt),\n  get_my_opt\n\nrun_cmd get_my_opt\nrun_cmd set_my_opt\nrun_cmd get_my_opt\n</pre></div>\n\n\n<p>The output I get is:</p>\n<div class=\"codehilite\"><pre><span></span>ff\ntt\nff\n</pre></div>\n\n\n<p>So <code>set_options</code> works in the current command, but the option is forgotten in subsequent commands.</p>",
        "id": 156639542,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1548191194
    },
    {
        "content": "<p>Ah, that's too bad. You may want to fake the option with a custom attribute (which can be set globally or locally, but unset only locally). I'm not aware of a better solution.</p>",
        "id": 156642096,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1548193144
    },
    {
        "content": "<p>Thanks, that seems to work well.</p>",
        "id": 156643580,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1548194238
    },
    {
        "content": "<p>Is this improving in lean 4? More generally, it would be nice if there was a way to persist arbitrary data across different commands. Does everything have to go via adding defs to the environment?</p>",
        "id": 156644445,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1548194905
    },
    {
        "content": "<p>I could see use cases for persisting data, but I also think it's important that tactics could be run concurrently, and the results cached.  Given that goal, <code>set_options</code> behavior  doesn't seem to surprising.<br>\nIn Haskell, you can define package level options and use them to define constants that can be checked at compile time (via CPP).  That's what I was hoping for here, so I could pass a flag to build or configure that controlled whether an axiom was allowed to be used.  The attribute trick doesn't seem too bad though.</p>",
        "id": 156665743,
        "sender_full_name": "Joe Hendrix",
        "timestamp": 1548222166
    }
]