[
    {
        "content": "<p>Inspired by <span class=\"user-mention\" data-user-id=\"282867\">@Victor Ahlquist</span> 's question in <a class=\"stream\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members\">#new members</a>  I made a video tutorial on how to solve the basic logical proposition he was asking about in both tactic mode and term mode:</p>\n<p><a href=\"https://www.youtube.com/watch?v=POHVMMG7pqE\" title=\"https://www.youtube.com/watch?v=POHVMMG7pqE\">https://www.youtube.com/watch?v=POHVMMG7pqE</a></p>\n<p>Comments, especially constructive criticism, most welcome. It has taken me months to get round to start doing this kind of thing, but now I finally have all the hardware and software and knowledge I need, so in some sense the learning can start now.</p>\n<p>One thing I've learnt from talking to people who know a lot more about this stuff than I do, is that apparently 10 minutes is the absolute max for stuff like this, and 5 minutes is better. I was aiming for 5 but over-ran. Still under 10 though. What am I supposed to say at the end? \"Like and subscribe\"?? :-)</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"POHVMMG7pqE\" href=\"https://www.youtube.com/watch?v=POHVMMG7pqE\" title=\"https://www.youtube.com/watch?v=POHVMMG7pqE\"><img src=\"https://i.ytimg.com/vi/POHVMMG7pqE/default.jpg\"></a></div>",
        "id": 193717818,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586705876
    },
    {
        "content": "<p>Very nice video! I thought length was good for tactic mode, but for term mode it went slightly too fast for me at least. That might be because I haven't fully understood the lambda stuff yet though. The bracket way of proving an iff was also new to me which might have contributed to my confusion.</p>",
        "id": 193718942,
        "sender_full_name": "Victor Ahlquist",
        "timestamp": 1586707690
    },
    {
        "content": "<p>I was very keen on keeping it short.</p>",
        "id": 193719896,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586709321
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193717818\" title=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193717818\">said</a>:</p>\n<blockquote>\n<p>One thing I've learnt from talking to people who know a lot more about this stuff than I do, is that apparently 10 minutes is the absolute max for stuff like this, and 5 minutes is better.</p>\n</blockquote>\n<p>Why maximum 10 minutes?</p>",
        "id": 193720042,
        "sender_full_name": "Jason KY.",
        "timestamp": 1586709568
    },
    {
        "content": "<p>Because kids your age don't watch videos which are any longer, apparently</p>",
        "id": 193720090,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586709630
    },
    {
        "content": "<p>All the MOOC lectures are 10 minutes, apparently. I am a really bad person to make these at this point because I never watch youtube videos at all; this is why I'm keen to hear from people who might actually be interested in watching them.</p>",
        "id": 193720106,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586709671
    },
    {
        "content": "<p>If you search for Lean Tutorial on youtube you can find a bunch of 90 minute videos with like 200 views from a couple of years ago</p>",
        "id": 193720117,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586709697
    },
    {
        "content": "<p>I think people with too short attention span won't be bothered to learn lean</p>",
        "id": 193720121,
        "sender_full_name": "Jason KY.",
        "timestamp": 1586709707
    },
    {
        "content": "<p>My 17 year old son is currently upstairs writing a C++ game engine because he's bored, and got frustrated with unity so decided to make a 2d game engine himself. He seems to only watch 10 minute videos.</p>",
        "id": 193720169,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586709763
    },
    {
        "content": "<p>Fair enough. But I would say video length around 15 min seems to be okay.</p>",
        "id": 193720184,
        "sender_full_name": "Jason KY.",
        "timestamp": 1586709835
    },
    {
        "content": "<p>ha ha he just came downstairs to get food, so I asked him to watch my video and his first question was \"how long is it?\". \"Ten minutes\", I said. \"Oh yeah I'll watch that\" he said.</p>",
        "id": 193721330,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586711670
    },
    {
        "content": "<p>great video!<br>\nyou might want to talk a bit more slowly.<br>\ni think when people say that 10 minutes is the maximum they mean that the entire content should fit in that time frame at a regular speed. people will also quickly lose attention if it's too fast for them.</p>",
        "id": 193723210,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1586714637
    },
    {
        "content": "<p>I feel like there is a general principle, here, similar to how you would structure papers and books. Long video lectures are bad because they are difficult to index and use as a reference; a lecture is better organized if it can be subdivided into smaller self-contained topics.</p>",
        "id": 193723566,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586715177
    },
    {
        "content": "<p>I never found lecture very enjoyable :/ I can read much faster than the lecturer can speak. I can't tell my lecturer to fast-forward through the preliminary bits and then stop for 10 minutes in the middle of a difficult derivation so I can figure out what's going on. So you just end up being a human blackboard copier and struggling through it yourself when you go home.</p>",
        "id": 193723657,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586715333
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"221921\">Marc Huisinga</span> <a href=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193723210\" title=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193723210\">said</a>:</p>\n<blockquote>\n<p>people will also quickly lose attention if it's too fast for them.</p>\n</blockquote>\n<p>The great thing about recorded lecture is that I can rewind when I don't follow something, or continue on and come back to it if later material touches on the topic</p>",
        "id": 193723903,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586715708
    },
    {
        "content": "<p>that's true, but i personally quickly lose interest when i have to rewind the material often. i certainly do this for lectures, but i find myself doing it only very rarely with regular informational youtube videos.<br>\nalternatively one can also control the speed of the video, but i only very rarely slow videos down, not sure why. i do however often speed them up when the lecturer is talking too slowly for me to keep focused.</p>",
        "id": 193724153,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1586716077
    },
    {
        "content": "<p>As a reasonable young person, I'd say:</p>\n<ul>\n<li>If I randomly stumble upon your video because Youtube's algorithm believes I have weird entertainment preferences, making it shorter will drastically increase the chances that I'll click it on a whim.</li>\n<li>If I'm specifically looking to learn Lean, you can make the video as long as you need. In this case, I'll much prefer a thorough and comprehensive treatment of the content to a rushed introduction.</li>\n</ul>",
        "id": 193724641,
        "sender_full_name": "Jannis Limperg",
        "timestamp": 1586716762
    },
    {
        "content": "<p>Really great video, would love to see more! Perhaps one showcasing an area of mathlib? Depending on what your target audience is, you might consider explaining what notation like $ and &lt;&gt; mean, as you were more explicit when explaining the tactic mode. But maybe that's just because I'm more familiar with tactic mode. I've subscribed <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 193727482,
        "sender_full_name": "Alastair Horn",
        "timestamp": 1586721328
    },
    {
        "content": "<p>\"Thanks for watching\"  would be a good way to finish the video :)</p>",
        "id": 193727571,
        "sender_full_name": "Alastair Horn",
        "timestamp": 1586721474
    },
    {
        "content": "<p>I'd have expected you to use <code>assume</code> instead of <code>intro</code> -- I think it looks less alien to newbies and goes better with the voice explanation, e.g. \"so let us assume this as a hypothesis <code>*types 'assume hyp'*</code>\" . Also, it would be nice if the link to the web-editor would already contain the problem statement you solve in the video :)</p>",
        "id": 193729821,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1586724965
    },
    {
        "content": "<p>Another trick I missed is that I could have shown off a high-powered tactic like <code>tauto</code> or whatever -- something which just closes the goal immediately.</p>",
        "id": 193730164,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586725641
    },
    {
        "content": "<p>Thanks for the video! It was nice to see someone else's thought process. <br>\nThe video felt like it went by quickly. Some 3 minute Corsera videos can go on for eternity.</p>",
        "id": 193752086,
        "sender_full_name": "Kevin Doran",
        "timestamp": 1586764908
    },
    {
        "content": "<p>I'm not sure if that's a good thing or a bad thing?</p>",
        "id": 193752738,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586765598
    },
    {
        "content": "<p>After <code>split,</code> you say \"put some parentheses\". I thought that means <code>()</code>, but you mean \"braces\" <code>{}</code>, right? (But you are the native speaker not me... so I guess I'm just wrong.)</p>",
        "id": 193753357,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1586766241
    },
    {
        "content": "<p>Also, duplicate: <a href=\"https://www.youtube.com/watch?v=p4IrbnPomXg\" title=\"https://www.youtube.com/watch?v=p4IrbnPomXg\">https://www.youtube.com/watch?v=p4IrbnPomXg</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"p4IrbnPomXg\" href=\"https://www.youtube.com/watch?v=p4IrbnPomXg\" title=\"https://www.youtube.com/watch?v=p4IrbnPomXg\"><img src=\"https://i.ytimg.com/vi/p4IrbnPomXg/default.jpg\"></a></div>",
        "id": 193753903,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1586766931
    },
    {
        "content": "<p>Brackets: I think this might be a UK/US English thing</p>",
        "id": 193754000,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1586767074
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193752738\" title=\"#narrow/stream/113488-general/topic/video.20tutorials/near/193752738\">said</a>:</p>\n<blockquote>\n<p>I'm not sure if that's a good thing or a bad thing?</p>\n</blockquote>\n<p>Oh, a good thing!</p>",
        "id": 193758926,
        "sender_full_name": "Kevin Doran",
        "timestamp": 1586772551
    },
    {
        "content": "<p>Just on the \"kids these days watching short videos\" (who cares what I think but): if I was looking up how to do something when I'm programming, I rarely watch videos (and I suppose if so short ones) because they are so information sparse---I just want a reference for some specific thing. (I mean sparse in the information <em>I</em> need.) Maybe I'd like some short videos if I had to learn about a collection of relatively disparate chemical reactions which I had to know about. But 10 min maths lectures would break my heart---there's no story, no soul!---because I don't want a reference, I'm generally hearing about something I have no idea about.</p>",
        "id": 194771203,
        "sender_full_name": "Keeley Hoek",
        "timestamp": 1587456178
    },
    {
        "content": "<p>I didn't see this video earlier, but I guess I'm a part of the Kid demographic? </p>\n<p>But short videos now according to YouTube are ones that are less than 4 minutes... And videos over 20 minutes are considered long. </p>\n<p>With programming videos, I think short ones are nice, but I don't mind long ones if they're like Derek Banas' videos, so timestamps in the descriptions and a transcript that I can Ctrl-F through. The YouTube auto generated transcript is ok, but a proper one is nice (but takes a lot of effort).  I've looked at the transcript from the Lean video, and it seems ok. Although Kevin saying the word \"goal\" is apparently difficult for YouTube.</p>\n<p>Suggestions for the video:</p>\n<ul>\n<li>Put the code from the video somewhere, and link to it in the description. Then people can copy and paste if they need to. Right now if someone wants to have the solution from your video they'll need to type it up.</li>\n<li>SEO? Right now when I search \"Lean Prover tutorial\" in YouTube (incognito mode so my account has no effect), this video doesn't show up. I have to explicitly tell YouTube to sort by newest. YouTube even shows a bunch of Coq ones and Kevin's P vs NP Lecture but not this video.</li>\n</ul>",
        "id": 194772750,
        "sender_full_name": "Shing Tak Lam",
        "timestamp": 1587457336
    }
]