[
    {
        "content": "<p>I learned recently that if you navigate to a GitHub repo and hit <code>.</code>, a web-based version of VS Code will render. (This also works if you go to <a href=\"http://github.dev\">github.dev</a> or replace the <code>.com</code> with <code>.dev</code> in the URL of your repo.) This kinda blew my mind. </p>\n<p>A main downside is that use of extensions is limited. It only supports <a href=\"https://code.visualstudio.com/api/extension-guides/web-extensions\">web extensions</a>. </p>\n<p>How reasonable would it be to make a web extension version of the Lean VS Code extension using the wasm-compiled version of Lean ?</p>\n<p>A use case I had in mind would be teaching a course through GitHub classroom.</p>",
        "id": 269622464,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643310698
    },
    {
        "content": "<p>Another use case is currently filled by the <a href=\"https://leanprover-community.github.io/lean-web-editor/\">Lean web editor</a></p>",
        "id": 269625347,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643311982
    },
    {
        "content": "<p>Based on a (very quick) scan of the web extensions page you linked, hooking up the WASM version of the server to the extension looks like it might be doable, but with a lot of work. </p>\n<p>Actually, one thing which looks rather hairy to me is how to deal with the olean files that you would need for projects depending on mathlib or large projects in general. The WASM version of Lean 3 reads olean files from .zip files that are (currently) prepared separately, and we're only building them for the latest commit for mathlib at the moment.</p>",
        "id": 269626753,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1643312541
    },
    {
        "content": "<p>Even if this is set up, I suspect a gitpod like setup where your browser communicates with Lean running on a remote server will be much more usable than the WASM server, since the WASM compiled Lean runs single threaded.</p>",
        "id": 269626915,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1643312631
    },
    {
        "content": "<p>I imagined that speed might be severely comprised.</p>",
        "id": 269627307,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643312784
    },
    {
        "content": "<p>I should say that if you pay for Codespaces then you get the same UX but with a basically full-featured VS Code.</p>",
        "id": 269627433,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643312848
    },
    {
        "content": "<p>Is communicating with a language server over http a bad idea?</p>",
        "id": 269627916,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643313032
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/113488-general/topic/vs.20code.20web.20extension.3F/near/269627916\">said</a>:</p>\n<blockquote>\n<p>Is communicating with a language server over http a bad idea?</p>\n</blockquote>\n<p>I'm not sure! I don't have any experience with language servers going through http, unfortunately.</p>",
        "id": 269628865,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1643313407
    },
    {
        "content": "<p>MSFT has this bare-bondes <a href=\"https://github.com/microsoft/vscode-extension-samples/tree/main/lsp-web-extension-sample\">example</a> for web worker based LSP but it still doesn't cover performance issues.</p>",
        "id": 269630078,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643313903
    },
    {
        "content": "<p>Too bad there isn't some educational pricing for Codespaces.</p>",
        "id": 269630155,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643313940
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306577\">Matthew Ballard</span> <a href=\"#narrow/stream/113488-general/topic/vs.20code.20web.20extension.3F/near/269627916\">said</a>:</p>\n<blockquote>\n<p>Is communicating with a language server over http a bad idea?</p>\n</blockquote>\n<p>I suspect a <a href=\"https://en.wikipedia.org/wiki/WebSocket\">WebSocket</a> might work better in the context of continuous exchange of information over a period of time</p>",
        "id": 269634812,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1643316218
    },
    {
        "content": "<p>You are definitely right. They live in the same area of my brain.</p>",
        "id": 269634960,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643316288
    },
    {
        "content": "<p>If codespaces ever becomes available to you, then it should work out of the box.  It's also quite a bit faster to start up than gitpod.</p>",
        "id": 269639535,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1643318353
    },
    {
        "content": "<p>Isn't codespaces available to all org's now?</p>",
        "id": 269639676,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643318432
    },
    {
        "content": "<blockquote>\n<p>Codespaces is rolling out progressively on August 11th, 2021 and can be enabled in settings by organization owners for Team and Enterprise Cloud plans. For users in individual plans, we’re extending the existing Codespaces beta. For those in the beta, access will remain and we’ll share updates on what’s coming in the near future.</p>\n</blockquote>",
        "id": 269640448,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1643318812
    },
    {
        "content": "<p>Is using github classroom with gitpod possible? Lean works quite well with gitpod in browser.</p>",
        "id": 269684285,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1643343030
    },
    {
        "content": "<p>Yeah. Integration of gitpod is simple with classroom. The flow is</p>\n<ul>\n<li>instructors create their own template repo for the homework</li>\n<li>they then import that into classroom </li>\n<li>when a student registers for an assignment, a repo is cloned for them with actions included for automated PRs (for feedback) and auto grading </li>\n</ul>\n<p>A <code>.gitpod.yml</code> in the template should propagate to each student’s repo. </p>\n<p>At a heuristic level, what I am asking for is not realistic: expose GH without exposing <code>git</code>. VS Code allows you to push some buttons to work with <code>git</code> which is better than CLI for a new student. </p>\n<p>On a personal level, gitpod has taken upwards of minutes to pull containers so I just stopped using it</p>",
        "id": 269867501,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643466657
    },
    {
        "content": "<p>Also, free is good because most instructors don’t have funding for course technology choices</p>",
        "id": 269867584,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643466751
    },
    {
        "content": "<p>Currently I would probably upgrade my course org to a GH team and use codespaces. Especially for small courses, I can cover the cost with a grant. But this is not possible for everyone. If you want Lean to get a strong foothold in mathematics education, then a no-cost, friction-free, simple flow is required</p>",
        "id": 269867908,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643467105
    },
    {
        "content": "<p>Another aspect: providing custom support for such a product, especially to enterprise, could be a means to fund <del>Lean</del> Mathlib development more broadly.</p>",
        "id": 269868358,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1643467643
    }
]