[
    {
        "content": "<p>Hi, I wonder what should I (as a user) expect from Lean 4 and Lean 3 → 4 porting of mathlib. While I found some slides about new core features coming to Lean 4, I failed to find answers to some basic questions.</p>\n<h3>What about compatibility?</h3>\n<ul>\n<li>Do I guess correctly that most of the tactic code in mathlib will have to be rewritten to work with Lean 4?</li>\n<li>What about proofs / theorems / defs?</li>\n</ul>\n<h3>Algebraic classes (monoids, groups, etc)</h3>\n<p>Are there any big changes coming here?</p>\n<h3>What should I expect from porting?</h3>\n<p>Is it going to be \"let's feature freeze and port to Lean 4\", \"let's start a new branch gradually pick files from <code>master</code>\", \"let's gradually make parts of the library compatible with Lean 4 while maintaining compatibility with Lean 3\", or something else?</p>",
        "id": 184318258,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1577449166
    },
    {
        "content": "<p>I ask this to avoid spending too much time on the parts of mathlib that are going to be rewritten from scratch.</p>",
        "id": 184321676,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1577454035
    },
    {
        "content": "<p>Many answers are unknown, but there are a couple of facts:</p>\n<ul>\n<li>Leo never promised any compatibility between Lean 3 and Lean 4. In fact he very explicitly warned everybody there won't be any compatibility, and we shouldn't build anything and expect it to work in Lean 4. He is on a mission to build a better proof assistant. He always writes this is a research project and not a product.</li>\n<li>Everything we do nonetheless in Lean 3 is worthwhile. The type class instance resolution procedure of Lean 4 has been developed using the experience gathered in mathlib. This is crucial.</li>\n<li>The tactic framework of Lean 4 doesn't exist yet, but one can be sure that not a single line of mathlib tactic code will work without modification in Lean 4.</li>\n</ul>\n<p>Less certain pieces include:</p>\n<ul>\n<li>Personally I think the community of mathematicians using Lean 3 is a huge success that will survive Lean 3.</li>\n<li>It may be possible to write code which automates at least partly the conversion of Lean 3 to Lean 4. I think the dream is that the Lean 4 parser will be flexible enough to parse Lean 3 code and output an approximate Lean 4 version.</li>\n<li>The mathlib community does not have a fixed plan for the transition. There cannot be a plan as long as we don't know more about the preceding point. </li>\n<li>I don't see any reason why mathlib would be more centralized than it currently is. There is no dictator who will say: mathlib is now frozen, everybody should work on porting. Everybody will continue doing whatever they want using whatever time they can find. We may have rules like: don't port and modify a file at the same time, since this could make a huge mess and create a lot of additional work.</li>\n</ul>",
        "id": 184321704,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577454087
    },
    {
        "content": "<p>The safest bet if you want to work on something that will stay is documentation.</p>",
        "id": 184321767,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577454160
    },
    {
        "content": "<p>You can pick a random file which has no header and docstrings and document it.</p>",
        "id": 184321773,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577454180
    },
    {
        "content": "<p>Or, better: write a Windows installer!</p>",
        "id": 184322702,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577455421
    },
    {
        "content": "<p>I'm afraid my instructions for installing something on a WIndows computer would start with \"install Linux\".</p>",
        "id": 184322753,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1577455471
    },
    {
        "content": "<p>That's how my instructions start, but experience proved this is not enough.</p>",
        "id": 184323220,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577456101
    },
    {
        "content": "<p>This is really bad luck. Last year most of my students had Linux at the end of the semester, because they were forced to install it by computer scientists (I'm using Lean with double-major math/CS students). But I need them to start using Lean at the beginning of the semester.</p>",
        "id": 184323316,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577456209
    },
    {
        "content": "<p>BTW, what changed about class instance resolution in Lean 4?</p>",
        "id": 184358272,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1577506633
    },
    {
        "content": "<p>The algorithm completely changed but as far as I know the new one hasn't been implemented yet</p>",
        "id": 184368011,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1577526047
    },
    {
        "content": "<p>I think it has been implemented, at least partly.</p>",
        "id": 184369430,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1577528918
    },
    {
        "content": "<p>Is there any paper/presentation/... describing the new algorithm?</p>",
        "id": 184369994,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1577530005
    },
    {
        "content": "<p>As far as I know there are just posts by Daniel Selsam on this chat, e.g. <a href=\"#narrow/stream/113488-general/topic/instances.20and.20parameters/near/178623928\" title=\"#narrow/stream/113488-general/topic/instances.20and.20parameters/near/178623928\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/instances.20and.20parameters/near/178623928</a></p>",
        "id": 184371834,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1577533506
    },
    {
        "content": "<blockquote>\n<p>The algorithm completely changed but as far as I know the new one hasn't been implemented yet</p>\n</blockquote>\n<p>They're in the middle of reimplementing it now</p>",
        "id": 184381911,
        "sender_full_name": "Simon Hudon",
        "timestamp": 1577551437
    },
    {
        "content": "<blockquote>\n<p>Algebraic classes (monoids, groups, etc)</p>\n<p>Are there any big changes coming here?</p>\n</blockquote>\n<p>I don't think I have anything new to share about the other questions, but this one should be easy to answer: AFAIK the plan is not to include the algebraic hierarchy in the corelib, since there is no reason to do so. So this will be up to the community.</p>",
        "id": 184549005,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1577805620
    },
    {
        "content": "<p>what's going to happen with <code>tactic.norm_num</code> and the algebraic dependencies there?</p>",
        "id": 184549216,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1577805953
    },
    {
        "content": "<p>There should be no reason to include <code>norm_num</code> in the corelib, either</p>",
        "id": 184549295,
        "sender_full_name": "Sebastian Ullrich",
        "timestamp": 1577806066
    }
]