[
    {
        "content": "<p>What are the guarantees/complexity of the tauto tactic algorithm? Are there any relevant sources/literature?</p>\n<p>Most of the existing literature on propositional logic algorithms seem to convert validity-checking into a SAT problem, but that doesn't seem to be what tauto.lean does.</p>",
        "id": 265645625,
        "sender_full_name": "HWeigel",
        "timestamp": 1640060100
    },
    {
        "content": "<p>See <a href=\"#narrow/stream/113488-general/topic/mathlib.20sat.20solvers/near/265031540\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/mathlib.20sat.20solvers/near/265031540</a> and the associated conversation. The short answer is that no one knows what <code>tauto</code> is doing, and its completeness is questionable</p>",
        "id": 265647470,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640062686
    },
    {
        "content": "<p>If it works in my proof, who cares what it's doing!</p>",
        "id": 265664184,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1640078979
    },
    {
        "content": "<p>Mario, that's not true, <span class=\"user-mention\" data-user-id=\"110026\">@Simon Hudon</span> knows what <code>tauto</code> is doing, and users knows that it's doing it faster than its competitors. Speed is much more important than completeness because it means we can actually use it when we want to get rid of an obvious part of a proof and we don't have to come back and remove it later for speed reasons.</p>",
        "id": 265664905,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1640079408
    },
    {
        "content": "<p>I'm not making a value judgment on its usefulness. But it is not a \"principled\" SAT solver, it is a collection of heuristics. This has advantages and disadvantages: heuristic provers tend to do better than \"principled\" solvers on common examples, and they might come up with shorter proofs too. On the other hand they might take exceedingly long, time out, or outright fail on problems where a principled solver would succeed, because the heuristics were not good for that particular example.</p>\n<p>Moreover, principled solvers may not always be available for a domain. There is no decision procedure for first order logic, because it is undecidable, so heuristics are the best you can do. <code>tauto</code> accepts this and so it can handle some problems that are not actually SAT goals; <code>itauto</code> is a principled solver and so outright rejects anything that is not strictly SAT, which is probably not what you want if your goal is \"almost\" SAT.</p>",
        "id": 265665567,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640079832
    },
    {
        "content": "<p>I agree with Patrick here.  LJT is not such a great calculus for proof search in classical logic (for intuitionistic logic it's not great either, but the alternatives are not much better).  And as we see, it really doesn't seem to scale well in practice on mathlib.</p>",
        "id": 265666595,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1640080506
    },
    {
        "content": "<p>The question about the solved subset is completely orthogonal and imho a red herring.  <code>tauto</code> isn't faster because it applies some non-propositional rules.  <code>itauto</code> isn't slow because it only does SAT.</p>",
        "id": 265666740,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1640080586
    },
    {
        "content": "<p>I am not arguing that <code>itauto</code> is better for mathlib than <code>tauto</code>. We already did the experiment and it clearly isn't. Mathlib is classical anyway</p>",
        "id": 265666814,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640080637
    },
    {
        "content": "<p>Then I probably misunderstood your point.</p>",
        "id": 265666953,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1640080706
    },
    {
        "content": "<p>But I think we can still do better when it comes to mathlib sat solvers, and get something that is at least complete for SAT and preferably FOL</p>",
        "id": 265666959,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640080711
    },
    {
        "content": "<p>My point is not that either is better, as I said there are advantages and disadvantages to heuristic search vs decision procedures. The best sat solvers use a mixture of both approaches, with heuristics to solve the common cases and mixing in occasional steps to ensure completeness</p>",
        "id": 265667157,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1640080817
    },
    {
        "content": "<p>I think that complete for SAT is more useful than complete for FOL (in mathlib).  But I am just as confident as you that we can get something great in mathlib.</p>",
        "id": 265667374,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1640080929
    }
]