[
    {
        "content": "<p>If you don't mind running a bot on your PC, it should be pretty straightforward to build a Python script that checks for your red PRs periodically. And if the community agrees, building a globally alerting bot should be straightforward as well (I can help with that)</p>",
        "id": 280334817,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1651058096
    },
    {
        "content": "<p>Personally, I think there are now so many PRs that I only have time to look at PRs with a green CI checkmark (barring occasional exceptions). In particular, I wouldn't mind strong bot flags that turn PRs with failing CI back in the realm of the PR author. I'm happy to have an even stronger label that authors can apply sparingly to override the broken-CI-bot to kick their PR on the review queue nonetheless.</p>",
        "id": 280335203,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1651058301
    },
    {
        "content": "<p>another one that always bites me is when there's magically a merge conflict, and I have no clue till a week later or so. it's also annoying that <code>gh pr status</code> (from the github cli) doesn't show labels</p>",
        "id": 280336894,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1651059372
    },
    {
        "content": "<p>but mercifully it does show all your PRs and whether CI is passing/failing, so it's a nice tool to run randomly</p>",
        "id": 280336928,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1651059400
    },
    {
        "content": "<p>I think the correct mechanism to handle \"my PR is broken but I'd like a review anyway\" is to post a message on <a class=\"stream\" data-stream-id=\"144837\" href=\"/#narrow/stream/144837-PR-reviews\">#PR reviews</a>!</p>",
        "id": 280337212,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1651059595
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> if labeling PRs is part of the scope of the lean-community bot, maybe it could be extended to change such labels back to <code>awating-author</code>?</p>",
        "id": 280338174,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1651060205
    },
    {
        "content": "<p>I have no idea how to do that, but it sounds reasonable to me. Of course, that's just my opinion. It would be good to hear from a lot of others as well. Including a bunch more <span class=\"user-group-mention\" data-user-group-id=\"2494\">@maintainers</span></p>",
        "id": 280338270,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1651060277
    },
    {
        "content": "<p>While we're here, automatically adding awaiting-review to new PRs when I forget would be neat</p>",
        "id": 280340021,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1651061274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"307953\">@Ruben Van de Velde</span> how to conclude that the PR is indeed ready for review?</p>",
        "id": 280342220,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1651062470
    },
    {
        "content": "<p>I do not really know whether there is a flow associated to <code>awaiting-CI</code>, but that label I would interpret as: \"I am happy with the current version and would tag it <code>awaiting-review</code>, provided it passes CI\".  If this is not the current behaviour, then maybe it could become that, instead?  I.e., the bot could check that PRs labeled <code>awaiting-CI</code> are \"green\" and could remove <code>awaiting-CI</code> and replace it by <code>awaiting-review</code>?</p>",
        "id": 280342593,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1651062647
    },
    {
        "content": "<p>So far, I've mostly treated it as \"Warning, do not merge right now! Please review/merge in a couple of hours\".</p>",
        "id": 280342839,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1651062816
    },
    {
        "content": "<p>Ah, I was looking at it from the perspective of the author, not of the reviewer!</p>",
        "id": 280342933,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1651062856
    },
    {
        "content": "<p>Actually, Johan, I realize now that what you are saying also applies to the author.  Anyway, maybe there should be an <code>awaiting-review-if-green</code>-tag.</p>",
        "id": 280343012,
        "sender_full_name": "Damiano Testa",
        "timestamp": 1651062917
    }
]