[
    {
        "content": "<p>I have been invited to give a colloquium at Berkeley's <a href=\"https://topos.institute/\">Topos Institute</a> in a couple of weeks (<a href=\"https://researchseminars.org/talk/ToposInstituteColloquium/33/\">talk link</a>) and I have given them the rather provocative title \"What is the point of Lean's maths library?\". I could happily talk for an hour on what <strong>I</strong> think the point is, but I have been giving a lot of talks recently from the comfort of my own front room and I am beginning to wonder whether I am just starting to recycle arguments which I've already waffled on about at length on YT or in my blog post ranblings. As I learn more about this community I realise that other people have very different ideas about the whole endeavour. Michael Harris' first post in <a href=\"https://siliconreckoner.substack.com/p/zeroth-day\">Silicon Reckoner</a>, his new substack, shows that he has a very different view of <code>mathlib</code> to me.</p>\n<p>What do you think the point of Lean's maths library is?</p>",
        "id": 247436382,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1627462873
    },
    {
        "content": "<p>I'd answer this question by drawing a parallel to the informal case. Here are four different questions:</p>\n<ol>\n<li>What is the point of Lean's maths library?</li>\n<li>What is the point of informal mathematics?</li>\n<li>Why do I do informal mathematics?</li>\n<li>Why do I work on Mathlib?</li>\n</ol>\n<p>Questions 3, 4 are easy, in each case I say \"because it's there\". Thus, I do formal mathematics for the same reasons that I do informal mathematics: it is unexplored terrain, I'm curious about it, and I find it satisfying and beautiful.</p>\n<p>Question 2 is not so easy and usually includes me guessing what the person asking might regard as valuable. At various points in history I might have answered by saying trigonometry was important for navigating the oceans, or I might have said that understanding the laws of steam engines or electromagnetism was important, and these days I might say electronic communication, crypotography, complexity theory, compressed sensing, GPS, ... are important.</p>",
        "id": 247440639,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1627466234
    },
    {
        "content": "<p>With that disclaimer I think I'd answer question 1 by saying the Mathlib effort:</p>\n<ul>\n<li>Helps us learn what we need from the next generation of proof assistants</li>\n<li>Enables correctness checking (like LTE)</li>\n<li>Provides a guaranteed-correct <em>unified</em> mathematical reference</li>\n<li>Unblocks a larger number of mathematicians who would formalise if only the relevant basic definitions / results in their area were already in place</li>\n<li>[Speculative] May allow us to push borders of mathematics into areas otherwise too complicated for humans to work reliably</li>\n</ul>",
        "id": 247440653,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1627466257
    },
    {
        "content": "<p>I think there are two questions:</p>\n<ol>\n<li>What is the point of building a large library of formalized mathematics?</li>\n<li>What is the point of mathlib’s approach to this (especially in contrast to MetaMath, Isabelle, Mizar, HOL Light, and Coq)?</li>\n</ol>",
        "id": 247454177,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476862
    },
    {
        "content": "<p>I don’t have enough understanding of the second question to give a meaningful contribution, but the first question has many diverse interesting answers and observations.</p>",
        "id": 247454189,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476870
    },
    {
        "content": "<p>First, the desire to formalize all of mathematics is fairly old.  Russell and Whitehead’s Principia Mathematics is now over 100 years old.  Since then, I think a lot of mathematicians have the unfortunate take away that, while formalization is theoretically possible, it is impractically hard.  (And they often erroneously cite that it took 379 pages to prove 1 + 1 = 2, as if the first chunk of the book was devoted to that theorem alone.)</p>",
        "id": 247454206,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476877
    },
    {
        "content": "<p>However, not everyone has shared this pessimistic view, especially when computers came along.  I don’t know the full history here with AutoMath and Mizar and such, but I’d love to see it written down.  I do know that the <a href=\"http://www.cse.chalmers.se/research/group/logic/TypesSS05/Extra/wiedijk_2.pdf\">QED Manifesto</a> of the 90s provides a number of diverse motivations for formalizing mathematics.  Recently, Josef Urban, in the middle, around 31:30, of <a href=\"https://soundcloud.com/thesis-review/20-josef-urban-deductive-and-inductive-reasoning-in-large-libraries-of-formalized-mathematics\">an interesting a podcast</a> described the diverse viewpoints of the QED Manifesto authors, some who thought AI was too lofty and just wanted to formalize math by hand, while others saw this potential library as a source for training future AIs.</p>",
        "id": 247454218,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476883
    },
    {
        "content": "<p>I think the Internet and all that came with it is really one thing that has helped formalization take off (as well as other large scale open source software projects).  First mailing lists and websites, but now Github, Zulip, Discord, etc. are invaluable for this community.  Even the ability to try out Lean in the browser is key to adoption.  (I know some complain that Lean has a big PR campaign, but I think PR is really important.  New software languages get adopted based on how good their documentation is.  And for every 1 person who comes to Lean from another ITP, another 2 come to formalization for the first time---or so I’m guessing without any data <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>).</p>",
        "id": 247454235,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476890
    },
    {
        "content": "<p>In my <a href=\"https://www.youtube.com/watch?v=EXpmbAfBNnw\">talk about Lean-GPT-f at Harvard</a>, I gave five different motivations for formalized mathematics, all of which I think apply to Mathlib:</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"EXpmbAfBNnw\" href=\"https://www.youtube.com/watch?v=EXpmbAfBNnw\"><img src=\"https://uploads.zulipusercontent.net/bd2a9c6a819c867efb19ea439f4a113b891f5dae/68747470733a2f2f692e7974696d672e636f6d2f76692f4558706d624166424e6e772f64656661756c742e6a7067\"></a></div><ol>\n<li><em>Mechanically check mathematical proofs.</em>  While it doesn’t yet make sense to have mathematicians formalize all of their work, it does make sense to formalize particularly foundational, interesting, or troublesome proofs, such as undergraduate mathematics, the independence of CH, or Scholze’s lemma in the Liquid Tensor project.</li>\n<li><em>Digitize mathematics.</em>  Everything nowadays is digitized, and systematically organized into databases.  However, mathematics is remarkably resistant to this trend.  Sure we have pdfs and LaTeX files of most articles, but none of these formats capture the mathematical content of the articles.  Formalization of a large body of mathematics, whether the full proofs or just the theorem statements, would open up many possibilities for automatic retrieval and search of mathematics.</li>\n<li><em>Unify and archive mathematical knowledge.</em>  Right now the world of mathematics consists of a mostly disjoint collection of articles (most of them mostly true).  There have been past heroic efforts from Euclid to Bourbacki to systematically organize the current mathematical knowledge of the time.  More modern incarnations include Wikipedia, nLab, and the Stacks Project.  Formalization provides yet another approach to this, whereby we systematically build up a library of mathematics starting at the foundations, up to the most interesting new developments.</li>\n<li><em>Prove the correctness of software and hardware.</em> This hasn’t been much of a focus in Lean, although Lean 4 will be a fast language, compiled to C and maybe LLVM, with the ability to formally verify the properties of any (safe) code one writes.  There have been some great success stories so far in software and hardware verification and I see a lot of potential for verified security software.  It is also the most likely way to monetize ones skills in formal theorem proving.  As the mathematics in formal libraries get more sophisticated, so do the types of algorithms that we can formalize.</li>\n<li><em>Making mathematics accessible to computers in a new way.</em>  I’ve heard it said that the one thing mathematics is good for is more mathematics.  This “false truism” also holds for formalization.  We don’t know the full applications of formal mathematics right now except that it will improve our ability to formalize more mathematics in the future.  However, we do have hints already at the ways that one can use a large library of formal mathematics.  AI projects like HOList and GPT-f are trained off of many person-years of formalization effort, and hopefully will eventually become a virtuous loop, helping users better formalize more mathematics.  It’s hard to predict what we can do with a large library of formalized, computer-readable, interconnected mathematics, but it is very reasonable to believe it could have important positive future impacts on mathematics, technology, science, and education.</li>\n</ol>",
        "id": 247454242,
        "sender_full_name": "Jason Rute",
        "timestamp": 1627476897
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"115715\">@Jason Rute</span> Wow, thanks for sharing your thoughts!</p>",
        "id": 247457514,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1627478535
    },
    {
        "content": "<p>Training in a more holistic manner. Perhaps more valuable than the existence of a single formalized library itself is the cultivation of a community where the members possess the skill \"ability to formalize pure mathematics.\"</p>",
        "id": 247459457,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1627479395
    },
    {
        "content": "<p>One thing that I haven't seen mentioned yet is that mathlib has brought together a set of folks with rather diverse interests who most likely would not be interacting otherwise. My impression is that when people from very different communities come together there are often unexpected opportunities and results.</p>",
        "id": 247461537,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1627480370
    },
    {
        "content": "<p>There's also the aspect from the other side of computer science. Chip designers have been formalizing their designs for a long time. But they don't need a formalization of Abel Ruffini to make the chips work. So mathlib allows us to ask meta questions - what are the various ways that expressiveness can help in transmitting information? What are useful metamathematic constructions/approaches? Can formalizing mathematics help us understand how to work with complicated structures in other fields?</p>",
        "id": 247462535,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1627480860
    },
    {
        "content": "<p>I complete agree with Bryan! It's been an important factor in all the fun that I've had, that we have type theorists, topologists, meta hackers, analysts, programmers, number theorists, AI experts, UX experts, geometers, and many others interact here on zulip. It's awesome.<br>\nIt also makes me sad that this probably will not scale. If we get 10x the user size, we'll see fragmentation, and people will start to interact only within their little cliques, I'm afraid. <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span> <br>\nBut for now, I'm going to enjoy all the fun! <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span> <span aria-label=\"cartwheel\" class=\"emoji emoji-1f938\" role=\"img\" title=\"cartwheel\">:cartwheel:</span></p>",
        "id": 247462635,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1627480915
    },
    {
        "content": "<p>I should say that for myself, a mathematician, experiencing and internalizing the perspectives <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> mentions has been the most enjoyable aspect of my interaction with lean.</p>",
        "id": 247464174,
        "sender_full_name": "Matthew Ballard",
        "timestamp": 1627481575
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"112680\">Johan Commelin</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247462635\">said</a>:</p>\n<blockquote>\n<p>I complete agree with Bryan! It's been an important factor in all the fun that I've had, that we have type theorists, topologists, meta hackers, analysts, programmers, number theorists, AI experts, UX experts, geometers, and many others interact here on zulip. It's awesome.<br>\nIt also makes me sad that this probably will not scale. If we get 10x the user size, we'll see fragmentation, and people will start to interact only within their little cliques, I'm afraid. <span aria-label=\"sad\" class=\"emoji emoji-2639\" role=\"img\" title=\"sad\">:sad:</span> <br>\nBut for now, I'm going to enjoy all the fun! <span aria-label=\"octopus\" class=\"emoji emoji-1f419\" role=\"img\" title=\"octopus\">:octopus:</span> <span aria-label=\"cartwheel\" class=\"emoji emoji-1f938\" role=\"img\" title=\"cartwheel\">:cartwheel:</span></p>\n</blockquote>\n<p>I agree that the problem of scaling and fragmentation is crucial, and somewhat sad. A part from interacting with little cliques, this will also question the role of <code>mathlib</code>, because if we end up with dozens of libraries which don't interact with each other, basically none will be of great use.</p>",
        "id": 247479303,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1627488454
    },
    {
        "content": "<p>That being said, and I might be too naïf, my answer is still the idea of a 21st century Bourbaki, including Serre's sentence \"we never explain why we did things in such-and-such a way, we simply did them\", which I read as a humble approach of letting each mathematician decide what to do of Bourbaki's books. When I speak to friends and colleagues, this is my main argument, together with the dream that in 10-15 years time to \"submit a paper\" will mean to submit some code which compiles in any of the several theorem-prover which will exist by then. I normally add that one big advantage will be that the editorial task done by colleagues working for journals will become somehow much more relevant, as the correctness of a result will be automatically checked and they will need to focus on its relevance.</p>",
        "id": 247479773,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1627488670
    },
    {
        "content": "<blockquote>\n<p>I agree that the problem of scaling and fragmentation is crucial, and somewhat sad. A part from interacting with little cliques, this will also question the role of mathlib, because if we end up with dozens of libraries which don't interact with each other, basically none will be of great use.</p>\n</blockquote>\n<p>Specialization doesn't necessarily imply fragmentation. I would look to large software projects like the linux kernel for inspiration here: people work on their own domains but it all still fits into a (somewhat) unified whole</p>",
        "id": 247481264,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627489398
    },
    {
        "content": "<p>I think there is already some considerable specialization going on in mathlib. I don't know if there is anyone who can actually follow every part of it</p>",
        "id": 247481399,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627489452
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247454206\">said</a>:</p>\n<blockquote>\n<p>often erroneously cite that it took 379 pages to prove 1 + 1 = 2</p>\n</blockquote>\n<p>I'm curious about the \"1 + 1 = 2 index\" for mathlib, but I calculated the easier thing, which is how many pages mathlib would be when printed. Excluding deprecated and some supporting code like tactics, it would take about 7500 pages, 70 lines per page (methodology: <code>wc -l</code> of the lean files in the <code>src</code> directory, minus the result from a few subdirectories, and then I saw how many lines emacs fits in a page when printing in postscript format).  Mathlib's tactics form another 500 page volume.  For a rough comparison, Principia Mathematica is about 2000 pages with about half as many lines per page.</p>",
        "id": 247489165,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1627492986
    },
    {
        "content": "<p>Did Princ.Math. have roughly the same amount of characters per line?</p>",
        "id": 247490435,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1627493539
    },
    {
        "content": "<p>they are mostly short lines, pure logical statements like A -&gt; B -&gt; A</p>",
        "id": 247490558,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627493619
    },
    {
        "content": "<p>well, the syntax was weirder than that but you get the idea</p>",
        "id": 247490670,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627493655
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247489165\">said</a>:</p>\n<blockquote>\n<p>I'm curious about the \"1 + 1 = 2 index\" for mathlib</p>\n</blockquote>\n<p>Oh right, you don't need mathlib for that:</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">example</span> <span class=\"o\">:</span> <span class=\"mi\">1</span> <span class=\"bp\">+</span> <span class=\"mi\">1</span> <span class=\"bp\">=</span> <span class=\"mi\">2</span> <span class=\"o\">:=</span> <span class=\"n\">rfl</span>\n</code></pre></div>",
        "id": 247493367,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1627494888
    },
    {
        "content": "<p>If you want a closer equivalent to principia mathematica's 1+1 = 2, you should consider <code>(1 : cardinal) + (1 : cardinal) = 2</code>, but it still isn't a good example because the lhs is the definition of the rhs. This is why metamath uses 2 + 2 = 4 instead, but that also isn't a good example in lean for the same reason. So perhaps <code>3 + 1 = 4</code></p>",
        "id": 247493882,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627495089
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"308899\">Yakov Pechersky</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247462535\">said</a>:</p>\n<blockquote>\n<p>There's also the aspect from the other side of computer science. Chip designers have been formalizing their designs for a long time. But they don't need a formalization of Abel Ruffini to make the chips work. So mathlib allows us to ask meta questions - what are the various ways that expressiveness can help in transmitting information? What are useful metamathematic constructions/approaches? Can formalizing mathematics help us understand how to work with complicated structures in other fields?</p>\n</blockquote>\n<p>This is close to one of my main motivations: formalising maths is very much like taking it to bits and putting it back together again. Just like doing so to a physical machine, you learn a lot about how it is built and what each component does, much more than studying it from the outside.</p>\n<p>Interestingly, for this purpose it's good that our provers are not <em>too</em> smart, so we can't paper over issues where the pieces are still too big to fit together. Here I'm thinking of things like <a href=\"https://leanprover-community.github.io/mathlib_docs/find/is_scalar_tower\">docs#is_scalar_tower</a>, which is quickly becoming a basic building block that I would never have invested so much time into, if we could transport everything in the Dedekind domains project for free to the algebraic closure.</p>",
        "id": 247505179,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1627500120
    },
    {
        "content": "<p>I'm late to the party but I can still dump my standard list of reasons to push math formalization (I don't think there is anything specific to mathlib, although I very much enjoy our specific community and process), in no specific order:</p>\n<ul>\n<li>check correctness, especially for proofs that are too big to fit in a human mind (here I'm thinking about proofs <em>much</em> larger than in LTE, at least 1000 pages without much intermediate reality checks, as in the really tricky bits of symplectic topology)</li>\n<li>save time for referees (this is not quite the same as the first point because the first point is first and foremost from the author point of view)</li>\n<li>force people to have clearer ideas, hopefully coming up with better abstractions. We still don't have a killer example here (for instance filters were unfortunately invented before proof assistants, but in the very similar context of Bourbaki). Although we didn't invent much in the LTE project apart from the Commelin complex, we can already say the project clarified the proof a bit, especially through questions we asked.</li>\n<li>force consistency (especially in a monolithic mathlib, but we need consistent formalization whether the repository organization)</li>\n<li>allow a much more universal access to the information. We all now subareas of math where papers are unreadable if you don't have physical access to a small group of authors and their folklore knowledge. Note this is isn't automatic with formal accounts, because we can write completely obfuscated formal math, so we also need the following items</li>\n<li>allow people to write better informal accounts, using the possibility to lie as much as desired since the formal version is covering our back</li>\n<li>even better, I still hope to reach a stage where we can get a single hybrid document allowing to start at a very informal level and almost continuously zoom in wherever we want until reaching the fully formal level (the Alectryon project is part of the current path towards that goal)</li>\n<li>also on the science-fiction side, there is still the hope to have a really nice search tool, as was envisioned in the formal abstract project or even including the dream to ask the AI for \"similar sounding\" lemmas</li>\n<li>teaching (see the tutorials project which is based on my undergrad course)</li>\n<li>merge with computer algebra systems, so that everything we currently do with Sage or similar tools become proofs. This also includes all the big proofs that Jeremy loves so much (4 colors, Kepler's conjecture...)</li>\n</ul>\n<p>And let me repeat once more that I don't mean all that to <em>replace</em> traditional math, I want everything, from very informal to formal.</p>",
        "id": 247521726,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1627509057
    },
    {
        "content": "<p>Being able to do \"data science\" on mathlib has been interesting as well, e.g. visualizing the web of theorems seems like something only possible with a mathlib-like endeavor; I have no idea if that is useful beyond being moderately intriguing for its own sake. Also the educational value of mathlib has been really helpful for me as a programmer trying to self-learn more math, having all the math completely unambiguous and explicit (i.e. I can keep drilling down until I get to some inductive type I can understand or whatever) is great.</p>",
        "id": 247522289,
        "sender_full_name": "Brandon Brown",
        "timestamp": 1627509451
    },
    {
        "content": "<p>Thank you all very much for the wide range of views!</p>",
        "id": 247523551,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1627510233
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110031\">Patrick Massot</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247521726\">said</a>:</p>\n<blockquote>\n<ul>\n<li>force people to have clearer ideas, hopefully coming up with better abstractions. We still don't have a killer example here (for instance filters were unfortunately invented before proof assistants, but in the very similar context of Bourbaki). Although we didn't invent much in the LTE project apart from the Commelin complex, we can already say the project clarified the proof a bit, especially through questions we asked.</li>\n</ul>\n</blockquote>\n<p>This complex that we came up with during LTE turns out to be a <em>reinvention</em> as well. MacLane already defined it in 1958... but the connection with Breen-Deligne resolutions hadn't been made.</p>",
        "id": 247543997,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1627533726
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306601\">Kyle Miller</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247489165\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/113488-general/topic/What.20is.20the.20point.20of.20Lean's.20maths.20library.3F/near/247454206\">said</a>:</p>\n<blockquote>\n<p>often erroneously cite that it took 379 pages to prove 1 + 1 = 2</p>\n</blockquote>\n<p>I'm curious about the \"1 + 1 = 2 index\" for mathlib, but I calculated the easier thing, which is how many pages mathlib would be when printed. Excluding deprecated and some supporting code like tactics, it would take about 7500 pages, 70 lines per page (methodology: <code>wc -l</code> of the lean files in the <code>src</code> directory, minus the result from a few subdirectories, and then I saw how many lines emacs fits in a page when printing in postscript format).  Mathlib's tactics form another 500 page volume.  For a rough comparison, Principia Mathematica is about 2000 pages with about half as many lines per page.</p>\n</blockquote>\n<p>so it's more on par with the Stacks Project, but that isn't formalised (though it is quite thorough..)</p>",
        "id": 249200638,
        "sender_full_name": "David Michael Roberts",
        "timestamp": 1628748179
    }
]