[
    {
        "content": "<p>Lean is sort of unique (at least compared to HOL Light which I was most used to before this) in that tactics are not pure functions (in theory or in practice).  Their behavior can change radically based on the environment.  The example I'm most aware of is the <code>simp</code> tactic which will automatically apply any theorem labeled with the <code>[simp]</code> attribute.  <code>refl</code>, <code>symmetry</code>, and <code>transitivity</code> also have similar attributes.  </p>\n<p>This means that the lean code</p>\n<div class=\"codehilite\"><pre><span></span><code><span class=\"kn\">lemma</span> <span class=\"n\">foo</span> <span class=\"o\">:</span> <span class=\"n\">bar</span> <span class=\"bp\">→</span> <span class=\"n\">baz</span> <span class=\"o\">:=</span> <span class=\"k\">by</span> <span class=\"n\">simp</span>\n</code></pre></div>\n\n\n<p>Might work in one part of the code but not another (even if <code>bar</code> and <code>bar</code> are both in the environment).  It sort of makes it tricky when thinking about AI to say, which tactics should I apply, because whether the <code>simp</code> tactic is applicable depends not only on the definitions of <code>bar</code> and <code>baz</code> and the theorems proved along the way, but on other things such as which lemmas are tagged with the <code>[simp]</code> attribute.</p>\n<p>Here are my questions:</p>\n<ol>\n<li>Are there other interactive tactics like this besides these 4?  (I'm only interested in tactics which can be found in PRed proofs.  Tactics like <code>library_search</code> which aren't used in final proofs aren't important for my interests.)</li>\n<li>Is there a list of such tactics?</li>\n<li>Are attributes the only mechanism which causes non-pure behavior or are there others?</li>\n<li>I think for <code>simp</code> this behavior matters a lot in practice, but how about <code>refl</code>, <code>symmetry</code> and <code>transitivity</code>?  Is it common to label a lemma with <code>[refl]</code>, <code>[symm]</code>, <code>[trans]</code> well after the corresponding relation is defined?  (Any definitions or automatic lemmas getting marked with say, <code>[refl]</code>, is for my purposes pure behavior and that doesn't concern me.)</li>\n</ol>",
        "id": 196390420,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588730970
    },
    {
        "content": "<p><code>tidy</code> will attempt to use any tactic that's been marked by the <code>[tidy]</code> attribute, e.g.</p>\n<div class=\"codehilite\"><pre><span></span><code><span class=\"c1\">-- uncomment in case of emergency</span>\n<span class=\"c1\">-- @[tidy] meta def big_bertha : tactic unit := `[finish]</span>\n</code></pre></div>",
        "id": 196390700,
        "sender_full_name": "Jesse Michael Han",
        "timestamp": 1588731290
    },
    {
        "content": "<p>(Also, before I start a flame war, if I'm not using the term \"pure\" correctly as it relates to functional programming, I hope you will forgive me and look past that to the main essence of my question.)</p>",
        "id": 196390798,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588731431
    },
    {
        "content": "<p>to avoid the complexity of modelling the dynamics of the environment, you could restrict yourself to <code>simp only [...]</code> and, like DeepHOL, supply lemmas ranked by a separate premise selection head</p>",
        "id": 196390881,
        "sender_full_name": "Jesse Michael Han",
        "timestamp": 1588731537
    },
    {
        "content": "<p>Yes, I'm thinking about that for <code>simp</code>.  I'm curious however if <code>simp</code> is the odd case, or if this is a pervasive behavior in Lean tactics.  (For example, I don't even know if there is a form of <code>refl</code> which doesn't use the <code>[refl]</code> lemmas except the definitional ones.  But I also don't know if it really matters much in practice.)</p>",
        "id": 196391244,
        "sender_full_name": "Jason Rute",
        "timestamp": 1588732018
    },
    {
        "content": "<p><code>ext</code> applies the best available extensionality lemma.</p>",
        "id": 196394200,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1588736899
    },
    {
        "content": "<p><code>to_additive</code> attribute depends on all dependencies having this attribute.</p>",
        "id": 196394205,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1588736927
    },
    {
        "content": "<p>I mean, all dependencies that should be adjusted from <code>*</code> to <code>+</code>.</p>",
        "id": 196394214,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1588736963
    },
    {
        "content": "<p>Many tactics depend on the reducibility attributes on declarations, which can be changed after the point of definition.</p>",
        "id": 196490887,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1588738793
    }
]