[
    {
        "content": "<p>Sander Dahmen, Assia Mahboubi, and I have been planning a workshop for a while at the Lorentz Center in Leiden. Pandemic planning is impossible and the workshop keeps changing shape. But we can finally be certain enough to announce: we will be hosting a virtual workshop, <a href=\"https://lean-forward.github.io/lorentz-center-meeting/\">Machine-Checked Mathematics</a>, March 2-4! It will happen European afternoons, in an attempt to be accessible by as many people as possible. </p>\n<p>Our workshop is organized around the idea of a “library showcase.” Proof assistant users from different communities will introduce the audience to some definition, design decision, abstraction, tool, or other feature of their library that is particularly good at serving some purpose. These showcases will be demo-style, with plenty of time for questions and discussion. We strongly encourage interacting with the presenters during these demos.</p>\n<p>The goal of these showcases is not for people to describe an entire library or present a formal paper. The formalized mathematics community is small and fragmented into even smaller communities by prover choice. We want to spur discussion of how good ideas can be adopted or adapted across community boundaries.</p>\n<p>We're still confirming and scheduling speakers, so <a href=\"https://lean-forward.github.io/lorentz-center-meeting/\">check back soon</a> for an updated program! The event is still officially happening through the Lorentz Center, so if you're interested, please register at <a href=\"https://www.lorentzcenter.nl/machine-checked-mathematics.html\">https://www.lorentzcenter.nl/machine-checked-mathematics.html</a></p>",
        "id": 271845595,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644853927
    },
    {
        "content": "<p>If I registered back in November for the in-person edition, I should not have to re-register, right?</p>",
        "id": 271851764,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1644856327
    },
    {
        "content": "<p>No need to re-register, you're still on the list <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 271852731,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1644856744
    },
    {
        "content": "<p>There are more details being finalized, but a draft schedule is up on the workshop website: <a href=\"https://lean-forward.github.io/lorentz-center-meeting/\">https://lean-forward.github.io/lorentz-center-meeting/</a></p>\n<p>If you're planning to attend, please do register on the Lorentz Center website!</p>",
        "id": 272330429,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645135254
    },
    {
        "content": "<p>Sorry for my naivete, but should I go as a (currently) non-academic? Does it cost me money?</p>",
        "id": 272342284,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1645142655
    },
    {
        "content": "<p>It's free, and you're very welcome to attend!</p>",
        "id": 272342712,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645142982
    },
    {
        "content": "<p>As someone who was registered for the in person workshop do I need to re-register?</p>",
        "id": 272372545,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645172314
    },
    {
        "content": "<p>Can I plug it on Twitter or would you rather I didn't?</p>",
        "id": 272372576,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645172344
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110596\">Rob Lewis</span> <a href=\"#narrow/stream/113488-general/topic/Workshop.3A.20Machine-Checked.20Mathematics.2C.20March.202-4/near/271852731\">said</a>:</p>\n<blockquote>\n<p>No need to re-register, you're still on the list <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>\n</blockquote>",
        "id": 272400153,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645190279
    },
    {
        "content": "<p>Thanks for offering the Twitter plug! I think it's better to keep the plugging for this event to the proof assistant Zulips/mailing lists. We're targeting people with some proof assistant experience this time.</p>",
        "id": 272400347,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645190381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110596\">@Rob Lewis</span> Was any of this workshop recorded? I've been checked out for a couple months and missed that it happened... The schedule looks interesting!</p>",
        "id": 284638453,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1654102088
    },
    {
        "content": "<p>It was recorded, but I'm not sure how accessible the recordings are. They were emailed to registered participants only IIRC. I'll look into it</p>",
        "id": 284644779,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1654105182
    }
]