[
    {
        "content": "<p>I read random stuff in random PDFs on the internet and it seems that the Knaster–Tarski theorem is the way to construct inductive predicates in ZFC... I can't understand that theorem though. am I right that the Knaster–Tarski theorem is needed to construct inductive predicates in ZFC? and how can I construct them then?</p>",
        "id": 245418017,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1625821175
    },
    {
        "content": "<p>I'm not sure how good a fit this type of question is for #general, since this doesn't really sound like a topic about lean. In future <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths\">#maths</a> _might_ be a better fit, as might <a class=\"stream\" data-stream-id=\"236446\" href=\"/#narrow/stream/236446-Type-theory\">#Type theory</a>. Maybe I'm wrong though.</p>",
        "id": 245421037,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1625822964
    },
    {
        "content": "<p>Somewhat tangential to your question, but maybe you will find interesting. As far as I understand there is a deep connection between fixed points and inductives, but I do not fully grasp it and am not qualified to explain. But I remember finding the accepted answer to <a href=\"https://cstheory.stackexchange.com/questions/10594/whats-the-difference-between-adts-gadts-and-inductive-types?rq=1\">this</a> stackexchange question quite enlightening at some point regarding the basics of this relation.</p>",
        "id": 245423762,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1625824800
    },
    {
        "content": "<p>Not zfc-theoretic, but it shows the intuition of how lists can be defined as a least fixed point, in the Knaster Tarski way</p>",
        "id": 245423892,
        "sender_full_name": "Horatiu Cheval",
        "timestamp": 1625824857
    },
    {
        "content": "<p>I don't often apply the Knaster-Tarski theorem directly, because it's wrapping a fairly trivial construction: the intersection of a collection of sets. Just like the example I gave earlier about defining <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>ω</mi></mrow><annotation encoding=\"application/x-tex\">\\omega</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.43056em;vertical-align:0em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.03588em;\">ω</span></span></span></span> as the intersection of all sets closed under zero and successor to get what amounts to the inductive type generated by zero and successor, if you have some collection of constructors for an inductive predicate, you just define what it means for a predicate to be closed under those rules and take the intersection of all of them to get the least fixed point.</p>",
        "id": 245433728,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1625832167
    },
    {
        "content": "<p>The Knaster-Tarski theorem is basically showing the general conditions under which you can expect a similar result. For example you don't need it to be the intersection of sets, it can be the infimum in any complete lattice. Intersection of sets is by far the most common case though. You also need the \"universe\" to be a fixed point; this usually follows in concrete applications by some kind of type correctness condition. For example, if I am defining the provability relation, it's a subset of formulas, so the \"universe\" is the set of all formulas, and since all my rules say that if such and such formula is provable then so is this other formula, so naturally the rules never escape the bounds of the set of all formulas.</p>",
        "id": 245434204,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1625832471
    },
    {
        "content": "<p>Here's the <a href=\"http://us.metamath.org/mpeuni/knatar.html\">metamath proof</a>, which is quite short and self contained.</p>",
        "id": 245434519,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1625832636
    },
    {
        "content": "<p>I found a discussion using the Knaster–Tarski fixpoint theorem in relation to inductively defined sets in Appendix 1 of \"Handbook of Practical Logic and Automated Reasoning\" by John Harrison. I would like to find a more rigorous proof and discussion, especially in regard to how inductive rules are formally defined. Would someone have a good reference?</p>",
        "id": 266299980,
        "sender_full_name": "Patrick Thomas",
        "timestamp": 1640732421
    },
    {
        "content": "<p>That is, how is the definition of a set by inductive rules formalized in ZFC, and how is the Knaster-Tarski fixpoint theorem used to prove that the set exists?</p>",
        "id": 266300214,
        "sender_full_name": "Patrick Thomas",
        "timestamp": 1640732702
    }
]