[
    {
        "content": "<p>Hello, I'd like to define a function like who's domain are the positive reals, I asked the other day if <code>preal</code> existed, but it looked like it didn't, in that case how can I define a function like that? So far I've best I've done is <code>f : R -&gt; R</code>and <code>f : nnreal -&gt; R</code></p>\n<p>On that same thread I was trying to define a function which takes in two elements from <code>R</code> and sends them to <code>R</code>, is the best way of doing that having <code>f : R -&gt; R -&gt; R</code> or is there an easier way of writing the repeated mapping like that. If that's the way we have to write it then how would we notate a function which takes in <code>n</code> arguments from <code>R</code> and maps it elsewhere?</p>",
        "id": 273014649,
        "sender_full_name": "Callum Cassidy-Nolan",
        "timestamp": 1645652187
    },
    {
        "content": "<p>One suggestion is that you just use the reals and return junk values for &lt;= 0. This works really well, this is how things like <code>real.sqrt</code> works (I don't know what <code>real.sqrt (-1)</code> is but I do know it's a real number and I suspect there are no lemmas about it). Otherwise make the subtype (and then live with the pain that this causes). </p>\n<p>As for R -&gt; R -&gt; R, that's exactly the way that e.g. addition and multiplication in groups and rings etc are done, it's definitely the least painful way in dependent type theory. If you want n arguments and n is a variable then it's <code>(fin n -&gt; R) -&gt; R</code>, but remember that if <code>n = 2</code> then <code>fin 2 -&gt; R</code> is not defeq to <code>R \\times R</code> and neither of those are as convenient as <code>R -&gt; R -&gt; R</code> anyway.</p>",
        "id": 273015203,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645652503
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"367659\">Callum Cassidy-Nolan</span> has marked this topic as resolved.</p>",
        "id": 273015350,
        "sender_full_name": "Notification Bot",
        "timestamp": 1645652583
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"367659\">Callum Cassidy-Nolan</span> has marked this topic as resolved.</p>",
        "id": 273919413,
        "sender_full_name": "Notification Bot",
        "timestamp": 1646280194
    }
]