[
    {
        "content": "<p>Thanks!  I don't suppose any of this works for Emacs?</p>",
        "id": 303466446,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1665503020
    },
    {
        "content": "<p>I don't know anything about emacs. I know some of it works for vim.</p>",
        "id": 303467787,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1665503443
    },
    {
        "content": "<p>It doesn't work for emacs unfortunately, or at least it didn't last time I tried.</p>",
        "id": 303470546,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1665504355
    },
    {
        "content": "<p>I wish the emacs package (for both Lean3 and 4) got more love :(</p>",
        "id": 303470798,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1665504434
    },
    {
        "content": "<p>I think we need to coordinate slightly better (at least emacs + vim) to find some ways to reduce duplication</p>",
        "id": 303486169,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665509506
    },
    {
        "content": "<p>I don't have a ton of Lean time myself at the minute but when we were learning about implementing widgets for neovim was probably a decent time to try to do it for both with possibly only a bit more effort but that would have involved learning enough about <code>lean-mode</code> that made it not happen</p>",
        "id": 303486417,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665509590
    },
    {
        "content": "<p>And some things would likely be useful for both -- e.g. porting <code>tailwind.css</code> to something usable in a terminal is something we only partially did, and I don't know whether there's a decent way to do so that'd work for both editors but certainly we should think about those things -- or think about thinking about them :P</p>",
        "id": 303486565,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665509649
    },
    {
        "content": "<p>Sorry, tachyons, not tailwind, too many css frameworks on the mind.</p>",
        "id": 303486665,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665509704
    },
    {
        "content": "<p>A hacky but (presumably) simple solution would be to display widgets in an external browser window.</p>",
        "id": 303487975,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1665510163
    },
    {
        "content": "<p>yeah -- I put a link to a thing for neovim which does so in <a href=\"https://github.com/Julian/lean.nvim/issues/59\">https://github.com/Julian/lean.nvim/issues/59</a></p>",
        "id": 303488302,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665510275
    },
    {
        "content": "<p>who knows how much brain is left for lean 3 from folks but maybe that's even possible to share with emacs if we somehow do it in the language server (like have the language server process drive the browser window) but that's random speculating without rethinking about it</p>",
        "id": 303488497,
        "sender_full_name": "Julian Berman",
        "timestamp": 1665510348
    }
]