[
    {
        "content": "<p>Hello,<br>\nI'm attempting to install VS Code correctly. I have made it down the installation instructions (<a href=\"https://leanprover-community.github.io/install/windows.html\">https://leanprover-community.github.io/install/windows.html</a>) to as far as \"install leanprover extension\" to VS Code, and I am now attempting to select Bash as the default shell.<br>\nI hit Ctrl-Shift-p, which brought up the palette, I typed \"select default\", which showed \"Terminal: Select Default Shell\" as the only available option. When I clicked it, it states that the only two available shells are Command Prompt and Windows PowerShell.</p>\n<p>My Bash is installed into a non-default location. Is that an issue?<br>\nI turned the External: Windows Exec path to the path of git-bash.exe . I then entered a test file and typed #lean 1+1 and it threw an error: \"command expected  Lean [1, 1]\"<br>\nAnyone know where I'm going wrong?</p>",
        "id": 231367268,
        "sender_full_name": "n Simplex Pachinko",
        "timestamp": 1616440242
    },
    {
        "content": "<p><code>#lean 1+1</code> isn't a command. How about <code>#check 1+1</code>?</p>",
        "id": 231367363,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1616440284
    },
    {
        "content": "<p>Hmm. True. I thought that the first time, I actually put in \"#eval 1+1\" per the help file, but just mistyped, but it's working now, either way.</p>",
        "id": 231367574,
        "sender_full_name": "n Simplex Pachinko",
        "timestamp": 1616440377
    },
    {
        "content": "<p>PS I am not at all sure that changing the default shell is an essential part of the installation process; I would be tempted to just not worry. <code>#check 1+1</code> will tell you that it's a natural number, <code>#eval 1+1</code> will tell you which one it is.</p>",
        "id": 231367649,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1616440409
    },
    {
        "content": "<p>Now it has an \"Info\" problem: \"2  Lean [1, 1]\" . The 2 (line number?) is white, the rest is gray. This probably doesn't matter, since I'm getting the right answer. Thank you! Off to do the Natural Number Game.</p>",
        "id": 231367940,
        "sender_full_name": "n Simplex Pachinko",
        "timestamp": 1616440515
    },
    {
        "content": "<p>That's what it's supposed to look like</p>",
        "id": 231389897,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1616449641
    },
    {
        "content": "<p>The <code>2</code> is the result, the <code>Lean</code> is some extra info that vscode displays about the source of the hover text</p>",
        "id": 231389927,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1616449667
    }
]