[
    {
        "content": "<p>Hello, I'm a new member in this chatroom. It's almost nearly the first time I join such a type of communication. Thus I'm not very experienced, have a little patience with me. I suppose I will need some time to become familiar with this tool which is a completely new one for me. I'm especially interested in philosophy, in epistemological questions. And over the years I noticed that it will end up with the philosophy of mathematics which seems to be the most important area of issues I'm actually interested in. Unfortunately I'm not a mathematician. What I have to do now is to become as familiar as possible with mathematical questions. A few weeks ago I started working with Daniel Vellemans great tool Proof Designer. But that tool deals only with set-theoretic questions. Thus I started a few days ago to learn lean prover. The first I did, was to play the magnificent Natural Number Game which gives a lot of fun beside learning some basics concerning lean prover. I stuck at the last proof of the Advanced Addition World. Is this the appropriate place to ask a question concerning the ne_succ_self-proof?<br>\nPeter</p>",
        "id": 207123536,
        "sender_full_name": "Claus-Peter Becke",
        "timestamp": 1597657005
    },
    {
        "content": "<p>sure</p>",
        "id": 207123594,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1597657054
    },
    {
        "content": "<p>Hi! Welcome, and thanks for writing an intro post!</p>",
        "id": 207123604,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1597657063
    },
    {
        "content": "<p>Just start a new thread in this \"new members\" stream, and post your question there.</p>",
        "id": 207123631,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1597657082
    },
    {
        "content": "<p>The general policy is: new question... new thread.</p>",
        "id": 207123667,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1597657096
    },
    {
        "content": "<p>Note that you can also search this stream history. All questions that one can have about this game have already been asked here (but we don't mind repeating the answer if you prefer).</p>",
        "id": 207123719,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1597657128
    },
    {
        "content": "<p>Thank you very much for being welcomed. So first of all I will look for the older posts and try to find what has been dealt in the path.</p>",
        "id": 207124046,
        "sender_full_name": "Claus-Peter Becke",
        "timestamp": 1597657376
    }
]