[
    {
        "content": "<p>I was wondering (currently working through Lean tutorial exercises) - what are the advantages/disadvantages of Lean compared to other proof assistants? What can't it do/what isn't it good for/what are its limits? I am really enjoying exploring it so far, but I'm wondering what the roof of the sky is, you know?</p>",
        "id": 207536671,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597937738
    },
    {
        "content": "<p>There are a couple of pointers at <a href=\"#narrow/stream/113488-general/topic/CICM.202020/near/206476084\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/CICM.202020/near/206476084</a>. But discussing this is not so fertile. You can simply try a couple of proof assistants. If you don't know where to start in order to learn Coq then you probably want to use Lean...</p>",
        "id": 207537819,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1597938332
    },
    {
        "content": "<p>That's fair enough!</p>",
        "id": 207538292,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597938535
    },
    {
        "content": "<p>I suppose what I was trying to get my head round was why a project that already exists and uses Coq might use Coq in specific, say, but I suppose to a degree the answer is \"time exists and we live now and not then\", which isn't particularly fertile.</p>",
        "id": 207538734,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597938742
    },
    {
        "content": "<p>There is a lot of inertia here. Learning how to use a proof assistant is extremely time-consuming, and changing is difficult. Building a good library is also extremely time-consuming and discourages switches. There are also huge cultural differences that totally prevents many movements between communities. The Coq community has a huge bias towards constructive mathematics while most people here do regular mathematics.  This is not a difference between software, but between people and libraries.</p>",
        "id": 207539532,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1597939116
    },
    {
        "content": "<p>That makes sense. I'm coming at it from a cryptography perspective and wondering if I might be able to get any use from it. Well: let me be more exact. I'm wonder if I could extract some useful research by writing some provable security stuff in Lean. Somebody has to be the first...</p>",
        "id": 207543723,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597941204
    },
    {
        "content": "<p>It's fun regardless!</p>",
        "id": 207543735,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597941212
    },
    {
        "content": "<p>You might also want to check out EasyCrypt (<a href=\"https://www.easycrypt.info/trac/\">https://www.easycrypt.info/trac/</a>), which is a specialized verification tool for cryptographic protocols.</p>",
        "id": 207545547,
        "sender_full_name": "Frédéric Dupuis",
        "timestamp": 1597941979
    },
    {
        "content": "<p>Nice, thank you.</p>",
        "id": 207545702,
        "sender_full_name": "Wrenna Robson",
        "timestamp": 1597942059
    }
]