[
    {
        "content": "<p>In the Chapter 7 exercises in \"Theorem Proving in Lean\", question 4 asks me to define the type of propositional formulas and a function for measuring the complexity of a formula, among other things. What is meant by \"complexity of a formula\" here?</p>",
        "id": 188800114,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1582348679
    },
    {
        "content": "<p>Usually it means something like the length of a formula, the number of variables plus the number of logical symbols (like connectives/negations). But it could mean different things, like the depth (how many nested logical connectives are there).</p>",
        "id": 188804332,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1582355759
    },
    {
        "content": "<p>I see, thanks. So there's no universally accepted definition of \"complexity of a formula\"?</p>",
        "id": 188804385,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1582355815
    },
    {
        "content": "<p>I don't think so, but if there was I would guess the number of symbols in it.</p>",
        "id": 188804533,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1582356093
    },
    {
        "content": "<p>For first-order logic formulas there is a different kind of complexity, which counts the number of quantifier changes (in a certain normal form): <a href=\"https://en.wikipedia.org/wiki/Arithmetical_hierarchy\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/Arithmetical_hierarchy\">https://en.wikipedia.org/wiki/Arithmetical_hierarchy</a><br>\nBut this doesn't make sense for propositional formulae, since there are no quantifiers.</p>",
        "id": 188804606,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1582356204
    },
    {
        "content": "<p>my guess is that it's asking for some kind of evaluation complexity (i.e. how many steps it would take to evaluate the formula), given that it also asks to implement evaluation right before that</p>",
        "id": 188806273,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1582359069
    },
    {
        "content": "<p>Generally when this term is used it doesn't really matter what it is precisely, as long as it's a natural number and subformulas have smaller complexity</p>",
        "id": 188806858,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1582360077
    },
    {
        "content": "<p>quantifier alternations is usually called \"arithmetic complexity\" specifically</p>",
        "id": 188806905,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1582360142
    }
]