[
    {
        "content": "<p>Curious if you create the following premise so your goal state ends up like:<br>\nn : mynat,<br>\nhn : n = succ n,<br>\nh0 : succ n ≠ 0<br>\n⊢ succ n = 0</p>\n<hr>\n<p>Is there a way to use the premise h0 and the goal state contradiction statements to return a proof of the goal?</p>",
        "id": 193684354,
        "sender_full_name": "PV",
        "timestamp": 1586647029
    },
    {
        "content": "<p>you don't need <code>h0</code> if the other hypotheses are already contradictory</p>",
        "id": 193684405,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1586647089
    },
    {
        "content": "<p>however the proof that <code>n = succ n</code> is false is not completely trivial so you may not have it on mynat. You have to prove it by induction</p>",
        "id": 193684419,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1586647174
    },
    {
        "content": "<p>The <code>exfalso</code> tactic will destroy the goal so that you only have to prove <code>false</code>, if that's what you're asking; but you can't generally take a hypothesis of the form \"not A\" and a goal of \"A\", and create a proof. After all, you could prove false that way: take a hypothesis of the form <code>true</code>, and a goal of the form <code>false</code>. If you notice that your goal is incompatible with your hypotheses, you have only two real paths to victory (one of them classically valid and one not): <code>exfalso</code> and prove that your hypotheses are inconsistent, or proof-by-contradiction of assuming the negation of the false goal and then proving that the hypotheses with that extra assumption are inconsistent. (There are niche cases where it's actually easier to prove the false goal from the false assumptions, but in my experience those are rare.)</p>",
        "id": 193698597,
        "sender_full_name": "Patrick Stevens",
        "timestamp": 1586675353
    },
    {
        "content": "<p>That makes sense.  Still getting used to reading a neq 0 as a = 0 -&gt; false and the use of the exfalso tactic to move along.</p>",
        "id": 193715691,
        "sender_full_name": "PV",
        "timestamp": 1586702296
    }
]