[
    {
        "content": "<p>Up until now I have been mostly teaching my Lean 3 course without using mathlib.  Today I started using mathlib more seriously for the first time, and most of my students didn't have it installed; either they hadn't created lean projects at all or their projects didn't include mathlib.  I had them run <code>leanproject new</code> or <code>add-mathlib</code> or <code>get-mathlib-cache</code>, and it worked on the PCs but not the Macs.  All the students using Macs got an error like \"getting lean 3.48, no package available for darwin\" (sorry, I don't remember the exact error message).  Is there something different they have to do?</p>",
        "id": 306352160,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1666828627
    },
    {
        "content": "<p>Did they update elan? (<code>elan self update</code> or, if it doesn't work, uninstall and reinstall from whatever their Mac app manager is)</p>",
        "id": 306354841,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1666830385
    },
    {
        "content": "<p>I don't know, I'll ask.  Is that sometimes what that error message means?</p>",
        "id": 306364477,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1666838697
    },
    {
        "content": "<p>To clarify, updating elan (by trying the two things Yaël proposed) is the solution to the problem, not the cause. The error you cited was fixed in elan 1.4.2.</p>",
        "id": 306364714,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1666838990
    },
    {
        "content": "<p>Thanks for this suggestion.  Most of them got it to work by updating elan through homebrew.  One or two of them installed it a different way (e.g. because they have an M1) and we're still working on it, but at least we know what the goal is...</p>",
        "id": 307163386,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1667237866
    },
    {
        "content": "<p>Did they install it using the instructions from <a href=\"https://leanprover-community.github.io/install/macos.html#m1-macs--apple-silicon\">https://leanprover-community.github.io/install/macos.html#m1-macs--apple-silicon</a>? If so, then they should first run <code>arch -x86_64 zsh</code> and then use <code>/usr/local/bin/brew</code> inside the resulting shell to update elan.</p>",
        "id": 307164873,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1667238284
    },
    {
        "content": "<p>I think they did that.  I'll try that with them today, thanks.</p>",
        "id": 307166705,
        "sender_full_name": "Mike Shulman",
        "timestamp": 1667238872
    }
]