[
    {
        "content": "<p>A question re dependent PRs -- if I write lemmas in a PR 3 that depend on other PRs I have (1 and 2), do I place the changes for 1 and 2 in the PR commits for 3 as well? If I don't, do I just propose the incremental change of 3?</p>",
        "id": 220897831,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1608856063
    },
    {
        "content": "<p>What's the correct git flow for this?</p>",
        "id": 220897832,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1608856076
    },
    {
        "content": "<p>Once PRs 1 and 2 are merged, do I rebase on new master in the branch for PR 3, or merge, or cherry pick in? Or just recommit on master and force-push?</p>",
        "id": 220897871,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1608856115
    },
    {
        "content": "<p>Doing a rebase seems to create a PR that has _all_ of the commits to master that happened in the interim. I understand that PR commits are squashed, but it still looks weird within the PR history.</p>",
        "id": 220897878,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1608856158
    },
    {
        "content": "<p>Usually I just have 3 contain the changes of both 1 and 2, and then fix merge problems as they arise. But I'm no git guru, and this probably isn't the best way to do it.</p>",
        "id": 220897922,
        "sender_full_name": "Thomas Browning",
        "timestamp": 1608856225
    },
    {
        "content": "<p>I don't know if mathlib has its own norms here, but normally yeah if you can't tear 3 independently away from 1 and 2 (which is preferable so that they can get merged independently) then you'd have the PR for 3 be on top of commits for 1 and 2.</p>",
        "id": 220898458,
        "sender_full_name": "Julian Berman",
        "timestamp": 1608857485
    },
    {
        "content": "<p>If mathlib squashes commits on merge that complicates things -- if it does that for all PRs there isn't much point in rebasing yours, you can equally well just merge master into your branch, and then that will all get squashed again once it merges back to master</p>",
        "id": 220898495,
        "sender_full_name": "Julian Berman",
        "timestamp": 1608857530
    },
    {
        "content": "<p>(The advantage over rebasing is that you may in some cases have to fix some merge conflicts multiple times, or in places that wouldn't be a conflict if you merged only the 2 HEADs, but if you like doing that you can enable <code>git rerere</code> and it sometimes helps)</p>",
        "id": 220898507,
        "sender_full_name": "Julian Berman",
        "timestamp": 1608857638
    },
    {
        "content": "<p><code>git rerere</code> docs are here in case you elect for that: <a href=\"https://www.git-scm.com/book/en/v2/Git-Tools-Rerere\">https://www.git-scm.com/book/en/v2/Git-Tools-Rerere</a></p>",
        "id": 220898555,
        "sender_full_name": "Julian Berman",
        "timestamp": 1608857720
    }
]