[
    {
        "content": "<p>Is there any way to automatically detect and warn about typeclass errors where, for example, you've accidentally introduced two zeroes for a type?  This sort of error leads to failures that are pretty cryptic for a beginner, and I'm wondering if there's any way to make it more obvious what's going wrong.</p>",
        "id": 267889647,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642089853
    },
    {
        "content": "<p>This would indeed be very helpful, but I don't think we have anything in that direction.</p>",
        "id": 267890154,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1642090071
    },
    {
        "content": "<p>There has been discussion about this, but nobody spent time on it yet.</p>",
        "id": 267890377,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1642090167
    },
    {
        "content": "<p><a href=\"#narrow/stream/113488-general/topic/Stupid.20assumptions.20tactic/near/264155485\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/Stupid.20assumptions.20tactic/near/264155485</a>, its certainly related to a lot of things I've been trying recently, and it sounds nice, its just not clear how it would be used. Like if its a tactic people have to call I'm not sure it will help beginners (who will teach them the tactic!)</p>",
        "id": 267903148,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1642095178
    },
    {
        "content": "<p>Maybe a more useful thing to do is to add nice doc pages with common debugging tips for specific errors, and then link to them from the lean error messages themselves</p>",
        "id": 267903399,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1642095284
    },
    {
        "content": "<p>I was thinking of it as a command like <code>#lint</code> that you could invoke to check for typeclass conflicts. Absolute beginners might not know about it at first (because they don’t know anything at first!) but once you know it’s there it would be a useful tool for resolving mysterious proof failures.</p>",
        "id": 267924031,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642104820
    },
    {
        "content": "<p>But yes, good debugging documentation would also be very helpful.</p>",
        "id": 267924118,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642104855
    }
]