[
    {
        "content": "<p>Hello everyone! I'm Kristian from Italy and I have a dev background, which turned to functional programming some months ago. I was looking for more pleasing ways of expressing my functional code and I've found Lean (and Idris, and Coq and a bunch of others). Lean seems pretty good at describing what you want in a clear way and more importantly in a readable way.</p>\n<p>I've gone through the \"Functional programming in Lean\" book ('till chapter 3.3) and I'm interested in learning more.</p>\n<p>Especially, I'd like to ask (1) what other resources are there for someone to learn how to approach general programming with Lean and (2) if graded modal types \"à la\" Granule are something describable within Lean.</p>\n<p>Thanks!</p>",
        "id": 305357903,
        "sender_full_name": "Kristian Notari",
        "timestamp": 1666359842
    },
    {
        "content": "<p>There is <a href=\"https://agentultra.github.io/lean-4-hackers/\">https://agentultra.github.io/lean-4-hackers/</a> which talks about IO which is currently missing from FPiL.</p>",
        "id": 305379215,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1666365617
    },
    {
        "content": "<p>Thanks! I'll take a look to it</p>",
        "id": 305383798,
        "sender_full_name": "Kristian Notari",
        "timestamp": 1666366718
    },
    {
        "content": "<p>While it isn't about programming, some sections in <a href=\"https://leanprover.github.io/lean4/doc/tpil.html\">TPiL</a> might be more complete than FPiL.  Also, I often find it helpful in programming to just get started trying to do stuff.  So you could pick a set of learning problems like <a href=\"https://adventofcode.com/\">advent of code</a> or your own personal project.  A lot of stuff in Lean 4 isn't documented (or worse is changing), but if you look at the code, you can find a lot by looking how things are done there.  Also <a href=\"https://leanprover-community.github.io/mathlib4_docs/\">https://leanprover-community.github.io/mathlib4_docs/</a> is useful.</p>",
        "id": 305401919,
        "sender_full_name": "Jason Rute",
        "timestamp": 1666371335
    },
    {
        "content": "<p>And I assume you know about the manual: <a href=\"https://leanprover.github.io/lean4/doc/whatIsLean.html\">https://leanprover.github.io/lean4/doc/whatIsLean.html</a></p>",
        "id": 305402280,
        "sender_full_name": "Jason Rute",
        "timestamp": 1666371450
    },
    {
        "content": "<p>I know about TPiL (reading it now), FPiL (already read) and the manual (which I've kept as a go to reference in case I needed it).</p>\n<p>You're right, I should probably start doing something then see where I end up. Thanks for the advice!</p>",
        "id": 305407007,
        "sender_full_name": "Kristian Notari",
        "timestamp": 1666372898
    },
    {
        "content": "<p>I have learned a huge amount just by reading Lean 4 source code. For example, use <code>go to definition</code> editor command on <code>Nat</code>, this takes you to the Lean's source code. Then use <code>find references</code> on the <code>succ</code> constructor and voila you can have a look at every single use case of <code>Nat.succ</code>. (finding references of a symbol is a recent lsp addition, right? I don't remember it working in the past)</p>",
        "id": 305408706,
        "sender_full_name": "Tomas Skrivan",
        "timestamp": 1666373438
    },
    {
        "content": "<p>Reading through <a href=\"https://github.com/leanprover/std4\">https://github.com/leanprover/std4</a>(collection of data structures and tactics written in Lean4) and <a href=\"https://github.com/leanprover/lean4-samples\">https://github.com/leanprover/lean4-samples</a>(collection of Lean4 code samples) and reimplementing some of them might be a good exercise to check your understanding of the language.</p>",
        "id": 305413123,
        "sender_full_name": "Taro Naoi",
        "timestamp": 1666374977
    },
    {
        "content": "<p>Thanks to both of you. I'm certainly trying your advices</p>",
        "id": 305628788,
        "sender_full_name": "Kristian Notari",
        "timestamp": 1666508018
    }
]