[
    {
        "content": "<p>Me and a fellow colleague were interested in trying to get our hands dirty with Lean and were thinking to start a project to formalize some basic Diophantine Approximation results with the (longterm) goal to prove Thue's and Roth's Theorems (and possibly their applications to solutions of Diophantine Equations). <br>\nWould that be of interested of the community? What is the best way to start other than create the lean file, do the work, and then have it somewhere on Github for people to see it?</p>",
        "id": 205731570,
        "sender_full_name": "Amos Turchet",
        "timestamp": 1596381622
    },
    {
        "content": "<p>Use <code>leanproject</code></p>",
        "id": 205732135,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382532
    },
    {
        "content": "<p>This makes it easy for other people to run your project without worrying about what version of mathlib it depends on</p>",
        "id": 205732186,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382564
    },
    {
        "content": "<p>The theorems you suggest are theorems that should end up in mathlib</p>",
        "id": 205732200,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382612
    },
    {
        "content": "<p>As soon as you have a chunk of your project which can be PRed to mathlib, you should do it</p>",
        "id": 205732217,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382663
    },
    {
        "content": "<p>This will get some code review and may change how you approach the rest of the project</p>",
        "id": 205732260,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382688
    },
    {
        "content": "<p>In fact for a project like this, many people prefer to develop on a branch in the mathlib repo</p>",
        "id": 205732270,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382710
    },
    {
        "content": "<p>See <a href=\"https://leanprover-community.github.io/contribute/index.html\">#contrib</a> for more details</p>",
        "id": 205732285,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382753
    },
    {
        "content": "<p>More importantly, come back and ask questions whenever you get stuck</p>",
        "id": 205732294,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382789
    },
    {
        "content": "<p>In addition to helping you finish your project more quickly, the community is producing intro materials, most notably <a href=\"https://leanprover-community.github.io/mathematics_in_lean/\">#mil</a>. This development is guided in part by questions from mathematicians on zulip</p>",
        "id": 205732369,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1596382885
    },
    {
        "content": "<p>Diophantine approximation sounds great! You might be interested in checking  out some of <br>\n<span class=\"user-mention\" data-user-id=\"252627\">@Jujian Zhang</span>'s work at <a href=\"https://github.com/jjaassoonn/transcendental\">https://github.com/jjaassoonn/transcendental</a>  which isn't in mathlib but has some nice results (Liouville's theorem for one)</p>",
        "id": 205735343,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1596387812
    },
    {
        "content": "<p>Since this is material we'd love to have in mathlib, it may make sense to just work in a branch of mathlib, rather than a separate repository.</p>",
        "id": 205755511,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596422796
    },
    {
        "content": "<p>This makes it easy to get material ready for a PR to mathlib, when you reach this stage.</p>",
        "id": 205755514,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596422810
    },
    {
        "content": "<p>(Getting material through the PR process is extra work, sometimes a lot of extra work, but hopefully your code ends up better, you learn a lot about Lean from the process, and the mathematical development is then available and easily usable by everyone else.)</p>",
        "id": 205755535,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596422861
    },
    {
        "content": "<p>If you want permission to push to non-master branches of the main repository of mathlib, just ask here. (Alternatively, you can always fork the mathlib repository on github. The main advantages of working in a branch on the main repository are that you get the benefit of olean files built by our continuous integration setup, and during the review process of a PR it's a little easier for reviewers.)</p>",
        "id": 205755591,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596422929
    },
    {
        "content": "<p>Looks like working on a branch of mathlib makes the most sense then. Is it possible to have permission? My GitHub user name is amosturchet. THANKS!</p>",
        "id": 206002222,
        "sender_full_name": "Amos Turchet",
        "timestamp": 1596618758
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"319141\">@Amos Turchet</span>, done!</p>",
        "id": 206002280,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1596618812
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 206002333,
        "sender_full_name": "Amos Turchet",
        "timestamp": 1596618843
    }
]