[
    {
        "content": "<p>Hi.  Was wondering what kind of conclusions Lean can come to on its own, and thus if it can \"list choices\" when you're proving something.  For instance if it knows f : A -&gt; B is a function and I assert that there's an x in A, then can I \"list choices\" here one of which would be \"there exists an element f(x) in B\".   I'm still learning Lean, so not sure how it all works.   I can work with it either way for my app.  For instance the suggested choices pane in the app could be constructed by user statistics or simply ordering the choices by \"how many times did this choice appear in the steps of a successful proof\".  That should be easy enough and not require much on the server side to aggregate the usage stats and update each user's copy.</p>",
        "id": 174088026,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1566746185
    },
    {
        "content": "<p>I think that what you would want is some sort of diagram chasing tactic. At the moment there is no such thing. But we are approaching additive/abelian categories in mathlib. Once we have those, such a tactic will be on several peoples wishlist.</p>",
        "id": 174088152,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1566746410
    },
    {
        "content": "<p>So you have it for other things than diagram chasing?</p>",
        "id": 174088158,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1566746443
    },
    {
        "content": "<p>There is <code>tidy</code>.</p>",
        "id": 174088167,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1566746468
    },
    {
        "content": "<p>For a nice story of what it does (more or less), you should read the paper by Gowers and Ganesalingam.</p>",
        "id": 174088180,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1566746495
    },
    {
        "content": "<p>I'm quite sure that you'll find it interesting.</p>",
        "id": 174088182,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1566746503
    },
    {
        "content": "<p><a href=\"https://arxiv.org/abs/1309.4501\" target=\"_blank\" title=\"https://arxiv.org/abs/1309.4501\">https://arxiv.org/abs/1309.4501</a></p>",
        "id": 174088186,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1566746520
    },
    {
        "content": "<p>Thanks!  I will look at it</p>",
        "id": 174088253,
        "sender_full_name": "Daniel Donnelly",
        "timestamp": 1566746636
    }
]