[
    {
        "content": "<p>I am trying to create a pull request containing the <a href=\"https://github.com/leanprover-community/mathlib/commit/e07d8b7abd13fc93e2180abc3b739c6223d75dff\">following lemmas </a>. The step that remains is finding the right files to place them in. However, once I try to edit one of the existing files in mathlib I get excessive memory consumption errors, and it feels improper to make a pull request of code I cannot run myself. Could someone help me with my merge?</p>",
        "id": 307755475,
        "sender_full_name": "Daan van Gent",
        "timestamp": 1667489202
    },
    {
        "content": "<p>You can put them in the right place, push the branch to github, and only open the PR once the CI is happy</p>",
        "id": 307756792,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1667489538
    },
    {
        "content": "<p>Or open as a draft PR</p>",
        "id": 307756810,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1667489546
    },
    {
        "content": "<p>it's also ok having a PR that's tagged <code>awaiting-author</code> for as long as you want. Reviewers will generally not look at it because it won't show up on <a href=\"https://bit.ly/3AZk1Qk\">#queue</a></p>",
        "id": 307757151,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1667489633
    },
    {
        "content": "<p>You could also try and use <a href=\"https://leanprover-community.github.io/tips_and_tricks.html#old-mode\">tip#old-mode</a> to see if it helps locally, or look at the changes you want to make one at a time, generally these excessive memory consumption things happen when you change a file that is relatively basic, and have another file far later in the import heierachy open in a different tab, and lean wants to check every file in between and run out of space, having only one tab open at a time can avoid this, but youll need to do <code>lean --make -j4 src/</code> on the command line after to rebuild locally</p>",
        "id": 307757435,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1667489697
    },
    {
        "content": "<p>Somehow the excessive memory consumption slipped into all my lean files, even though I am now on a branch where I edited no mathlib files. Getting new cache does not seem to fix it, so I'll remove my mathlib folder and <code>leanproject get</code> again.</p>",
        "id": 307760650,
        "sender_full_name": "Daan van Gent",
        "timestamp": 1667490588
    }
]