[
    {
        "content": "<p>Hi, I am new on the platform!! I have just got a lean project from \"<a href=\"https://github.com/mmasdeu/biysc2022\">https://github.com/mmasdeu/biysc2022</a>\" to run it on VS Code. What I did was, on the terminal: write the comand \"leanproject get mmadeu/biysc2022\", and everything worked perfectly. However, this project uses some files that the Lean Infoview is not reading. In the code it says \"import basic\", but file \"basic\" is not found in the search path, how could I solve this?</p>",
        "id": 292407692,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659968170
    },
    {
        "content": "<p>Did you open the folder biysc2022 in vscode, rather than any file. I just tried this project and it works for me</p>",
        "id": 292408482,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659968525
    },
    {
        "content": "<p>Yes!! For example, I opened the doc \"separation.lean\" and all is fine except that I am not seeing the goals in the Lean infoview because the file \"basic\" cannot be imported...</p>",
        "id": 292408928,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659968742
    },
    {
        "content": "<p>You have to use \"Open folder...\" in vscode and open the root folder named \"biysc2022\"</p>",
        "id": 292410749,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659969569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"127136\">@Alex J. Best</span> Oh, now I see!! It is working!! The problem was that I had the \"Tutorials\" Lean project and the \"biysc2022\" project in the same space...</p>",
        "id": 292411286,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659969815
    },
    {
        "content": "<p>By the way, is there any way I can have both the Tutorial project and the biysc2022 project in my left side of the VS Code so that I can work with both at the same time??</p>",
        "id": 292411425,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659969867
    },
    {
        "content": "<p>I've never seen that, I just open two (or 10) copies of vscode and put them next to each other so I can work on both at once</p>",
        "id": 292411592,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659969933
    },
    {
        "content": "<p>Do you mean Ctrl + Shift + N ??</p>",
        "id": 292412057,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659970138
    },
    {
        "content": "<p>On the command line I just type <code>code some_folder</code> again and it opens in a different window</p>",
        "id": 292412521,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659970375
    },
    {
        "content": "<p>But I think ctrl-shift-N does the same</p>",
        "id": 292412554,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1659970395
    },
    {
        "content": "<p>Thank you so much, Alex!! You really helped me to make progress!!</p>",
        "id": 292412828,
        "sender_full_name": "Luisitoon",
        "timestamp": 1659970530
    }
]