[
    {
        "content": "<p>If I open one of my .lean files in TextMate  (a text editor,  which one probably not relevant),   then I see some Japanese-looking characters <br>\nwhere in Lean I see some nice mathematical characters (which I typed in by \\N  or \\F, etc.)    TextMate offers me to \"re-open with encoding...\" and offers numerous options;  e.g. UTF-8,  and several more.   But none of them make it appear as it does in Lean.   I would like to be able to see it in TextMate as I see it in Lean.   So the actual question is,  what encoding is VSCode using to display my Lean files?</p>",
        "id": 245616612,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1626023431
    },
    {
        "content": "<p>It sounds more like a font issue than an encoding issue.</p>",
        "id": 245616673,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1626023511
    },
    {
        "content": "<p>well,  since it displays fine in VSCode,  the necessary fonts are present on my machine.   So your suggestion is that TextMate and VSCode choose different fonts to render  a certain byte in UTF-8?</p>",
        "id": 245617226,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1626024068
    },
    {
        "content": "<p>I don't know what is TextMate but I don't see why any editor would feel the need to use the same font as what you asked VSCode to use.</p>",
        "id": 245617266,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1626024123
    },
    {
        "content": "<p>Mathlib files are UTF-8, and I assume lean itself requires that.</p>",
        "id": 245617810,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626024723
    },
    {
        "content": "<p>TextMate is the common ancestor of the syntax highlighter used by sublime / atom / vscode.</p>",
        "id": 245617875,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626024780
    },
    {
        "content": "<p>At least in terms of the grammar of the grammar files</p>",
        "id": 245617896,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1626024806
    },
    {
        "content": "<p>OK,  here is a different but related question.    I copy a few lines of Lean from my Lean file.  It contains some Unicode characters.   I paste it into a LaTeX file  between  \\begin{verbatim}  and  \\end{verbatim}.    What package and package options will enable this to work?   I tried <br>\n\\usepackage[latin9, utf8]{inputenc}  and some variations on that without success.   I'm using TeXShop on the mac.   <br>\nSurely I'm not the first person to try this.</p>",
        "id": 245777670,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1626149614
    },
    {
        "content": "<p>Oh.   All you have to do is choose \"XeLateX\"  from the TeXShop \"Typeset with\"  menu.   Well,  not quite.  Quantifiers do not render.</p>",
        "id": 245778980,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1626151391
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/lean/tree/master/extras/latex\">In the Lean repository</a> we have a <code>lstlean.tex</code> file for typesetting Lean code. <a href=\"https://github.com/leanprover-community/lean/blob/master/extras/latex/lstlean.md\">See <code>lstlean.md</code></a> for more instructions.</p>",
        "id": 245797546,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1626167821
    }
]