[
    {
        "content": "<p>Hello! I want an advice. Do I use a good folder structure in my project that is supposed to grow into a large codebase in the future?<br>\n<a href=\"https://github.com/madvorak/grammars/\">https://github.com/madvorak/grammars/</a></p>\n<p>I will appreciate any tips from experienced LEANers.</p>\n<p>I am also not sure whether it is convenient to have large files like this one.<br>\n<a href=\"https://github.com/madvorak/grammars/blob/main/src/cfgClosureUnion.lean\">https://github.com/madvorak/grammars/blob/main/src/cfgClosureUnion.lean</a></p>\n<p>There is one theorem (the class of context-free languages is closed under union) and basically everything else serves for proving this theorem (auxiliary definitions and lemmata). Would it be better to have a separate folder for the one theorem and split the file into several files? For example into four files:<br>\n1) main theorem<br>\n2) proof of the first inclusion<br>\n3) proof of the second inclusion<br>\n4) common parts referenced by both 2 and 3</p>\n<p>Or, would such a granularity make my project less clearly organized in the future, when the main issue becomes the amount of files in the project (rather than the amount of lines in a file) later?</p>",
        "id": 274240986,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1646483664
    },
    {
        "content": "<p>I've also been having similar problems figuring out how organise my personal project.  Taking some inspiration from mathlib I'm trying to assign to ever major mathematical object I define a folder with at least the following structure : a folder/file for each non trivial component of the definition,  a file called basic that defines the object and morphisms, and some trivial results are proven, a folder called instances where I define examples of the object,  and folders (with the structure currently described) for gadgets associated with the object. </p>\n<p>Whist this is easier to work with than giant file I used to have, here are a few problems I've been having with this structure:<br>\n1) Things can morally live in more than one place, should the category of open sets live in the topology folder or  category theory folder?<br>\n2) Sometimes imports don't play nice with this structure. In my ideals folder I had a file for basic identities involving ideals, ideally (ha!) this would also include identities involving the radical but my definition the radical depended on results from this file.  <br>\n3) I don't really know how medium sized proofs like the ones in your project fix into this file structure, proofs long enough that they ruin the flow of a file but doesn't like it deserves a file of its own .  A super long proof whose elements morally live together would get a file or folder of its own but I don't really know how I'd structure this folder.</p>",
        "id": 274303660,
        "sender_full_name": "Cameron Torrance",
        "timestamp": 1646570163
    },
    {
        "content": "<p>As an experiment, I refactored the abovementioned proof into 4 files.<br>\n<a href=\"https://github.com/madvorak/grammars/tree/granularity/src/context_free/cfgUnderUnion\">https://github.com/madvorak/grammars/tree/granularity/src/context_free/cfgUnderUnion</a></p>\n<p>Do you think it looks better (on this branch) now?</p>",
        "id": 274695054,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1646836211
    }
]