[
    {
        "content": "<p>I want to go through (some of) Linear Algebra Done Right with a couple people next year and formalize it in Lean. Has anyone tried/done this for other textbooks? It would be cool to have an entire textbook formalized. </p>\n<p>How much do you think we should rely on mathlib in this endeavor. One extreme is to take everything in mathlib as given and only do the exercises in the book. The other extreme is to only use abelian groups and fields, and redefine everything: vector spaces, linear independence, etc. Any advice on this?</p>",
        "id": 284075046,
        "sender_full_name": "Vasily Ilin",
        "timestamp": 1653608209
    },
    {
        "content": "<p>Unless it's for your own learning or for teaching lean to students very familiar with that particular, rebuilding everything from scratch sounds like a particularly bad investment of time</p>",
        "id": 284075867,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1653608924
    },
    {
        "content": "<p>Doing all the exercises feels like a much better project, especially if doing them reveals gaps in mathlib</p>",
        "id": 284075916,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1653608997
    },
    {
        "content": "<p>I think it'd also be worth formalizing theorem statements using mathlib and trying to find the corresponding mathlib proofs.</p>",
        "id": 284076122,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1653609195
    },
    {
        "content": "<p>This has probably been asked before, but would formalized textbooks be a good fit for the mathlib archive folder? The additional maintenance burden seems like it would be worth it:</p>\n<ul>\n<li>it's a test of whether mathlib's APIs are up to the task, and it can drive development of library improvements.</li>\n<li>it can stand in for some documentation, since it would be an entry point into mathlib from a potentially familiar point of view.</li>\n<li>when someone asks \"how can I help?\" we can point them toward working on a textbook formalization, which will naturally lead to helping with mathlib proper when gaps arise.</li>\n<li>when a textbook is complete, we can point to it and say \"yes, mathlib does in fact know this,\" and since it's in the archive we know mathlib won't forget.</li>\n</ul>",
        "id": 284077500,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1653610398
    },
    {
        "content": "<p>What is the mathlib archive folder? I am not familiar with it.</p>",
        "id": 284094374,
        "sender_full_name": "Vasily Ilin",
        "timestamp": 1653631043
    },
    {
        "content": "<p>In the mathlib repository, whereas the <code>src</code> folder contains the mathematics library, <a href=\"https://github.com/leanprover-community/mathlib/tree/master/archive\"><code>archive</code></a> contains some other formalizations that for one reason or another aren't library code.</p>",
        "id": 284100967,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1653637363
    },
    {
        "content": "<p>There's also <a href=\"https://github.com/leanprover-community/mathlib/tree/master/counterexamples\"><code>counterexamples</code></a> and <a href=\"https://github.com/leanprover-community/mathlib/tree/master/roadmap\"><code>roadmap</code></a>, the latter which I only noticed recently and am not really sure what it's for.</p>",
        "id": 284101292,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1653637650
    },
    {
        "content": "<p>Perhaps relevant to both the textbook and linear algebra aspects; I made an attempt at formalizing (&lt;10% of) \"the matrix cookbook\", which contains only statements with no proofs and therefore is great for spotting holes in mathlib:</p>\n<p><a href=\"https://github.com/eric-wieser/lean-matrix-cookbook\">https://github.com/eric-wieser/lean-matrix-cookbook</a></p>\n<p>I'm not certain how much it would benefit from being in mathlib itself</p>",
        "id": 284104102,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1653639695
    },
    {
        "content": "<p>I think that the Hoskinson centre might be interested in formalised textbooks. <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span> ?</p>",
        "id": 284209557,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1653712216
    },
    {
        "content": "<p>We should all be interested! There are really two questions here, (1) whether it should go in mathlib, and, (2) wherever it is, where we should record it (e.g. on the community web pages) so that people can find it.</p>",
        "id": 284310634,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1653866247
    }
]