[
    {
        "content": "<p>Hello all,<br>\n    I am seeking to formalize some geometry exercises (mostly on high school or undergrad level), I have seen the topic about <a href=\"#narrow/stream/113489-new-members/topic/Euclidean.20Geometry\">Euclidean Geometry</a> here. In the current mathlib there is already geometry in euclidean space, but that's more or less algebraic. And also there is an axiomatic geometry repo based on Tarski's. </p>\n<p>I would like to know whether mathlib or this repo is ready to formalize exercises involving congruent triangles or, angle in circles? If yes, which is more appropriate? And if not, if there is any undergoing plan on enriching mathlib's geometry and I will be happy to see if I can contribute?</p>\n<p>Thanks!</p>",
        "id": 242996042,
        "sender_full_name": "Kunhao Zheng",
        "timestamp": 1623924232
    },
    {
        "content": "<p>My understanding is that currently Lean is ready to be doing the kind of high-school geometry proofs but that nobody is working on it. For example I suspect that we are ready to state things like \"angle at centre equals twice angle at circumference\" but I think that nobody stated yet, although I might be out of date here.</p>",
        "id": 243007027,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1623931362
    },
    {
        "content": "<p>There are lots of different things referred to as \"angle\" in informal geometry that need to be distinguished in formal geometry. \"angle at centre\" is an angle from 0 to 2π, where the choice between θ and 2π-θ has to be disambiguated using information about which of two possible arcs the \"angle at circumference\" is on. We don't have a definition of that kind of angle in mathlib; what we have defined is an undirected angle from 0 to π. So stating that result requires first working out the right way to define such angles that's best for building up everything that uses such angles, and then you need to build out the associated API for such angles in mathlib.</p>",
        "id": 243098062,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1623972005
    },
    {
        "content": "<p>Congruence is probably more accessible right now, in that you probably only need one definition and there's a straightforward and natural form of that definition. Say that two indexed families of points, with the same index type, in two possibly different metric spaces (or more generally, in mathlib, <code>pseudo_emetric_space</code>s), are congruent if there exists an isometric equivalence between those metric spaces that maps the points of one family to corresponding points of the other.</p>\n<p>Then SSS congruence for triangles says that two triangles in the same Euclidean space are congruent if corresponding side lengths are equal. But that's not the right form of result for mathlib, because something much more general is true. If you want to prove a version of SSS congruence for mathlib, I think you should aim for something like this:</p>\n<p>Consider two indexed families of points, with the same index type (not necessarily finite), in two possibly different Euclidean spaces, such that all the distances between corresponding pairs of points in the two families are equal. (a) The (directions of) the affine spans of the two families have the same dimension. (b) If that dimension is finite, and there is an isometric equivalence between the two Euclidean spaces (which might themselves be infinite-dimensional), then the two families are congruent. (c) As a special case, which is often what you want to use in geometry problems, if the index type is a <code>fintype</code> and the two Euclidean spaces are the same, then the two families are congruent. (And SSS congruence for triangles is a further special case of that, which never needs to be given as a separate theorem at all.)</p>\n<p>You probably need to prove lots of lemmas along the way to doing that, but it shouldn't involve setting up lots of definitions.</p>",
        "id": 243099135,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1623972913
    },
    {
        "content": "<p>We don't have the affine isometry group yet, although I have been thinking of defining it (and would be glad of your thoughts, <span class=\"user-mention\" data-user-id=\"266253\">@Joseph Myers</span>).  I am imagining a file very similar to <code>analysis.normed_space.linear_isometry</code>, which completes the analogy<br>\n<code>linear_equiv</code> : <code>affine_equiv</code> :: <code>linear_isometry_equiv</code> : X</p>",
        "id": 243104456,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1623977239
    },
    {
        "content": "<p>At the moment, one can talk about a <a href=\"https://leanprover-community.github.io/mathlib_docs/find/isometry\">docs#isometry</a> of Euclidean space, but it would be good to be able to work habitually with an \"affine isometry equiv\" which has the linearity property bundled in.</p>",
        "id": 243104577,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1623977330
    },
    {
        "content": "<p>Note that thanks to the Mazur-Ulam theorem (<a href=\"https://leanprover-community.github.io/mathlib_docs/find/isometric.to_real_linear_isometry_equiv\">docs#isometric.to_real_linear_isometry_equiv</a>) this is no loss of generality.</p>",
        "id": 243104674,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1623977402
    },
    {
        "content": "<p>A couple of remarks there: (a) if we define affine isometric equivs then <code>euclidean_geometry.reflection</code> should become one (at present it's just a bundled isometric equiv); (b) Mazur-Ulam only covers the bijective case, an isometry of Euclidean spaces that isn't surjective is also necessarily an affine map (I formalized that, but didn't PR it to mathlib because what I did was specific to the Euclidean case and it was pointed out on Zulip that it should be done more generally for isometries of (affine spaces over) strictly convex normed spaces (so first we need to define strictly convex spaces)).</p>",
        "id": 243106637,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1623979160
    },
    {
        "content": "<p>I would also like to know if we are ready to formalize statement like <code>2 circles are tangent at point X</code>or <code>2 lines are parallel</code> (of course in dim = 2)? From <a href=\"https://leanprover-community.github.io/mathlib_docs/geometry/euclidean/sphere.html\">docs#sphere</a>, seems that we are talking about points and we don't have an object that describe a sphere?</p>",
        "id": 243397891,
        "sender_full_name": "Kunhao Zheng",
        "timestamp": 1624288628
    },
    {
        "content": "<p>In the style of mathlib, what is the ideal way of saying that <code>2 lines are parallel</code>? I don't have a clear idea but I guess we will have to go into <code>linear_algebra.affine_space</code>?</p>",
        "id": 243398305,
        "sender_full_name": "Kunhao Zheng",
        "timestamp": 1624288804
    },
    {
        "content": "<p>See <a href=\"https://leanprover-community.github.io/mathlib_docs/find/metric.sphere\">docs#metric.sphere</a> for an object describing a sphere.</p>",
        "id": 243398665,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1624288949
    },
    {
        "content": "<p>There are different ways to formalize \"two spheres are tangent at point X\":</p>\n<ul>\n<li><code>r₁ + r₂ = dist O₁ O₂</code> or <code>abs (r₁ - r₂) = dist O₁ O₂</code>;</li>\n<li>the submanifolds have the same tangent plane (needs lots of definitions from <code>geometry/manifold</code>);</li>\n<li>two spheres have exactly one common point.<br>\nSome day we should have a <code>tfae</code> lemma about these (and possibly some other) definitions.</li>\n</ul>",
        "id": 243399393,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1624289261
    },
    {
        "content": "<p>For the \"tangent plane\" version of the definition, one can define the tangent plane to a sphere using an explicit formula, then</p>\n<ul>\n<li>glue this to the <code>manifold</code> library (can be done later; AFAIR, we don't have tangent subspaces to submanifolds yet);</li>\n<li>prove that the definition based on this explicit formula (two spheres intersect at <code>X</code> and share the tangent plane at this point) is equivalent to the other two definitions (at least if <code>0 &lt; r₁</code> and <code>0 &lt; r₂</code>).</li>\n</ul>",
        "id": 243399907,
        "sender_full_name": "Yury G. Kudryashov",
        "timestamp": 1624289459
    },
    {
        "content": "<p>A line is an affine subspace whose direction has dimension 1. To say two affine subspaces <code>s₁</code> and <code>s₂</code> are parallel, use <code>s₁.direction = s₂.direction</code>. Since there are lots of lemmas about the directions of affine subspaces, and equality is also convenient to use, this may well be more convenient than having an explicit definition of <code>parallel</code>.</p>\n<p>(If it's possible one affine subspace is empty and the other is a single point, equality of directions might not be quite what you want because both of those have the trivial submodule as their <code>direction</code>. But if you already know you're dealing with nonempty subspaces, that's not an issue.)</p>",
        "id": 243456218,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1624318195
    },
    {
        "content": "<p>(For the most part, lemmas about dimensions of affine spaces and subspaces are only present for <code>finrank</code>, not the possibly-infinite cardinal-valued <code>rank</code>. So <code>finrank ℝ s.direction = 1</code> is how you say that <code>s</code> is a line.)</p>",
        "id": 243456561,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1624318458
    },
    {
        "content": "<p>I certainly expect it will be useful, for lots of Euclidean geometry purposes, to define a structure for bundled spheres (bundling centre and radius; with appropriate <code>has_mem</code> and <code>has_coe</code> instances, and various definitions for operations that can usefully be carried out involving spheres). The main formalization question arising there is whether such a structure should also bundle a nondegeneracy condition (positive radius), or whether it will be more convenient to use such a structure if that condition is not bundled but is instead a hypothesis on lemmas that need it (many may only need nonnegative radius rather than requiring it to be positive).</p>",
        "id": 243456833,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1624318687
    },
    {
        "content": "<p>Definitions that make sense for bundled spheres include, for example, tangency (to affine subspaces and to other spheres), power of a point, radical axis / plane / hyperplane (= affine subspace of points with equal power with respect to two spheres), inversion, pole and polar. All such definitions should, when added, have lots of routine lemmas added at the same time to provide a basic API to help use the definition. There would also naturally be definitions that produce a bundled sphere; a bundled <code>circumsphere</code> definition, for example, that puts together <code>circumcenter</code> and <code>circumradius</code>, and the image of a sphere under an isometric equivalence as another bundled sphere. These of course need their own routine lemmas.</p>",
        "id": 243457208,
        "sender_full_name": "Joseph Myers",
        "timestamp": 1624318995
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"260507\">Heather Macbeth</span> <a href=\"#narrow/stream/113489-new-members/topic/Formalising.20geometry.20exercises/near/243104456\">said</a>:</p>\n<blockquote>\n<p>We don't have the affine isometry group yet, although I have been thinking of defining it (and would be glad of your thoughts, <span class=\"user-mention silent\" data-user-id=\"266253\">Joseph Myers</span>).  I am imagining a file very similar to <code>analysis.normed_space.linear_isometry</code>, which completes the analogy<br>\n<code>linear_equiv</code> : <code>affine_equiv</code> :: <code>linear_isometry_equiv</code> : X</p>\n</blockquote>\n<p>Done in <a href=\"https://github.com/leanprover-community/mathlib/issues/8660\">#8660</a>.</p>",
        "id": 249385637,
        "sender_full_name": "Heather Macbeth",
        "timestamp": 1628874226
    }
]