[
    {
        "content": "<p>Hello everyone! I've been looking into autoformalization with natural language processing (NLP), and it seems the task has some promising tracks shown in <a href=\"https://arxiv.org/abs/1912.02636\">Qingxiang Wang’s works</a> but is generally not feasible yet.  From what I’m getting, the main problem is the context holes, which are “easy to understand/derive\" by readers. </p>\n<p>So I think we could instead start with a simpler task, namely porting proofs from other ITPs, e.g. Isabelle, to Lean. This should be more feasible since contexts in ITPs are mostly explicit. We could think of the problem input as some Lean statement (manual input), and the statement’s proof to the goal but in Isabelle. The output will be the statement’s proof in Lean.</p>\n<p>As in <a href=\"https://arxiv.org/abs/2102.06203\">Jesse Han’s PACT paper</a>, we saw the usefulness of GPTs in providing Lean proof. We can further integrate Isabelle proof embedding into such a network to increase the proof success rate, and hopefully, it will realistically help with porting. This should also be possible as GPT is known to work well even when integrated with image embeddings.</p>\n<p>It might be a stretch, but if this works well enough, the network can be the exploration guidance module in <a href=\"https://doi.org/10.1007/978-3-030-53518-6_1\">Szegedy’s  A Promising Path Towards Autoformalization and General Artificial Intelligence</a>.</p>\n<p>So what do you think about the idea? I'm still new to everything, so please do correct me if I said something wrong.</p>",
        "id": 266962729,
        "sender_full_name": "Tung Tran",
        "timestamp": 1641402847
    },
    {
        "content": "<p>Welcome! I don't know much about AI. But I'll just point out that there is an entire stream dedicated to <a class=\"stream\" data-stream-id=\"219941\" href=\"/#narrow/stream/219941-Machine-Learning-for-Theorem-Proving\">#Machine Learning for Theorem Proving</a>.</p>",
        "id": 266963009,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641402974
    },
    {
        "content": "<p>Also <a class=\"stream\" data-stream-id=\"274007\" href=\"/#narrow/stream/274007-lean-gptf\">#lean-gptf</a></p>",
        "id": 266963057,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641403000
    },
    {
        "content": "<p>Woah I didn't know about the streams, thank you!</p>",
        "id": 266965377,
        "sender_full_name": "Tung Tran",
        "timestamp": 1641404167
    },
    {
        "content": "<p>An approach which isn't machine learning based would be MMT, at <a href=\"http://uniformal.github.io\">uniformal.github.io</a>, though admittedly I don't know as much about it as I would like.</p>",
        "id": 266980668,
        "sender_full_name": "Sigma",
        "timestamp": 1641411561
    }
]