[
    {
        "content": "<p>Hello!  I am new to this but I have been working through tutorials and the libraries, and I am ready to start a project.<br>\nI would like to do something in mathematical physics.  My original hope was to start defining perturbative quantum field<br>\ntheory along the lines of Kevin Costello's book.  Or I might try something simpler, like classical mechanics of particles.<br>\nMy question is, are there any near-term plans to put any functional analysis into mathlib.  Even functions from R to R^k and<br>\nbasic calculus would be enough to do something.  I saw the topology definitions, Cauchy sequences and data.complex.exponential.<br>\nAre these the foundations that will be used, or is this up for discussion?  Has anyone outlined what this would look like ?  Thanks!</p>",
        "id": 171014255,
        "sender_full_name": "Michael R Douglas",
        "timestamp": 1563302095
    },
    {
        "content": "<p>I just found analysis.normed_space.deriv, will look at that now.  But clearly there is a long way to go.  Is there a plan?</p>",
        "id": 171016226,
        "sender_full_name": "Michael R Douglas",
        "timestamp": 1563303316
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"124175\">@Kevin Sullivan</span> is also working on physics related things.</p>",
        "id": 171018230,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1563304690
    },
    {
        "content": "<p>People have worked on the basics of topological/normed vector spaces, Banach spaces, but not much more.</p>",
        "id": 171018263,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1563304719
    },
    {
        "content": "<p>I'm not aware of any big road maps</p>",
        "id": 171018274,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1563304731
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"201575\">@Michael R Douglas</span> Also, welcome! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>",
        "id": 171018297,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1563304746
    },
    {
        "content": "<p>The mathematicians who have been around here the longest are people like me, Patrick and Johan, and none of us are analysts. So algebra and topology have forged ahead, rather leaving analysis behind. Sebastian Gouezel has recently started to put things right, but my understanding is that things are more subtle than one might naively expect. On the other hand there's plenty of analysis in other theorem provers so we just have to catch up.</p>",
        "id": 171018516,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1563304901
    },
    {
        "content": "<p>I'm not really an analyst either, but I would love to see some day Fourier transform and Sobolev spaces in Lean!</p>",
        "id": 171019460,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1563305553
    },
    {
        "content": "<p>The Bochner integral is currently under construction, which is where we intend to get multivariate calculus. The derivative is already mostly there, but neither one has been specialized for the real univariate case yet</p>",
        "id": 171020339,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1563306131
    },
    {
        "content": "<p>and they only work for Cauchy reals ;-)</p>",
        "id": 171021403,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1563306880
    },
    {
        "content": "<p>I may not have been sufficiently clear in the other thread because the point was to talk about transfer what-if scenarios, but I don't think we will ever have Dedekind reals in mathlib. Having multiple versions of a type like <code>real</code> is just asking for confusion and indecision. (Instead, we will show that <code>real</code> acts just like Dedekind reals in whatever way we need.)</p>",
        "id": 171022122,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1563307374
    }
]