[
    {
        "content": "<p>Localisation is there but I don't know if anyone specifically put the field of fractions there. What does one want? Just the statement that if you localise an integral domain at 0 then you get a field?</p>\n<p>GCD of an ideal -- does that always exist? I'd not heard of it before.</p>",
        "id": 157086615,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1548747030
    },
    {
        "content": "<p>It doesn't always have to exist. But that was the definition of the GCD we used in Algebra 1, and what is used in the proof of the Gauss Lemma I'm trying to write in lean.  </p>\n<p>Wikipedia also seems to use that definition. <a href=\"https://en.wikipedia.org/wiki/GCD_domain\" target=\"_blank\" title=\"https://en.wikipedia.org/wiki/GCD_domain\">https://en.wikipedia.org/wiki/GCD_domain</a></p>",
        "id": 157088982,
        "sender_full_name": "Aditya Agarwal",
        "timestamp": 1548750605
    },
    {
        "content": "<p>I would prefer working with the GCD being defined in terms of ideals because it lets me ignore multiplication by units.  However, working with the ordinary defintion doesn't create any insurmountable issue.</p>",
        "id": 157089092,
        "sender_full_name": "Aditya Agarwal",
        "timestamp": 1548750740
    },
    {
        "content": "<p>That link is only about GCD's of finite sets of elements, not arbitrary ideals. I vaguely remember some talk here about GCD domains a few months back.</p>",
        "id": 157090327,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1548752025
    },
    {
        "content": "<p>Whoops, yeah. I totally forgot the infintie case exists.</p>",
        "id": 157092574,
        "sender_full_name": "Aditya Agarwal",
        "timestamp": 1548754526
    },
    {
        "content": "<p>There is <a href=\"https://github.com/leanprover/mathlib/blob/master/src/algebra/gcd_domain.lean\" target=\"_blank\" title=\"https://github.com/leanprover/mathlib/blob/master/src/algebra/gcd_domain.lean\">https://github.com/leanprover/mathlib/blob/master/src/algebra/gcd_domain.lean</a> , but it seems to use the normal definition of GCD.</p>",
        "id": 157092671,
        "sender_full_name": "Aditya Agarwal",
        "timestamp": 1548754636
    },
    {
        "content": "<p>My memory was that the CS people at some stage wanted to choose a generator of every ideal or something. They think about stuff in really weird asymmetric ways.</p>",
        "id": 157093220,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1548755299
    },
    {
        "content": "<p>There was some discussion about whether it was possible to choose a generator of every principal ideal in a way compatible with multiplication, and it works great for some rings (eg choose the monic generator for poly rings and the non negative generator for the integers) but it can't be done in general</p>",
        "id": 157093322,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1548755442
    }
]