[
    {
        "content": "<p>Hello and thanks for helping with Lean. <br>\nI am undertaking to learn Geometric Algebra {ala David Hestenes) and I recognize that it may be most efficient to learn Linear Algebra first/concurrently (e.g., Alan McDonald's work). <br>\nI am an older adult independent learner so I would like to use Lean to \"check\" the proofs that I produce as I study Linear/Geometric Algebra.<br>\nWould one of you fine folks please direct me to the most appropriate resources for learning Lean within the stated context?<br>\nThanks for your time.</p>",
        "id": 223154034,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610996189
    },
    {
        "content": "<p>We have a list of resources for learning Lean <a href=\"https://leanprover-community.github.io/learn.html\">here</a>.</p>\n<p>Just a word of advice, with the current state of the art, it will most likely be extremely difficult to simultaneously learn a piece of new math while formalizing it. In most people's experience (though there may be one or two exceptions...), understanding the math inside and out is a necessary prerequisite before attempting a formalization of it.</p>",
        "id": 223154587,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1610996606
    },
    {
        "content": "<p>Thank you, Bryan. So are there any means for automated proof checking of student proofs? Or is this just a pipe dream?</p>",
        "id": 223154777,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610996750
    },
    {
        "content": "<p>It depends on what you mean. Have you tried the <a href=\"http://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/\">Natural Number Game</a>?</p>",
        "id": 223154949,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1610996871
    },
    {
        "content": "<p>I have Natural Number Game pulled up, but I have not started yet.<br>\nBy checking student proofs, I mean that when the text says prove that such and so is the case, given the following conditions, I can construct a proof in the theorem prover much as I would on paper (but using prover syntax, of course) and know that my proof is valid because the prover accepts it thus filling the role of instructor. I have thought about using Coq for this, but it seems like Lean might be more accessible. <br>\nAnyway, I will see what I can do with what's available.<br>\nThanks again for your time.</p>",
        "id": 223155654,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610997287
    },
    {
        "content": "<p>You might be interested in <a href=\"https://leanprover-community.github.io/mathlib_docs/find/exterior_algebra\">docs#exterior_algebra</a> and <a href=\"https://leanprover-community.github.io/mathlib_docs/find/clifford_algebra\">docs#clifford_algebra</a>, to get a feel for what is already formalized</p>",
        "id": 223155972,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1610997582
    },
    {
        "content": "<p>Thank you Eric; I will have a look.</p>",
        "id": 223156078,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610997662
    },
    {
        "content": "<p>The answer for mathlib, at least, is currently \"really not much\", but over at <a href=\"https://github.com/pygae/lean-ga/issues/13\">pygae/lean-ga#13</a> there's a fair bit more</p>",
        "id": 223156099,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1610997683
    },
    {
        "content": "<p>Thank you, I will have a look there also.</p>",
        "id": 223156188,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610997745
    },
    {
        "content": "<p>Lastly, you may be interested in the link I commented on <a href=\"https://github.com/leanprover-community/mathlib/issues/5059\">#5059</a> - I gave a talk at ICCA in collaboration with <span class=\"user-mention\" data-user-id=\"296911\">@Utensil Song</span> to try and sell GA researchers on Lean, and gave a summary of some approaches used to formalize geometric algebra in other theorem provers. You can find it on youtube here: <a href=\"https://m.youtube.com/watch?v=DX2n_-MD-A4\">https://m.youtube.com/watch?v=DX2n_-MD-A4</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"DX2n_-MD-A4\" href=\"https://m.youtube.com/watch?v=DX2n_-MD-A4\"><img src=\"https://i.ytimg.com/vi/DX2n_-MD-A4/default.jpg\"></a></div>",
        "id": 223156981,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1610998327
    },
    {
        "content": "<p>Excellent.<br>\nThanks for your dedication to GA; my instincts tell me that it is one of the proverbial keys to the kingdom (Homotopy Type Theory being another...).</p>",
        "id": 223157190,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610998518
    },
    {
        "content": "<p>You're welcome here but if you believe in homotopy type theory then you should probably learn about another proof assistant.</p>",
        "id": 223157562,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1610998810
    },
    {
        "content": "<p>Yes, lean's axiom system is incompatible with the univalence axiom of homotopy type theory. I wrote a rant recently in another thread arguing that homotopy type theory didn't seem to me to be offering much to formalisation of the kind of mathematics we're interested in here, but of course I am biased!</p>",
        "id": 223157781,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1610998996
    },
    {
        "content": "<p>Thank you, Patrick.<br>\nI am a long ways still from learning HOTT; I just think that it is the correct direction in which to head.<br>\nMy immediate concern is to get up to speed with Geometric Algebra so that I can apply it to undergrad physics and beyond but McDonald's work is all that I can find that seems targeted toward freshman mathematics and he takes a strict theorem-proof approach but doesn't provide answers in the text, hence my problem...</p>",
        "id": 223158091,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610999247
    },
    {
        "content": "<p>Thank you Kevin.</p>",
        "id": 223158116,
        "sender_full_name": "Robert Webb Jr.",
        "timestamp": 1610999267
    }
]