[
    {
        "content": "<p>(not exactly new here but I'm somewhat new to mathlib so posting in this stream)</p>\n<p>Hello! I'm a Master's student from UC San Diego studying with professor Sean Gao. I'm interested in helping out with the formalization of probability theory in the direction of Bayes Nets (and ultimately reinforcement learning theory), though I'm in no rush and willing to help out with any amount of groundwork needed beforehand. I wasn't a mathematics undergrad (more on the CS side), so I'm not technically a \"mathematician\", but as a grad student I'm certainly more interested in the formal side of things.</p>\n<p>I'm pretty much up to speed with the existing formalizations in <code>src/probability</code> (as well as the measure theory it's built on). I see some very interesting work being done recently with martingales, though this seems fairly independent from what I'd like to formalize (CMIIW). I suppose I have two main questions:</p>\n<ol>\n<li>Are there any streams I should join so I can stay up to speed with what others are working on here?</li>\n<li>Are there any \"primary references\" that we're basing our formalizations on? If so, what are the next things we're planning to formalize? I already have a pretty good idea of where I want to start, though I'm not sure if I'd be duplicating some existing work done in <code>src/measure_theory</code> or elsewhere.</li>\n</ol>",
        "id": 268296592,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1642440046
    },
    {
        "content": "<p>Hi! The main work on probability currently is this project <span class=\"user-mention\" data-user-id=\"243312\">@Jason KY.</span>  and I are working on: <a href=\"https://github.com/leanprover-community/mathlib/projects/15\">https://github.com/leanprover-community/mathlib/projects/15</a> . This is about martingales, as you mentioned. The goal is to prove Doob's various theorems and inequalities for martingales. As a bonus, it will give us a law of large numbers. Personally, I would like to get to concentration inequalities (Hoeffding's inequality for example), which are one of the main simple tools I use in my usual work (I work on bandit theory, so not so far from reinforcement learning). That means adding facts about moments and moment generating functions, linking the <code>independence</code> file (which is not used much yet) and those new concepts... There is much to do!</p>\n<p>You can join us on that project if you'd like, or if you are more interested in Bayesian results, you might want to start by implementing things related to conditional probability. We don't even have a definition for that (although it can be simply defined as a rescaling of <code>measure.restrict</code>). Bayes theorem would be a nice addition!</p>",
        "id": 268302871,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1642444374
    },
    {
        "content": "<p>And to answer the main questions:</p>\n<ul>\n<li>there are no streams you need to join. There are not many of us working on this yet, so we did not feel the need for a separate stream.</li>\n<li>we don't follow any book in particular. For the martingales project we picked a goal (Doob's maximal inequalities), then looked at various proofs to identify the other concepts we should implement first. For now we are implementing concepts so basic that any probability book on martingales has standard proofs for everything. Pick your favourite.</li>\n</ul>",
        "id": 268304210,
        "sender_full_name": "Rémy Degenne",
        "timestamp": 1642445346
    },
    {
        "content": "<p>Thank you very much! I think I'll get started right away with conditional probability (definition, Bayes' theorem, and some basic independence results) to get my feet wet, and eventually circle back around to Martingales as the law of large numbers seems like quite a fundamental result.</p>",
        "id": 268305019,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1642445882
    },
    {
        "content": "<p>BTW if any undergrads (or anyone else) wanted to work on this, do let me know (it seems like a pretty good place to start). I'm realizing I've got a bit more editor tweaking to do but I think I'll have something ready in the next couple days, and I'm just as happy to review as I am to contribute!</p>",
        "id": 268555304,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1642605976
    },
    {
        "content": "<p>Hello! Great to hear of new developments in mathlib's probability!</p>\n<p>As you already noticed, conditional expectations are there. <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>\n<p>In my opinion, a rather complementary view on condition is (regular) conditional distributions, and my feeling would be that mathlib should eventually have these defined via disintegration / probability kernels (as in e.g. Kallenberg \"Foundations of Modern Probability\", Chapter 8), which works well in Polish spaces. I don't know if that was your plan already, and if it wasn't I'm not necessarily suggesting it as the first thing. Now I mainly wanted to gauge others' opinions about whether there is agreement on the mathlib-generality and approach in such topics. (Since probability didn't make it to Bourbaki, the mathlibists will have to make some decisions without a canonical precedent.)</p>",
        "id": 268592373,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1642621018
    },
    {
        "content": "<p>The little that I know of Bayesian things, I nevertheless suspect that it is conditioning in the sense of conditional distributions rather than conditional expectations that is relevant; is that even correct? In that case I would suspect that whether the above mentioned generality is needed would depend on whether one works in a discrete setup or say in Polish spaces. In any case, I will be happy to see developments in these directions. Thanks in advance if you keep this Zulip posted about the developments!</p>",
        "id": 268592408,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1642621041
    },
    {
        "content": "<p>(As for background: I'm interested in probability and formalization, but at least the first half of this semester looks like I'm not really doing almost any Lean apart from a few examples in an undergraduate metric spaces course. As soon as I have the chance again, I will try to take responsibility and finish the portmanteau theorem and basics of convergence in distribution that have only been approximately 10% PR'd so far.)</p>",
        "id": 268592508,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1642621084
    },
    {
        "content": "<p>Alright I have some (very basic) first definitions/theorems for conditional probability up at: <a href=\"https://github.com/rish987/lean-bayes\">https://github.com/rish987/lean-bayes</a>.</p>\n<p>I may not be the best person at the moment to work on what Kalle has mentioned (though it certainly is interesting). This should at least be enough for me to get started on conditional independence next. In general I plan to formalize <em>Probabilistic Reasoning in Intelligent Systems</em> by Judea Pearl, filling in any extra needed proofs as I go.</p>\n<p>Let me know if what I have so far is anything close to what we had in mind. In particular let me know your thoughts on the type class wrapper I added for measurable sets. It has helped me clean things up a bit since having to explicitly pass around measurability conditions is quite cumbersome (especially when those are already implied by more specific conditions), but I suppose the value of this will become clearer as I formalize more.</p>\n<p>Not sure if a PR is a better place to discuss the specifics, but I can make one if we prefer that (Github username <code>rish987</code>). And also I am new to formalizing so don't hold back on any criticisms!</p>",
        "id": 268923821,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1642812271
    },
    {
        "content": "<p>Update: I have some basic <a href=\"https://github.com/rish987/lean-bayes/blob/3e0efba3fbaff5a4f76bada1f86d545a4a78ad51/src/probability_theory/conditional.lean#L168\">definitions of conditional independence</a> ready, and have gotten started on random variables, with <a href=\"https://github.com/rish987/lean-bayes/blob/3e0efba3fbaff5a4f76bada1f86d545a4a78ad51/src/probability_theory/random_variable.lean#L34\">a definition of joint and marginal distributions</a> and the marginalization principle.</p>\n<p>I think I'll make a PR as soon I've covered the rest of the basics and feel that things have settled a bit. In the meantime let me know if you notice anything that looks way off track!</p>",
        "id": 269684330,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1643343104
    },
    {
        "content": "<p>Great, having good ways to talk about these would be very nice!</p>\n<p>I don't have much to say and I haven't had time to carefully look at your code. But I did want to say I like that your choices contain a concrete answer to <a href=\"#narrow/stream/217875-Is-there.20code.20for.20X.3F/topic/the.20law.20of.20a.20random.20variable.20is.20a.20probability.20measure/near/248151189\">a question I had a long while ago</a> about how to talk about the laws of random variables. Your use of <a href=\"https://leanprover-community.github.io/mathlib_docs/find/measure_theory.measure.map\">docs#measure_theory.measure.map</a> is the natural thing in my opinion, too. In the thread of the same question, there was some discussion of getting the dot notation to work with these push-forwards of measures, but as far as I understand, no one has done that yet. If it can be made work, I think it might be an improvement to how we talk about the laws of random variables in mathlib in general.</p>\n<p>In any case, great to see that you are pushing mathlib's probability theory to the directions that it will work for Bayesian things.</p>",
        "id": 269895376,
        "sender_full_name": "Kalle Kytölä",
        "timestamp": 1643498525
    },
    {
        "content": "<p>The proofs for <a href=\"https://github.com/rish987/lean-bayes/blob/ff754374a9b9393bc3daaeaa547ba86f41e9be00/src/probability_theory/random_variable.lean#L359\">independence and conditional independence of random variables</a> are finally sorry-free. There are certainly more basics to cover, but this already feels like a very solid foundation. I've got some academic logistics to take care of for the next few weeks but I'll get started right away on cleaning this up and PRing it piece by piece! And as always let me know if you have any thoughts/suggestions.</p>",
        "id": 271728055,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1644728964
    },
    {
        "content": "<p>What's <code>&gt;&gt;[]</code> notation for there?</p>",
        "id": 271738329,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1644746589
    },
    {
        "content": "<p>That's just for converting from one <code>pi_subtype</code> set to another, for example <code>set (Π i : A, β i)</code> to <code>set (Π i : A ∪ B, β i)</code>. When I PR this I think I'll reframe everything in <code>pi_subtype.lean</code> as an extension to the library for <a href=\"https://leanprover-community.github.io/mathlib_docs/find/subtype.restrict\">docs#subtype.restrict</a>.</p>",
        "id": 271750592,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1644765366
    },
    {
        "content": "<p>Maybe you shouldn't use <code>Π i : A, β i</code>, then. This sounds like subtype hell to me.</p>",
        "id": 271750792,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644765667
    },
    {
        "content": "<p>Perhaps, haha I didn't know we had an expression for this. For me though this was the most natural thing. If I'm using the marginal distribution on <code>A</code>, I don't want to have to convert a marginal assignment <code>set (Π i : A, β i)</code> to be over the full index type <code>set (Π i : ι, β i)</code> every time, that feels like a different kind of hell. I only want to have to define things for the marginalized variables. I could use <code>set (Π i ∈ A, β i)</code>, but that would be pretty much equivalent to using a subtype, right?</p>",
        "id": 271751583,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1644766805
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"373814\">Rish Vaishnav</span> <a href=\"#narrow/stream/113489-new-members/topic/Getting.20started.20contributing.20to.20probability.20theory/near/271751583\">said</a>:</p>\n<blockquote>\n<p>I don't want to have to convert a marginal assignment <code>set (Π i : A, β i)</code> to be over the full index type <code>set (Π i : ι, β i)</code> every time, that feels like a different kind of hell.</p>\n</blockquote>\n<p>Why not? Do you know about the concept of junk values?</p>",
        "id": 271753497,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644769363
    },
    {
        "content": "<p>Btw, your line 132 could use docs#forall₂_congr and your lines 143-144 could use docs#forall₄_congr.</p>",
        "id": 271755370,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644772030
    },
    {
        "content": "<p>So the idea is that partial functions are a pain to work with (you constantly have to prove that your argument to a partial function lies inside the domain), so instead we turn functions total by making them return a junk value, typically <code>a / 0 = 0</code>.</p>",
        "id": 271755594,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644772305
    },
    {
        "content": "<p>This makes stuff much easier to handle, and some theorems end up even \"truer\". For example, <code>(a + b)/c = a/c + b/c</code> without needing <code>c</code> nonzero, or less trivially Rolle's theorem doesn't require the function to be differentiable! (because the derivative has junk value <code>0</code>).</p>",
        "id": 271755788,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644772555
    },
    {
        "content": "<p>Most of your code is actually about those subtyping issues. If you make your functions total, then you can fully get rid of <code>probability_theory.pi_subtype</code> and greatly simplify most proofs.</p>",
        "id": 271755849,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1644772647
    },
    {
        "content": "<p>I really don't think this is a good approach in this situation.</p>",
        "id": 271755913,
        "sender_full_name": "Reid Barton",
        "timestamp": 1644772742
    },
    {
        "content": "<p>Or in most situations.</p>",
        "id": 271755916,
        "sender_full_name": "Reid Barton",
        "timestamp": 1644772747
    },
    {
        "content": "<p>But here it doesn't even seem to be applicable--since we are talking about a set of functions on a subset, we can just replace it with the set of all total functions that restrict to a member of the set on that subset.</p>",
        "id": 271755999,
        "sender_full_name": "Reid Barton",
        "timestamp": 1644772855
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387244\">Yaël Dillies</span> <a href=\"#narrow/stream/113489-new-members/topic/Getting.20started.20contributing.20to.20probability.20theory/near/271755849\">said</a>:</p>\n<blockquote>\n<p>Most of your code is actually about those subtyping issues. If you make your functions total, then you can fully get rid of <code>probability_theory.pi_subtype</code> and greatly simplify most proofs.</p>\n</blockquote>\n<p>I'm not sure this would simplify the <code>probability_theory</code> proofs that much. For one thing it would certainly complicate the definition</p>\n<div class=\"codehilite\" data-code-language=\"Lean\"><pre><span></span><code><span class=\"kd\">def</span> <span class=\"n\">marginal</span> <span class=\"o\">(</span><span class=\"n\">mv</span> <span class=\"o\">:</span> <span class=\"n\">set</span> <span class=\"n\">ι</span><span class=\"o\">)</span> <span class=\"o\">:</span> <span class=\"n\">measure</span> <span class=\"o\">(</span><span class=\"bp\">Π</span> <span class=\"n\">i</span> <span class=\"o\">:</span> <span class=\"n\">mv</span><span class=\"o\">,</span> <span class=\"n\">β</span> <span class=\"n\">i</span><span class=\"o\">)</span> <span class=\"o\">:=</span> <span class=\"n\">joint</span> <span class=\"n\">μ</span> <span class=\"o\">(</span><span class=\"n\">pi_subtype</span> <span class=\"n\">mv</span> <span class=\"n\">f</span><span class=\"o\">)</span>\n</code></pre></div>\n<p>(which is just <code>measure.map (λ a i, (pi_subtype mv f) i a) μ</code>). Though of course we won't know unless we try it, unfortunately I'm a bit pressed for time for the next few weeks. FWIW it hasn't really felt like hell yet, and I think it could be good to have a solid library for working with pi subtypes. Going to start PRing pieces of this, perhaps that will be a better place to discuss.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"110032\">Reid Barton</span> <a href=\"#narrow/stream/113489-new-members/topic/Getting.20started.20contributing.20to.20probability.20theory/near/271755999\">said</a>:</p>\n<blockquote>\n<p>But here it doesn't even seem to be applicable--since we are talking about a set of functions on a subset, we can just replace it with the set of all total functions that restrict to a member of the set on that subset.</p>\n</blockquote>\n<p>Not sure this is the best way either -- I'd imagine in many cases when using joint distributions, you're <em>already</em> working with a subtype of indices from some type. If we were to do this then we'd have to deal with curried pis for the joint distribution and uncurried pis for the marginal, which sounds confusing by itself.</p>",
        "id": 271998842,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1644942292
    },
    {
        "content": "<p>I've got two PRs up recently (<a href=\"https://github.com/leanprover-community/mathlib/pull/12279\">#12279</a> and <a href=\"https://github.com/leanprover-community/mathlib/pull/12343\">#12343</a>), though it looks like I can't set the <code>awaiting-review</code> label -- would someone mind giving me that permission, <code>rish987</code> on Github. Thanks!</p>",
        "id": 273414425,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1645982021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"373814\">@Rish Vaishnav</span> Invite sent. You will need to resubmit your PRs; for technical reasons we can only accept PRs originating from branches in the mathlib repo itself</p>",
        "id": 273414520,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1645982155
    },
    {
        "content": "<p>that is, push your branch to mathlib, and then reopen the PR for merging the branch into master</p>",
        "id": 273414582,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1645982200
    },
    {
        "content": "<p>Thank you! Will do.</p>",
        "id": 273414622,
        "sender_full_name": "Rish Vaishnav",
        "timestamp": 1645982279
    },
    {
        "content": "<p>Is the reason for only accepting mathlib branches is bors and CI?</p>",
        "id": 273416041,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1645983974
    },
    {
        "content": "<p>Yes, but CI is a deal breaker given the current state of the repo</p>",
        "id": 273417407,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645985856
    },
    {
        "content": "<p>The reason is CI, and more specifically that we want our infrastructure to upload oleans for PR branches so that reviewers can more easily check out the code.</p>\n<p>(Bors is totally fine with PRs from external repos).</p>",
        "id": 273417457,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1645985899
    },
    {
        "content": "<p>I figured, just wanted to make sure I understand. Thanks.</p>",
        "id": 273423815,
        "sender_full_name": "Jireh Loreaux",
        "timestamp": 1645994247
    }
]