[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span>, welcome! You'll eligible for the Giry test: do you know what is the Giry monad?</p>",
        "id": 177903909,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570798410
    },
    {
        "content": "<p>Oh crap: he left. I hope it's not because of the Giry joke. <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span> this was a joke about computer scientists who like to pretend they think probability theory is the study of the <a href=\"https://ncatlab.org/nlab/show/Giry+monad\" target=\"_blank\" title=\"https://ncatlab.org/nlab/show/Giry+monad\">Giry monad</a>, an arcane part of category theory. But you're very welcome to formalize actual probability theory!</p>",
        "id": 177906063,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570800063
    },
    {
        "content": "<p>I was emailed by a computer scientist from Harvard earlier this week, who sent me a preprint in statistical learning theory where they have formalised some basic results from this area in Lean. I took a look through the paper and the first thing I noticed was that <span class=\"user-mention\" data-user-id=\"116448\">@Koundinya Vajjha</span> was a co-author (which probably explained the Lean) but also that they talk extensively about the Giry monad. So there really are people out there who know what it is (but I think none of the authors were mathematicians...)</p>",
        "id": 177928417,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1570814374
    },
    {
        "content": "<p>Yeah that preprint was an outgrowth of my internship at Oracle Labs. The computer scientist who emailed you was probably Jean-Baptiste Tristan?</p>",
        "id": 177929384,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1570814976
    },
    {
        "content": "<p>Indeed! Is it posted online anywhere? I was pleasantly surprised to see Giry monads in there, for me and Patrick they are becoming a running joke, I have asked several mathematicians about them (including a Fields Medallist and another highly prestigious person) and none of them have ever heard of them!</p>",
        "id": 177929559,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1570815078
    },
    {
        "content": "<p>No it's not posted online yet! And the Giry monad is really quite pleasant. It's a pity they haven't heard of it.</p>",
        "id": 177929668,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1570815131
    },
    {
        "content": "<p>I guess many mathematicians haven't even heard of filters ;-)</p>",
        "id": 177929767,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1570815215
    },
    {
        "content": "<p>but a lot more of them haven't heard of monads.</p>",
        "id": 177929779,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1570815228
    },
    {
        "content": "<p>At least we hear the word</p>",
        "id": 177929786,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570815236
    },
    {
        "content": "<p>Yeah I consider myself a mathematician (who formalizes) and it's really when you see the Giry monad in action to construct product measures, say, you realize how cool it is. :-)</p>",
        "id": 177929915,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1570815320
    },
    {
        "content": "<p>Maybe I'm saying it wrong. How do you pronounce \"Giry\"?</p>",
        "id": 177929921,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1570815325
    },
    {
        "content": "<p>I don't think the Giry monad is relevant to mainstream mathematicians in probability theory, as we most often work with infinite sequences of random variables. For instance, the first theorem in a probability course is the law of large numbers, saying that if <code>X_n</code> is a sequence of integrable independent identically distributed random variables, then <code>(X_0+...+X_{n-1})/n</code> converges almost surely to the average of <code>X_0</code>. I was under the impression that this can not be conveniently expressed with the Giry monad, but I would be happy to be corrected if I am wrong!</p>",
        "id": 177931461,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1570816343
    },
    {
        "content": "<p>Note that the law of large numbers is one of the 5 remaining theorems on Freek100.</p>",
        "id": 177931644,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1570816460
    },
    {
        "content": "<p>Johannes used to talk about the Ionescu-Tulcea theorem which allows one to construct Markov processes using the Giry monad for probability measures.</p>",
        "id": 177931717,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1570816511
    },
    {
        "content": "<blockquote>\n<p>Note that the law of large numbers is one of the 5 remaining theorems on Freek100.</p>\n</blockquote>\n<p>Well, I have proved in Isabelle the Birkhoff theorem, which is a far reaching generalization of the law of large numbers...</p>",
        "id": 177938092,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1570820377
    },
    {
        "content": "<blockquote>\n<p>Johannes used to talk about the Ionescu-Tulcea theorem which allows one to construct Markov processes using the Giry monad for probability measures.</p>\n</blockquote>\n<p>If you want to look at a Markov process in finite time, the Giry monad is perfect (and essentially designed for this, I would say). But if you want a theorem talking about the process over all times, I don't think it is the right tool.</p>",
        "id": 177938280,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1570820463
    },
    {
        "content": "<p>How much work would it be to specialize the Birkhoff theorem to the law of large numbers?</p>",
        "id": 177938608,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1570820683
    },
    {
        "content": "<p>Not that much. But given all the theory that Johannes and Jeremy have already developed to prove the (much harder) central limit theorem, it would probably be even quicker to formalize one of the classical proofs of the law of large numbers -- and this would just be an exercise, really.</p>",
        "id": 177942119,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1570822972
    },
    {
        "content": "<p>I had never heard of the Giri monad. And now that I had a quick look at the page, I am not really less perplexed than before</p>",
        "id": 177947495,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1570826647
    },
    {
        "content": "<p>To me randomness feels more like the IO monad from Haskell, an unknowable process that ends up producing a real number at the end ...</p>",
        "id": 177947609,
        "sender_full_name": "Vincent Beffara",
        "timestamp": 1570826759
    },
    {
        "content": "<p>If you know monads from Haskell you're half way through understanding that Giry stuff.</p>",
        "id": 177947973,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570827000
    },
    {
        "content": "<p>And soon you'll be able to do probability theory the right way <span aria-label=\"lol\" class=\"emoji emoji-1f606\" role=\"img\" title=\"lol\">:lol:</span></p>",
        "id": 177948053,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1570827024
    },
    {
        "content": "<p>I think that the Giry monad is essentially the formalization of your intuition, <span class=\"user-mention\" data-user-id=\"242586\">@Vincent Beffara</span></p>",
        "id": 177970968,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1570856219
    },
    {
        "content": "<p>I'm not sure the definition itself provides much knowledge, but the idea that you can view random variables as a monad makes it really clear how to use them in diverse ways</p>",
        "id": 177971031,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1570856322
    },
    {
        "content": "<blockquote>\n<p>Not that much. But given all the theory that Johannes and Jeremy have already developed to prove the (much harder) central limit theorem, it would probably be even quicker to formalize one of the classical proofs of the law of large numbers -- and this would just be an exercise, really.</p>\n</blockquote>\n<p>Is it really that easy? If we're talking about the strong law of large numbers, I believe the proof is quite tricky. According to Terry Tao:</p>\n<blockquote>\n<p>The weak law is easy to prove, but the strong law (which of course implies the weak law, by Egoroff’s theorem) is more subtle, and in fact the proof of this law (assuming just finiteness of the first moment) usually only appears in advanced graduate texts. </p>\n</blockquote>\n<p><a href=\"https://terrytao.wordpress.com/2008/06/18/the-strong-law-of-large-numbers/\" target=\"_blank\" title=\"https://terrytao.wordpress.com/2008/06/18/the-strong-law-of-large-numbers/\">https://terrytao.wordpress.com/2008/06/18/the-strong-law-of-large-numbers/</a></p>",
        "id": 178130757,
        "sender_full_name": "Floris van Doorn",
        "timestamp": 1571080982
    },
    {
        "content": "<p>No, the strong law of large numbers is not easy, but it is not hard either. The proof takes less than two pages in standard textbooks (for instance Billingsley, probability and measure), and all the supporting material is already formalized, so I am pretty sure I could do it in a few hours, say.</p>",
        "id": 178131912,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1571081786
    }
]