[
    {
        "content": "<p>Hello all, I am a professor of Economics in the US. I have been watching Kevin’s videos, and I would like to try a similar teaching experience with some of undergraduates and graduate students- to formalize some of our basic microeconomic theory results.</p>\n<p>I am very new to Lean, and just working through some basics at the moment.</p>",
        "id": 264295599,
        "sender_full_name": "Greg Leo",
        "timestamp": 1639054207
    },
    {
        "content": "<p>Hi! What are examples of these basic results?</p>",
        "id": 264297527,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639055189
    },
    {
        "content": "<p>We tend to start with relations that represent “preferences”. We assume some basic axioms and build up from there. One early goal I can imagine is formalizing the “Debreu Theorems” which are various statements about the representation of these preference relations  by real-valued functions</p>",
        "id": 264299049,
        "sender_full_name": "Greg Leo",
        "timestamp": 1639055933
    },
    {
        "content": "<p>Just looking on <a href=\"https://en.wikipedia.org/wiki/Debreu_theorems\">the Wikipedia page</a> it looks like this should be fine to do in Lean 3 if you use its maths library mathlib.</p>",
        "id": 264299326,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639056073
    },
    {
        "content": "<p>Excellent. After reading a bit yesterday, what’s what I installed. I am going to work through the natural number game and some examples on relations in the documentation today.</p>",
        "id": 264300017,
        "sender_full_name": "Greg Leo",
        "timestamp": 1639056346
    },
    {
        "content": "<p>To be honest, as far as teaching goes, I think even proving some simple results about relations will be instructive for my students- especially my undergrads. I loved how you relate using Lean to playing levels of a game. I think this could help get some students interested in mathematics.</p>",
        "id": 264300304,
        "sender_full_name": "Greg Leo",
        "timestamp": 1639056468
    },
    {
        "content": "<p>I often use the same analogy when I solve models for my class using some live-coding style lectures I do with lyx (a latex frontend) and mathematica.</p>",
        "id": 264300491,
        "sender_full_name": "Greg Leo",
        "timestamp": 1639056549
    },
    {
        "content": "<p>Hello! I have an ongoing project to formalize some basic ideas from Rational Choice Theory and Social Choice Theory in my repository <a href=\"https://github.com/asouther4/lean-social-choice\">lean-social-choice</a>. The repo is a bit messy right now, but you may find some of the work helpful. Feel free to reach out with any questions or ideas. Notably, I have formalized Arrow's Impossibility Theorem. Now, I am working to formalize a current ongoing research project in Voting Theory.</p>\n<p>Eventually, I hope to branch out and formalize some Game Theory or classic Micro Theory. I would love to hear how some of this work pans out for you!</p>",
        "id": 264635811,
        "sender_full_name": "Andrew  Souther",
        "timestamp": 1639332862
    }
]