[
    {
        "content": "<p>Hi, I am exploring the space of proof assistants and got pointed to Lean  from the <a href=\"https://categorytheory.zulipchat.com/#narrow/stream/229111-general/topic/Cat.20theory.20in.20type.20theory\">category theory zulip channel</a> via a <a href=\"https://www.youtube.com/watch?v=1NUc-ZNC_2s&amp;list=PLlF-CfQhukNlxexiNJErGJd2dte_J1t1N&amp;index=15\">youtube presentation</a> by Scott Morison. (That's all I now at present).  It looks very nice. <br>\nThe <a href=\"https://leanprover.github.io/theorem_proving_in_lean/introduction.html\">Lean Doc says</a> </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"1NUc-ZNC_2s\" href=\"https://www.youtube.com/watch?v=1NUc-ZNC_2s&amp;list=PLlF-CfQhukNlxexiNJErGJd2dte_J1t1N&amp;index=15\"><img src=\"https://i.ytimg.com/vi/1NUc-ZNC_2s/default.jpg\"></a></div><blockquote>\n<p>A prior version, Lean 2, had special support for homotopy type theory. </p>\n</blockquote>\n<p>which of course raises the question if that has been integrated into Lean 3, or if that is a dead end project, or if something even better was planned (e.g. <a href=\"https://ncatlab.org/nlab/show/modal+homotopy+type+theory\">Modal HoTT</a>)?  I was just curious.</p>",
        "id": 211455238,
        "sender_full_name": "Henry Story",
        "timestamp": 1601273998
    },
    {
        "content": "<p>There is a project doing some HoTT in Lean3: <a href=\"https://github.com/gebner/hott3\">https://github.com/gebner/hott3</a>, but it is not particularly active.</p>",
        "id": 211456876,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601275832
    },
    {
        "content": "<p>It demonstrates that it is possible, but there doesn't appear to be much interest in pursuing it at the moment.</p>",
        "id": 211456893,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601275857
    },
    {
        "content": "<p>I had just found that, following a link <a href=\"https://cubical.systems/\">from this page</a>. :-)</p>",
        "id": 211456924,
        "sender_full_name": "Henry Story",
        "timestamp": 1601275877
    },
    {
        "content": "<p>Most of the community of mathematicians working with Lean are very happy to work in classical foundations (well, if \"classical\" includes dependent type theory), and are more interested in doing \"mathematics\" as usually practiced.</p>",
        "id": 211457029,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601275934
    },
    {
        "content": "<p>That said, for a mathematician to learn the basics of dependent type theory, the first few chapters of the HoTT book are great, even if you have no interested in univalence.</p>",
        "id": 211457063,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601275976
    },
    {
        "content": "<p>yes, I agree, the first few chapters of the HoTT book are great. <br>\nI am actually coming from programming background in Scala (Odersky pointed me to HoTT 6 years ago) and so I have made a detour through Category Theory.</p>",
        "id": 211457235,
        "sender_full_name": "Henry Story",
        "timestamp": 1601276119
    },
    {
        "content": "<p>I'm a mathematician, but my programming background is partially in scala. A bit of a strange language, but I do like it. Lean is better, though, and Lean4 will actually be a proper programming language (not just a proof assistant), so all the scala folks should come join us. :-)</p>",
        "id": 211458354,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601277112
    },
    {
        "content": "<p>Very cool! When will that come out? <br>\nTwo key features would be compiling to JavaScript and I believe to Web Assembly (I have not used WAssembly yet - and know little of it - but as I understand it could allow one to write very efficient reasoners for the browser, something I am interested for the semantic web. My understanding is that Web Assembly can be thought of as a new type of bytecode. As I understand it also allows one to compile existing c programs to it).</p>",
        "id": 211459820,
        "sender_full_name": "Henry Story",
        "timestamp": 1601278429
    },
    {
        "content": "<p>Lean3 itself compiles to Wasm, this is what you see at <a href=\"https://leanprover-community.github.io/lean-web-editor/\">https://leanprover-community.github.io/lean-web-editor/</a></p>",
        "id": 211460281,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1601278725
    },
    {
        "content": "<p>(Lean 3 is a C++ program)</p>",
        "id": 211460296,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1601278740
    },
    {
        "content": "<p>There is no release date for Lean 4, but the first alpha version seems pretty close.</p>",
        "id": 211460346,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1601278785
    },
    {
        "content": "<p>And indeed the situation with HoTT is: many people here would love to see it usable, but it currently isn't, so we play with what works today. This is not proof assistant specific. There is no sizable library of general mathematics formalized in HoTT, in any proof assistant. General mathematics here means what you learn in an undergrad math degree. Existing HoTT-based libraries are all about category theory and even more about HoTT for its own sake.</p>",
        "id": 211460520,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1601278909
    },
    {
        "content": "<p>About Wasm, don't expect your web browser to execute Lean at any speed comparable to the native speed of course.</p>",
        "id": 211460601,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1601278959
    },
    {
        "content": "<p>It's very helpful to know that the browser version is running wasm. That's helping me see what wasm is capable of :-)<br>\nI am very interested in proofs mostly for security reasoning. That's also why I have been looking to Modal HoTT as security reasoning can be seen as a form of modal logic. See  e.g. Martin Abadi's work (An MS fellow) such as <a href=\"https://www.sciencedirect.com/science/article/pii/S1571066107000746\">Access Control in a Core Calculus of Dependency</a>. That should be doable with CoC based tools as it only requires Indexed Strong Monads, but I like to know what I may be missing <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> .</p>",
        "id": 211462224,
        "sender_full_name": "Henry Story",
        "timestamp": 1601280174
    },
    {
        "content": "<p>Modal logic per se doesn't need any HoTT, of course, and has various partial formalizations in standard proof assistants.</p>",
        "id": 211465819,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1601282834
    },
    {
        "content": "<p>yes, David Corefield who wrote the (philosophically oriented) book <a href=\"https://golem.ph.utexas.edu/category/2020/02/modal_homotopy_type_theory_the.html\">Modal HoTT</a> only gets to the latest HoTT work in the last chapter of the book. But his key point as I understand is that modalities arise out of adjunction of slice categories.<br>\nAs I understand the Modal HoTT work is showing how all modalities such as linearity, ... can be brought under one roof. But it's over my head at present. I need to become fluent in proof assistants to get to understand that first :-)</p>",
        "id": 211466476,
        "sender_full_name": "Henry Story",
        "timestamp": 1601283297
    }
]