[
    {
        "content": "<p>Hi all!</p>\n<p>I'm a graduate student at MIT. I'm new to Lean, but I've been interested in learn about Lean (and might actually get onto it now that it's summer). Anyway, I have a few talented high school students (i.e. comfortable with a good chunk of undergraduate math) and they've been looking for stuff to do over the summer. It seems to me that this might be an appropriate place for them to find something to contribute to - but I'm a bit unfamiliar as to  what's already done / being worked on etc. I would really appreciate it if someone could give me some pointers. </p>\n<p>Thanks!</p>",
        "id": 167856716,
        "sender_full_name": "Chun Hong Lo",
        "timestamp": 1560264242
    },
    {
        "content": "<p>Welcome!</p>",
        "id": 167857052,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264440
    },
    {
        "content": "<p>Most of us mathematicians are struggling quite hard to formalise basic things (-;</p>",
        "id": 167857089,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264474
    },
    {
        "content": "<p>I'm not exactly sure what kind of contributions you are thinking of... mathematical things or more recreational things?</p>",
        "id": 167857181,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264512
    },
    {
        "content": "<p>To give you an idea: at the moment it is a gigantic task to show that the derivative of <code>exp</code> is <code>exp</code>. And indeed, this task has not been done yet.</p>",
        "id": 167857228,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264545
    },
    {
        "content": "<p>On the other hand, we have some pretty advance commutative algebra done</p>",
        "id": 167857262,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264568
    },
    {
        "content": "<p>So the library is very skewed.</p>",
        "id": 167857270,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560264575
    },
    {
        "content": "<p>To be honest I'm not sure what kind of contributions I'm thinking of either. Is there a place where I can see something like 'ongoing tasks' / 'what we have so far' etc.?</p>",
        "id": 167857974,
        "sender_full_name": "Chun Hong Lo",
        "timestamp": 1560265064
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/pulls?page=1&amp;q=is%3Apr+is%3Aopen\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/pulls?page=1&amp;q=is%3Apr+is%3Aopen\">https://github.com/leanprover-community/mathlib/pulls?page=1&amp;q=is%3Apr+is%3Aopen</a></p>",
        "id": 167858065,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1560265102
    },
    {
        "content": "<p><a href=\"https://github.com/leanprover-community/mathlib/commits/master\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/commits/master\">https://github.com/leanprover-community/mathlib/commits/master</a></p>",
        "id": 167858074,
        "sender_full_name": "Kenny Lau",
        "timestamp": 1560265108
    },
    {
        "content": "<p>This seems like what I've been looking for. Thanks!</p>",
        "id": 167859631,
        "sender_full_name": "Chun Hong Lo",
        "timestamp": 1560266098
    },
    {
        "content": "<p>Are you in the maths department there?</p>",
        "id": 167868974,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560272367
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span> will be at MIT next semester; he's a big contributor to mathlib.</p>",
        "id": 167869000,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560272390
    },
    {
        "content": "<p>Yeah! I've talked to Kenny - in fact he recommended me to show up in this chat</p>",
        "id": 167893159,
        "sender_full_name": "Chun Hong Lo",
        "timestamp": 1560289473
    },
    {
        "content": "<blockquote>\n<p>To give you an idea: at the moment it is a gigantic task to show that the derivative of <code>exp</code> is <code>exp</code>. And indeed, this task has not been done yet.</p>\n</blockquote>\n<p>Is it really a gigantic task? This is just a question of showing a power series can be differentiated term by term within its radius of convergence. I guess we're still waiting for the differentiation API but <em>gigantic</em>? Isn't it just a bit tedious and long?</p>",
        "id": 167893387,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560289679
    },
    {
        "content": "<p>Very recently there's been a bit of interest here in the <a href=\"http://www.cs.ru.nl/~freek/100/\" target=\"_blank\" title=\"http://www.cs.ru.nl/~freek/100/\">100 theorems</a> list. A lot of easy items on the list haven't been done, and there's quite a range of potential projects.</p>",
        "id": 167893448,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289702
    },
    {
        "content": "<p>For example proving that the harmonic series diverges might be a good first project.</p>",
        "id": 167893471,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289733
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224911\">@Chun Hong Lo</span> that would make a very interesting project. For many of the theorems on the list, people here would know in theory how to do it, it's just finding the time.</p>",
        "id": 167893475,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560289739
    },
    {
        "content": "<p>Many people here have got their own projects that they're working on.</p>",
        "id": 167893501,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560289758
    },
    {
        "content": "<p>(Also see <a href=\"https://github.com/leanprover-community/mathlib/blob/100-thms/docs/100-theorems.md\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/blob/100-thms/docs/100-theorems.md\">https://github.com/leanprover-community/mathlib/blob/100-thms/docs/100-theorems.md</a>, <a href=\"http://bim.shef.ac.uk/lean/hundred_theorems.html\" target=\"_blank\" title=\"http://bim.shef.ac.uk/lean/hundred_theorems.html\">http://bim.shef.ac.uk/lean/hundred_theorems.html</a>.)</p>",
        "id": 167893519,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289792
    },
    {
        "content": "<p>One issue is that many of these are kind of useless from a math library perspective, but for a first project that's not necessarily such a bad thing</p>",
        "id": 167893613,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289868
    },
    {
        "content": "<p>In fact I know from experience that many first projects by beginners are in no shape at all to go into a maths library.</p>",
        "id": 167893640,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560289917
    },
    {
        "content": "<p>So we can just point to it and say someone did it, and that's fine</p>",
        "id": 167893708,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289956
    },
    {
        "content": "<p>And the student gets to make the number go up</p>",
        "id": 167893717,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560289967
    },
    {
        "content": "<p>The theorems are mostly useless but the library building needed to prove the theorems are not</p>",
        "id": 167894910,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1560290993
    },
    {
        "content": "<p>Thanks for all the references -- it makes sense that first projects by beginners are unlikely to be appropriate for the maths library but that's absolutely fine. I'll probably be back with more concrete questions later, once I learn some of the basics first :)</p>",
        "id": 167896254,
        "sender_full_name": "Chun Hong Lo",
        "timestamp": 1560292313
    },
    {
        "content": "<p>There's also the issues list, <a href=\"https://github.com/leanprover-community/mathlib/issues\" target=\"_blank\" title=\"https://github.com/leanprover-community/mathlib/issues\">https://github.com/leanprover-community/mathlib/issues</a>, which I'd love to see become a clearing house for good problems for newcomers to work on.</p>",
        "id": 167896659,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1560292601
    },
    {
        "content": "<p>I have some random mathematical issues which I still didn't add to the issues page, but the problem is that all of them will involve creating some new structures, and there is an art to this which a beginner probably will not have.</p>",
        "id": 167897399,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560293191
    },
    {
        "content": "<p>Ok, maybe <em>gigantic</em> was a bit of an exaggeration. But it is definitely a lot more work than a mathematician would naively expect it to be.</p>",
        "id": 167915119,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560315042
    },
    {
        "content": "<p>Hi all, I'm new too, and my uninformed opinion is that analysis is much harder to formalize than algebra, topology, category theory... because of the many different definitions one could make about such simple objects as <code>exp</code>.  As someone remarked on MathOverflow, <code>exp</code> has three natural definitions: power series, inverse to log=\\int dx/x, and lim(1+x/n)^n. If we want to prove a specific fact about <code>exp</code>, we could choose the easiest definition for that purpose; but for a formalization project, we'd need to have all three, and prove their equivalence. It's further complicated by the fact <code>exp</code> is also a complex-analytic object.</p>\n<p>Same goes with (constructions of) real numbers.</p>",
        "id": 167954674,
        "sender_full_name": "Yao Liu",
        "timestamp": 1560351364
    },
    {
        "content": "<p>I know of 3 different definitions of the p-adic integers...</p>",
        "id": 167955178,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1560351716
    },
    {
        "content": "<p>The good thing is that all the different definitions of exp are actually equal (and not just isomorphic)</p>",
        "id": 167965246,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560357667
    },
    {
        "content": "<p>I think one thing that is perhaps holding up analysis is that maybe we don't know (at least I certainly don't know) what the optimum level of generality is. For example it wouldn't be hard to prove the theorems from a real analysis course on convergent series, but it's clearly not the right level of generality.</p>",
        "id": 167975215,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560364825
    },
    {
        "content": "<p>But I never learned enough analysis to know what the correct level of generality is</p>",
        "id": 167975247,
        "sender_full_name": "Reid Barton",
        "timestamp": 1560364855
    },
    {
        "content": "<p>Johannes made multivariate polynomials but it became clear quickly that we still needed single-variable ones so Chris made them too.</p>",
        "id": 167975397,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560364960
    },
    {
        "content": "<p>I think I did them wrong though. All the structure should have come from <code>mv_polynomial</code> first to shorten the theory</p>",
        "id": 167975462,
        "sender_full_name": "Chris Hughes",
        "timestamp": 1560365035
    },
    {
        "content": "<p>Exactly. An obvious first goal would be the fundamental theorem of calculus, and there already are multiple issues with the level of generality, the least of which being: Are functions real-valued or complex-valued (if you have Cauchy's integral formula in mind), or as Bourbaki would have it, taking values in a topological vector space? I always felt this was excessive, but when I did sit down and try to write it down, that's what I ended up too...</p>\n<p>Do remember that Bourbaki (or Weil in particular) started out trying to write a text for analysis, which finally came after volumes of algebra and topology—though it was only \"functions of a single real variable\" and doesn't seem to have much on convergence of series, if I recall. It's probably at the \"optimum level of generality\" as it gets, being Bourbaki after all.</p>\n<p>Not totally unrelated, there is a rumor that Bourbaki was working on a volume on differentiable manifolds, and Grothendieck wanted to base it on sheaves and categories... they ended up with only a \"summary of results\" on manifolds. We all wonder what it would have been like if Grothendieck had his way.</p>",
        "id": 167979897,
        "sender_full_name": "Yao Liu",
        "timestamp": 1560368059
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> has a pretty good idea</p>",
        "id": 167979945,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1560368109
    },
    {
        "content": "<p>Analytic functions in several variables are done in proper generality for instance in Mujica, complex analysis in Banach spaces (see the first chapter there). But this will be so much more complicated than one single variable that I think it is definitely worth it to do a separate theory in one variable (first, and probably keep it forever). Complex analysis in one variables also has several features that simply do not exist in several variables.</p>",
        "id": 167983689,
        "sender_full_name": "Sebastien Gouezel",
        "timestamp": 1560370701
    }
]