[
    {
        "content": "<p>If someone else's PR has changed a file, I know how to see this on the \"Files changed\" page on <a href=\"http://github.com\">github.com</a> and how to highlight one or more lines to suggest changes.  If a file hasn't been changed by the PR what's the appropriate way to suggest a change to it?  (For example, if the PR is failing CI with an \"Unchanged files with check annotations\" error, and I want to suggest a fix to that file.)</p>",
        "id": 271452879,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1644509146
    },
    {
        "content": "<p>If it were my own PR I could just checkout the branch, commit the change, and push the commit.  But on someone else's PR this feels impolite (although the intention is to save them the trouble of finding and fixing the problem).  So this is partly a how-to-use-github question and partly an etiquette question.</p>",
        "id": 271454015,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1644509569
    },
    {
        "content": "<p>Ignoring the topic of etiquette: there's no way to make a suggestion that github will recognize as such in this case - your options are:</p>\n<ul>\n<li>Make a regular comment indicating roughly where to make the change</li>\n<li>Pushing to the branch</li>\n<li>Making a PR against the PR branch</li>\n</ul>",
        "id": 271454462,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1644509771
    },
    {
        "content": "<p>Ignoring the topic of etiquette: there's no way to make a suggestion that github will recognize as such in this case - your options are:</p>\n<ul>\n<li>Make a regular comment indicating roughly where to make the change</li>\n<li>Push to the branch</li>\n<li>Make a PR against the PR branch</li>\n</ul>",
        "id": 271454472,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1644509776
    },
    {
        "content": "<p>What I usually do is to branch out from the person's branch, change what I want to suggest, then opening a PR into the person's branch</p>",
        "id": 271454492,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1644509786
    }
]