[
    {
        "content": "<p><strong>MWE:</strong></p>\n<div class=\"codehilite\"><pre><span></span><code> <span class=\"kn\">example</span> <span class=\"o\">:</span> <span class=\"n\">can_write_tactics</span> <span class=\"n\">Rocky</span> <span class=\"o\">:=</span> <span class=\"n\">sorry</span><span class=\"o\">,</span>\n</code></pre></div>\n\n\n<p><strong>More Context</strong><br>\nI want to learn how to write tactics. I have ideas for tactics that could be useful, and it seems like tactic writing is a scarce skill in the community. I've read the tactic writing guide a few times, but a lot of it still goes over my head. I don't have an extensive background in functional programming or type theory. Are there any other resources I should look at? Should I wait until I understand Lean better by writing more proofs? General advice for learning how to write tactics? I've heard a chapter of Mathematics in Lean will cover tactic writing eventually.</p>",
        "id": 197826207,
        "sender_full_name": "ROCKY KAMEN-RUBIO",
        "timestamp": 1589682750
    },
    {
        "content": "<p>There's some more info on tactic writing in the <a href=\"https://leanprover-community.github.io/learn.html#textbooks\">Hitchhiker's guide</a>. I can't say what will make you into a tactic writer since I'm not such a person myself, but I've certainly learned a lot from studying the code of various tactics in core Lean and mathlib.</p>",
        "id": 197826569,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1589683421
    },
    {
        "content": "<p>Start reading the source code of tactic implemented in mathlib.</p>",
        "id": 197828632,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589687371
    },
    {
        "content": "<p>Start telling us (here, for example), ideas for new tactics, and we can tell you \"sounds hard\"/\"ill-specified\"/\"sounds like a good first project\". :-)</p>",
        "id": 197828676,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1589687415
    },
    {
        "content": "<p>Write some simple examples. Write an <code>assumption</code> tactic. Go through the logic solver example in Programming In Lean and fix it up!</p>",
        "id": 197837933,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1589704720
    }
]