[
    {
        "content": "<p>Hello, I installed lean using elan, but it isn't working. I installed the new version of python 3.10 and I installed vscode. When I open the introduction project in vscode, on the right in \"lean infoview\" where lean should be checking the proof, it just says \"loading...\"</p>",
        "id": 272986021,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1645638706
    },
    {
        "content": "<p>To precise, <code>leanproject get-m</code> on the tutorial project and <code>leanproject get-c</code> on mathlib don't print out anything.</p>",
        "id": 272986188,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1645638775
    },
    {
        "content": "<p>Usually \"loading\" indicates that you didn't open the root directory of a correctly formatted lean project with VS Code's \"open folder\" functionality.</p>",
        "id": 272998919,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645644266
    },
    {
        "content": "<p>If that isn't it, can you confirm that you installed following the instructions on the community website rather than Microsoft's website?</p>",
        "id": 272999016,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1645644315
    },
    {
        "content": "<p>I managed to install it successfully today after installing wsl</p>",
        "id": 273838360,
        "sender_full_name": "Jovan Gerbscheid",
        "timestamp": 1646240052
    },
    {
        "content": "<p>Good evening everyone,<br>\nI have been trying to install LEAN locally on my windows computer by following the tutorial that was posted here: <a href=\"https://leanprover-community.github.io/install/windows.html\">https://leanprover-community.github.io/install/windows.html</a><br>\nHowever, when I run 'pip3 install mathlibtools' I continue to get an error message :</p>\n<p>Exception: ERROR: The 'make' utility is missing from PATH</p>\n<hr>\n<p>ERROR: Failed building wheel for pynacl<br>\n  Running setup.py clean for pynacl<br>\nFailed to build pynacl<br>\nERROR: Could not build wheels for pynacl which use PEP 517 and cannot be installed directly</p>\n<p>I've googled and looked through the tutorials but none of the solutions I've seen have worked. Anyone have any suggestions?</p>",
        "id": 300710563,
        "sender_full_name": "Marco Campos",
        "timestamp": 1664160905
    }
]