[
    {
        "content": "<p>Hey all! My name is Nathan; I'm a third year PhD student at IU Bloomington. I work in algebraic and arithmetic geometry, and I've recently become interested in Lean. I've done the natural numbers game and the Lean tutorial, and I figured the best way to get started was the just jump right in! I'd like to help implement some facts about elliptic curves. A reasonable amount of progress can be made by simply doing algebraic manipulations with Weierstrass equations, but to really do it justice, one needs a fair amount of algebraic geometry machinery, e.g. curve/function field duality, divisors, Riemann-Roch, etc. It looks like some scheme theory has been implemented, but there's certainly a lot to do.</p>\n<p>Any advice on how to get started or other resources would be greatly appreciated!</p>",
        "id": 270897067,
        "sender_full_name": "Nathanial Lowry",
        "timestamp": 1644163604
    },
    {
        "content": "<p>There's a group of people at Imperial working on Mordell-Weil. I suspect you'd be welcome to join them or to get ideas from them about related things to do next. <span class=\"user-mention\" data-user-id=\"464700\">@David Ang</span> ?</p>",
        "id": 270897509,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644164185
    },
    {
        "content": "<p>Welcome!!<br>\nThe <a href=\"https://leanprover-community.github.io/\">community website</a> has a lot of good material on how to get started. In particular, the \"Documentation\" and \"Contributing\" sections of the left menu may offer some practical guidance <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 270897585,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1644164286
    },
    {
        "content": "<p>I think the plan is group cohomology, Galois cohomology, Mordell-Weil, Tate-Shafarevich and Selmer groups.</p>",
        "id": 270897594,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644164305
    },
    {
        "content": "<p>Riemann-Roch is a long way off because we don't have sheaf cohomology for schemes, you could think about that but it's a bit of a harsh project for a beginner.</p>",
        "id": 270897646,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644164403
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"475338\">@Nathanial Lowry</span> Welcome! Here is the current status of Mordell-Weil: <a href=\"https://github.com/leanprover-community/mathlib/blob/mordell_weil/src/algebraic_geometry/EllipticCurve/mordell_weil.lean\">https://github.com/leanprover-community/mathlib/blob/mordell_weil/src/algebraic_geometry/EllipticCurve/mordell_weil.lean</a></p>",
        "id": 270898961,
        "sender_full_name": "David Ang",
        "timestamp": 1644166269
    },
    {
        "content": "<p>Indeed, currently the main block is associativity of the group law because we don't have Riemann-Roch, but we also need some theory of local fields which I suspect should be a more feasible as a first project?</p>",
        "id": 270899167,
        "sender_full_name": "David Ang",
        "timestamp": 1644166529
    },
    {
        "content": "<p>I believe someone else is working on group and Galois cohomology, and once those are done, things like Selmer groups should be immediate (assuming associativity of course)</p>",
        "id": 270899234,
        "sender_full_name": "David Ang",
        "timestamp": 1644166639
    },
    {
        "content": "<p>A theory of local fields might be a really cool first project.</p>",
        "id": 270904060,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644172292
    },
    {
        "content": "<p>Great! I took a class using Serre's local fields last year, so that's still pretty fresh in my mind</p>",
        "id": 270904998,
        "sender_full_name": "Nathanial Lowry",
        "timestamp": 1644173456
    },
    {
        "content": "<p>If you are in number theory you may be interested in the <code>flt-regular</code> project (Fermat last theorem for regular primes). Any contribution is very welcome!</p>",
        "id": 270905440,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1644174015
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"475338\">Nathanial Lowry</span> <a href=\"#narrow/stream/113489-new-members/topic/Introduction.20.2B.20algebraic.2Farithmetic.20geometry/near/270904998\">said</a>:</p>\n<blockquote>\n<p>Great! I took a class using Serre's local fields last year, so that's still pretty fresh in my mind</p>\n</blockquote>\n<p>Great idea! <br>\n<a href=\"#narrow/stream/116395-maths/topic/Krull.20topology.20on.20Galois.20groups/near/270762221\">https://leanprover.zulipchat.com/#narrow/stream/116395-maths/topic/Krull.20topology.20on.20Galois.20groups/near/270762221</a></p>",
        "id": 270908427,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1644177389
    },
    {
        "content": "<p>My post-doc <span class=\"user-mention\" data-user-id=\"406490\">@María Inés de Frutos Fernández</span> just defined the adeles and ideles, and stated the main theorem of global class field theory; one target could be stating the corresponding local theorem so we could have local-global compatibility. Of course this will be a lot of work, e.g. you'd have to prove that the completion of a number field at a prime was a local field etc.</p>",
        "id": 270908535,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644177502
    },
    {
        "content": "<p>Do we have the definition of a local field anywhere? What’s the current status?</p>",
        "id": 270908830,
        "sender_full_name": "David Ang",
        "timestamp": 1644177753
    },
    {
        "content": "<p>The current status is that a few days ago Adam proposed that \"we use Serre's definition, whatever it is\" and since then probably nobody did anything.</p>",
        "id": 270908854,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644177796
    },
    {
        "content": "<p>Serre starts with DVRs and Dedekind domains, both of which we have, although I strongly suspect that he proves lemmas that we don't have. We don't have Frobenius elements in Galois groups AFAIK. Chapter 2: we have Haar measure and completion. We don't have anything about finite extensions AFAIK, or structure of complete DVRs, although we do have Witt vectors. It would be interesting to fill in the remaining holes in the first two chapters although this would be a lot of work. I don't think he's mentioned the phrase \"local field\" yet!</p>",
        "id": 270909118,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1644178098
    },
    {
        "content": "<p>I learned local class field theory via central simple algebras (which seems not in mathlib) at IUB from Darrell Haile using Falko Lorenz's <em>Algebra, Volume II</em> (which I think is a very nice reference), but he has now retired.</p>",
        "id": 270909585,
        "sender_full_name": "Junyan Xu",
        "timestamp": 1644178706
    }
]