[
    {
        "content": "<p>Hi everyone <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span><br>\nAs a late introduction (and shameless advertisement, I hope this is allowed...) I would like to share my project: A proof that Basic Modal Logic has Craig Interpolation: <a href=\"https://github.com/m4lvin/tablean\">https://github.com/m4lvin/tablean</a><br>\nThe proof uses a tableau system and is relatively easy, though it took me quite some time to formalise while learning Lean as I went along. Big thanks go out to the many people here on zulip who helped me!<br>\nMy motivation and long term goal is an open question, or a rather messy situation in the literature: Does Propositional Dynamic Logic (PDL, a much more complicated modal logic than Basic Modal Logic) have Craig Interpolation?<br>\nAt least three proof( attempt)s for this have been (more or less) published, but none seems to be generally accepted. One of them (Borzechowski 1988) I translated from German to English, but am still really unsure whether it works. So a formalisation would be a great way to settle the confusion.<br>\nMy next goal for now is to simplify and improve the proof/code (any suggestions are welcome!) before making it more complicated again by moving to more expressive modal logics. For now I am happy that I managed to finish this small first milestone.<br>\nThanks again for making Lean, mathlib, the nice documentation, and for all the help!</p>",
        "id": 283370674,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1653336779
    },
    {
        "content": "<p>I will give a short presentation about this at Advances in Modal Logic in a month, here is the five page paper that was accepted: <a href=\"https://malv.in/2022/AiML2022-basic-modal-interpolation-lean.pdf\">https://malv.in/2022/AiML2022-basic-modal-interpolation-lean.pdf</a></p>",
        "id": 290480120,
        "sender_full_name": "Malvin Gattinger",
        "timestamp": 1658479558
    }
]