[
    {
        "content": "<p>Hello,<br>\nI would like to be able to, in vim/neovim, jump to the definitions of the functions I use. Lean is not supported by ctags, so I can't use it to generate tags. Is there some other way to generate tags for Lean or to get the \"jump to definition\"-functionality?<br>\nI know Julian has this functionality in lean.nvim, but I don't want all of the other stuff his plugin has.</p>\n<p>Best,<br>\nSimon</p>",
        "id": 286490101,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655473058
    },
    {
        "content": "<p>I think that \"not wanting all the other stuff this plugin has\" isn't a wise move. And I'm sure you can opt out of certain things if it does a bit too much.</p>",
        "id": 286490904,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1655473432
    },
    {
        "content": "<p>Okay, so you are not aware of any other way of doing it, <span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> ?</p>",
        "id": 286492748,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655474302
    },
    {
        "content": "<p>No.</p>",
        "id": 286495452,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1655475429
    },
    {
        "content": "<p>Okay, thanks for the input</p>",
        "id": 286495574,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655475486
    },
    {
        "content": "<p>Did you stumble upon <a href=\"https://github.com/rish987/lean_ctags\">https://github.com/rish987/lean_ctags</a>?</p>",
        "id": 286499103,
        "sender_full_name": "Mauricio Collares",
        "timestamp": 1655477056
    },
    {
        "content": "<p>This looks like it could be useful, will take a look!</p>",
        "id": 286500544,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655477725
    },
    {
        "content": "<p>I agree with Patrick, even grudgingly :), since before I wrote the plugin I thought I was ok with very minimal things -- but even if you want to go your own way, I think you'll be happier with LSP support rather than just ctags, since it will give you more accurate jump to definition, even if you choose to do nothing else. You can do this \"directly\" with <code>nvim-lspconfig</code>, since we were sure when writing <code>lean.nvim</code> to contribute that upstream. Of course on the other hand if you do choose to still use <code>lean.nvim</code>, as Patrick says, if you want to turn everything off (the infoview, say), it's perfectly well supported  and essentially leaves you in the same state but with the ability to add in other functionality later. E.g. using Lean without abbreviations support is not much fun. But do what makes you happy :)</p>",
        "id": 286508069,
        "sender_full_name": "Julian Berman",
        "timestamp": 1655481011
    },
    {
        "content": "<p>Maybe you guys are right.<br>\nI have also tried setting up lean.nvim but could not get the LSP to connect. That is likely a problem on my part though. I may try again this weekend.</p>",
        "id": 286510407,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655482050
    },
    {
        "content": "<p>If you have setup issues please share/complain about them -- I think the install instructions are clear but if they aren't I very much want them to be. The most likely reason for the LSP not connecting is not installing <code>lean-language-server</code>. But yeah let me know.</p>",
        "id": 286511660,
        "sender_full_name": "Julian Berman",
        "timestamp": 1655482657
    },
    {
        "content": "<p>I knew I had lean-language-server  installed. But will try again and open a new topic if I get the same problem!</p>",
        "id": 286512761,
        "sender_full_name": "Simon Jacobsson",
        "timestamp": 1655483200
    },
    {
        "content": "<p>There is a VSCode extension called VSCode Neovim (<a href=\"https://github.com/vscode-neovim/vscode-neovim/\">https://github.com/vscode-neovim/vscode-neovim/</a>) which I'd highly recommend for Vim/Neovim users. It embeds Neovim inside VSCode (unlike VSCode Vim which only emulates Vim behavior inside VSCode) and it works perfectly with the Lean extension.</p>\n<p>With the extension, if you press <code>K</code> in normal mode, a small window with type information and some documentation about the term under the cursor will appear. If your cursor is over a tactic, a small window with documentation about the tactic will appear instead. This shortcut has exactly the same effect as hovering the mouse over the term/tactic (with the added bonus of not having to take your hands away from the keyboard). This is example of the Neovim extension working perfectly with the Lean extension, because <code>K</code> is a Vim/Neovim normal mode shortcut that opens the manual page for the word under the cursor.</p>\n<p>Also like in Vim/Neovim (particularly, like in the help files), you can press <code>&lt;c-]&gt;</code> (<code>ctrl+]</code>) to jump to the definition of the term/tactic under the cursor in normal mode. Again like in Vim/Neovim, you can then press <code>&lt;c-o&gt;</code> and <code>&lt;c-i&gt;</code> to jump forwards and backwards in the cursor position history, even between multiple files, making it extremely easy to jump to a definition, then another, then another, then back to your own code. Another example of the Neovim extension working perfectly with the Lean extension (and more convenient than pressing <code>&lt;f12&gt;</code>)!</p>\n<p>I've used this extension ever since I started using Lean. As far as I can tell it behaves perfectly well together with the Lean extension and it makes using VSCode almost exactly like using Vim/Neovim (almost, see <a href=\"https://github.com/vscode-neovim/vscode-neovim/issues/936\">https://github.com/vscode-neovim/vscode-neovim/issues/936</a> for one of the rare examples where it doesn't act exact like Vim/Neovim).</p>\n<p>I think this extension (or maybe even the more popular Vim emulation extension VSCode Vim) should be mentioned in <a href=\"https://leanprover-community.github.io/get_started.html\">https://leanprover-community.github.io/get_started.html</a> or another page that a beginner is likely to read when getting started with Lean. Since Lean doesn't have an official Vim/Neovim extension, it would be nice to inform people that they can get the best of both words with this VSCode extension. People who use Emacs or Vim/Neovim get so much convenience out of their editor that I perfectly understand why some may rather sacrifice the convenience of a proof assistant extension instead of sacrificing the convenience of their (amazing, objectively superior) text editor.</p>",
        "id": 286991573,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1655858664
    },
    {
        "content": "<p>You're probably right to point it out as a good option. For what it's worth, all the things you mention work with <code>lean.nvim</code> too :P, so I'd like to think at this point it's a good option too. But I also think as Lean is growing we'll grow more and more good options, competition (and choice, and symbiosis) is very very good.</p>",
        "id": 287070673,
        "sender_full_name": "Julian Berman",
        "timestamp": 1655911823
    },
    {
        "content": "<p>Idly by the way, on your vscode-neovim ticket --</p>\n<blockquote>\n<p>ctrl+m in any mode behaves exactly the same way as enter.</p>\n</blockquote>\n<p>This isn't 100% true anymore, or at least it optionally isn't true. <code>neovim</code> now <a href=\"https://github.com/neovim/neovim/pull/18181\">supports CSI</a>, and if your terminal supports it, as e.g. Kitty does, the keys are separate -- I have no idea what kind of terminal emulation support vscode is going with, but it should likely at least consider doing something like that as well.</p>",
        "id": 287071513,
        "sender_full_name": "Julian Berman",
        "timestamp": 1655912169
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"321696\">@Julian Berman</span> very interesting, I was unaware of that. I guess my claim about <code>ctrl+m</code> only applies to more traditional terminal emulators then.</p>\n<p>I'll definitely check <code>lean.nvim</code> out too. Although VSCode Neovim is pretty good, I honestly rather just one Neovim. <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 287123093,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1655937619
    }
]