[
    {
        "content": "<p>Sorry, I'm going to make a bunch of threads because I have some questions haha<br>\nI'm thinking of working through this text in lean <a href=\"https://smile.amazon.com/Real-Analysis-Constructive-Mark-Bridger/dp/0471792306\">https://smile.amazon.com/Real-Analysis-Constructive-Mark-Bridger/dp/0471792306</a> , would that be a good choice?</p>",
        "id": 268746485,
        "sender_full_name": "Andre Popovitch",
        "timestamp": 1642707694
    },
    {
        "content": "<p>You can use Lean for this, but using mathlib would be very painful and frustrating because that library is not constructive.</p>",
        "id": 268746716,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642707824
    },
    {
        "content": "<p>I see, do you have any advice for learning real analysis in a way that wouldn't be painful in lean? Or can I follow that book and just not use mathlib?</p>",
        "id": 268748040,
        "sender_full_name": "Andre Popovitch",
        "timestamp": 1642708445
    },
    {
        "content": "<p>When you say \"real analysis\" do you mean \"real analysis as taught in maths departments\" or \"constructive real analysis\"? These are very different things</p>",
        "id": 268748727,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642708771
    },
    {
        "content": "<p>I personally would say that lean is not a good tool for learning any kinds of mathematics at all</p>",
        "id": 268748790,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642708802
    },
    {
        "content": "<p>I'm specifically commenting the word \"constructive\" in the book title</p>",
        "id": 268748835,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642708809
    },
    {
        "content": "<p>Kevin, I learned order theory, convex analysis and additive combinatorics using Lean!</p>",
        "id": 268748940,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1642708835
    },
    {
        "content": "<p>I would say that it's better to learn the mathematics in the traditional way and then engage with it in lean once you understand it</p>",
        "id": 268748970,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642708851
    },
    {
        "content": "<p>Yael, you also went to the international mathematics Olympiad so what works for you might not be a good measure of what works for others</p>",
        "id": 268749028,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642708885
    },
    {
        "content": "<blockquote>\n<p>When you say \"real analysis\" do you mean \"real analysis as taught in maths departments\" or \"constructive real analysis\"?</p>\n</blockquote>\n<p>Doesn't really matter to me, I'm just trying to learn more math</p>\n<blockquote>\n<p>I personally would say that lean is not a good tool for learning any kinds of mathematics at all</p>\n</blockquote>\n<p>:( that's too bad, I really enjoyed the natural number game for learning about the naturals, and I wanted to do the same thing for reals</p>",
        "id": 268749681,
        "sender_full_name": "Andre Popovitch",
        "timestamp": 1642709152
    },
    {
        "content": "<p>I would recommend trying the community tutorial then.  <a href=\"https://github.com/leanprover-community/tutorials\">#tutorials</a></p>",
        "id": 268750144,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642709338
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Just.20finished.20the.20game.2C.20what.20to.20do.20next/near/268748790\">said</a>:</p>\n<blockquote>\n<p>I personally would say that lean is not a good tool for learning any kinds of mathematics at all</p>\n</blockquote>\n<p>Didn't you say in your popular talk that Lean is great for teaching freshmen about what a mathematical proof is?</p>",
        "id": 268753451,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642710857
    },
    {
        "content": "<p>This probably isn't the best book to use if your main interest is in learning how real analysis is conventionally done, just because the approach taken in this book isn't what's normally taught.  But after skimming through the preview that's available on Google Books I think you could learn a lot by formalising this in Lean.  In Chapter 1 the author goes very slowly step by step through the process of defining \"intervals of rational numbers\", proving properties of them, and picking out special families of these intervals that will play the role of real numbers.  The fact that he's working constructively might actually be helpful to you, since it may be easier for you to imitate the same constructions and definitions in your formalisation.</p>",
        "id": 268756468,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642712266
    },
    {
        "content": "<p>If you do decide to follow this path I'd suggest you start by working through the definitions and exercises in Chapter 0 (some of which will be repeating things you've already done in the game).</p>",
        "id": 268756777,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642712407
    },
    {
        "content": "<p>Then when you come to formalise Chapter 1 you'll learn lots about how to define structures in Lean, how to define operations that take these objects as inputs and outputs (for example, the addition function on rational intervals in Definition 1.1.8), and how to use typeclasses to talk about properties of your structures (for example, to assert that there's an interval that plays the role of \"zero\").</p>",
        "id": 268758172,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642713026
    },
    {
        "content": "<p>And of course if it does turn out to be horribly frustrating as others have warned then you can always give it up and turn to another book instead, or just study real analysis in a more conventional way.  But I think it's worth the experiment.</p>",
        "id": 268758601,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642713211
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> IIRC, your main thesis was \"Lean is the right way to do math.\" ; not \"Lean is the right thing to do in addition to doing math / after having learnt math.\" . Maybe I am pulling out a strawman, I don't know.</p>",
        "id": 268758773,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642713289
    },
    {
        "content": "<p>There's no such thing as \"the right way\" to do mathematics, of course. And there is a big difference between learning about the concept of proof, and what constitutes one (a necessary first step in advanced mathematics), and learning specific proofs and proof techniques.</p>",
        "id": 268760148,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1642713896
    },
    {
        "content": "<p>My experience has been that the more fluent I become in Lean, the easier it gets to learn mathematics with it. Understanding mathematical concepts while type-checking terms in my head \"at the same time\" often becomes a mental mess <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 268762161,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642714767
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"422543\">@Stuart Presnell</span> thank you for the advice, I'll give in a try and report back :p</p>",
        "id": 268772664,
        "sender_full_name": "Andre Popovitch",
        "timestamp": 1642720993
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"417654\">Martin Dvořák</span> <a href=\"#narrow/stream/113489-new-members/topic/Just.20finished.20the.20game.2C.20what.20to.20do.20next/near/268753451\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Just.20finished.20the.20game.2C.20what.20to.20do.20next/near/268748790\">said</a>:</p>\n<blockquote>\n<p>I personally would say that lean is not a good tool for learning any kinds of mathematics at all</p>\n</blockquote>\n<p>Didn't you say in your popular talk that Lean is great for teaching freshmen about what a mathematical proof is?</p>\n</blockquote>\n<p>I might have had different opinions in 2019 before I spent a year studying these ideas with a qualified math education specialist.</p>",
        "id": 268772998,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642721202
    },
    {
        "content": "<p>Is Lean no longer used in the introductory mathematical-proving class for freshmen at Imperial? Do you still teach the class?</p>",
        "id": 268776838,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642723803
    },
    {
        "content": "<p>I use it in different ways now. I teach the maths first in a regular way and then show people how to do it in Lean afterwards</p>",
        "id": 268777561,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642724302
    },
    {
        "content": "<p>The problem with \"here is the definition of an equivalence relation, let me show you right now what it looks like in Lean, let's do some simple examples all in Lean, isn't this cool\" is that the students who would usually struggle with the concepts when taught in the usual way are likely to be struggling even more when presented with the added obfuscation of a theorem prover. This was one of the things we learnt after experimenting. Better to teach it in a regular way and then give an optional class where you do it in lean <em>afterwards</em>.</p>",
        "id": 268777774,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642724475
    },
    {
        "content": "<p>I don't understand the emotions I am experiencing right now.</p>",
        "id": 268778311,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642724772
    },
    {
        "content": "<p>Note that all this might change in the future</p>",
        "id": 268778337,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642724802
    },
    {
        "content": "<p>Improved tooling could make this a great thing for education</p>",
        "id": 268778358,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642724818
    },
    {
        "content": "<p>People are actively working on making it a tool for high school teaching.</p>",
        "id": 268778392,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642724836
    },
    {
        "content": "<p>Kevin is observing that right now, using it in a 1st year course is not working.</p>",
        "id": 268778413,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1642724857
    },
    {
        "content": "<p>And it's already a great tool when you first teach stuff in the usual way and then have students redo it in Lean. This is what I've been doing for four years.</p>",
        "id": 268778433,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642724879
    },
    {
        "content": "<p>Do you think it's plausible to think about a test/control experiment with some students being asked to do it in Lean and some informally with pen and paper?</p>",
        "id": 268778639,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642725027
    },
    {
        "content": "<p>Are you asking me or Kevin?</p>",
        "id": 268779827,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642725871
    },
    {
        "content": "<p>Both actually, or anyone who might have input on this</p>",
        "id": 268779921,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642725949
    },
    {
        "content": "<p>Just as a little remark: I think I have written more proofs in Lean and Isabelle than informally by hand so far, mostly because in my math courses we rather rarely get to see a proof or even develop one ourselves, and while I feel like being exposed to theorem provers rather early on (I first did a little bit of stuff with Isabelle close to the end of my 1st semester) did definitely give me a better understanding of the logic and reasoning part I don't at all feel competent enough to write proofs about the things we do in our math courses in Lean vs doing them informally on paper. Although that might also be because as mentioned above my math courses don't tend to stick to the entire proof stuff as much after all.</p>\n<p>Just my 5 cents on the usefulness of ITPs in teaching^^</p>",
        "id": 268780037,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1642726016
    },
    {
        "content": "<p>After only 3 months of exposure to formal proofs (I had absolutely no experience with this subject previously), I can observe a huge impact on my way of thinking about mathematics. I am now more aware of things that I unconsciously took for granted while writing informal proofs</p>",
        "id": 268780878,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642726354
    },
    {
        "content": "<p>Hm well maybe I never felt that change because I didnt develop much intution for informal proofs before doing ITP stuff  <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> I certainly do observe that lots of other students in my classes struggle with writing a proof whenever it comes up while I don't</p>",
        "id": 268781031,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1642726478
    },
    {
        "content": "<p>I would love to education science people doing some rigorous assessment of the impact of my course, but so far I haven't found interested people who have time to do it.</p>",
        "id": 268781415,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642726794
    },
    {
        "content": "<p>Might be just a matter of time (I hope not too much)</p>",
        "id": 268781818,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642726904
    },
    {
        "content": "<blockquote>\n<p>I teach the maths first in a regular way and then show people how to do it in Lean afterwards</p>\n</blockquote>\n<p>I see. I remember you talking about a tool that allowed you to turn a lean source file into a nicely-formatted website, does that still exist?</p>",
        "id": 268802607,
        "sender_full_name": "Andre Popovitch",
        "timestamp": 1642748089
    },
    {
        "content": "<p>Note that what Kevin’s experience suggests is that you shouldn’t try to teach a whole class via Lean because the struggling students will struggle more. It doesn’t tell us that you <em>as an individual student</em> shouldn’t use Lean as part of your studying. You may well find, as others in this thread have reported, that the extra rigour of using Lean improves your understanding — for example, by preventing you from skimming over things you only half understand and then getting stuck later.</p>",
        "id": 268803242,
        "sender_full_name": "Stuart Presnell",
        "timestamp": 1642748868
    },
    {
        "content": "<p>In contrast with Kevin's (new) opinion, I found a thesis that suggests that students should learn formal proving in Coq first, and only then proceed to usual mathematical proofs. It is intended as plan for CS students, but nevertheless, it could be interesting to compare with opinions of various people here.</p>\n<p><a href=\"https://publishup.uni-potsdam.de/opus4-ubp/frontdoor/deliver/index/docId/42379/file/boehne_diss.pdf\">https://publishup.uni-potsdam.de/opus4-ubp/frontdoor/deliver/index/docId/42379/file/boehne_diss.pdf</a></p>\n<p><a href=\"/user_uploads/3121/NUV2nicX18xb20_ZdlNI6NWk/students_start_Coq.png\">students_start_Coq.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/NUV2nicX18xb20_ZdlNI6NWk/students_start_Coq.png\" title=\"students_start_Coq.png\"><img src=\"/user_uploads/3121/NUV2nicX18xb20_ZdlNI6NWk/students_start_Coq.png\"></a></div>",
        "id": 268890647,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642792880
    },
    {
        "content": "<p>Martin, maybe we should clarify that Kevin and I are very much aware that all this is very much an open research question (in education science). And we certainly hope that more research will be conducted, and more tools will be developed to lower the entry price into formal proofs.</p>",
        "id": 268891281,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642793211
    },
    {
        "content": "<p>I should have mentioned; it is in Chapter 7. Alternatively, you can read similar thing here: <a href=\"https://arxiv.org/pdf/1803.01466v1.pdf\">https://arxiv.org/pdf/1803.01466v1.pdf</a></p>",
        "id": 268891509,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642793337
    },
    {
        "content": "<p><a href=\"/user_uploads/3121/edYUo0w-M1G8CNt30SgCAATQ/students_start_Coq_exam_scores.png\">students_start_Coq_exam_scores.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/edYUo0w-M1G8CNt30SgCAATQ/students_start_Coq_exam_scores.png\" title=\"students_start_Coq_exam_scores.png\"><img src=\"/user_uploads/3121/edYUo0w-M1G8CNt30SgCAATQ/students_start_Coq_exam_scores.png\"></a></div>",
        "id": 268892195,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642793684
    },
    {
        "content": "<p>Is anybody interested in continuing the conversation about the educational stuff? If so, I'd fork this conversation.</p>",
        "id": 268892290,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642793734
    },
    {
        "content": "<p>I love to compare those figures to those achieved by AI, like GPT-f, because the latter always are a bit underwhelming, but put into context they become pretty good!</p>",
        "id": 268892481,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1642793821
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"417654\">@Martin Dvořák</span> You could share this research on the <a class=\"stream\" data-stream-id=\"187764\" href=\"/#narrow/stream/187764-Lean-for-teaching\">#Lean for teaching</a> stream</p>",
        "id": 268892513,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1642793844
    },
    {
        "content": "<p>I was about to point out this stream</p>",
        "id": 268892619,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642793895
    },
    {
        "content": "<p>I should also say that I saw infinitely many more papers about using proof assistants to teach computer science than math, and the comments made there always seemed very hard to transpose to pure maths. That table clearly is about CS and programming.</p>",
        "id": 268892781,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642793999
    },
    {
        "content": "<p>All those words: first order logic, propositional logic, data type, inductive data types...</p>",
        "id": 268892894,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1642794054
    },
    {
        "content": "<p>Theorem provers are used in many computer science departments. The problem we're trying to solve is getting them used more commonly in mathematics departments, where the curriculum is very different so the problems faced also seem to be different.</p>",
        "id": 268896734,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1642795626
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Just.20finished.20the.20game.2C.20what.20to.20do.20next/near/268896734\">said</a>:</p>\n<blockquote>\n<p>Theorem provers are used in many computer science departments. The problem we're trying to solve is getting them used more commonly in mathematics departments, where the curriculum is very different so the problems faced also seem to be different.</p>\n</blockquote>\n<p>They might be used on many CS department, but they are usually not used for the first contact between undergrads and mathematical proofs.</p>",
        "id": 268897227,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642795912
    },
    {
        "content": "<p>In this aspect, I found your teaching methods (as you described them in <a href=\"https://www.youtube.com/watch?v=Dp-mQ3HxgDE\">https://www.youtube.com/watch?v=Dp-mQ3HxgDE</a> in 2019) really revolutionary. Not because it was taught to Math students (as opposed to CS students) but because it was taught at the very beginning of their studies.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Dp-mQ3HxgDE\" href=\"https://www.youtube.com/watch?v=Dp-mQ3HxgDE\"><img src=\"https://uploads.zulipusercontent.net/cff6ae37ab54c74b0cd0ff1841d8d8ad7de97622/68747470733a2f2f692e7974696d672e636f6d2f76692f44702d6d513348786744452f64656661756c742e6a7067\"></a></div>",
        "id": 268897909,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1642796296
    },
    {
        "content": "<p>Maybe this thread can be split and moved to <a class=\"stream\" data-stream-id=\"187764\" href=\"/#narrow/stream/187764-Lean-for-teaching\">#Lean for teaching</a> (and probably merged into Martin's thread?)</p>",
        "id": 268898762,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1642796787
    }
]