[
    {
        "content": "<p>Hi everyone. My name is Kevin Allen and I am an MSc Maths student in University College Dublin (soon to be PhD student). I have recently been looking into Lean out of curiosity after watching a couple of Kevin Buzzard's videos on youtube, and I completed the Natural Number Game and the further Maths Challenges on the github page.<br>\nI am currently doing my MSc project on topics in finite geometry (projective planes, semifields etc.) and was thinking I could introduce some Lean to help learn Lean and the project material. I had a look through the library and couldn't find a definition of a projective plane so that could possibly be a start for me. Would anyone have advice for how to get started? Much appreciated!</p>",
        "id": 241404490,
        "sender_full_name": "Kevin Allen",
        "timestamp": 1622732927
    },
    {
        "content": "<p>There are some old threads related to axiomatic geometry linked <a href=\"#narrow/stream/116395-maths/topic/Euclidean.20geometry.20in.20mathlib.3F/near/189423917\">here</a>; see also <span class=\"user-mention\" data-user-id=\"241485\">@Vaibhav Karve</span>'s <a href=\"https://vaibhavkarve.github.io/leanteach_2020.html\">work on axiomatic geometry in Lean</a>.</p>",
        "id": 241405691,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1622733376
    },
    {
        "content": "<p>I also have a branch where I started some sketches about projective geometry (with the eventual goal of proving the fundamental theorem of projective geometry), but I haven't had the time nor energy to work on it for a while... I think it's <a href=\"https://github.com/leanprover-community/mathlib/tree/proj-space-quot\">branch#proj-space-quot</a> ?</p>\n<p>(This has nothing about the axiomatic approach though)</p>",
        "id": 241411836,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1622735961
    },
    {
        "content": "<p>Brilliant. Thanks for the resources. I am still quite new to github so I will have some fun figuring that out too</p>",
        "id": 241449145,
        "sender_full_name": "Kevin Allen",
        "timestamp": 1622752644
    },
    {
        "content": "<p>We have <a href=\"https://leanprover-community.github.io/contribute/index.html\">a page</a> for new mathlib contributors, but also feel free to ask any questions about git or github here!</p>",
        "id": 241449570,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1622752864
    }
]