[
    {
        "content": "<p>Does Lean always process my whole file every time I add one more line of code?   If so how come it's still working fast enough, now that I have more than 2000 lines of proof?  (HOL Light gets crazy slow with a few thousand lines of proof).   Lean does make my Mac turn on its fan (sign that it's using all four cores!)  sometimes.  If I put say the first 1000 lines in another file and import it,  will it still be processing that all the time?</p>",
        "id": 209574875,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599689414
    },
    {
        "content": "<p>It starts from the last statement</p>",
        "id": 209575016,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1599689526
    },
    {
        "content": "<p>It would be a very good idea to put the first 1000 lines in another file and import it; then the first 1000 lines won't be processed again and again. Yes, Lean can process a lot of a file, or at least the proof you're working on, every time you press a key. Its exact behaviour depends on what you have selected on the bottom row of VS Code (\"checking visible files\" or \"checking visible lines and above\" or whatever.</p>\n<p>I think that very few mathlib files are 1000 lines long now. Why not split it up?</p>",
        "id": 209575037,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1599689542
    },
    {
        "content": "<p>Lean is sent the entire file each time you make a change, but it generally starts re-processing from the last <em>changed</em> line.</p>",
        "id": 209575092,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599689598
    },
    {
        "content": "<p>Thanks Bryan, that clarifies something, but it makes me curious:  where does Lean keep the results of its processing?  Something like <br>\na bytecode file?  But then it must have indexing back to the source so it can figure out what part corresponds to the changed part <br>\nof the source file.</p>",
        "id": 209575280,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599689745
    },
    {
        "content": "<p>The set command  is working perfectly.  Thanks so much for getting me over that hump.</p>",
        "id": 209575565,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599689944
    },
    {
        "content": "<p>I think Lean keeps the results in memory but there are different data structures for files that are open for editing and Lean files that are merely imported. Lean only needs to keep track of the connections between lines of code and the resulting proof terms for the files that are open for editing.</p>\n<p>The results of processing can be saved to disk as <code>.olean</code> files if you run <code>lean --make</code>. These are only used for imports, and I don't think they have any indexing back to the original source of the file.</p>\n<p>(The above might be all wrong, I haven't read enough of the C++ to know for sure, so I'm mostly guessing based on experience...)</p>",
        "id": 209576335,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599690503
    }
]