[
    {
        "content": "<p>I have read Theorem Proving in Lean4 and the Lean Manual and I am very impressed with the documentation. The only thing I can't find is some documentation and search for the Lean4 standard library, does this exist?</p>",
        "id": 305527782,
        "sender_full_name": "awalterschulze",
        "timestamp": 1666441218
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib4_docs/find/?pattern=Std.HashMap#doc\">docs4#Std.HashMap</a></p>",
        "id": 305529611,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1666442115
    },
    {
        "content": "<p>Perfect thank you :)</p>",
        "id": 306484172,
        "sender_full_name": "awalterschulze",
        "timestamp": 1666887031
    },
    {
        "content": "<p>We found that this documentation is slightly out of date.  Is there an up to date version or a plan to up date <a href=\"https://leanprover.github.io/reference/libraries.html\">https://leanprover.github.io/reference/libraries.html</a> ?</p>",
        "id": 306948117,
        "sender_full_name": "awalterschulze",
        "timestamp": 1667130776
    },
    {
        "content": "<p>You are the second person in a few hours to ask where the standard library is. Perhaps people don't want to update this page because they feel like the moment they point to the standard library they will have to write some overview saying what it is and what it does.</p>\n<p>The standard library just appeared; it is here <a href=\"https://github.com/leanprover/std4\">https://github.com/leanprover/std4</a> and right now you'll have to make do with the docs available online which are here <a href=\"https://leanprover-community.github.io/mathlib4_docs/Std/Data/Int/Basic.html#Int.sign\">https://leanprover-community.github.io/mathlib4_docs/Std/Data/Int/Basic.html#Int.sign</a> . I don't know enough about Lean 4 to explain the difference between what is in core and what is in std4, beyond the assertion that what's in core is the bare minimum that is needed to get Lean up and running as a programming language and prover. </p>\n<p>The mathematics library is in the process of being ported from Lean 3 to Lean 4. It's here <a href=\"https://github.com/leanprover-community/mathlib4\">https://github.com/leanprover-community/mathlib4</a> and you can find information about the Lean 3 version here <a href=\"https://leanprover-community.github.io/\">https://leanprover-community.github.io/</a> , although much of what is explained there (e.g. about how much undergraduate mathematics is in the library) does not yet apply to mathlib4, although it will do one day.</p>",
        "id": 306950558,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1667131939
    },
    {
        "content": "<p>That assertion is indeed the only difference.</p>",
        "id": 306950717,
        "sender_full_name": "Henrik Böving",
        "timestamp": 1667132015
    },
    {
        "content": "<p>Okay, so the standard library has only recently been published, so we'll have to wait a bit for the documentation to also be updated and until then we can use the mathlib4 community docs or browse the source code.<br>\nThank you everyone for answering my question.</p>",
        "id": 306954328,
        "sender_full_name": "awalterschulze",
        "timestamp": 1667133879
    }
]