[
    {
        "content": "<p>As Alex recommended I used \"leanproject build\" to compile my project (but only after a detour that involved recursively getting pipx and the Xcode command line tools installed).  Fine,  but there is also leanpkg.   Is it now obsolete and superseded by leanproject?  Or do the two serve different purposes?</p>",
        "id": 209809801,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599844921
    },
    {
        "content": "<p><code>leanproject</code> should (eventually?) be able to do everything that <code>leanpkg</code> does. It's discussed a little bit <a href=\"https://leanprover-community.github.io/toolchain.html#handling-dependencies\">on the page on the Lean tool chain</a>.</p>",
        "id": 209810168,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599845087
    },
    {
        "content": "<p>Thanks.   I note from that page:  \"For historical reasons, leanproject still calls leanpkg for some simple operations\".  Therefore leanpkg is not obsolete.</p>\n<p>By the way,  when I originally installed lean I tried to follow instructions, but<br>\nLean installation broke on installing elan; eventually I downloaded elan directly from github,<br>\nbypassing the certificate-store problem that had blocked installation.   So by this work-around I guess the <br>\npath to leanproject never got stored.   Hence this morning's wrestling match with homebrew, pipx, Xcode command-line tools, etc.  Anyway, all's well that ends well. But just for the record, the recommended installation instructions hit some \"certificate store problem\" and didn't work.</p>",
        "id": 209811565,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599845805
    },
    {
        "content": "<p>Thanks for the report. Do you remember any other details about the error message? I don't think we've seen that one before.</p>",
        "id": 209812510,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599846276
    },
    {
        "content": "<p>no,  that was last April and I didn't make a complete record of my struggles.  <br>\nBy the way, after successfully compiling my project once,  it failed later; mysteriously the path to leanpkg  in   Users/Beeson/.elan/bin<br>\nwasn't found;  after adding it to my bash profile file it worked again.  There's a file in my project directory called leanpkg.path.<br>\nI didn't manage to edit it successfully.  I don't know where it came from, either,  but it doesn't contain any valid path to leanpkg.  <br>\nI emphasize,  my system is working so there is no question in this post.  Compiling it also solved my speed/responsiveness problems<br>\nso I am good to go!</p>",
        "id": 209863218,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1599883580
    },
    {
        "content": "<p><code>leanpkg.path</code> is what Lean actually looks at to find the olean files. It's generated from <code>leanpkg.toml</code> by <code>leanpkg</code> and <code>leanproject</code> and should almost never be edited by hand.</p>",
        "id": 209863590,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1599884380
    }
]