[
    {
        "content": "<p>I am trying to use the lean game maker to make a local version of the real number game. I think I downloaded everything correctly and when I make the game it seems to work. However, when everything finishes and I try to run the html file nothing pops up in the browser. I've tried a few things but at this point I am pretty stuck. Does anyone have any suggestions on what I can do?</p>",
        "id": 286922741,
        "sender_full_name": "David Talone",
        "timestamp": 1655822140
    },
    {
        "content": "<p>I haven't managed to get the html to work like that. If you add it to a github repo and then create the github page using those files then it does generate the correct website.</p>",
        "id": 286930779,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655825308
    },
    {
        "content": "<p>What files do I need to upload to github to generate the website?</p>",
        "id": 286933156,
        "sender_full_name": "David Talone",
        "timestamp": 1655826115
    },
    {
        "content": "<p>If you run <code>make-lean-game</code> it will create a bunch of files in some folder (or make a folder called html). I just upload all of that into a repo and then point the github pages at that and it seems to work.</p>",
        "id": 286947223,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655832047
    },
    {
        "content": "<p>Sorry for all the questions but what do you mean by saying point the github pages at the folder? I got the folder into github but I'm not sure what to do with it.</p>",
        "id": 286948149,
        "sender_full_name": "David Talone",
        "timestamp": 1655832487
    },
    {
        "content": "<p>No problem! So if you go to <code>settings</code> and look at the <code>pages</code> tab then you can select a branch and then select between <code>root</code> or <code>docs</code> folder (I don't know how to get github to look for things in subfolders) . But if you have all the files in the main branch, say, then select this branch and then the <code>root</code> folder. It should then generate the pages for you from this.  </p>\n<p>If it helps you can look at what the mirror for the NNG looks like here: <a href=\"https://github.com/CBirkbeck/natural_number_game\">https://github.com/CBirkbeck/natural_number_game</a>. If your repo looks like this then the above should work.</p>",
        "id": 286953839,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655835112
    },
    {
        "content": "<p>I got it working. Thank you so Much!</p>",
        "id": 286960207,
        "sender_full_name": "David Talone",
        "timestamp": 1655838185
    },
    {
        "content": "<p>I got it working but now it says that lean is busy and it will never go away. Does anyone have any suggestions on what to do about this?</p>",
        "id": 287057997,
        "sender_full_name": "David Talone",
        "timestamp": 1655906524
    },
    {
        "content": "<p>Allow cookies (some people couldn't play NNG because they had some browser paranoid settings on)</p>",
        "id": 287059069,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1655906989
    },
    {
        "content": "<p>I was able to run the NNG just fine but now that I'm trying this out it just says lean is busy. I turned on cookies anyway but it doesn't seem to have helped.</p>",
        "id": 287059852,
        "sender_full_name": "David Talone",
        "timestamp": 1655907315
    },
    {
        "content": "<p>I had that problem, but for me it was because <code>make-lean-game</code> wasn't creating the mathlib olean files.</p>",
        "id": 287060798,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655907709
    },
    {
        "content": "<p>How did you fix that problem?</p>",
        "id": 287062262,
        "sender_full_name": "David Talone",
        "timestamp": 1655908316
    },
    {
        "content": "<p>The game is built on a lean project right? So maybe the same way you would do for lean projects?<br>\n<a href=\"https://leanprover-community.github.io/leanproject.html#getting-mathlib-oleans\">https://leanprover-community.github.io/leanproject.html#getting-mathlib-oleans</a></p>",
        "id": 287062687,
        "sender_full_name": "Bart Michels",
        "timestamp": 1655908467
    },
    {
        "content": "<p>For me the issue was that when I ran <code>make-lean-game</code> I had an error saying <code>Error: [Errno 2] No such file or directory: 'leanpkg'</code>. It turned out that I just had a bad installation of the game maker, which once I installed properly, got rid of the error and then generated the correct files.</p>",
        "id": 287065261,
        "sender_full_name": "Chris Birkbeck",
        "timestamp": 1655909600
    },
    {
        "content": "<p>Interesting, it doesn't seem like anything is working for me. It's not necessarily a big deal but it is a bit annoying.</p>",
        "id": 287068824,
        "sender_full_name": "David Talone",
        "timestamp": 1655911032
    },
    {
        "content": "<p>I figured out that it's only certain levels that aren't working but at least some of it is good.</p>",
        "id": 287070553,
        "sender_full_name": "David Talone",
        "timestamp": 1655911779
    },
    {
        "content": "<p>Are you on Windows? The latest update (KB5014697) introduced some network-related bugs, maybe it's that.</p>",
        "id": 287085999,
        "sender_full_name": "Bart Michels",
        "timestamp": 1655918544
    },
    {
        "content": "<p>No I'm on mac. For whatever reason everything seems to work now. I didn't really do anything but now it works.</p>",
        "id": 287086807,
        "sender_full_name": "David Talone",
        "timestamp": 1655918942
    }
]