[
    {
        "content": "<p>Hi, I'm currently parsing output from a lean file just by calling lean in a loop. We can't compile all of the files involved and it goes very slowly. We've been trying to figure out what the plugin is doing and it looks like it's using lean's --server option, for which there is limited but some documentation. I think mainly all we need is incremental compilation. I just wanted to check for those familiar if indeed implementing a client for the server mode is indeed the right rabbit hole to go down.</p>",
        "id": 236555543,
        "sender_full_name": "Andrew Elsey",
        "timestamp": 1619634445
    },
    {
        "content": "<p>I assume your loop that calls into lean is also modifying the files?</p>",
        "id": 236557832,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1619635419
    },
    {
        "content": "<p>Usually yes. Although right now I'm just printing off the file from scratch every turn, but eventually yes, should only change one or perhaps a few lines every iteration</p>",
        "id": 236559746,
        "sender_full_name": "Andrew Elsey",
        "timestamp": 1619636167
    },
    {
        "content": "<p>First, make sure you are not starting up the server every time, (although if you keep it running but work with different files, you might have memory leaks).  However, even if you leave the server open every sync will take 200ms, so you can’t do better than that really.  It is a hard coded delay in the code.</p>",
        "id": 236606570,
        "sender_full_name": "Jason Rute",
        "timestamp": 1619660671
    },
    {
        "content": "<p>You can compile an individual file with <code>lean —make</code>.  It will also compile the dependencies if they are not already compiled, but if you know what the dependencies are and they don’t change, that will speed things up.</p>",
        "id": 236606909,
        "sender_full_name": "Jason Rute",
        "timestamp": 1619660909
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"115715\">Jason Rute</span> <a href=\"#narrow/stream/113489-new-members/topic/Lean.20Incremental.20Compilation.3F/near/236606570\">said</a>:</p>\n<blockquote>\n<p>First, make sure you are not starting up the server every time, (although if you keep it running but work with different files, you might have memory leaks).  However, even if you leave the server open every sync will take 200ms, so you can’t do better than that really.  It is a hard coded delay in the code.</p>\n</blockquote>\n<p>Thanks!</p>",
        "id": 237670906,
        "sender_full_name": "Andrew Elsey",
        "timestamp": 1620312718
    }
]