[
    {
        "content": "<p>I've started going through the Software Foundations book series and I've got some observations and one question:</p>\n<p>First of all, it seems very much like Lean was written for mathematicians whereas Coq was written for software verification. Even though their core calculi are virtually indistinguishable (modulo explicit vs. implicit universe levels, but I'm not sure how much it matters in practice), the proofs have a very different feel to them.</p>\n<p>When proving things in Lean, it feels like most of the time you're hunting for the appropriate lemma to make progress (much like a normal math proof), in Coq it seems like you tend to do a lot more computationally, relying on the specific definition of a function and then letting beta-reductions do a lot of progress.</p>\n<p>This leads to very asymmetrical and somewhat \"unmathematical\" feeling proof. E.g. with my mathematician's hat on, <code>[] ++ l</code> and <code>l ++ []</code> should both be <code>l</code> reasoning that <code>[]</code> is the neutral element of list concatenation. Whereas computationally, one of them is trivial and one of them hard, requiring a proof by induction. In Coq you might prove that a number is a prime by defining a function <code>is_prime : nat -&gt; bool</code>, perhaps have a lemma <code>forall n, is_prime = true &lt;-&gt; prime n</code> and then the \"proof\" would be \"show <code>is_prime 101 = true</code> by reflexivity\". </p>\n<p>Furthermore Coq's very strong stance to rely much more heavily on constructive logic and computation for proofs makes the systems feel so incredibly different in practice.</p>\n<p>Now for my questions; how are Lean's and Coq's <code>unfold</code> related? It seems to me that in Coq unfold literally unfolds a definition, whereas in Lean that's often not supported. E.g. if you define a function by cases (equation compiler, presumably), it won't let you unfold at all until you've already set up the preconditions such that you match a particular case at which point unfold behaves more like Coq's <code>simpl</code> (Lean's <code>simp</code> is a completely different beast applying all kinds of fancy lemma and transformations, much more complex than Coq's <code>simpl</code>.)</p>\n<p>Do we have any basic <code>unfold</code> that can unfold definition of pattern matching? And do we have something to do beta reduction as a tactic?</p>",
        "id": 202632216,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593643316
    },
    {
        "content": "<p>I'm not familiar with Coq's tactics, but if you want to literally just unfold a definition in Lean I think that's what <code>delta</code> does.</p>",
        "id": 202632505,
        "sender_full_name": "Reid Barton",
        "timestamp": 1593643479
    },
    {
        "content": "<p><code>unfold</code> is actually <code>simp</code> with special settings btw</p>",
        "id": 202632839,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593643777
    },
    {
        "content": "<p>While we could do something similar, it's not trivial in lean to obtain the equivalent of <code>unfold</code> on a coq <code>Fixpoint</code> definition, because lean doesn't have a <code>fix</code> combinator like coq</p>",
        "id": 202633058,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593643949
    },
    {
        "content": "<p>is that a consequence of the equation compiler for defining functions by pattern matching?</p>",
        "id": 202633102,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593644012
    },
    {
        "content": "<p>I think in coq you would first <code>unfold</code> to expose the match and then do case analysis, but in lean you have to do it the other way around because if you literally just <code>delta</code> it then you get this horrible mess of recursors</p>",
        "id": 202633103,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593644012
    },
    {
        "content": "<p>hidden behind yet more definitions you would have to unfold first</p>",
        "id": 202633116,
        "sender_full_name": "Reid Barton",
        "timestamp": 1593644035
    },
    {
        "content": "<p>It's the other way around - the equation compiler defines functions using recursors because lean doesn't have <code>fix</code></p>",
        "id": 202633171,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593644060
    },
    {
        "content": "<p>gotcha</p>",
        "id": 202633184,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593644075
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"235513\">@Daniel Fabian</span> what you say is interesting because I'm pretty sure Leo was not specifically targeting mathematicians when he wrote Lean. I had always assumed that the reason mathematics was growing faster in Lean than Coq was just that the user base was different and that this was perhaps just a historical fluke</p>",
        "id": 202658851,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1593675659
    },
    {
        "content": "<p>The fact that nonconstructivism deeply permeates even undergraduate mathematics might be a reason though</p>",
        "id": 202658953,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1593675757
    },
    {
        "content": "<p>The IVT is a nonconstructive theorem about a noncomputable object and these issues are never flagged to mathematics undergraduates when they are taught IVT in their first year. We don't care in mathematics departments</p>",
        "id": 202659078,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1593675893
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"235513\">Daniel Fabian</span> <a href=\"#narrow/stream/113489-new-members/topic/Lean's.20vs.20Coq'.20unfold.20and.20simpl/near/202632216\">said</a>:</p>\n<blockquote>\n<p>First of all, it seems very much like Lean was written for mathematicians whereas Coq was written for software verification. Even though their core calculi are virtually indistinguishable (modulo explicit vs. implicit universe levels, but I'm not sure how much it matters in practice), the proofs have a very different feel to them.</p>\n<p>When proving things in Lean, it feels like most of the time you're hunting for the appropriate lemma to make progress (much like a normal math proof), in Coq it seems like you tend to do a lot more computationally, relying on the specific definition of a function and then letting beta-reductions do a lot of progress.</p>\n</blockquote>\n<p>I think what you wrote is literally false but of course it comes from something very real. First I don't think that Lean was written specifically for mathematicians. This would have been emphasized in the early papers and presentation you can find on the official website. Everything I see mention both kinds of applications. And I don't think there is much technical difference that explain what you see, although my understanding is that Coq is better at reflexivity heavy lifting. I think that what you describe is mostly a difference between user communities and libraries. It is well known that mathcomp <em>loves</em> definitional equality, and I guess Software Foundation also does. And of course they are deeply indoctrinated into constructivism, although this is slowly changing. But Coq itself is perfectly capable of being classical. In principle someone could go and write mathlib in Coq and it would feel Lean-like.</p>",
        "id": 202660184,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1593676930
    },
    {
        "content": "<p>I think setoid hell is an issue you would run into if you tried to just write mathlib in coq</p>",
        "id": 202660730,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593677460
    },
    {
        "content": "<p>although perhaps it would be possible to live with <code>quot.beta</code> only being a propositional equality, in which case you can get away with a simple axiomatic definition of quotient types</p>",
        "id": 202660843,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593677540
    },
    {
        "content": "<p>I believe this is being tried in Coq</p>",
        "id": 202660865,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1593677571
    },
    {
        "content": "<p>it would also be interesting to know how well coq typeclass inference performs on typical mathlib style typeclass problems</p>",
        "id": 202660922,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593677630
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110031\">@Patrick Massot</span> I find the choices Leo made quite interesting, to be honest. Z3 is after all heavily used in software verification in some pretty advanced projects. F* for instance is heavily automatised and it lets you prove whole invariants about programs very easily, often by merely stating them. Lean compared to that is very manual. Yet, Leo frames it at least in some earlier presentations as a next step up from Z3 to make software verification more scalable and robust.</p>\n<p>Maybe it's that TPIL and Logic and Proof are specifically written with a math background whereas Software Foundations are written with a software verification background.</p>\n<p>I was not asserting btw. that Lean and Coq are technically very different, but that the user experience, syntax choices, etc. give it a very different feel to it. And those things very much influence what can be done in a programming language in practice. As an analogy, even though to a first approximations all programming languages are equal  in the sense that they are turing complete, assembly can be used for very, very different things than, say Java. Which in turn attracts a different community and reinforces the differences.</p>\n<p>For instance this fixpoint operator vs recursors / equation compiler difference feels like something, we wouldn't care about unless we are trying to characterise the technical differences between the systems, yet it shows up naturally after trying to do case analysis on a piece of code that uses pattern matching.</p>\n<p>Also interesting is the choice to separate computable from non-computable parts in Lean. So you may have a function which has computational meaning and prove a sophisticated property about it in a highly non-constructive way and Lean is quite happy with that.</p>\n<p>It certainly feels valuable to experience theorem proving from both worlds as it helps building perspective ;-)</p>",
        "id": 202670304,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593684870
    },
    {
        "content": "<p>I don't know enough about coq to say if this isn't already the case, but I imagine that Coq could fairly easily present recursive functions by pattern matching similar to how lean does it, which is probably more influenced by agda/haskell style</p>",
        "id": 202670484,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685054
    },
    {
        "content": "<p>The fact that you first unfold one iteration of the fix and then break up the match seems like exposing implementation details on coq's part</p>",
        "id": 202670553,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685089
    },
    {
        "content": "<p>the advantage of lean's approach is that you can't really tell how the recursive function is implemented, and indeed this is taken advantage of so that lean can support multiple compilation strategies depending on how the recursive calls look</p>",
        "id": 202670632,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685165
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110038\">Kevin Buzzard</span> <a href=\"#narrow/stream/113489-new-members/topic/Lean's.20vs.20Coq'.20unfold.20and.20simpl/near/202659078\">said</a>:</p>\n<blockquote>\n<p>The IVT is a nonconstructive theorem about a noncomputable object and these issues are never flagged to mathematics undergraduates when they are taught IVT in their first year. We don't care in mathematics departments</p>\n</blockquote>\n<p>When they were mentioning the AC to us, they did flag it up as being non-constructive, not really saying it was problematic, necessarily, though. When I learnt about intuitionistic logic, by that time, em was so ingrained that I found it quite difficult to have an intuition what is and isn't entailed, though, intuitionistically.</p>",
        "id": 202670658,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685185
    },
    {
        "content": "<p>IVT doesn't use AC, therefore it is constructive</p>",
        "id": 202670738,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685230
    },
    {
        "content": "<p>this is the way I learned it</p>",
        "id": 202670742,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685238
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110049\">Mario Carneiro</span> <a href=\"#narrow/stream/113489-new-members/topic/Lean's.20vs.20Coq'.20unfold.20and.20simpl/near/202670632\">said</a>:</p>\n<blockquote>\n<p>the advantage of lean's approach is that you can't really tell how the recursive function is implemented, and indeed this is taken advantage of so that lean can support multiple compilation strategies depending on how the recursive calls look</p>\n</blockquote>\n<p>This is in it's own right makes constructive reasoning harder, though. Precisely because you don't know the implementation details.</p>",
        "id": 202670799,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685300
    },
    {
        "content": "<p>well, lean does expose the fact that the equations it generates are definitional equalities</p>",
        "id": 202670879,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685352
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> I remember the context when AC first came up. might have been the continuity, actually for picking a big enough <code>N</code>.</p>",
        "id": 202670889,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685366
    },
    {
        "content": "<p>at least, when they are (they are not necessarily in the case of well founded recursions)</p>",
        "id": 202670917,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685389
    },
    {
        "content": "<p>You mean for IVT?</p>",
        "id": 202670963,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685421
    },
    {
        "content": "<p>IVT doesn't need choice</p>",
        "id": 202670968,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685427
    },
    {
        "content": "<p>it's perfectly well definable in ZF</p>",
        "id": 202670980,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685437
    },
    {
        "content": "<p>it might have been for defining reals.</p>",
        "id": 202671026,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685452
    },
    {
        "content": "<p>really it's been a long time :P</p>",
        "id": 202671040,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685464
    },
    {
        "content": "<p>but the constructiveness meant by not using AC is more like \"we have an explicit description of what we are talking about\" so it includes things like the busy beaver function but not a well order of the reals</p>",
        "id": 202671081,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685499
    },
    {
        "content": "<p>And anyway, I expect in 5 years time, Lean will have more powerful tactics that will let us not think about fixpoint vs. recursors as some of the reasoning is fairly mechanical, anyway.</p>",
        "id": 202671184,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685564
    },
    {
        "content": "<p>I would say that lean has had that since almost the beginning</p>",
        "id": 202671216,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685589
    },
    {
        "content": "<p>the equation compiler is just about as powerful as fix/match</p>",
        "id": 202671227,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685605
    },
    {
        "content": "<p>I think it is noticeably less powerful than agda pattern matching in a few places</p>",
        "id": 202671267,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685649
    },
    {
        "content": "<p>I don't know about that, I've certainly run into loads of trouble trying to use match expressions inside of tactics mode.</p>",
        "id": 202671272,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685653
    },
    {
        "content": "<p>feel free to ask here <span aria-label=\"smile\" class=\"emoji emoji-263a\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 202671327,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685683
    },
    {
        "content": "<p>But I think this might be a result of the clash between Coq tactics and Agda terms</p>",
        "id": 202671363,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685710
    },
    {
        "content": "<p>lean strikes a decent balance between them but they really are separate languages and they don't communicate too much</p>",
        "id": 202671394,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685750
    },
    {
        "content": "<p>I will at some point fight my way through that bloody rb-tree, lol. But I have to say I did hit a brick wall twice on it now in Lean, both intrinsically and extrinsically. I just somehow can't do the distinction by cases efficiently in Lean and since it's something like 125 cases, I'm not going to spell it out by hand :P</p>",
        "id": 202671436,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685792
    },
    {
        "content": "<p>maybe I'll be able to ask a more concrete thing, but it really boils do to the balance operation being defined as an 8-line pattern match, very simple.</p>",
        "id": 202671516,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685832
    },
    {
        "content": "<p>Ah, I've been there :)</p>",
        "id": 202671528,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685845
    },
    {
        "content": "<p>but it corresponds to 100+ cases and and I haven't been able to tell lean's tactics to the work for me.</p>",
        "id": 202671550,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593685868
    },
    {
        "content": "<p>You shouldn't get that many cases if you set things up well, use lots of intermediate functions and such</p>",
        "id": 202671578,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1593685914
    },
    {
        "content": "<p>Ya, I'll work my way through Software Foundations, maybe I'll learn something that'll be useful in this context, specifically. <br>\nI'll get it done, eventually.</p>",
        "id": 202671687,
        "sender_full_name": "Daniel Fabian",
        "timestamp": 1593686000
    }
]