[
    {
        "content": "<p>Hello, i am looking for someone with experience that can help me with lean/mathlib. I had been working in some personal projects with lean for a while but there is a lot of things that i will love to know to make faster and better progress. Documentation and resources are pretty good but i have a bunch of specific questions. My goals are mostly in formalizing cryptography stuff but i am also very interested in contributing to mathlib in any area. I am not a mathematician but a software engineer. I can get funding for classes.<br>\nAnother option will be to form a small team of starters to work in a common project and learn from each other. Anyone interested please let me know. Thanks (I am not sure if this message is in the right stream, let me know).</p>",
        "id": 322089121,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674057712
    },
    {
        "content": "<p>This is the good place for such a question!</p>\n<p>My personal advice is to choose a small theorem to formalize (maybe discussing the choice here) and then start working on it. For example, can you give an example of a \"cryptography stuff\" you would like to formalize?</p>",
        "id": 322107214,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1674062135
    },
    {
        "content": "<p>yea sure, thank you Ricardo. I am interested on pure math as well but i do have a hard time understanding mathlib.<br>\nin the other hand i did some progress in a personal project, i have some code <a href=\"https://github.com/oxarbitrage/salsa20\">https://github.com/oxarbitrage/salsa20</a>, is pretty crappy by now as i made it just for learning.</p>",
        "id": 322107837,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674062303
    },
    {
        "content": "<p>so basically i tried to formalize a cryptosystem called salsa20 and then prove some theorems about it found in some papers. at the end i think the most interesting one is that when the input is specially crafted you can get collisions in the hash function.</p>",
        "id": 322108524,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674062502
    },
    {
        "content": "<p>i guess one of my main problems is that i am kind of learning functional programming at the same time</p>",
        "id": 322109778,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674062753
    },
    {
        "content": "<p>mathlib is quite hard to read, especially if you don't know the math it's basically impossible to understand (it's nothing like a textbook to learn math). But formalizing a cryptosystem seems a nice project!</p>",
        "id": 322110232,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1674062819
    },
    {
        "content": "<p>yea, exactly. even if you do know the math of some basic things mathlib is written a lot different than the textbooks</p>",
        "id": 322110628,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674062937
    },
    {
        "content": "<p>Yeah, the problem is that we choose from the beginning the most general definition to avoid having to redo stuff, so in practice it's unusable to lean math. For example there are no \"vector spaces\" in mathlib, only a generalization of them.</p>",
        "id": 322111039,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1674063056
    },
    {
        "content": "<p>yea, that makes sense, the other way around (prove a theorem, build a personal project, etc) is easier but still complex enough for me to make more serious progress. for example, i think i picked the wrong datatypes in my project so i end up with ugly statements and proofs that i will like to avoid <a href=\"https://github.com/oxarbitrage/salsa20/blob/main/src/rowround.lean#L125\">https://github.com/oxarbitrage/salsa20/blob/main/src/rowround.lean#L125</a></p>",
        "id": 322112012,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674063322
    },
    {
        "content": "<p>do you think a readme will help ? my plan is to refactor that project the most i can to be written in decent lean and then use it as a base to do more proves about the same or other similar cryptosystems.</p>",
        "id": 322125952,
        "sender_full_name": "Alfredo Garcia",
        "timestamp": 1674067341
    }
]