[
    {
        "content": "<p>Greetings! I am going to dig into <a href=\"http://leanprover.github.io/logic_and_proof\">Logic and Proof course</a>. I finished <a href=\"https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/\">NNG</a>.</p>\n<p>Firstly, what is clear estimated time of completion for this book?</p>\n<p>Secondly, what kind of math culture is required if I, for example, decide to study it with my programmer friends? Frankly speaking, it's interesting for me to provide such an experiment with people who actually have no background. Especially, after reading <a href=\"https://link.springer.com/article/10.1007/s40753-021-00140-1\">this article</a>.</p>\n<p>Thanks!</p>",
        "id": 254313962,
        "sender_full_name": "Grigoriy Prokhrov",
        "timestamp": 1632285396
    },
    {
        "content": "<p>Which book are you talking about? Is Logic and Proof not complete?</p>",
        "id": 254367294,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1632317574
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I think <span class=\"user-mention\" data-user-id=\"343597\">@Grigoriy Prokhrov</span>  meant how long does it take (approximately) to read it / complete the exercises.</p>",
        "id": 254404977,
        "sender_full_name": "Mac",
        "timestamp": 1632331378
    },
    {
        "content": "<p>You might find <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>'s <a href=\"https://www.andrew.cmu.edu/user/avigad/Papers/learning_logic_and_proof.pdf\">paper on the Logic and Proof course</a> interesting.</p>",
        "id": 254405348,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632331534
    },
    {
        "content": "<p>I am sorry for my late answer.</p>\n<p><span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span> I've read the article about Lean course at Imperial.  Authors mention that students have special course which can be described as \"academic writing for human readable math proofs\".</p>\n<p><span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> thank you. Fortunately, I've already read <span class=\"user-mention\" data-user-id=\"110865\">@Jeremy Avigad</span>'s article. But basic level of CMU or Imperial student is much higher than average. It's possible to use their knowledge to teach the way of expression on Lean. But I started to feel that in inverse problem of teaching reasoning with computer the Lean may be not enough. If proof is not just a program but mostly a form of communication between people, then it would be that implicit requirement that I mentioned in the opening post.</p>",
        "id": 254573343,
        "sender_full_name": "Grigoriy Prokhrov",
        "timestamp": 1632418267
    },
    {
        "content": "<p>I agree that right now you cannot just put a mathematics undergraduate in front of Lean and say \"go ahead and do maths using this now!\"</p>",
        "id": 254573460,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1632418321
    },
    {
        "content": "<p>Ok. It seems like there's no other option to actually know how much time does it take rather than dig into and finish it.</p>",
        "id": 254581006,
        "sender_full_name": "Grigoriy Prokhrov",
        "timestamp": 1632421334
    },
    {
        "content": "<p>Do report back after you and your friends have given it a shot! It's always valuable to hear about beginners' experiences.</p>",
        "id": 254586734,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632423597
    },
    {
        "content": "<p>Thank you! I'll do my best.</p>",
        "id": 254590996,
        "sender_full_name": "Grigoriy Prokhrov",
        "timestamp": 1632425351
    },
    {
        "content": "<p>So I've started my run in my spare time. It's a nice idea to start this book with logic puzzle. But two things are in my mind. I actually can go through. But this is like a construction kit. A toy for big children with strong motivation. There is definitely a lack of little achievable targets in this journey. An open problem is not an issue for me. Personally, I'm not afraid of working with raw material but this doesn't seem to be a production ready solution. Perhaps this is a reason to invent it?)</p>\n<p>As an intern in devops I would like to construct a pretty little theory. Maybe this \"theory\" will be dumb or trivial, but it will be full-fledged. Even if it would be synonymous with \"print x\" in other languages. But after every increment I should be ready for release.</p>\n<p>There is a difference between filling gaps in NNG theorems and stating&amp;proving own theorems. I see the point of this puzzle. But It would take time to walk through this chapter to personally succeed with exercises. It's look like a waterfall and not like a continuous cycle.</p>\n<p>Anyway, I'll finish it.</p>",
        "id": 255302439,
        "sender_full_name": "Grigoriy Prokhrov",
        "timestamp": 1632864336
    }
]