[
    {
        "content": "<p>Hi all,</p>\n<p>I just tried to install Lean after playing through the Natural Number Game, which I came across on hackernews yesterday. Compliments to Kevin and Mohammad for a very convincing introduction! (speaking as a mathematician here <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>)</p>\n<p>I'm on a recently-acquired M1 mac and was not able to install elan through the instructions at <a href=\"https://leanprover-community.github.io/get_started.html\">https://leanprover-community.github.io/get_started.html</a>.</p>\n<p>Error message: <code>elan: unknown CPU type: arm64</code><br>\n(brew and leanproject installed just fine)</p>\n<p>I am technically ignorant about M1 stuff and haven't yet had to use Rosetta for anything, so I'm not sure how to fix this or what to do instead. I saw some discussion up above about getting Lean to work on an M1 mac, but don't understand it. Anyone willing to help a newbie get set up?</p>\n<p>Thanks!<br>\n-JL</p>",
        "id": 227370426,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1614044691
    },
    {
        "content": "<p>Welcome! I think the issue is that <code>elan</code> does not have binaries for <code>arm64</code> (yet?). Are M1 macs able to run binaries for intel macs? If so, then maybe the <code>apple-darwin</code> file here will work: <a href=\"https://github.com/Kha/elan/releases/tag/v0.10.3\">https://github.com/Kha/elan/releases/tag/v0.10.3</a></p>",
        "id": 227371064,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614045223
    },
    {
        "content": "<p>I haven't tried to install <code>elan</code> manually before, but the <a href=\"https://github.com/Kha/elan/tree/v0.10.3#installation\">instructions</a> say just to run the file in a terminal after unpacking it.</p>",
        "id": 227371206,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614045325
    },
    {
        "content": "<p>Hi Bryan, thank you! Some progress now -- that installer seems to have worked and successfully installed elan. I've cloned the Lean tutorials.</p>\n<p>New error message: looks like something else hasn't installed correctly (maybe <code>leanpkg</code>?): VSCode appears to be running <code>leanpkg configure</code> and getting this error:</p>\n<p><code>dyld: Library not loaded: /usr/local/opt/gmp/lib/libgmp.10.dylib\n  Referenced from: /Users/jake/.elan/toolchains/leanprover-community-lean-3.26.0/bin/lean\n  Reason: image not found</code></p>\n<p>Note -- I do have <code>gmp</code> installed already via <code>brew install gmp</code>.</p>",
        "id": 227372504,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1614046304
    },
    {
        "content": "<p>Hmm, <code>leanpkg</code> is just a <code>.lean</code> script, so I think <code>lean</code> is not able to find <code>gmp</code> for some reason.</p>",
        "id": 227372766,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614046468
    },
    {
        "content": "<p>Is it possible that the <code>gmp</code> you got from homebrew is an <code>arm64</code> version and not compatible with a program compiled for an intel mac? (I have no idea, just guessing wildly...)</p>",
        "id": 227372900,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614046568
    },
    {
        "content": "<p>That'll be it yeah, paths to ARM things from homebrew will be in /opt/</p>",
        "id": 227373018,
        "sender_full_name": "Julian Berman",
        "timestamp": 1614046673
    },
    {
        "content": "<p>you can install an intel homebrew as well and then it'll get you an intel libgmp if you use that one instead, or you can also reasonably easily compile lean natively for ARM, there's just one <code>cmake</code> arg you need which is <a href=\"#narrow/stream/113488-general/topic/Apple.20Silicon/near/219305416\">https://leanprover.zulipchat.com/#narrow/stream/113488-general/topic/Apple.20Silicon/near/219305416</a></p>",
        "id": 227373436,
        "sender_full_name": "Julian Berman",
        "timestamp": 1614046963
    },
    {
        "content": "<p>I suspect the former route might be easier for a new user; otherwise, if you want <code>leanproject</code> to work then you'll have to make sure you compile Lean at the correct v3.26.0 commit and then recompile when we upgrade mathlib to a new version.</p>",
        "id": 227374262,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614047667
    },
    {
        "content": "<p>Update:</p>\n<p>Your suggestions worked -- recording for posterity here in case anyone else reads this: it turned out I actually already had intel homebrew installed as well (presumably because my current macbook copied everything from my previous macbook automatically when I was first setting it up).</p>\n<p>But, I had to actually call that version of homebrew directly to install x86 gmp, that is <code>/usr/local/Homebrew/bin/brew install gmp</code> instead of <code>brew install gmp</code> even though the command ran in a Rosetta terminal... I guess this makes sense but wasn't obvious to me at first!</p>\n<p>And after fiddling a bit more, I appear to have the tutorials up and running in VSCode!</p>\n<p>Thanks Bryan and Julian!</p>\n<p><code>goals accomplished</code> <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span></p>",
        "id": 227380771,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1614054147
    },
    {
        "content": "<p>Oh boy, thanks for persevering!</p>",
        "id": 227393807,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614067291
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"391579\">@Jake Levinson</span> Glad you got things working! If you don't mind, can you try and recall all the steps you took so we can add some M1-specific instructions to our webpage?</p>",
        "id": 227464402,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614099373
    },
    {
        "content": "<p>This is going to be messy, haha. Maybe I should reinstall it all (homebrew, elan, lean, etc) from scratch now that I know how to get it working. The actual sequence involved a bunch of no doubt superfluous steps.</p>\n<p>What I actually did was:</p>\n<ol start=\"0\">\n<li>(I had homebrew and <code>git</code> already installed in both intel and arm64 versions, though I didn't realize I had both copies at first).</li>\n<li>\n<p>I ran the install command from [https://leanprover-community.github.io/install/macos.html] in Terminal:<br>\n<code>/bin/bash -c \"$(curl -fsSL https://raw.githubusercontent.com/leanprover-community/mathlib-tools/master/scripts/install_macos.sh)\" &amp;&amp; source ~/.profile</code></p>\n</li>\n<li>\n<p>I followed these instructions [https://osxdaily.com/2020/11/18/how-run-homebrew-x86-terminal-apple-silicon-mac/] to make a duplicate Terminal that would run using Rosetta.</p>\n</li>\n<li>I basically now reran a bunch of installers both terminals. Homebrew; the install command from Step 1; Bryan's suggested package for <code>elan</code>; VSCode; <code>brew install gmp</code> and <code>brew install coreutils</code>. (Some of these installers automatically declined to make a second copy of their installation.)</li>\n</ol>\n<p>At this point I was able to copy the tutorial using <code>leanproject get tutorials</code>. When I opened it in VSCode, it caused a bunch of \"memory capacity exceeded\" errors in the VSCode Infoview (I forget the exact error message, unfortunately). This stopped happening once I ran <code>leanproject build tutorials</code>. I'm not sure if that was supposed to be necessary.</p>\n<p>Still, lean was still not functional because it couldn't detect gmp.</p>\n<ol start=\"4\">\n<li>Finally I forced Homebrew to install the x86 gmp using Julian's suggestion. Specifically I went and found the intel Homebrew installed in <code>/usr/local/Homebrew</code> and ran the gmp installer with it as <code>/usr/local/Homebrew/bin/brew install gmp</code> instead of <code>brew install gmp</code>. (The latter command had been, I think, invoking <code>arm64</code> Homebrew even if I ran it in the Rosetta Terminal.)</li>\n</ol>\n<p>That seemed to do it!</p>\n<p>(edit: Oh, there was more too. I think I ran some other commands like <code>pipx ensurepath</code> and maybe related stuff in both terminals. Basically I was trying to do all the steps from <a href=\"https://leanprover-community.github.io/install/macos_details.html\">https://leanprover-community.github.io/install/macos_details.html</a>.)</p>\n<p>If I have time this weekend I'll delete it all and try a fresh install.</p>",
        "id": 227470665,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1614101706
    },
    {
        "content": "<p>Thanks Jake! This is already really helpful!</p>",
        "id": 227471475,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614102000
    },
    {
        "content": "<p>I believe <code>leanproject get tutorials</code> should've made it unnecessary to run <code>leanproject build tutorials</code>, as one of the things it does is to download the compiled files for the version of mathlib used in the tutorials. Not sure if the lack of <code>gmp</code> somehow caused Lean to be unable to find them.</p>",
        "id": 227471800,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1614102114
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"438769\">@Ania Misiorek</span>, now that you've changed the thread title, do you see the message above from Jake Levison? He describes the steps in his successful installation on an M1 mac.</p>",
        "id": 252549976,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1631144135
    },
    {
        "content": "<p>It would be helpful to also have your report of either a successful recipe, or failure points.</p>",
        "id": 252549993,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1631144153
    },
    {
        "content": "<p>Unfortunately not many of us have M1 macs yet!</p>",
        "id": 252550006,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1631144162
    },
    {
        "content": "<p>I just compiled lean3 from the  source on my M1 Mac. elan does not yet (last time I checked) work on M1 Macs. The downside of compiling from source, is that you have git checkout release rather than the latest git commit. The latest git commit could be a bit too experimental.  After that everything just works, but you don't get elan support for different versions of lean.</p>",
        "id": 252574287,
        "sender_full_name": "Justin Pearson",
        "timestamp": 1631166441
    },
    {
        "content": "<p>I forgot to say, you also have to install leanproject yourself via pipx.  If you haven't used your mac for development then you will have to set a quite a few things such as homebrew,  and installing the xcode command line tools.</p>",
        "id": 252574534,
        "sender_full_name": "Justin Pearson",
        "timestamp": 1631166718
    },
    {
        "content": "<p>I'm not sure of the steps I took anymore, but I use <code>elan</code> on an M1 Mac.</p>",
        "id": 252587607,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1631175241
    },
    {
        "content": "<p>I think it involved using homebrew.</p>",
        "id": 252587715,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1631175279
    },
    {
        "content": "<p>There's a thread called \"Lean 4 on M1 Macs\" in which this is discussed.</p>",
        "id": 252587933,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1631175378
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372804\">@Marcus Rossel</span>  Perhaps you're using intel homebrew (and therefore rosetta'd lean)? <code>file =lean</code> and/or <code>file =elan</code> should tell you (or feel free to share the output), it'll say at the end <code>Mach-O 64-bit executable arm64</code> if it's arm64, but yeah elan isn't going to give you those.</p>\n<p>Also I've tried to update most of the docs for this that I could find, but I'm pretty sure there's at least 1 PR still unmerged updating instructions (and then 1 ticket for making things \"automatically work\" as best they can). Certainly help is still welcome.</p>",
        "id": 252659309,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631206726
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"434371\">@Justin Pearson</span> </p>\n<blockquote>\n<p>The downside of compiling from source, is that you have git checkout release rather than the latest git commit.</p>\n</blockquote>\n<p>Yes definitely -- I think Brian mentioned this above in this thread, but if you don't get this commit right, you'll also find that oleans that leanproject downloads will not work on your lean (or really, they'll not be useful, and your lean will recompile things).</p>",
        "id": 252659408,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631206776
    },
    {
        "content": "<blockquote>\n<p>I forgot to say, you also have to install leanproject yourself via pipx.</p>\n</blockquote>\n<p>This is the outstanding PR that needs merging to update the docs -- pipx isn't necessary anymore, <code>brew install mathlibtools</code> will give you a working leanproject even on M1s.</p>\n<p>I'll ping someone on that PR (<a href=\"https://github.com/leanprover-community/leanprover-community.github.io/pull/194\">https://github.com/leanprover-community/leanprover-community.github.io/pull/194</a>) to see if we can get it merged).</p>",
        "id": 252659772,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631206898
    },
    {
        "content": "<p>I managed to install elan on my M1 Mac as well as the lean extension, but I get this error in VS Code: server has stopped due to signal SIGABRT</p>\n<p>dyld: Library not loaded: /usr/local/opt/gmp/lib/libgmp.10.dylib<br>\n  Referenced from: /Users/hec/.elan/toolchains/stable/bin/lean<br>\n  Reason: image not found</p>",
        "id": 252844987,
        "sender_full_name": "Hector Padilla",
        "timestamp": 1631305338
    },
    {
        "content": "<p>Hi! Can you:</p>\n<ul>\n<li>show the output of <code>file /Users/hec/.elan/toolchains/stable/bin/lean</code></li>\n<li>same for <code>otool -L /Users/hec/.elan/toolchains/stable/bin/lean</code></li>\n<li>explain briefly what you ran to get elan, and then what you did to get lean, and how you got vscode</li>\n</ul>\n<p>If you want to interpret that error -- it's saying \"the dynamic linker can't find libgmp\", or even simpler \"lean can't find a dependency of itself while it's trying to start\". And I can see from the path it's looking in that is trying to find an intel libgmp (which is going to live in <code>/usr/local/opt</code>). If you share a bit more about what you ran it'll likely help.</p>",
        "id": 252846770,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631306172
    },
    {
        "content": "<p>Thank you! When I run, file /Users/hec/.elan/toolchains/stable/bin/lean</p>\n<p>/Users/hec/.elan/toolchains/stable/bin/lean: Mach-O 64-bit executable x86_64</p>\n<p>And when I run, otool -L /Users/hec/.elan/toolchains/stable/bin/lean</p>\n<div class=\"codehilite\"><pre><span></span><code>/usr/local/opt/gmp/lib/libgmp.10.dylib (compatibility version 15.0.0, current version 15.1.0)\n/usr/lib/libSystem.B.dylib (compatibility version 1.0.0, current version 1292.60.1)\n/usr/lib/libc++.1.dylib (compatibility version 1.0.0, current version 904.4.0)\n</code></pre></div>\n\n<p>I used Jake's method above to install elan. I also installed lean extension through vscode and installed vscode through their website.</p>",
        "id": 252849696,
        "sender_full_name": "Hector Padilla",
        "timestamp": 1631307587
    },
    {
        "content": "<p>OK cool, so you have a fully intel lean and elan at least. Does <code>ls /usr/local/opt/gmp/lib</code> show that that exists (and contains that file)?</p>",
        "id": 252850105,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631307733
    },
    {
        "content": "<p>it says no such file or directory exists</p>",
        "id": 252850255,
        "sender_full_name": "Hector Padilla",
        "timestamp": 1631307818
    },
    {
        "content": "<p>Aha, interesting ok. Can you try re-running <code>/usr/local/Homebrew/bin/brew install gmp</code> and let me know what it does?</p>",
        "id": 252850464,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631307911
    },
    {
        "content": "<p>Warning: No available formula or cask with the name \"gmp\".<br>\n==&gt; Searching for similarly named formulae...<br>\nError: No similarly named formulae found.<br>\n==&gt; Searching for a previously deleted formula (in the last month)...<br>\nError: No previously deleted formula found.<br>\n==&gt; Searching taps on GitHub...<br>\nError: No formulae found in taps.</p>",
        "id": 252852285,
        "sender_full_name": "Hector Padilla",
        "timestamp": 1631308797
    },
    {
        "content": "<p>Hrm, interesting... And if you run <code>/usr/local/Homebrew/bin/brew update</code> and then try it again?</p>",
        "id": 252853074,
        "sender_full_name": "Julian Berman",
        "timestamp": 1631309156
    },
    {
        "content": "<p>One possibly relevant fact about my approach earlier this year: at some point, the Rosetta terminal I created stopped working. Unfortunately, it was a while ago (maybe around the start of the summer?) and I don't remember exactly what was wrong with it. But, either way, Lean and VS Code were working for me at that point (and still is), so I didn't question it...</p>",
        "id": 252871692,
        "sender_full_name": "Jake Levinson",
        "timestamp": 1631323118
    },
    {
        "content": "<p>I found this thread as I'm considering buying an M1 mac. Besides the installation issues (which make me feel a little intimidated), is the M1 a good machine for lean? On my 5-year-old windows notebook, Lean can be pretty slow at times, which is one of the reasons I'm thinking of buying a new notebook.</p>",
        "id": 254219510,
        "sender_full_name": "Justus Springer",
        "timestamp": 1632235728
    },
    {
        "content": "<p>My M1 MacBook Air handles Lean like a champ. Installation was a pain, but I've mostly got it figured out. I built <code>elan</code> from source and then let it pull whatever lean binaries it wants (usually from a call to <code>leanproject</code>). They will be x86 binaries and they will fail to run. So then I go intro <code>elan</code>'s folder and overwrite them with the proper version of <code>lean</code> that I manually build from source. Then everything works. I can explain in more detail if anyone is interested. The benefit of this hack is that <code>leanproject</code> works.</p>",
        "id": 254221263,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1632236392
    },
    {
        "content": "<p>If you are happy with only having one version of lean, then it seems that you don't really need elan. I tend to use \"leanproject --no-lean-upgrade upgrade-mathlib\"  The real problem with the M1 macs is that even though you have the intel emulation , mixing it with native M1 binaries is a bit of a mess,    so it takes some planning.</p>",
        "id": 254226778,
        "sender_full_name": "Justin Pearson",
        "timestamp": 1632238225
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"436061\">Trevor Fancher</span> <a href=\"#narrow/stream/113489-new-members/topic/M1.20macs/near/254221263\">said</a>:</p>\n<blockquote>\n<p>My M1 MacBook Air handles Lean like a champ. Installation was a pain, but I've mostly got it figured out. I built <code>elan</code> from source and then let it pull whatever lean binaries it wants (usually from a call to <code>leanproject</code>). They will be x86 binaries and they will fail to run. So then I go intro <code>elan</code>'s folder and overwrite them with the proper version of <code>lean</code> that I manually build from source. Then everything works. I can explain in more detail if anyone is interested. The benefit of this hack is that <code>leanproject</code> works.</p>\n</blockquote>\n<p>Yes, detailed instructions in this thread would definitely be helpful for others, particularly as we don't have much on M1 Macs on our website right now!</p>",
        "id": 254229412,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632239123
    },
    {
        "content": "<p>Thanks for the info! I hope my excitement of looking forward to a fast lean environment will mitigate the installation pain.</p>",
        "id": 254230009,
        "sender_full_name": "Justus Springer",
        "timestamp": 1632239343
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> I'll write something up and post it back here. There are a bunch of steps, so it may take a day or so before I have time to remember/rediscover the process.</p>",
        "id": 254235099,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1632241158
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"123965\">@Bryan Gin-ge Chen</span> I went ahead and put the instruction in a new thread <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/M1.20Macs.3A.20Installing.20the.20Lean.203.20toolchain\">#new members &gt; M1 Macs: Installing the Lean 3 toolchain</a> .  I forgot just how convoluted the whole process is. It really does work, though :)</p>",
        "id": 254299386,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1632271369
    },
    {
        "content": "<p>Thanks! I've taken the liberty of editing the title to explicitly say \"Lean 3\".</p>",
        "id": 254300058,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632271994
    },
    {
        "content": "<p>Oops, I guess that broke the link in your message. Sorry!</p>",
        "id": 254300082,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1632272024
    },
    {
        "content": "<p>No problem, I fixed it :)</p>",
        "id": 254300158,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1632272067
    },
    {
        "content": "<p>Hey I'm still getting this SIGABRT error, does anyone know how to fix it? I tried restarting lean. I am also running on a M1 mac. <a href=\"/user_uploads/3121/CNwaxB6H68lI1IfexpqyPrXR/Screen-Shot-2021-10-25-at-11.43.33-AM.png\">Screen-Shot-2021-10-25-at-11.43.33-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/CNwaxB6H68lI1IfexpqyPrXR/Screen-Shot-2021-10-25-at-11.43.33-AM.png\" title=\"Screen-Shot-2021-10-25-at-11.43.33-AM.png\"><img src=\"/user_uploads/3121/CNwaxB6H68lI1IfexpqyPrXR/Screen-Shot-2021-10-25-at-11.43.33-AM.png\"></a></div>",
        "id": 258978268,
        "sender_full_name": "Hector Padilla",
        "timestamp": 1635176674
    },
    {
        "content": "<p>I'm thinking about trying to get one of the new macbooks (which I'm not too happy about, but by all reports this M1 Pro is an absolute beast...). Has anyone tried Lean on one of then yet?</p>",
        "id": 259505333,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1635502638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"284160\">@Eric Rodriguez</span> A few people have (both with Rosetta and installing natively).  Besides this thread, search Zulip for \"apple silicon\", \"M1\", \"aarch64\" and \"arm\".  I don't have one yet.  (I was going to buy one, but then my old company offered me my work MacBook Pro for $200 when I left.)  However, the impression I get is that it works well and is fast (even on the M1 MacBook Air, both emulated on Rosetta or installed natively), but if you are going to install it natively you currently have to compile from source which is some additional work.  Instructions are at <a class=\"stream-topic\" data-stream-id=\"113489\" href=\"/#narrow/stream/113489-new-members/topic/M1.20Macs.3A.20Installing.20the.20Lean.203.20toolchain\">#new members &gt; M1 Macs: Installing the Lean 3 toolchain</a>  (There is some discussion in <a class=\"stream-topic\" data-stream-id=\"113488\" href=\"/#narrow/stream/113488-general/topic/Apple.20Silicon\">#general &gt; Apple Silicon</a> about making an M1 binary to make installation easier, but it involves changes to the current GitHub workflow.)</p>",
        "id": 259511167,
        "sender_full_name": "Jason Rute",
        "timestamp": 1635506974
    },
    {
        "content": "<p>Sorry, maybe I misunderstood.  Were you asking specifically about running Lean on a new M1 Pro/Max chip to get a sense of the performance?  (Given the good reviews for the early M1 chip, I'm sure it's great, but I'd also love to hear from folks how great.)</p>",
        "id": 259512282,
        "sender_full_name": "Jason Rute",
        "timestamp": 1635507765
    },
    {
        "content": "<p>Yes, although this is also very useful info! If I end up getting it, I'll report back :)</p>",
        "id": 259521771,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1635513174
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"439270\">@Hector Padilla</span> Maybe check if gmp got installed in <code>/usr/local/Homebrew/opt</code> when using intel homebrew, in my case it got installed in the homebrew <code>opt</code> directory. </p>\n<p>Not the best solution, but you can change the referenced shared library with <code>install_name_tool -change /usr/local/opt/gmp/lib/libgmp.10.dylib /usr/local/Homebrew/opt/gmp/lib/libgmp.10.dylib /Users/hec/.elan/toolchains/stable/bin/lean</code>.</p>",
        "id": 271259682,
        "sender_full_name": "Nick Yu",
        "timestamp": 1644404372
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"477697\">Nick Yu</span> <a href=\"#narrow/stream/113489-new-members/topic/M1.20macs/near/271259682\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"439270\">Hector Padilla</span> Maybe check if gmp got installed in <code>/usr/local/Homebrew/opt</code> when using intel homebrew, in my case it got installed in the homebrew <code>opt</code> directory. </p>\n<p>Not the best solution, but you can change the referenced shared library with <code>install_name_tool -change /usr/local/opt/gmp/lib/libgmp.10.dylib /usr/local/Homebrew/opt/gmp/lib/libgmp.10.dylib /Users/hec/.elan/toolchains/stable/bin/lean</code>.</p>\n</blockquote>\n<p>In the end I completed the install using homebrew as described at <a href=\"https://leanprover-community.github.io/install/macos.html\">https://leanprover-community.github.io/install/macos.html</a>. But this put Lean at $HOME/.elan/toolchains/leanprover-community--lean---3.41.0/bin/lean.  So the command to fix the reference to libgmp had to point to there.</p>",
        "id": 276141408,
        "sender_full_name": "Cris Perdue",
        "timestamp": 1647921594
    },
    {
        "content": "<p>Recently there is an alpha release for asahilinux which is specifically made for apple M1 chips. Their is a super easy to use installer scripts. I just get Lean run locally on this Linux distro. The only problem is that visual studio code doesn’t work; so one has to use code-server which is like visual studio code but with user interface in a browser.</p>",
        "id": 276349398,
        "sender_full_name": "Jujian Zhang",
        "timestamp": 1648048848
    },
    {
        "content": "<p>Ooh, can you send a link? How come code doesn't work?</p>",
        "id": 276352494,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1648050078
    },
    {
        "content": "<p><a href=\"https://asahilinux.org\">https://asahilinux.org</a></p>",
        "id": 276365382,
        "sender_full_name": "Jujian Zhang",
        "timestamp": 1648054397
    },
    {
        "content": "<p>All lean code works; it’s just visual studio code the editor doesn’t compile.</p>",
        "id": 276365429,
        "sender_full_name": "Jujian Zhang",
        "timestamp": 1648054421
    },
    {
        "content": "<p><a href=\"https://github.com/coder/code-server\">https://github.com/coder/code-server</a><br>\nThis link is vscode in browser</p>",
        "id": 276365791,
        "sender_full_name": "Jujian Zhang",
        "timestamp": 1648054541
    },
    {
        "content": "<p>Good day to everyone! Recently I've found some more time to dive into Lean once again, but currently have problems while installing Lean on my M1 Mac Mini. I've carefully followed the steps provided here: <a href=\"https://leanprover-community.github.io/install/macos.html\">https://leanprover-community.github.io/install/macos.html</a>, everything looked fine, but in the end after I've downloaded Mathematics_in_lean using <code>leanproject get</code>all the commands are highlighted by the red lines.</p>\n<p>the explanation is \"file 'data/real/basic' not found in the search path\" and so on. I'd be grateful if someone could direct me to what to do next since I'm not really familiar with programming, Visual Studio and other IT-related subjects. Thanks in advance!</p>",
        "id": 304136059,
        "sender_full_name": "Daniel Ever",
        "timestamp": 1665792003
    },
    {
        "content": "<p>Are you using VSCode? If so, do you see <code>leanpkg.toml</code> and <code>leanpkg.path</code> at the root of the open directory?</p>",
        "id": 304146236,
        "sender_full_name": "Matt Diamond",
        "timestamp": 1665803004
    },
    {
        "content": "<p>Yeah, often the issue is that the user did not open the root directory of a lean project with VS Code's \"open folder\" functionality</p>",
        "id": 304159511,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665817456
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"380294\">Matt Diamond</span> <a href=\"#narrow/stream/113489-new-members/topic/M1.20macs/near/304146236\">said</a>:</p>\n<blockquote>\n<p>Are you using VSCode? If so, do you see <code>leanpkg.toml</code> and <code>leanpkg.path</code> at the root of the open directory?</p>\n</blockquote>\n<p>indeed, it solved the issue! I never thought it was important since I was already insider the folder and used <code>code</code> command to get there before. Thanks for your help!</p>",
        "id": 304184596,
        "sender_full_name": "Daniel Ever",
        "timestamp": 1665832100
    },
    {
        "content": "<p>Hello! I got a new m1 mac recently and have wanted to install lean. I've been following the instructions on <a href=\"https://leanprover-community.github.io/install/macos.html\">https://leanprover-community.github.io/install/macos.html</a>, but get stuck at the part where I run the command <code>arch -x86_64 zsh</code>. It keeps giving me the error  <code>arch: posix_spawnp: zsh: Bad CPU type in executable</code>. I don't really have much familiarity with how these things work, so would appreciate any help!</p>",
        "id": 318767253,
        "sender_full_name": "Dhruv Bhatia",
        "timestamp": 1672508887
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"452188\">@Dhruv Bhatia</span> You probably haven't installed Rosetta yet: <a href=\"https://apple.stackexchange.com/a/408379/119179\">https://apple.stackexchange.com/a/408379/119179</a></p>",
        "id": 318859370,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1672580249
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372804\">@Marcus Rossel</span> Note that this was the error message a <a href=\"#narrow/stream/113488-general/topic/Installing.20mathlib.20on.20M1.20Mac/near/291366560\">friend of mine got</a> after Rosetta 2 installed apparently successfully. Do you think it really is that Rosetta is corrupted as was commented in that part of the thread, and if so, do you have a better fix than the pretty wild instructions I got on reinstalling it?</p>",
        "id": 318949077,
        "sender_full_name": "Bolton Bailey",
        "timestamp": 1672647130
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"282271\">@Bolton Bailey</span> Unfortunately I'm not well-versed in this kind of topic either, but the next best thing I'd try is running the commands from a terminal that was explicitly launched using Rosetta: <a href=\"https://apple.stackexchange.com/a/428769\">https://apple.stackexchange.com/a/428769</a></p>",
        "id": 318950552,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1672647861
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"372804\">@Marcus Rossel</span> that worked! Thanks, I'd been banging my head against a wall for a while there!</p>",
        "id": 319103153,
        "sender_full_name": "Dhruv Bhatia",
        "timestamp": 1672699696
    },
    {
        "content": "<p>I have installed elan using rosetta 2 brew. can someone tell me how can I change to default brew on arm64? even when I run <code>arch -arm64 zsh</code> and type <code>brew list</code>, it still shows the x86 brew packages.</p>",
        "id": 322770777,
        "sender_full_name": "Topo_Space",
        "timestamp": 1674329046
    },
    {
        "content": "<p>Does somebody know what's the issue?</p>\n<p><code>file 'topology/basic' not found in the search path\nUse 'lean --path' to see where lean is looking, or https://leanprover-community.github.io/file-not-found.html for more</code></p>\n<p>and when I check the <code>lean --path</code> it shows the following:<br>\n<code>lean --path\n{\n  \"is_user_leanpkg_path\": false,\n  \"leanpkg_path_file\": \"/Users/max/Local Repository/Lean/my_project/leanpkg.path\",\n  \"path\": [\n    \"/Users/max/.elan/toolchains/leanprover-community--lean---3.50.3/bin/../library\",\n    \"/Users/max/.elan/toolchains/leanprover-community--lean---3.50.3/bin/../lib/lean/library\",\n    \"/Users/max/Local Repository/Lean/my_project/_target/deps/mathlib/src\",\n    \"/Users/max/Local Repository/Lean/my_project/./src\"\n  ]\n}</code></p>",
        "id": 322875074,
        "sender_full_name": "Topo_Space",
        "timestamp": 1674401547
    },
    {
        "content": "<p>I don't use a mac, but have you opened in VS code the <em>folder</em> you want to work in (and not only a single file)?</p>",
        "id": 322877185,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1674402701
    },
    {
        "content": "<p>yes I did</p>",
        "id": 322878595,
        "sender_full_name": "Topo_Space",
        "timestamp": 1674403409
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"130384\">Riccardo Brasca</span> <a href=\"#narrow/stream/113489-new-members/topic/M1.20macs/near/322877185\">said</a>:</p>\n<blockquote>\n<p>I don't use a mac, but have you opened in VS code the <em>folder</em> you want to work in (and not only a single file)?</p>\n</blockquote>\n<p>only the project must be opened with vscode. thanks for your mention. problem solved.</p>",
        "id": 322881484,
        "sender_full_name": "Topo_Space",
        "timestamp": 1674404935
    }
]