[
    {
        "content": "<p>Hey all, I am having a heck of a time getting mathlib to work in Visual Studio. I have gone over the instructions and everything is coming back correctly except for the step when I run <br>\n\"which python\" to which I am supposed to get \"/c/Users/&lt;user&gt;/AppData/Local/Programs/Python/Pythonxx-xx/python\" but end up getting /c/Users/&lt;user&gt;/AppData/Local/Programs/Python/Python310/python<br>\nI do not know what the issue could be besides this, since everything else seems fine. <br>\nThanks for the help in advance</p>",
        "id": 303045016,
        "sender_full_name": "Brandon Sisler",
        "timestamp": 1665249950
    },
    {
        "content": "<p>That looks fine to me! The xx on the website just means \"whatever number python is up to now\"</p>",
        "id": 303046298,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665250917
    },
    {
        "content": "<p>Just to be sure, you're using Visual Studio <em>Code</em>, right? Visual Studio is a different product that likely does not support lean.</p>",
        "id": 303049735,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1665253151
    },
    {
        "content": "<p>What error are you running into?</p>",
        "id": 303058211,
        "sender_full_name": "Newell Jensen",
        "timestamp": 1665258790
    },
    {
        "content": "<p>Yes, as an example, if I try and use data.real.basic from the first tutorial then I get this :</p>\n<p><a href=\"/user_uploads/3121/eg8X-mqnOY33UaNfWoLgSkd_/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/eg8X-mqnOY33UaNfWoLgSkd_/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/eg8X-mqnOY33UaNfWoLgSkd_/image.png\"></a></div><p>and cannot use anything included in that package.</p>",
        "id": 303060166,
        "sender_full_name": "Brandon Sisler",
        "timestamp": 1665260379
    },
    {
        "content": "<p>Fire up the terminal at the bottom of the screen and type <code>leanproject get-mathlib-cache</code> and see if that fixes it.</p>",
        "id": 303060237,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665260423
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"310045\">Eric Wieser</span> <a href=\"#narrow/stream/113489-new-members/topic/Mathlib.20with.20Visual.20Studio/near/303049735\">said</a>:</p>\n<blockquote>\n<p>Just to be sure, you're using Visual Studio <em>Code</em>, right? Visual Studio is a different product that likely does not support lean.</p>\n</blockquote>\n<p>Yes, if I understand the question right. I can run lean code just fine, just not with the packages in matlib.</p>",
        "id": 303060259,
        "sender_full_name": "Brandon Sisler",
        "timestamp": 1665260442
    },
    {
        "content": "<p>It looks like you didn't install the project correctly. The orange bars just mean that Lean is working fine and just compiling mathlib. If you wait for 6 hours or so it should work fine, and the room your computer is in will be nice and hot as well. The command I'm suggesting will download precompiled binaries from the internet which will hopefully solve your problem.</p>",
        "id": 303060313,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665260506
    },
    {
        "content": "<p>No stop, I take that back. You have got the wrong folder open, that's your mistake.</p>",
        "id": 303060400,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665260555
    },
    {
        "content": "<p>On the left you can see that there is a visible directory called <code>tutorials</code>. That directory shouldn't be visible -- that should be the directory which you open with VS Code. I don't know for sure but it looks to me like you have got two copies of the tutorials lean project, one inside another one, and right now you have opened one of the projects with VS Code and are trying to use files in the other project; this will not work.</p>",
        "id": 303060510,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665260655
    },
    {
        "content": "<p>For example I can see two directories called <code>src</code>. This is evidence that you have a pretty borked set-up. If you haven't started doing anything yet then I recommend deleting everything (i.e. both projects) and redownloading the tutorials project, just once, with <code>leanproject get tutorials</code> or whatever it's called. This command will create a new folder called <code>tutorials</code>. Open that folder with VS Code and you'll be fine. Right now you have a corrupted project (or more precisely a project within a project, which is not a setup which is supported)</p>",
        "id": 303060612,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1665260757
    },
    {
        "content": "<p>Well shucks, yah I don't have anything I can't just save in a note app, I'll do as you recommend and see if that does it. Thank you<br>\n.</p>",
        "id": 303060821,
        "sender_full_name": "Brandon Sisler",
        "timestamp": 1665260892
    },
    {
        "content": "<p>Hey, that did it, thanks so much!</p>",
        "id": 303061538,
        "sender_full_name": "Brandon Sisler",
        "timestamp": 1665261587
    }
]