[
    {
        "content": "<p>I have the windows 10 store install of python3 and once I remove the aliases I can't seem to find the location that I need to add to git bash path to continue the install.  Any chance someone knows where the store version gets installed?  Can't seem to find an easy answer looking around.</p>",
        "id": 193664374,
        "sender_full_name": "PV",
        "timestamp": 1586617324
    },
    {
        "content": "<p>Note: I did pivot to just doing the install in windows 10 ubuntu wsl (worked great) as I could not seem to get around the strange windows 10 store python install.  Maybe that is not supported way to go.</p>",
        "id": 193665885,
        "sender_full_name": "PV",
        "timestamp": 1586619424
    },
    {
        "content": "<p>Wow. There is a Windows Store version of Python?</p>",
        "id": 193691245,
        "sender_full_name": "Shing Tak Lam",
        "timestamp": 1586660529
    },
    {
        "content": "<p>Anyways, it's installed in <code>C:\\Program Files\\WindowsApps\\PythonSoftwareFoundation.Python.3.8_3.8.752.0_x64__qbz5n2kfra8p0</code></p>",
        "id": 193691250,
        "sender_full_name": "Shing Tak Lam",
        "timestamp": 1586660587
    },
    {
        "content": "<p>I think the bit at the end is a hash? so it may be different for everyone. Also you might need to mess with permissions to access that folder. So WSL is probably a better idea. Or just install from the website.</p>\n<p>Edit: Or anaconda.</p>",
        "id": 193691251,
        "sender_full_name": "Shing Tak Lam",
        "timestamp": 1586660641
    },
    {
        "content": "<p>I can't recommend enough using a pre-compiled binary distribution on Windows like conda</p>",
        "id": 193692206,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586662683
    },
    {
        "content": "<p>Python on Windows is compiled with some ancient version of Visual Studio; it's a huge pain, do not recommend</p>",
        "id": 193692212,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586662715
    },
    {
        "content": "<p>even the development version of Python shipped with Visual Studio uses Anaconda's <code>conda</code> under the hood</p>",
        "id": 193692218,
        "sender_full_name": "Andrew Ashworth",
        "timestamp": 1586662782
    },
    {
        "content": "<p>The wsl install with the remote vscode extension is great.  Good point on using conda though for a windows only install.</p>",
        "id": 193692437,
        "sender_full_name": "PV",
        "timestamp": 1586663222
    }
]