[
    {
        "content": "<p>In various topics I've self-studied, I've found it very helpful to be able to quickly get unstuck by asking in a chat room. The low response latency makes for efficient learning. I want to self-study probability, and I'm wondering if anybody knows a chat room (somewhere on the internet) where that would be on topic. The Lean Zulip is great of course, but the last time I tried, it was too much of a struggle to learn probability and lean and mathlib's measure theory all at once. Can you think of a place where I could ask probability questions as I'm going through a book?</p>",
        "id": 259015346,
        "sender_full_name": "Iocta",
        "timestamp": 1635193393
    },
    {
        "content": "<p><a href=\"http://math.stackexchange.com\">math.stackexchange.com</a> is pretty good</p>",
        "id": 259016779,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1635194044
    },
    {
        "content": "<p>it's not a chatroom but you can still get answers in &lt; 1 hour most of the time</p>",
        "id": 259016868,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1635194094
    },
    {
        "content": "<p>there is also a chatroom though, for very short questions</p>",
        "id": 259016973,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1635194143
    },
    {
        "content": "<p>The question box there also has a feature that as you write your question, a sidebar of related questions shows up. I've had a couple things answered that way.</p>",
        "id": 259017426,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1635194377
    },
    {
        "content": "<p>For completeness, <a href=\"https://libera.chat/\">Libera (an IRC network)</a> also still has a ##math room with ~600  people in it at any given point in time -- whether people respond or how sophisticated of a question you can ask is sometimes hit or miss, but yeah it's an option.</p>",
        "id": 259027534,
        "sender_full_name": "Julian Berman",
        "timestamp": 1635200062
    },
    {
        "content": "<p>Thanks all.</p>",
        "id": 259046013,
        "sender_full_name": "Iocta",
        "timestamp": 1635216711
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"253355\">Iocta</span><br>\nI've found that creating/joining a discord server helps for this kind of thing. I am also interested in starting to study probability. PM me if you'd be interested in talking more about potentially going through it together.</p>",
        "id": 259070922,
        "sender_full_name": "Lucas Teixeira",
        "timestamp": 1635240239
    }
]