[
    {
        "content": "<p>Hi, total noob here. I'm a software engineer, not a mathematician, but I enjoy some recreational math and I thought Lean looked like a really fun avenue to explore. I'm from the US, but I live in Düsseldorf, Germany.</p>",
        "id": 200662511,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591964226
    },
    {
        "content": "<p>Welcome!</p>",
        "id": 200663114,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1591964627
    },
    {
        "content": "<p>If the goal is exactly recreation, <br>\nI think the funnest part of Lean for a new user is filling in sorries. So I recommend the \"game\"s, tutorials, and Codewars :)</p>",
        "id": 200667297,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591967150
    },
    {
        "content": "<p>Thanks for the suggestion! I've done most of the natural number game, and I'm just starting the tutorial now. I think the Codewars katas are maybe more intermediate? The very first kata is about finding a syntax error, and the errors shown on the website are not helpful for finding it.</p>",
        "id": 200667929,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591967487
    },
    {
        "content": "<p>I certainly hope the tutorials are much easier and much more interesting than codewars</p>",
        "id": 200671808,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1591969671
    },
    {
        "content": "<p>which kata is about finding a syntax error? afaik they don't have a canonical order. <br>\nalso, you should write code locally. It's not hard to install Lean and VSCode, and the experience of writing locally is significantly better than writing code on codewars. (and at least a little bit better than writing code in the community web editor, which is what e.g. the natural number game runs on.)</p>",
        "id": 200673281,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591970296
    },
    {
        "content": "<blockquote>\n<p>The very first kata is about finding a syntax error, and the errors shown on the website are not helpful for finding it.</p>\n</blockquote>\n<p>Yeah, the entry kata to the site is rather designed for ordinary programming languages and doesn't fit Lean (or other theorem proving languages) so well. IMHO a more suitable introductory Lean kata would be <a href=\"https://www.codewars.com/kata/5c879811bc562909bf65c8e6/lean\">Theorem proving hello world</a>.</p>",
        "id": 200673456,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1591970389
    },
    {
        "content": "<p>I thought it was fine, but it is true that it tests a skill (basically, do you know how to write a definition) that won't come up again until you get to the point where you want to write auxiliary definitions in your kata solutions.</p>",
        "id": 200673877,
        "sender_full_name": "Reid Barton",
        "timestamp": 1591970577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"252300\">@Jalex Stark</span>  this one: <a href=\"/user_uploads/3121/QBcT8TNzPkV27FbH5I2xaG--/image.png\">image.png</a> . I guess it might not be about finding a syntax error, but that's what I thought when I read the instructions. Copying and pasting the code into VS code and solving it locally makes sense I guess, but I think it defeats the purpose of having katas on the CodeWars site, doesn't it? At that point, it seems like it would be better to migrate all of the katas into the tutorials.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/3121/QBcT8TNzPkV27FbH5I2xaG--/image.png\" title=\"image.png\"><img src=\"/user_uploads/3121/QBcT8TNzPkV27FbH5I2xaG--/image.png\"></a></div>",
        "id": 200675936,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591971636
    },
    {
        "content": "<p>ah yeah that first kata is not particularly friendly.<br>\nthe thing that codewars did for me was to give me a list of problems that I'm supposed to solve mostly without help, as though i were an undergrad doing problem sets.</p>",
        "id": 200676201,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1591971770
    },
    {
        "content": "<p>Ah, makes sense</p>",
        "id": 200676702,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591972016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311255\">@Nathan Glenn</span> About the lack of an interactive environment for Lean, Codewars currently supports over 50 different programming languages, probably more than any other recreational/educational/competitive OJ site you could find, so it is infeasible to support a full-fledged IDE for every language. As Jalex mentioned, you may wish to think of Codewars as a repository of Lean exercises of varying difficulty, contributed by the community, as opposed to a dedicated online tutorial. For getting up to speed with Lean as a complete beginner, I would still recommend proper tutorials and/or textbooks such as the <a href=\"https://wwwf.imperial.ac.uk/~buzzard/xena/natural_number_game/\">NNG</a>, <a href=\"https://leanprover.github.io/theorem_proving_in_lean/\">TPIL</a> and/or Patrick's tutorial.</p>",
        "id": 200678412,
        "sender_full_name": "Donald Sebastian Leung",
        "timestamp": 1591972804
    },
    {
        "content": "<p>Thanks! I'm working on the tutorial now.</p>",
        "id": 200695709,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591980972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311255\">@Nathan Glenn</span> heh, I'm a Lean newb from Duisburg, waving from one city over ;-)</p>",
        "id": 200698804,
        "sender_full_name": "Carl Friedrich Bolz-Tereick",
        "timestamp": 1591982605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"311255\">@Nathan Glenn</span> hey there, welcome!</p>",
        "id": 200699112,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1591982744
    },
    {
        "content": "<p>Well, fun you will certainly have. Know that rush you get when things compile? Completing proofs is much better, because Lean is much more annoying than any compiler out there (I'd love to see someone argue for Rust's).</p>",
        "id": 200699373,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1591982866
    },
    {
        "content": "<p>There are several Rust people here, maybe you'll be lucky.</p>",
        "id": 200700238,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1591983294
    },
    {
        "content": "<p>I learned Rust for my last project and thought I'd move onto Lean, actually :D I was going to learn Haskell, but someone on HN said that learning Lean did a much better job of teaching them how to think differently, and then I came down this rabbit hole...</p>",
        "id": 200700245,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591983298
    },
    {
        "content": "<p>You can learn Haskell using Lean, just write <code>meta</code> in front of every definition and don't prove anything.</p>",
        "id": 200702089,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1591984254
    },
    {
        "content": "<p><span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span>  sounds easy! Yeah my first impression is that Lean is a superset of Haskell. Haskell didn't seem super production-applicable to me at first glance, so I thought I'd go for something that provided the mind-bending language learning benefit but also had a niche application that I couldn't easily get elsewhere.</p>",
        "id": 200703373,
        "sender_full_name": "Nathan Glenn",
        "timestamp": 1591984846
    }
]