[
    {
        "content": "<p>TLDR:  Advice request for an old curious uneducated person who wants to learn Maths.</p>\n<p>I dropped out of college 40 years ago and have made a living as a self-taught IT specialist.  I am retiring in 3 years and would like to go back to school and get an undergraduate degree in Math/Physics (just for the fun of it).  I have spent the past few years taking most of the courses required of an undergrad math major at my local university.  It is easy enough for me to get A's in the courses, but I am not learning maths at a foundational or deep level.  A lot of this may be due to the fact that I didn't take the courses in sequence and often took a course and it's prerequisites simultaneously.  My biggest blunder was taking a graduate level course in Complex Analysis without any undergraduate courses in Complex Variables.  I got a C.</p>\n<p>I have played around with functional programming over the years (mainly LISP and Haskell) and have a very superficial knowledge of Categories and the Curry-Howard-Lambek isomorphism.  I have been playing with Lean for a couple of weeks.  I am almost through with the Natural Number Game and am starting to work my way through the Logic and Proofs Book.  I enjoy it a lot, but am finding it hard to master Lean and Mathematics at the same time.</p>\n<p>I was a little disheartened to hear Kevin Buzzard suggest that there really is no pedagogical advantage to using Lean while attempting to learn maths.  A \"real\" undergraduate level understanding of maths is my goal.  Any advice other than do a lot of problems?  Thank you in advance and sorry for the question I'm sure has been asked many many times before.  This is a New Members thread so I don't feel too bad.  I figure if you are tired of answering this type of question, you will just ignore me.</p>",
        "id": 221174286,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609281949
    },
    {
        "content": "<p>My 2 cents: you learn maths by doing problems with pen and paper, at least right now. We haven't designed any tools for using Lean to teach serious maths yet; the people who do the best at Lean are the ones who basically know the maths already. The tools will come though.</p>",
        "id": 221174474,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1609282161
    },
    {
        "content": "<p>I was afraid that would be the response.  It sounds reasonable to me.  Thank you for responding.  I think I will take your advice and concentrate on  learning the maths in a semi-traditional manner with the standard curriculum and lots of repetition and mastery before moving on.  I will probably continue with Lean as well just because I find it interesting.  I really appreciate all the good work you guys are doing.  I think it is a good path and would like to encourage you as much as possible.</p>",
        "id": 221174768,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609282454
    },
    {
        "content": "<p>if you are just aiming at \"college level math\" with a background of practical computer stuff, you might find itmore  interesting to learn number theory rather than calculus</p>",
        "id": 221174802,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609282516
    },
    {
        "content": "<p>there are kind of two tracks</p>",
        "id": 221174805,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609282519
    },
    {
        "content": "<p>but all the \"dealing with infinite sets via formalism\" type stuff that is important for calculus/analysis does not really have an analog in computer stuff, whereas number theory relates more to reasoning about finite entities like computers are. the calculussy things are more interesting for science / physics that sort of thing. all in my humble opinion. but a lot of people who are like hmm i want to learn more math only think of it as a scale that goes up to calculus, when the number theory type things might have a higher ratio of like accessibility and usefulness to difficulty</p>",
        "id": 221174986,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609282689
    },
    {
        "content": "<p>something like the material described in <a href=\"https://nrich.maths.org/number-theory\">https://nrich.maths.org/number-theory</a></p>",
        "id": 221175055,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609282793
    },
    {
        "content": "<p>I agree with your advice as well.  I enjoyed Calculus when I was teaching myself and felt like I had to be able to prove everything rigorously.  When I took it in school there was no theory involved, just memorize a few rules and be able to apply them mechanically on a test.  I might have misstated my goal when I said \"college level math\".  I want to know the Math and Physics that would have been known to a really talented professional at the end of the 19th Century.  Not only do I want to know the 'what' but more importantly the 'how' and 'why'.</p>\n<p>I do agree that number theory might be a better fit for me than calculus.  I am trying to take a more algebraic approach to things right now.  I am a few hundred years at least from where I want to be.  Thanks for the advice and the URL.</p>",
        "id": 221175572,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609283386
    },
    {
        "content": "<p>Yours story is very like my story. I like math but don't know it. What about reading books? Some interesting topics are abstract algebra, category theory, commutative algebra, algebraic topology and so on. I can recommend some books, but most of them are in russian.</p>",
        "id": 221176000,
        "sender_full_name": "Дмитрий Лейкин",
        "timestamp": 1609283932
    },
    {
        "content": "<p>Thanks Дмитрий.  I wish I could read Russian!  The languages with non-Western alphabets are very difficult for me.  Mandarin is killing me!  I am trying to read books on my own and I am interested in all the topics that you mentioned.  I am trying to work my way through a video course on Abstract Algebra from Harvard that was taught by Benedict Gross.  He used the textbook by Michael Artin.  There is just so much to learn.  It is like trying to drink water from a fire hose.  I think I just need to concentrate on working slowly and methodically and not moving to  another subject until I have completely mastered my current focus area.</p>",
        "id": 221177030,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609285183
    },
    {
        "content": "<p>skimming through the content of that class, that seems like it could be a lot to start out with. i would go for something like \"elementary number theory\", like something that leads up to proving fermat's little theorem</p>",
        "id": 221177271,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609285451
    },
    {
        "content": "<p><em>little</em> mind you</p>",
        "id": 221177276,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1609285454
    },
    {
        "content": "<p>Thank you Kevin Lacker.  I am going to take your advice and do as you suggest.  I appreciate the guidance.</p>\n<p>I do remember proving Fermat's Little Theorem for a test in a Beginning Abstract Algebra course that I took two years ago.  Unfortunately, I didn't internalize it because I was unable to reproduce the proof from memory.  I had to look it up in my textbook.  It was done as a corollary to Lagrange's Theorem (with an assist from Euler).  I'm mildly encouraged by the fact that I remember doing the proof at one time, but that is not the same thing as actually knowing the material.  I have Burton's Elementary Number Theory and will work my way through it and actually try to learn the material.  I really appreciate your taking the time to help me out.  Thank you very much!</p>",
        "id": 221180330,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609288984
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370155\">@Joel Healy</span> In addition to what has already been said, I don't think you need to first learn math then learn formalization; you just need to tailor the formalization goals to things that you already somewhat understand at a mathematical level</p>",
        "id": 221190548,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609304717
    },
    {
        "content": "<p>Formalizing a proof is a great way to force yourself to study it in detail. The best choice for this kind of thing is a medium to large proof which might be technical but is composed of pieces you understand</p>",
        "id": 221190681,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609304885
    },
    {
        "content": "<p>Execuse me for offtopic, but russian alphabet is very like english, and all these languages are from indo-europian language family (and if you compare english, greek, hebrew and russian alphabets the order of letters in many places are the same). About abstract algebra, I liked Herstein \"Abstract algebra\" and  \"Topics in algebra\".  There is also interesting book Paolo Aluffi \"Algebra Chapter 0\"  about abtract algebra with category theory ideas explained.</p>",
        "id": 221191901,
        "sender_full_name": "Дмитрий Лейкин",
        "timestamp": 1609307180
    },
    {
        "content": "<p>@Дмитрий Лейкин - Regarding offtopic: I actually tried to memorize the Russian alphabet a year or two ago.  I got to the point where I could recognize some words phonetically.  At one point I probably could have butchered a pronunciation of your name.  However, I didn't continue with Russian and now I have forgotten everything.  I even uninstalled my Russian keyboard mapping from my computer.  I never attempted Hebrew (although I find it intriguing).  The only reason I mostly remember the Greek alphabet is because I routinely see them used as variable names.  Perhaps I should start using Russian letters for variable names instead! <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>  </p>\n<p>Regarding your book recommendations:  I can't tell you how much I appreciate you taking the time to do this for me.  I am too old to try to learn using inefficient methods, so I take recommendations of successful techniques very seriously.  I will try to investigate these books.</p>",
        "id": 221221164,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609342976
    },
    {
        "content": "<p>@Mario Carneiro - You wrote \"Formalizing a proof is a great way to force yourself to study it in detail\".  This  really resonates with me and I was hoping to use Lean to provide the structure for me to understand maths.  I still plan to go through the Logic and Proof PDF on the community website.  I think I have enough superficial acquaintance with naïve logic to make this a good experience for me.  After that I was hoping that there would be some similar sort of guided course in Algebra.  I was hoping that Algebra would be a good area for relatively easy formalization.</p>\n<p>I know that I am just an uneducated simpleton,  but it always  frustrated me that  college level math seemed to be based upon the calculus of Real numbers, but nobody ever explained exactly what Real numbers were.  They just tell you that they are fundamental and that they form the best basis for the rest of your learning.  At best, the calculus books that I have looked at would have a two or three page appendix that mentioned the magical words \"Dedekind cuts\" and presto!  There was also sometimes a chart that diagramed the relationships between well-ordering, induction, etc.  When I was sixteen I went to a local technical library that had thousands of math books, but I could only find a couple that dealt with the formalization of the Reals.  I seem to recall that the proof of 1 + 1 = 2 was several hundred pages in.  I started reading the book, but never made it out of the first chapter.</p>\n<p>I apologize for being so snarky.  I really appreciate and admire this community and I hope to learn a lot from hanging around and listening to you all.</p>",
        "id": 221223970,
        "sender_full_name": "Joel Healy",
        "timestamp": 1609345061
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"370155\">Joel Healy</span> <a href=\"#narrow/stream/113489-new-members/topic/Newbie.20with.20stale.20question/near/221177030\">said</a>:</p>\n<blockquote>\n<p>Thanks Дмитрий.  I wish I could read Russian!  The languages with non-Western alphabets are very difficult for me.  Mandarin is killing me!  I am trying to read books on my own and I am interested in all the topics that you mentioned.  I am trying to work my way through a video course on Abstract Algebra from Harvard that was taught by Benedict Gross.  He used the textbook by Michael Artin.  There is just so much to learn.  It is like trying to drink water from a fire hose.  I think I just need to concentrate on working slowly and methodically and not moving to  another subject until I have completely mastered my current focus area.</p>\n</blockquote>\n<p>(just chiming in that that course I think is very good -- when you feel ready for it I'd definitely recommend it. I had a terrible undergrad math experience and those video lectures taught me algebra when my actual courses didn't)</p>",
        "id": 221225127,
        "sender_full_name": "Julian Berman",
        "timestamp": 1609346070
    },
    {
        "content": "<p>I didn't read artin though myself, I went through the lectures while reading Fraleigh, which was easier for a newbie</p>",
        "id": 221225174,
        "sender_full_name": "Julian Berman",
        "timestamp": 1609346158
    }
]