[
    {
        "content": "<p>Hi!</p>\n<p>I am using Lean with the vscode extension on linux, with compiled mathlib etc. I have no problems when I am editing a few files, even when I use imports from mathlib. But after a few minutes/hours of editing my files and pressing F12 to open the source of stuff, the lean process memory is consuming 30%-40% of my (8GB) memory, and even if I close all the vscode tabs the memory usage never goes down. So I have to periodically kill and restart the lean process. Is this normal? Is there something I can do?</p>",
        "id": 201057407,
        "sender_full_name": "Lucas Viana",
        "timestamp": 1592332922
    },
    {
        "content": "<p>you can restart lean from within vscode</p>",
        "id": 201057985,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1592333219
    },
    {
        "content": "<p>ctrl-shift-p \"restart lean\" should find it</p>",
        "id": 201058158,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1592333323
    },
    {
        "content": "<p>i think these issues are common, but if you have things set up correctly, then restarting lean is actually not so expensive (so the common solution is just to restart lean when there's an issue)</p>",
        "id": 201058218,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1592333367
    },
    {
        "content": "<p>I don't have any insights in to the nature of the problem, but it's probably the sort of thing where working on it for Lean 3 is duplicating efforts of the Lean 4 folks</p>",
        "id": 201058383,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1592333458
    },
    {
        "content": "<p>I am also having this problem. But in my case Lean is consuming so much memory my computer eventually freezes. Is there a way to limit the amount of memory used by the server?</p>",
        "id": 201079026,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1592344411
    },
    {
        "content": "<p>There's a -M switch which you can tell VS Code to use. I remember but having much success with it though</p>",
        "id": 201080293,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592345311
    },
    {
        "content": "<p>I fixed freezes by creating some swap space</p>",
        "id": 201080305,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592345326
    },
    {
        "content": "<p>It is possible that there is some bug that can be fixed. Is there a reliable way of reproducing this? e.g. a list of steps that someone can take to get the memory usage to go up by X GB over and over.</p>",
        "id": 201080891,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1592345797
    },
    {
        "content": "<p>I thought it was limited by default.</p>",
        "id": 201080938,
        "sender_full_name": "Reid Barton",
        "timestamp": 1592345849
    },
    {
        "content": "<p>We've discussed the -M flag before, see <a href=\"#narrow/stream/113489-new-members/topic/emacs/near/197821742\">this post</a>. If it's not working, that's a problem.</p>",
        "id": 201081083,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1592345962
    },
    {
        "content": "<p>I've definitely seen Lean eat up all my memory and lock up my computer. It happened a lot when I was working on linter stuff and had multiple copies of mathlib in memory at once. I suspected at the time that there was a memory leak with opening and closing many different files in the same VSCode session. But I never spent the time to find a reliable way to reproduce it.</p>",
        "id": 201081388,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1592346175
    },
    {
        "content": "<p>This kind of memory issue is above my paygrade, but if anyone is interested in investigating, I can try again to find a way to reproduce it. (<span class=\"user-mention\" data-user-id=\"110043\">@Gabriel Ebner</span> if you're feeling bored? ;) )</p>",
        "id": 201081449,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1592346231
    },
    {
        "content": "<p>But generally, restarting the Lean server will clean things up. I have that bound to a hotkey and hit it now and then out of instinct.</p>",
        "id": 201081550,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1592346292
    },
    {
        "content": "<p>If you have multiple copies of mathlib open, maybe they correspond to multiple lean server processes (with different LEAN_PATHs, or even different versions of Lean) each separately limited to 4G or whatever it is.</p>",
        "id": 201082864,
        "sender_full_name": "Reid Barton",
        "timestamp": 1592347174
    },
    {
        "content": "<p>I'm not as much of a pro as Rob, I only ever have one VS Code open and no command line lean running, and I've still seen lean take down my work computer with 8 gigs -- indeed this was commonplace earlier this year and the -M flag wouldn't fix it for me. In the end I just used my laptop when at work. 16 gigs is enough for me</p>",
        "id": 201084354,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592348347
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"110032\">Reid Barton</span> <a href=\"#narrow/stream/113489-new-members/topic/non.20decreasing.20memory.20usage/near/201080938\">said</a>:</p>\n<blockquote>\n<p>I thought it was limited by default.</p>\n</blockquote>\n<p>I was going to follow <span class=\"user-mention\" data-user-id=\"110038\">@Kevin Buzzard</span>'s advice, but noticed that <code>-M 4096</code> is set by default for me.</p>",
        "id": 201091556,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1592355288
    },
    {
        "content": "<p>I have just tested the memory limit and it is working; here it was set to 4GB too but when things start moving to swap my computer freezes. It seems to me that the vscode extension keeps the files you closed \"in cache\", so if you reopen them there is no need to check them again. But to me this can turn into a problem when I peek and close multiple files from mathlib in the same session.</p>",
        "id": 201095114,
        "sender_full_name": "Lucas Viana",
        "timestamp": 1592359999
    },
    {
        "content": "<p>I made lean use all the 4GB limit just by opening and closing random mathlib files (when I open them, lean does the checking even if I have them compiled in the project)</p>",
        "id": 201095193,
        "sender_full_name": "Lucas Viana",
        "timestamp": 1592360134
    },
    {
        "content": "<p>It would be useful if I could disable the checking of files inside the mathlib folder</p>",
        "id": 201095241,
        "sender_full_name": "Lucas Viana",
        "timestamp": 1592360164
    },
    {
        "content": "<p>There's the <code>--old</code> command line option (in Lean 3.10.0c and newer), which might help with this.</p>",
        "id": 201095254,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1592360200
    },
    {
        "content": "<p>I've been getting complete computer freezes recently with VSCode and Lean as well.</p>",
        "id": 201177679,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1592416595
    },
    {
        "content": "<p>Does it just happen when you have a lot of files open?</p>",
        "id": 201178034,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1592416766
    },
    {
        "content": "<p>I have 3 files open, only 1 mathlib file, and the extension is set to <code>check visible files</code></p>",
        "id": 201178289,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1592416863
    },
    {
        "content": "<p>I'll try setting memory limit to 1024 MB</p>",
        "id": 201178318,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1592416876
    },
    {
        "content": "<p>If that won't work, I'll try remote VSC on a DigitalOcean droplet</p>",
        "id": 201178363,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1592416896
    }
]