[
    {
        "content": "<p>Recently I've been getting more orange bars than I used to, and it's not consistent or reproducible - but every now and then while I'm in the middle of a proof I'll get orange bars on every file in my project, which take the usual compilation time to go away. Any ideas what's going on?</p>",
        "id": 199575302,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1591153084
    },
    {
        "content": "<p>It's usually when I'm in tactic mode writing a proof - no changes to any other files or mathlib, but other files which this one depends on also recompile</p>",
        "id": 199575320,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1591153127
    },
    {
        "content": "<p>Most likely the trigger is a hover request</p>",
        "id": 199575330,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1591153143
    },
    {
        "content": "<p>Why would that make things recompile?</p>",
        "id": 199575349,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1591153178
    },
    {
        "content": "<p>I'm not entirely sure, but I believe this is Lean switching from the olean version to the in memory version of the dependent file</p>",
        "id": 199575403,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1591153233
    },
    {
        "content": "<p>which it needs to provide some precise location information</p>",
        "id": 199575406,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1591153253
    },
    {
        "content": "<p>There has been some chat about this, with comments such as \"can be fixed by closing all the lean files you have open in your VS code apart from the one you're working on\" (a workflow-breaking solution) or \"works as expected\". Kenny asked how to open a file in notepad mode at some stage, by which he meant how to look at a file without triggering a risk of orange bars. I agree that something is wrong but I haven't worked out how to reproduce or what I'm doing to cause it</p>",
        "id": 199585755,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1591168098
    },
    {
        "content": "<p>I am a bit scared that some people think nothing is wrong</p>",
        "id": 199585764,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1591168115
    },
    {
        "content": "<p>I didn't have any other lean files open when this happened, and I wasn't trying to look at a different file! I was just writing a proof like normal</p>",
        "id": 199611960,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1591186942
    },
    {
        "content": "<p>And are you using a mouse and hovered accidentally?</p>",
        "id": 199642343,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1591201677
    },
    {
        "content": "<p>Nope, I was in the middle of typing</p>",
        "id": 199642635,
        "sender_full_name": "Bhavik Mehta",
        "timestamp": 1591201793
    }
]