[
    {
        "content": "<p>Hello!</p>\n<p>I am a new Lean user. In order to learn Lean more effectively, I use OrgPad. I gradually create this OrgPage (a selfstudy material):<br>\n<a href=\"https://orgpad.com/s/ZBGjrzoGIBb\">https://orgpad.com/s/ZBGjrzoGIBb</a></p>\n<p>I am posting it here for two reasons:<br>\n1) If you spot any mistake, please, let me know! I will be thankful if you help me correct mistakes I made.<br>\n2) Feel free to use my OrgPage for your selfstudy as well.</p>",
        "id": 264277747,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1639043637
    },
    {
        "content": "<p>well, I'm pretty sure mathlib contributors have done an immense amount of work as well... probably unfair to list only 3 people as VIPs <span aria-label=\"stuck out tongue\" class=\"emoji emoji-1f61b\" role=\"img\" title=\"stuck out tongue\">:stuck_out_tongue:</span></p>",
        "id": 264289428,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1639050546
    },
    {
        "content": "<p>I'd say the whole Lean \"movement\" is a large scale collaboration effort and it doesn't have any \"leaders\" <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 264289564,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1639050619
    },
    {
        "content": "<p>Good points, thanks!</p>",
        "id": 264289603,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1639050651
    },
    {
        "content": "<p>I think that I am often mistaken as some kind of leader, because I go around doing a lot of promotion of the software; however I am not even a maintainer of the maths library!</p>",
        "id": 264289624,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639050668
    },
    {
        "content": "<p>I think that there are even some people in the community who are uncomfortable with the fact that I am somehow deemed a \"leader\" -- mathlib is even occasionally referred to \"my library\", something which couldn't be further from the truth and which we're doing our best to stamp out.  Massot in particular is often quick to guide me to such inaccuracies and I do my best to fix them.</p>",
        "id": 264290289,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639051095
    },
    {
        "content": "<p>It is undoubtedly true that some of the projects I've been involved in have resulted in media coverage, and I've given a lot of talks in mathematics departments about mathlib so I am inevitably associated with the library by many mathematicians. But I have certainly never wanted to be a leader, not least because I couldn't organise myself out of a paper bag.</p>",
        "id": 264290632,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1639051283
    },
    {
        "content": "<p>OK. If I delete the small section called \"Community\", will you then pay attention to the rest of the document instead?</p>",
        "id": 264297646,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1639055277
    },
    {
        "content": "<p>i think aside from that issue your document is pretty solid lol but like there are quite a few ??? in your document, so maybe it's a good idea to post them as questions here?</p>",
        "id": 264300048,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1639056356
    },
    {
        "content": "<p>I felt like I hadn't put enough effort into figuring it out myself. I will ask these questions later if those question marks stay there.</p>",
        "id": 264302668,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1639057540
    },
    {
        "content": "<p>I am more worried about mistakes in places where I don't think I have a mistake.</p>",
        "id": 264302769,
        "sender_full_name": "Martin Dvořák",
        "timestamp": 1639057574
    }
]