[
    {
        "content": "<p>I can't find in mathlib the name of the projection of a vector onto an element of the basis, i.e. the linear map that, given a basis, an element of the basis and a vector returns the component of the vector (I mean its value in the field) of that particular element. I looked everywhere in the file <code>linear_algebra.basis</code> but I did not find it: I do not want to assume the basis is orthonormal so the orthogonal projection does not work here</p>",
        "id": 207638191,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1598018988
    },
    {
        "content": "<p><a href=\"https://leanprover-community.github.io/mathlib_docs/find/is_basis.repr\">docs#is_basis.repr</a> does what you want I think?</p>",
        "id": 207638682,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1598019216
    },
    {
        "content": "<p>Yes thanks I actually saw it but I was confused by its description in the documentation in the top of the file and I did not recognize it. With the documentation you linked I think this is actually what I wanted even if I cannot really manage to use it.</p>",
        "id": 207656968,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1598028601
    },
    {
        "content": "<p>Yeah I also found that docstring a little hard to understand.</p>",
        "id": 207657074,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1598028643
    },
    {
        "content": "<p>What problems are you having using it? I guess you'll need to call it with a basis, a vector and then the index of the basis element you want?</p>",
        "id": 207657249,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1598028733
    },
    {
        "content": "<p>Ok thanks I'm about to write my problem in the topic <code>Basis dependence</code> as it is related to both topics but I think more to that one</p>",
        "id": 207657397,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1598028818
    }
]