[
    {
        "content": "<p>it seems that the two are different right? this is making me really confused can anyone explain this stuff</p>",
        "id": 228166863,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614556972
    },
    {
        "content": "<p>from what i understand type false is a type that has no inhabitants and there is a function that maps an instance of an uninhabited type to any type on earth called <code>false.elim</code></p>",
        "id": 228167061,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614557162
    },
    {
        "content": "<p>and the false prop is like a boolean value and that's it</p>",
        "id": 228167110,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614557181
    },
    {
        "content": "<p>but under that mental model there are things that feel incongruent</p>",
        "id": 228167119,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614557200
    },
    {
        "content": "<p>so I'm pretty sure my understanding is wrong somehow</p>",
        "id": 228167123,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614557212
    },
    {
        "content": "<p>Can you link to the terms you're talking about e.g. <a href=\"https://leanprover-community.github.io/mathlib_docs/find/false\">docs#false</a> ? I only know of <code>false : Prop</code>, which is the false proposition. Sure you can call it a type, if you're happy to call Propositions types. If you're confused about the whole \"propositions as types\" thing then maybe you want to look at <a href=\"https://leanprover.github.io/theorem_proving_in_lean/\">#tpil</a> chapter 3 or my <a href=\"https://xenaproject.wordpress.com/2020/06/20/mathematics-in-type-theory/\">blog post</a> about it.</p>",
        "id": 228167976,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1614558175
    },
    {
        "content": "<p>By type false do you mean <a href=\"https://leanprover-community.github.io/mathlib_docs/find/pempty\">docs#pempty</a> ?</p>",
        "id": 228169535,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1614560005
    },
    {
        "content": "<p>I think now I know where my confusion stems from. The <code>false</code> type that I talk about is actually the proof of false type. There is the proof type and there is the prop type. And the two types are conflated to simplify the syntax. When I write <code>def something : Prop := false</code>, I'm telling Lean that there is <code>something</code> that is false. It doesn't constitute a proof of false, the word <code>false</code> here is only a truth value. However when I use exfalso for example and the goal turns into <code>false</code>, the word <code>false</code> here indicates that I have to show a term that has type <code>Proof false</code>, and the word <code>Proof</code> is elided because proof and prop are conflated.</p>\n<p>From <a href=\"https://leanprover.github.io/theorem_proving_in_lean/\">#tpil</a> chapter 3:</p>\n<blockquote>\n<p>This approach would provide us with a reasonable way of building assertions and proofs. Determining that an expression <code>t</code> is a correct proof of assertion <code>p</code> would then simply be a matter of checking that <code>t</code> has type <code>Proof p</code>.</p>\n<p>Some simplifications are possible, however. To start with, we can avoid writing the term <code>Proof</code> repeatedly by conflating <code>Proof p</code> with <code>p</code> itself. In other words, whenever we have <code>p : Prop</code>, we can interpret <code>p</code> as a type, namely, the type of its proofs. We can then read <code>t : p</code> as the assertion that <code>t</code> is a proof of <code>p</code>.</p>\n</blockquote>",
        "id": 228185126,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1614577968
    },
    {
        "content": "<p>I think your \"there is the proof for and there is the prop type\" model is not a good one. Try replacing <code>false</code> with <code>nat</code> in your above code snippets; the nat in <code>37 : nat</code> and <code>nat : Type</code> are the same.</p>",
        "id": 228187892,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1614580889
    },
    {
        "content": "<p>Just as the false in <code>(sorry : false)</code> and <code>(false : Prop)</code> are the same</p>",
        "id": 228187955,
        "sender_full_name": "Eric Wieser",
        "timestamp": 1614580953
    },
    {
        "content": "<p>There are type theories that would require some transformation or coercion in order to treat a term as a type, so that the latter example would be <code>sorry : T(false)</code> and <code>false : Prop</code> where <code>T</code> is a constructor that makes types from terms representing types. This <code>T</code>, renamed to <code>Proof</code>, is what TPIL is talking about, but in lean there is no such coercion, the set of types is a literal subset of the set of terms so <code>T</code> is an identity</p>",
        "id": 228195877,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1614587736
    }
]