[
    {
        "content": "<p>During a proof, one of my hypothesis has a <code>⟨R, hR⟩.val</code> term. I don't know what that means or how to work with it. While specific help on  this would be nice, I am looking for more general help on how I could find out during a proof (in tactic mode) on how I could figure out what such things mean and how to deal with them. Some tips along the lines of how to do \"printf style debugging\" when in tactic mode is what I'm after. Thanks in advance.</p>",
        "id": 252091452,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1630864639
    },
    {
        "content": "<p>You can click on the term in the widget</p>",
        "id": 252091525,
        "sender_full_name": "Ruben Van de Velde",
        "timestamp": 1630864698
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"436061\">@Trevor Fancher</span> Are you using VScode? Because you can click on things in the goal view to explore them.</p>",
        "id": 252091531,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1630864711
    },
    {
        "content": "<p>fwiw, usually try <code>dsimp</code> first if you don't get the tactic state. that simplifies things up to definitional equality, and so will actually turn that into just <code>R</code>.</p>",
        "id": 252091608,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1630864803
    },
    {
        "content": "<p>I am using VSCode. I didn't realize clicking on things let me dig around like that. Thats really neat!</p>",
        "id": 252091703,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1630864886
    },
    {
        "content": "<p>That certainly will change how I explore during proofs :)</p>",
        "id": 252091749,
        "sender_full_name": "Trevor Fancher",
        "timestamp": 1630864923
    },
    {
        "content": "<p>Your pointy bracket R, hR term will surely be an insurance of a structure with two fields, one called val (which will presumably be R) and one called something else (which will be hR). As Eric says, you can probably use <code>dsimp</code> to tidy up, but note that sometimes you can then finish the proof and delete the <code>dsimp</code> because all it does is changes things to definitionally equal but easier-to-read things</p>",
        "id": 252094092,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1630867469
    }
]