[
    {
        "content": "<p>I'm trying to reason about competitive programming programs. I can't directly express the algorithms in Lean because the limited semantics make it hard to express memory reuse and other tricks that make the programs efficient. My original idea was to formalize a restricted subset of C++, however after a while I realized that this might be overkill. Is it a good idea to use WASM as a language to express imperative algorithms?</p>",
        "id": 242300105,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1623385785
    },
    {
        "content": "<p>If you don't know what competitive programming is, this page is full of competitive problems: <a href=\"https://cses.fi/problemset/list/\">https://cses.fi/problemset/list/</a>. The <a href=\"https://usaco.guide\">https://usaco.guide</a> page also provides a good introduction.</p>",
        "id": 242300193,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1623385878
    },
    {
        "content": "<p>How about LLVM?</p>",
        "id": 242300196,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1623385891
    },
    {
        "content": "<p>Ease of formalization should also be considered, LOL. LLVM IR is a humongous language.</p>",
        "id": 242300280,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1623386021
    },
    {
        "content": "<p>Competitive programming programs don't do much I/O aside from reading and writing to standard streams.</p>",
        "id": 242300333,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1623386049
    },
    {
        "content": "<p>So far, WASM seems like a promising candidate but I want experts to weigh in too.</p>",
        "id": 242300351,
        "sender_full_name": "Huỳnh Trần Khanh",
        "timestamp": 1623386095
    },
    {
        "content": "<p>Why not formalize IMP or lisp instead? Something semi-practical but with a small basis so you can prove properties</p>",
        "id": 242300770,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623386732
    },
    {
        "content": "<p>almost any real world language will have way too many moving parts for your needs</p>",
        "id": 242300811,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1623386764
    }
]