[
    {
        "content": "<p>If i understand correctly the instance <code>sigma.topological_space</code> gives the sigma type the disjoint union topology. By searching for <code>sigma.topological_space</code> across mathlib it seems this has not been used even though I don't know if it were used after opening the namespace sigma. My question is: why is this natural? If <code>A</code> and <code>B</code> are two topological spaces would it not be more natural to consider the product topology on the constant sigma type? I would need to remove it from mathlib or to add the hypothesis that the base type of the sygma type has the discrete topology. Is it a problem?</p>",
        "id": 213655279,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602946010
    },
    {
        "content": "<p>I'm not sure I completely understand the question but the sigma type instance you're talking about has no assumption that alpha is a topological space, so it is literally just the assertion that if you have a bunch of topological spaces indexed by alpha then their disjoint union naturally has a topological space structure. I don't know what A and B are supposed to denote in your question.</p>",
        "id": 213655448,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602946237
    },
    {
        "content": "<p>Oh ok is disjoint union by rule implemented with the sigma type, I mean is there no any kind of type synonim or something? My point is, what if in <code>\\Sigma x : \\alpha, \\beta x</code>, <code>\\alpha</code> is not meant to be a type of indices but it is a topological space and I want to give to the sigma type a different topology from the disjoint union, should I just define an instance over that of the disjoint union?</p>",
        "id": 213655601,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602946512
    },
    {
        "content": "<p>I see. If you're stuck with the instance and you don't want it then sure you could use a type alias, the instance would not move over to that by default. I have no idea how this would work though. If alpha has a topology and you want this to be reflected in the sigma type then wouldn't you have to have some concept of what it means for an open subset of beta(x) to be \"close to\" an open subset of beta(y) if x is close to y? As I'm sure you know, the whole point of the sigma type is that the different beta(x)'s don't have to be related in any way.</p>",
        "id": 213655744,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602946780
    },
    {
        "content": "<p>If you're really just interested in a product of topological spaces, just use the product of topological spaces in mathlib with its product topology.</p>",
        "id": 213655810,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602946858
    },
    {
        "content": "<p>You can take the coarsest topology where the projection to alpha is continuous, for example...</p>",
        "id": 213655813,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602946862
    },
    {
        "content": "<p>If all the beta(x) were equal then a back of an envelope calculation indicates that this would not give you the product topology (which was mentioned in the original post) but of course you're absolutely right.</p>",
        "id": 213655851,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602946922
    },
    {
        "content": "<p>You're right, it says nothing about the beta x</p>",
        "id": 213655895,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602946953
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"243562\">Adam Topaz</span> <a href=\"#narrow/stream/113489-new-members/topic/sigma.2Etopological_space/near/213655895\">said</a>:</p>\n<blockquote>\n<p>You're right, it says nothing about the beta x</p>\n</blockquote>\n<p>I am lost, does it refer to the post?</p>",
        "id": 213655906,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602946988
    },
    {
        "content": "<p>You could take the coarsest topology which contains that, and where all the fibres have the right topology</p>",
        "id": 213655907,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602946991
    },
    {
        "content": "<p>But it's not clear the projection is continuous</p>",
        "id": 213655915,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947017
    },
    {
        "content": "<p>I think we're just trying to figure out what topology you want to introduce on this object <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213655962,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947045
    },
    {
        "content": "<p>yes, we're still trying to understand what A and B are in your question :-)</p>",
        "id": 213655980,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1602947092
    },
    {
        "content": "<p>Is there a way of saying that the spaces  <code>beta x</code> vary continuously in <code>x</code>?</p>",
        "id": 213656196,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947424
    },
    {
        "content": "<p>Well yes depending on the specific example you are working with there are many ways to define different topologies than the disjoint union one, and I want to understand how should I deal with the conflict with the sigma.topological_space instance. In my question A and B are just two topological spaces of which I want to consider the product topology on the sigma type, and I do not want to use the product. But this was just an example to illustrate the point, it could be any other thing that like what Adam said, it could be the Moebius bundle, I just want to consider different topologies on the sigma type.</p>",
        "id": 213656197,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602947433
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"243562\">Adam Topaz</span> <a href=\"#narrow/stream/113489-new-members/topic/sigma.2Etopological_space/near/213656196\">said</a>:</p>\n<blockquote>\n<p>Is there a way of saying that the spaces  <code>beta x</code> vary continuously in <code>x</code>?</p>\n</blockquote>\n<p>Yes in the case of vector bundles for example</p>",
        "id": 213656202,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602947453
    },
    {
        "content": "<p>Sure any fibre bundle works too, but it assumes you start with a big space and you're looking at the fibres</p>",
        "id": 213656215,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947486
    },
    {
        "content": "<p>Note that general topological spaces do not form a Cartesian closed category</p>",
        "id": 213656264,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947524
    },
    {
        "content": "<p>If you could define a topology on <code>Top</code> (the type of all topological spaces), this could work in general</p>",
        "id": 213656392,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947746
    },
    {
        "content": "<p>Anyway, the practical solution to making new instances on existing types is to define a type synonym.</p>",
        "id": 213656528,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1602947911
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"243562\">Adam Topaz</span> <a href=\"#narrow/stream/113489-new-members/topic/sigma.2Etopological_space/near/213656528\">said</a>:</p>\n<blockquote>\n<p>Anyway, the practical solution to making new instances on existing types is to define a type synonym.</p>\n</blockquote>\n<p>Ok I hoped I could find another way but I will do this, thanks!!</p>",
        "id": 213656539,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1602947945
    },
    {
        "content": "<p>Ultimately the best way to do this is probably just the traditional way: write down the total space and put the topology you want on it</p>",
        "id": 213657010,
        "sender_full_name": "Reid Barton",
        "timestamp": 1602948726
    }
]