[
    {
        "content": "<p>Sometimes I get lean/vscode into a state where it updates the state view not just very slowly, but it seems it doesn’t “skip ahead”, and instead shows the state after each character I inputted.</p>\n<p>For example, while I type a keyword, I can see <code>unknown identifier 'r'</code> and then <code>unknown identifier 're'</code> etc. for each character that I typed, although I have long finished typing <code>refine</code>.</p>\n<p>But only sometimes – usually it only processes the latest state, and I have no idea yet what’s causing this. Do others observe this as well?</p>",
        "id": 272146604,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1645031759
    },
    {
        "content": "<p>Happens to me as well. I assume it's a memory leak. The only thing that seems to solve it is restart the Lean server.</p>",
        "id": 272147022,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1645031907
    },
    {
        "content": "<p>Yeah this happens to me fairly often to me, would be a nice issue to track down once and for all, but maybe another one of those things that we live with as it will likely not be the same in lean 4.<br>\nUsually this happens when editing a file deep in the import heierachy in mathlib.<br>\nMy solution is to have a keybind to restart lean, which normally is faster than waiting for it to finish typing one character at a time.</p>",
        "id": 272147075,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1645031924
    },
    {
        "content": "<p><code>Ctrl + &lt; + P + Enter</code> on VScode</p>",
        "id": 272147325,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1645032012
    },
    {
        "content": "<p>It happens for me mostly when I'm editing a deep file, when I also have a lot of other tabs open with other files that depend on it. If I don't have those depend files open, I'm fine</p>",
        "id": 272147742,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1645032161
    },
    {
        "content": "<p>I do restart lean from time to time and know the keybinding, but so far it didn’t fix this issue reliably, I thought. <br>\nDeep file with other tabs open might be it, but shouln’t “check visible file” or  “check visible lines” prevent that? (but that may just be how it should be, not how it is)</p>",
        "id": 272147880,
        "sender_full_name": "Joachim Breitner",
        "timestamp": 1645032216
    },
    {
        "content": "<p>\"how it should, not how it is\" is my understanding too.</p>",
        "id": 272148028,
        "sender_full_name": "Yakov Pechersky",
        "timestamp": 1645032267
    },
    {
        "content": "<p>You can also assign a specific keybind to restart lean though, which is a bit more convenient if the computer response time is lagging, I use cmd+shift+L .<br>\nIndeed this is not how it should be, but a convenient way to reproduce this issue, and a lot of motivation for someone who knows leans internals well are prerequisites for fixing it!</p>",
        "id": 272148136,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1645032312
    },
    {
        "content": "<p>as far as I know, Yakov's experience is mine too</p>",
        "id": 272148407,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1645032412
    },
    {
        "content": "<p>a well placed <code>#exit</code> after and <code>.</code> before mitigates it, but isn't great. another thing I do is close all other files and restart, but this isn't ideal</p>",
        "id": 272148484,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1645032446
    },
    {
        "content": "<p>it's kinda hard to diagnose, because it's to do with performance - my new laptop gets it a lot less than my 10 year old desktop, but it still can sometimes happen</p>",
        "id": 272148657,
        "sender_full_name": "Eric Rodriguez",
        "timestamp": 1645032499
    },
    {
        "content": "<p>FWIW I see this in neovim occasionally, so I think it's something totally unrelated to VSCode specifically, it's on the Lean server side.</p>",
        "id": 272148961,
        "sender_full_name": "Julian Berman",
        "timestamp": 1645032618
    }
]