[
    {
        "content": "<p>Hello everyone. I'm coming from a programming background and I find this formal verification stuff super interesting. Would love to learn more about lean, but I have a few questions:</p>\n<ul>\n<li>What's the deal with lean 3 vs 4? I'm currently using lean 4, but it looks like most resources are targeted towards lean 3. Though it looks like lean 3 was last updated back in 2019, so should a beginner like me focus on learning lean 3 or 4?</li>\n<li>I've stumbled across numerous introduction guides to lean, but is there any more structured documentation on features and syntax of the language? Or am I supposed to figure stuff out by reading the source code?</li>\n</ul>",
        "id": 247523864,
        "sender_full_name": "DayDun",
        "timestamp": 1627510480
    },
    {
        "content": "<p>You should be using the community edition of lean 3, at <a href=\"http://leanprover-community.github.io\">leanprover-community.github.io</a></p>",
        "id": 247524275,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1627510785
    },
    {
        "content": "<p>Lean 3 is forked, and alive and well at the Leanprover community website. Sounds like you might want to look at the community <a href=\"https://leanprover-community.github.io/\">home page</a> to get up to speed with what's happening with Lean 3.</p>",
        "id": 247524277,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1627510786
    },
    {
        "content": "<p>Alright, didn't see it was forked. What's the status of lean 4? How usable is it? And is there any estimation when it will be \"ready\"? I quite like the fact that large parts of it are written in lean, and reading about the changes from lean 3 to 4, many of them sound quite handy.</p>",
        "id": 247525660,
        "sender_full_name": "DayDun",
        "timestamp": 1627511712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"429227\">@DayDun</span> It's perfectly usable, but it is currently undergoing rapid development and changes by the day. The <em>very</em> work-in-progress Lean 4 manual has a <a href=\"https://leanprover.github.io/lean4/doc/setup.html\">section</a> on how to set it up. Currently, despite the existence of a supposed stable release, the nightly is the only version actively supported (e.g., by the VSCode extension and <a class=\"stream\" data-stream-id=\"270676\" href=\"/#narrow/stream/270676-lean4\">#lean4</a>  stream).  So, if you are fine playing with an alpha product you can jump in and toy around with stuff if you want. However, if you want a stable Lean with some rich documentation, the Lean 3 community version is for you.</p>",
        "id": 247538381,
        "sender_full_name": "Mac",
        "timestamp": 1627525553
    }
]