[
    {
        "content": "<p>Is it considered useful to replace bare simps in mathlib with <code>simp only</code> ones? I'm reading a file for other reasons (it's algebra/group/basic) which has a bunch of bare ones. Or is that not useful considering the lemmas simp are using for this file are unlikely to disappear?</p>",
        "id": 218955975,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607206216
    },
    {
        "content": "<p>bare simp is fine if it closes the goal.</p>",
        "id": 218956054,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1607206327
    },
    {
        "content": "<p>This is a maintenance issue. <code>simp</code> gets better over time, so <code>simp</code> in the middle of a goal might change behaviour making code hard to maintain. <code>simp only</code> is far less likely to change even if new simp lemmas are added.</p>",
        "id": 218956081,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1607206394
    },
    {
        "content": "<p>Got it OK -- I thought I saw a note in the docs that they weren't desirable entirely because if a proof using bare simp starts to fail you don't know what lemma that disappeared is the one that was relied on (whereas if you have the explicit list you at least maybe guess at what the lemma said or something). Maybe that was referring to something else</p>",
        "id": 218956153,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607206538
    },
    {
        "content": "<p>Yeah not finding that language now, must be my mistake, thanks.</p>",
        "id": 218956297,
        "sender_full_name": "Julian Berman",
        "timestamp": 1607206765
    },
    {
        "content": "<p>I don't think lemmas usually disappear. The problem is that new ones appear!</p>",
        "id": 218956356,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1607206841
    },
    {
        "content": "<p>Also worth noting - sometimes <code>simp only</code> can be a lot faster than just <code>simp</code>. In <a href=\"https://github.com/leanprover-community/mathlib/issues/3963\">#3963</a> I (mostly) just replaced <code>simp</code> with <code>simp only</code>, and the time required to check that file halved, for one lemma it went from 40 seconds to 2.</p>",
        "id": 218979614,
        "sender_full_name": "Shing Tak Lam",
        "timestamp": 1607249532
    }
]