[
    {
        "content": "<p>I heard someone say today that the fact that Lean can perform dependent pattern matching \"by itself\" (without needing to provide the type level information as e.g. in Coq) comes at the cost of a larger trusted code base. <br>\nI couldn't follow as to why this would be the case, as I thought Lean just elaborates everything to its <code>Expr</code> type and then passes that to the kernel - so I wouldn't see how the kernel would have to distinguish between dependent vs nondependent matches. <br>\nWhat's the right answer here?</p>",
        "id": 321105800,
        "sender_full_name": "Marcus Rossel",
        "timestamp": 1673599191
    },
    {
        "content": "<p>I don't think the kernel cares whether matches are dependent or not - they get compiled down into recursor applications anyway, which are <a href=\"https://github.com/leanprover/lean4/blob/master/src/kernel/inductive.cpp\">handled here</a>.  The lack of match expressions in the kernel can be seen from lean's <a href=\"https://github.com/leanprover/lean4/blob/master/src/kernel/expr.h#L67\">list of expression types</a>.</p>",
        "id": 321151749,
        "sender_full_name": "Sky Wilshaw",
        "timestamp": 1673613956
    },
    {
        "content": "<p>yes, this argument sounds like either nonsense or a miscommunication</p>",
        "id": 321151993,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673614020
    },
    {
        "content": "<p>I don't even know what it means to say that \"lean doesn't need to provide type level information as e.g. in Coq\", lean has types for everything it just has to elaborate them using type inference</p>",
        "id": 321152243,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1673614088
    },
    {
        "content": "<p>We're allowed to omit some type information because Lean's elaborator is strong.</p>",
        "id": 321152246,
        "sender_full_name": "Sky Wilshaw",
        "timestamp": 1673614089
    },
    {
        "content": "<p>If anything it seems like the reverse is true, because the Lean kernel only sees recursor applications</p>",
        "id": 321154101,
        "sender_full_name": "Reid Barton",
        "timestamp": 1673614602
    }
]