[
    {
        "content": "<p>Hi all - I've been lurking here for a little while, but haven't yet introduced myself: I'm a comp sci MSc student at the University of Victoria and I've spent some of the summer working on learning Lean via TPIL and other resources with the aim of using it as tool for a project in formal verification and cryptography. At present, my supervisor and I are thinking of perhaps trying to implement a term rewriting tactic for deduction systems (i.e. within a specific equational theory) with the eventual aim of supporting term rewriting for abelian groups with homomorphism. This has some application in intruder detection in cryptography - though that's all something new to me, so I'm not too familiar with all the ins and outs at the moment.</p>\n<p>Lately I've been working through some of the <a href=\"https://lean-forward.github.io/logical-verification/2020/index.html\">VU Logical Verification</a> course material, and I've found some of the other papers from the Lean Forward group's publication to be quite helpful. I'm still figuring out how to navigate mathlib though, and I'm trying to get a sense of whether or not some aspects of term rewriting in the abelian group sense might already be complete...? I'm not sure that our eventual goal would be to contribute to mathlib, though we're definitely open to that, if we end up producing something of value.</p>\n<p>Does anyone have any suggestions or direction I might be interested in?</p>",
        "id": 255644204,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1633034206
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"378478\">@Ashley Blacquiere</span> Welcome! Can you explain a bit more what \"term rewriting for abelian groups\" means? (I'm a mathematician, so I know what <em>abelian group</em> means, but I don't know what <em>term rewriting</em> means in that context.</p>\n<p>Would this be a version of <code>rw</code> that does rewrites modulo associativity and commutativity? And that automatically collapses <code>a * a¯¹</code> to <code>1</code>?</p>",
        "id": 255693792,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1633067513
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"112680\">@Johan Commelin</span> ! In answer to your question: Yes, this would be something like a version of <code>rw</code>, or perhaps <code>ring_exp</code>, that reduces terms to a normal form, but in addition to associativity and commutativity also rewrites based on an equational theory stemming from a cryptographic protocol (i.e. the equational theory would include rules for things like message encoding / decoding, among others). This is motivated by the intruder deduction problem, and specifically equational theories that include associativity and commutativity (see for example <a href=\"https://www.sciencedirect.com/science/article/pii/S0304397517301214\">Intruder deduction problem for locally stable theories with normal forms and inverses</a>. </p>\n<p>Our current thought is to attempt to implement the necessary term rewriting rules in Lean as a tactic. I'm assuming there is already some existing term rewriting work that we can extend (i.e. similar to <span class=\"user-mention\" data-user-id=\"238446\">@Anne Baanen</span>'s <a href=\"https://link.springer.com/chapter/10.1007/978-3-030-51054-1_2\"><code>ring_exp</code> paper</a> extending <code>ring</code>), but I'm not sure if that would be an extension of what <code>rw</code> does, or something similar to <code>simp</code> - though much more constrained - or something else entirely. Or maybe I'd have to start from scratch. I've spent some time this summer learning about proof technique in Lean, but I'm just getting into meta-programming now, so I'm not yet really sure what I need, or precisely what I'm looking for. It's all pretty overwhelming, but I'm slowly narrowing down my focus and improving my understanding. That said, if anyone has any thoughts that might help direct my efforts, I'm all ears. :)</p>",
        "id": 255777899,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1633108604
    },
    {
        "content": "<p>Do you know about <a href=\"https://leanprover-community.github.io/mathlib_docs/tactics.html#abel\">https://leanprover-community.github.io/mathlib_docs/tactics.html#abel</a>?</p>",
        "id": 255788083,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1633112999
    },
    {
        "content": "<p>Thanks for reminding me! I only recently saw <code>abel</code> -  I hadn't come across it in any of the texts / tutorials, I don't think, so I haven't really experimented with it and wasn't top of mind. Yes, it might be more on the lines of what I'm looking for. Certainly it seems to be a good starting point.</p>",
        "id": 255788831,
        "sender_full_name": "Ashley Blacquiere",
        "timestamp": 1633113331
    }
]