[
    {
        "content": "<p>Lean alternates between making me feel smart and making me feel incompetent and stupid.</p>",
        "id": 201482472,
        "sender_full_name": "Jason Orendorff",
        "timestamp": 1592667221
    },
    {
        "content": "<p>But this community is so helpful and kind. In case I've missed any of you: thanks</p>",
        "id": 201482513,
        "sender_full_name": "Jason Orendorff",
        "timestamp": 1592667244
    },
    {
        "content": "<p>What happens as you go on is that Lean makes you feel smart more, and incompetent less.</p>",
        "id": 201482517,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592667258
    },
    {
        "content": "<p>And when you feel incompetent, it is sometimes the case that you've just discovered that something is set up wrong.</p>",
        "id": 201482525,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592667290
    },
    {
        "content": "<p>and then at some point you realise that the reason things are set up wrong is that actually humanity currently has quite a poor understanding of how to do undergraduate mathematics on a computer proof system, despite the fact that usable proof systems have existed for 30 years or more.</p>",
        "id": 201482592,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592667370
    },
    {
        "content": "<p>because most mathematicians don't use them, and most computer scientists don't have a good understanding of what mathematicians actually do.</p>",
        "id": 201482601,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592667415
    },
    {
        "content": "<p>so unfortunately we will remain occasionally feeling incompetent for a while yet, but it's going to get better, because times are changing.</p>",
        "id": 201482615,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592667461
    },
    {
        "content": "<p>It's exciting.</p>",
        "id": 201482920,
        "sender_full_name": "Jason Orendorff",
        "timestamp": 1592667896
    },
    {
        "content": "<p>It will inevitably change the world, but most mathematicians will not be interested until it actually starts changing the world. This creates a vicious circle, because it is not going to change the world until some time after mathematicians invest some time into teaching the system what mathematics is. And teaching systems mathematics e.g. by building mathlib is extremely unlikely to suddenly enable a tactic to prove a new theorem of interest to humans, at least in the short to medium term.</p>",
        "id": 201483098,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1592668134
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"306644\">Jason Orendorff</span> <a href=\"#narrow/stream/113489-new-members/topic/Thank.20you/near/201482513\">said</a>:</p>\n<blockquote>\n<p>But this community is so helpful and kind. In case I've missed any of you: thanks</p>\n</blockquote>\n<p>I second this. Thank you!</p>",
        "id": 201495954,
        "sender_full_name": "Ashvni Narayanan",
        "timestamp": 1592684738
    }
]