[
    {
        "content": "<p>I'm having trouble getting mathlib to work. I make it through the installer ok, but I always get errors when I try to do things like open_locale classical. I've tried reinstalling mathlib several times, I'm doing it in the folder that has my lean package install and the src file, and have tried this on multiple projects. I've also tried restarting my editor, terminal, and computer. Any thoughts would be very much appreciated!</p>",
        "id": 188050033,
        "sender_full_name": "ROCKY KAMEN-RUBIO",
        "timestamp": 1581539025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"261068\">@ROCKY KAMEN-RUBIO</span> Can you paste code that gives an error?</p>",
        "id": 188050793,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581539621
    },
    {
        "content": "<p><code>open_locale classical</code> also sometimes gives me errors when it comes right after some <code>import</code> statements.</p>",
        "id": 188050890,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581539692
    },
    {
        "content": "<p>I think it can be fixed by writing something above it. (I usually put <code>noncomputable theory</code> <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span>)</p>",
        "id": 188050930,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1581539725
    },
    {
        "content": "<p>Are you using VS Code? Did you clone the example project? Did you remember to \"open folder\" and not \"open file\"?</p>",
        "id": 188054916,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1581542943
    },
    {
        "content": "<p>I was using VSCode , cloned a project from github that was working on a friend's computer, and was sure to \"open folder\" instead of \"open file\". I tried it again today without having changed anything and it seems to be working ok. I'll keep you all updated if it stops working again. Computers are mysterious creatures.</p>",
        "id": 188244042,
        "sender_full_name": "ROCKY KAMEN-RUBIO",
        "timestamp": 1581712589
    }
]