[
    {
        "content": "<p>Hello, Lean Prover community.</p>\n<p>I have been typing up exercises from the end of chapter one of Atiyah and MacDonald's \"Introduction to Commutative Algebra\" in LaTeX (via emacs plus auctex). As a commutative algebra student, I wonder if it would be fun to type these up with Lean.</p>\n<p>Typing up proofs is reminding me that using LaTeX is already a quasi-programming experience: I tend to try to solve problems on paper, and then go type them up, but the process is never a transcription--I am editing and revising in the language of LaTeX as I type up the hand-written proof.</p>\n<p>If I invested the time in energy in getting somewhat conversant in Lean, I wonder if I could use it to type up my solutions to exercises at the end of Chapter 1 in Atiyah-MacDonald? I have no idea. Do you think the technology is there, or not? Maybe it would be accurate to say that I'm interested in Lean from a workflow perspective.</p>",
        "id": 157831255,
        "sender_full_name": "jessup",
        "timestamp": 1549593614
    },
    {
        "content": "<p>I think the majority of the material you need for the chapter 1 exercises is in Lean already, so it should be quite doable, but I'm not an expert on the coverage we have on ideals, etc.</p>",
        "id": 157834585,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1549599187
    },
    {
        "content": "<p>It's an interesting question what to do with such solutions, if you were to produce them.</p>",
        "id": 157834591,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1549599219
    },
    {
        "content": "<p>Most of the exercises are actually things are are in, or ought to be in, mathlib itself.</p>",
        "id": 157834594,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1549599236
    },
    {
        "content": "<p>So a second stage might be to find the appropriate names of lemmas, and locations in files, and then integrate the solutions into the library itself.</p>",
        "id": 157834636,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1549599260
    },
    {
        "content": "<p>It would also, of course, be nice to have them as a document that actually shows the exercise numbers from AM.</p>",
        "id": 157834642,
        "sender_full_name": "Scott Morrison",
        "timestamp": 1549599294
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 157834912,
        "sender_full_name": "jessup",
        "timestamp": 1549599802
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"110064\">@Kenny Lau</span> basically learnt Lean by working through the early chapters of A-M, and this was before we had modules :-) Some of those exercises are hard. We have Spec of a ring as a topological space, but I can't remember whether this is in mathlib or not.</p>\n<p>As for writing them up, you could make them look like this <a href=\"https://www.math.u-psud.fr/~pmassot/lean/\" target=\"_blank\" title=\"https://www.math.u-psud.fr/~pmassot/lean/\">https://www.math.u-psud.fr/~pmassot/lean/</a> :-) </p>\n<p>Man, I had better understand what Patrick did and set up my own version of that stuff before Patrick deletes it all.</p>",
        "id": 157840857,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1549610669
    },
    {
        "content": "<p>Wow that link is awesome. Definitely the kind of end-result I had in mind. I am interested in how a technology like Lean can streamline communication about mathematics. With respect to that link, has there been anything interesting on the problem of moving in the other direction (i.e. placing the natural language in the drop-down box). At some level this should be possible, right? Maybe not feasible? Maybe what I'm looking for is a good read by somebody who has already thought a lot about computer-assisted proofs.</p>",
        "id": 157991503,
        "sender_full_name": "jessup",
        "timestamp": 1549833406
    },
    {
        "content": "<p>Do you mean generating the natural language from the Lean code? Or do you simply mean displaying stuff differently? Currently everything is typed by a human except for the tactic state, see the source file at <a href=\"https://www.math.u-psud.fr/~pmassot/lean/source.html\" target=\"_blank\" title=\"https://www.math.u-psud.fr/~pmassot/lean/source.html\">https://www.math.u-psud.fr/~pmassot/lean/source.html</a></p>",
        "id": 157991606,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1549833572
    },
    {
        "content": "<p>I figured the page had been hand coded, but the design did make me wonder about translations between a language like lean and the subset of some given natural language that is used to state proofs in some body of math literature. What about the translation from this source file to the lean test website--is that being done automatically? (btw: studying that page will definitely help me learn to think in terms of lean. Thanks for making it, however you did it.)</p>",
        "id": 157992102,
        "sender_full_name": "jessup",
        "timestamp": 1549834395
    },
    {
        "content": "<p>I think there have been experiments to translate from a proof assistant to natural  language, but not with Lean. Of course the web page is generated automatically! Doing that by hand would be way beyond my patience. It's produced with <a href=\"https://github.com/leanprover-community/format_lean\" target=\"_blank\" title=\"https://github.com/leanprover-community/format_lean\">https://github.com/leanprover-community/format_lean</a> This is a prototype, this web page is the very first test of that script</p>",
        "id": 157992430,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1549834969
    },
    {
        "content": "<p>haha yes I thought it must be automatic. Thank you for the link</p>",
        "id": 157992501,
        "sender_full_name": "jessup",
        "timestamp": 1549835068
    }
]