[
    {
        "content": "<p>Hi! I've been interested in lean for a while, and I finally have some time to play around with it. </p>\n<p>I'm trying to get mathlib set up on my computer, but I have a fairly uncommon system (based on nixos), so I would like to understand precisely how leanpkg and update-mathlib interact (eventually it would be nice to write a nix derivation that sets everything up automatically using, e.g. <code>nix-shell</code>).  </p>\n<p>Suppose I follow the following (standard?) workflow:</p>\n<ol>\n<li>Use <code>leanpkg new foo &amp;&amp; cd foo</code> to start a new lean project in the folder <code>foo</code> and change to that directory.</li>\n<li>Use <code>leanpkg add leanprover-community/mathlib</code> to add <code>mathlib</code> source to <code>_target/deps/mathlib</code> and update  <code>leanpkg.toml</code> and <code>leanpkg.path</code> accordingly.</li>\n<li>Use <code>update-mathlib</code> to do various things...</li>\n</ol>\n<p>Assume I have used <code>update-mathlib</code> in the past so the directory <code>$HOME/.mathlib</code> already exists, and assume that the <code>.mathlib</code> folder does not contain a cached <code>olean</code> archive of the current version of <code>mathlib</code>. I would like to understand what step 3 above actually does.</p>\n<p>I looked at the <code>update-mathlib</code> python script itself. If I understand correctly, step 3 should be (more-or-less) equivalent to the following:</p>\n<ul>\n<li>Download the olean tarball from <a href=\"http://github.com/leanprover-community/mathlib-nightly\" target=\"_blank\" title=\"http://github.com/leanprover-community/mathlib-nightly\">github.com/leanprover-community/mathlib-nightly</a> corresponding to the commit hash of the current version of mathlib (as defined in <code>leanpkg.toml</code>) and save it in <code>~/.mathlib</code> for future use.</li>\n<li>Extract that tarball into <code>foo/_target/deps/mathlib</code> thereby adding <code>.olean</code> files in <code>foo/_target/deps/mathlib</code> without any actual compilation using lean.</li>\n</ul>\n<p>It would be great if someone more familiar with the tooling could verify that this is indeed all that is happening. Is it true that the main reason to use <code>update-mathlib</code> in step 3 above is to avoid compiling <code>mathlib</code> entirely from source (which takes quite a while)?</p>",
        "id": 183180050,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1576085357
    },
    {
        "content": "<p>Yes, the point of <code>update-mathlib</code> is precisely that if you download <code>mathlib</code> from e.g. github and then change directory into <code>src</code> and type <code>lean --make</code>, it will take 15 minutes or more to compile the .lean files into the .olean bytecode. We wanted users to be able to get going more quickly, so people wrote <code>update-mathlib</code> to download some precompiled binaries.</p>",
        "id": 183188121,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1576090433
    },
    {
        "content": "<p>If you are happy to just make one project <code>foo</code>, download today's mathlib master, compile from source by running <code>lean --make</code> in <code>_target/deps/mathlib/src</code> and then go and have a cup of tea, then you won't need update-mathlib. If you want to make a second project with mathlib as a dependency then you could literally just copy <code>_target</code> over although (a) you would have to be careful with timestamps (i.e. preserve them!) and (b) you would in theory have to edit <code>leanpkg.toml</code> yourself to point to the correct commit (this is what <code>leanpkg add</code> does, as well as cloning the mathlib repo). </p>\n<p>If on the other hand you want to update mathlib to get some new exciting feature, then you'll have to compile again.</p>",
        "id": 183188644,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1576090716
    },
    {
        "content": "<p>Yes, you can emulate what <code>update-mathlib</code> is doing by downloading a mathlib nightly and extracting it in the relevant folder.</p>",
        "id": 183203504,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1576099562
    },
    {
        "content": "<p>Great! Thanks for the responses. One more quick question regarding Kevin's response: Where do timestamps come in the picture and what will break if they're not preserved? (Are these just filesystem timestamps you're referring to? I don't see timestamps inside of any file generated by <code>leanpkg</code>.)</p>",
        "id": 183204153,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1576099961
    },
    {
        "content": "<p>If Lean sees foo.lean file which is newer than foo.olean it will recompile foo.lean and every files depending on it.</p>",
        "id": 183204306,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1576100071
    },
    {
        "content": "<p>Some OS manage to mess up time stamps when extracting archives...</p>",
        "id": 183204319,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1576100098
    },
    {
        "content": "<p>Ah! I see. Thanks!</p>",
        "id": 183204452,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1576100201
    }
]