[
    {
        "content": "<p>Does anyone have any recommendations for macOS fonts that include all the unicode symbols in mathlib? On Windows the default fonts seem good so far but there are some missing symbols on macOS like <code>â‚˜</code>.</p>",
        "id": 132142135,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1534287640
    },
    {
        "content": "<p>I'm also interested in font recomendations . On my mac <code>\\I</code> and <code>i</code> look exactly the same which lead to some head scratching.</p>",
        "id": 132142546,
        "sender_full_name": "Edward Ayers",
        "timestamp": 1534288208
    },
    {
        "content": "<p>Maybe you need OS recommendations <span class=\"emoji emoji-1f61c\" title=\"stuck out tongue wink\">:stuck_out_tongue_wink:</span></p>",
        "id": 132142574,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1534288320
    },
    {
        "content": "<p>Have you tried the ğ”˜ğ”«ğ”¦ğ” ğ”¬ğ”¡ğ”¢ ğ”£ğ”¬ğ”«ğ”± ğ”°ğ”²ğ”¤ğ”¤ğ”¢ğ”°ğ”±ğ”¦ğ”¬ğ”«ğ”° for Linux?  From what I hear, these fonts run on macOS as well.</p>\n<blockquote>\n<p>Fonts with good unicode support (on Linux): \"editor.fontFamily\": \"Source Code Pro Medium, DejaVu Sans Mono\"</p>\n</blockquote>",
        "id": 132160189,
        "sender_full_name": "Gabriel Ebner",
        "timestamp": 1534316723
    },
    {
        "content": "<p>Many of the monospace fonts I've tried on the Mac have a problem with <code>â†ª</code>: it takes more than the usual horizontal space, which leads to overlap with other characters. This includes Source Code Pro. I've been using Menlo, which has a good monospace <code>â†ª</code>. For some reason, I had not yet tried DejaVu Sans Mono. Now that I have, I see that it's very similar to Menlo. Both also have <code>â‚˜</code>.</p>",
        "id": 132161106,
        "sender_full_name": "Sean Leather",
        "timestamp": 1534318280
    },
    {
        "content": "<p>Thanks, installing <a href=\"https://dejavu-fonts.github.io/\" target=\"_blank\" title=\"https://dejavu-fonts.github.io/\">the DejaVu fonts</a> seems to have done the trick! I think Menlo doesn't actually have the <code>â‚˜</code> character, since it's the default font for VS Code on macOS already (the default setting  is <code>\"editor.fontFamily\": \"Menlo, Monaco, 'Courier New', monospace\",</code>) and the character wasn't showing up before I installed these fonts. It seems that whenever a font is missing a glyph, the system fills it in from the other installed fonts (if it can).</p>",
        "id": 132173504,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1534338398
    },
    {
        "content": "<p>Interesting. It seems you're right. I confirmed with Font Book. The Mac symbol viewer only shows the DejaVu fonts under Font Variation for <code>â‚˜</code>. I previously checked in iTerm2, so, yeah, somebody must be filling in <code>â‚˜</code> from some other font. I wonder where it's coming from.</p>",
        "id": 132173814,
        "sender_full_name": "Sean Leather",
        "timestamp": 1534338760
    },
    {
        "content": "<p>I realise this thread is old but for the sake of anyone else who has this issue: I just hit the same problem on Mac OS (e.g., no glyph for U+2099) and the same solution worked: installing DejaVu fonts.</p>",
        "id": 177094958,
        "sender_full_name": "Oliver Nash",
        "timestamp": 1569961794
    }
]