[
    {
        "content": "<p>Hello, all.<br>\nTrying this question again.<br>\nSo I have Lean 3.4.2 running in emacs lean-mode on a PC laptop in Lubunut 22.04 and I am working through the book Logic and Proof.<br>\nI would also like to be able to work through the book Mathematics in Lean using the Mathlib library.<br>\nI have downloaded the TryLean binary and it works, but I don't want to run vscode or vscodium if I can avoid doing so.<br>\nIs there any way that I can just tell emacs to use the Mathlib library from the TryLean download? Or maybe just copy the Mathlib library files to someplace where  emacs lean-mode can see them?<br>\nThanks!</p>",
        "id": 301862626,
        "sender_full_name": "Bob Bass",
        "timestamp": 1664655199
    },
    {
        "content": "<p>Lean 3.4.2 is really old.  Even if you get it working, it will require a really old version of Mathlib.  Is this what you want?  (Lean 3 was forked and taken over by the Lean community.  The current version is Lean 3.48c.)</p>",
        "id": 301870180,
        "sender_full_name": "Jason Rute",
        "timestamp": 1664661535
    },
    {
        "content": "<p>Looking at <a href=\"https://leanprover-community.github.io/mathematics_in_lean/01_Introduction.html\">https://leanprover-community.github.io/mathematics_in_lean/01_Introduction.html</a> I think you only need to do the following (none of these steps use vs code):</p>\n<ul>\n<li>Make sure you have <a href=\"https://leanprover-community.github.io/install/windows.html#installing-elan\">elan installed</a> (so you can get whatever version of Lean you need)</li>\n<li>Make sure you have <a href=\"https://leanprover-community.github.io/install/windows.html#installing-mathlib-supporting-tools\">mathlibtools tools</a> installed</li>\n<li>Use leanproject as follows: <code>leanproject get mathematics_in_lean</code> to make a project directory with the right version of lean and mathlib</li>\n<li>Open that newly created directory in emacs.</li>\n</ul>",
        "id": 301870871,
        "sender_full_name": "Jason Rute",
        "timestamp": 1664662104
    },
    {
        "content": "<p>(I don't use emacs, windows, or mathematics in lean, so your mileage may vary with my directions. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> )</p>",
        "id": 301870915,
        "sender_full_name": "Jason Rute",
        "timestamp": 1664662155
    }
]