[
    {
        "content": "<p>Question 1:   I would like to select a block  and move that whole block left or right  so many spaces.   Is it possible?</p>\n<p>Question 2:  I would like the info view not to recalculate at every keystroke but only when I press Enter.   Long ago I read that this is possible but I have no idea how to get it to happen.   I like to compose long exact proofs a piece at a time and I need to see the current list of hypotheses while I do that.</p>",
        "id": 213366119,
        "sender_full_name": "Michael Beeson",
        "timestamp": 1602720618
    },
    {
        "content": "<ol>\n<li>Answering a slightly more general question: Press cmd-shift-p (on mac, probably ctrl-shift-p on windows?) and type what you want (in this case \"indent\") and you should see a line saying \"indent line\" with the hotkey next to it. On my machine it is \"cmd+]\" and then \"cmd+[\" to unindent.</li>\n</ol>",
        "id": 213366831,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1602721297
    },
    {
        "content": "<ol start=\"2\">\n<li>Same thing cmd+shift+p and type toggle updating, and press enter to pause updating, there is no hotkey by default for this but you can set one</li>\n</ol>",
        "id": 213366918,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1602721360
    },
    {
        "content": "<p>same thing to unpause after</p>",
        "id": 213366943,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1602721404
    },
    {
        "content": "<p>to set a hotkey for something do \"cmd+shift+p\" type keyboard shortcuts and press enter, then type toggle updating to find that one setting and click that + next to it to set a keyboard shortcut</p>",
        "id": 213367030,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1602721489
    },
    {
        "content": "<p>For 1. I usually select the text and then just hit tab or shift+tab to indent / de-indent by 2 spaces (the number of spaces in an indent is <a href=\"https://code.visualstudio.com/docs/editor/codebasics#_indentation\">configurable</a>.)</p>",
        "id": 213367299,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1602721719
    },
    {
        "content": "<p>For question 1: if you are a Vim user, there is a good plugin: VS Code Neovim. I am sure there is a good one for Emacs (but there is an Emacs mode for Lean, so that should be better).</p>",
        "id": 213367773,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1602722254
    },
    {
        "content": "<p>For question 2: I use <code>ctrl+k</code> to freeze the tactic display. It is a custom binding, so you can find one that fits you. It is very handy.</p>",
        "id": 213367839,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1602722325
    },
    {
        "content": "<p>To add a shortcut, install the Lean plugin and go to <code>File &gt; Preferences &gt; Keyboard shortcuts</code> and search for <code>toggle updating</code>.</p>",
        "id": 213367862,
        "sender_full_name": "Pedro Minicz",
        "timestamp": 1602722363
    }
]