[
    {
        "content": "<p>I watched a <a href=\"https://youtu.be/kcirwIwRIUw?t=1582\">video</a>  in which <a href=\"https://research.unsw.edu.au/people/professor-norman-j-wildberger\">Norman Wildberger</a> expresses some anxiety about <a href=\"http://www.math.ucsd.edu/~tkemp/140A/Construction.of.R.pdf\">construction of real numbers as equivalence classes as Cauchy sequences</a>.   He says it's shaky ground but he doesn't seem to get down to brass tacks in the video, just some bullet points.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"kcirwIwRIUw\" href=\"https://youtu.be/kcirwIwRIUw?t=1582\"><img src=\"https://i.ytimg.com/vi/kcirwIwRIUw/default.jpg\"></a></div><p><a href=\"https://ncatlab.org/nlab/show/Cauchy+real+number\">nLab</a> on the other hand seems to be comfortable that the construction can be defined from first principles without assuming ℝ to begin with, just ℕ and ℚ.  That is, the construction is not tautological.</p>\n<p>Lean uses Cauchy sequences.</p>\n<p>This is not an urgent how-do-I-do-this-in-Lean topic, but if it is a standard controversy with a standard answer, I'd be curious to know.</p>",
        "id": 220005036,
        "sender_full_name": "Lars Ericson",
        "timestamp": 1608049964
    },
    {
        "content": "<p>that PDF link doesn't appear to express any anxiety, it's just doing standard real number construction stuff</p>",
        "id": 220006851,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1608050666
    },
    {
        "content": "<p>i don't really want to watch a half hour video to figure out the claim though. I don't think there's a standard controversy here, I think this is pretty well accepted. can you summarize what seems shaky to him or to you?</p>",
        "id": 220007119,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1608050773
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"364351\">Lars Ericson</span> <a href=\"#narrow/stream/113489-new-members/topic/Well-foundedness.20of.20Cauchy.20construction.20of.20.E2.84.9D/near/220005036\">said</a>:</p>\n<blockquote>\n<p>This is not an urgent how-do-I-do-this-in-Lean topic, but if it is a standard controversy with a standard answer, I'd be curious to know.</p>\n</blockquote>\n<p>There is no controversy.</p>",
        "id": 220008375,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608051359
    },
    {
        "content": "<p>What <em>does</em> happen, is that may universities don't define the reals at all, but just start their Calculus and Analysis courses with an axiomatic approach to the reals.<br>\nA <em>construction</em> of the reals may then appear as an appendix, or maybe in a later course that introduces metric spaces etc...</p>",
        "id": 220008584,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608051446
    },
    {
        "content": "<p>NJ Wildberger is an ultrafinitist, he doesn't believe in infinite sets (or even very large finite sets/numbers), so cauchy sequences look a little magic and philosophically unjustified from that perspective. The constructivist solution is to talk only about computable sets and sequences, which are enumerable and hence easier to make \"tangible\"</p>",
        "id": 220008846,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1608051559
    },
    {
        "content": "<p>Alternatively, there is the formalist response (here formalist is referring to the philosophical position, although I think it accords well with formalized mathematics), in which all we are doing is playing a game with symbols, in which case we can use whatever infinite sets we like because they are just notations and we aren't asserting any \"real\" \"existence\" of infinite sets, whatever that means.</p>",
        "id": 220009517,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1608051825
    },
    {
        "content": "<p>formalism is the best philosophy here. -1 doesn't \"really exist\", it's just sooo convenient for like, accounting when someone owes me a dollar, life is better when we just go along with it</p>",
        "id": 220009806,
        "sender_full_name": "Kevin Lacker",
        "timestamp": 1608051922
    },
    {
        "content": "<p>I'm a formalist who pretends to be platonist when I want to get things done</p>",
        "id": 220009975,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1608051996
    },
    {
        "content": "<p>I'm a platonist who pretends to be a formalist when I want to get things done (say in Lean)</p>",
        "id": 220011384,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608052590
    },
    {
        "content": "<p>I know that the type <code>real</code> in mathlib is not the <em>real</em> \"real numbers\" (you know, the <em>ideal</em> one... whose shadow you can see in some cave), but I just pretend that it is.</p>",
        "id": 220011464,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1608052627
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"364351\">Lars Ericson</span> <a href=\"#narrow/stream/113489-new-members/topic/Well-foundedness.20of.20Cauchy.20construction.20of.20.E2.84.9D/near/220005036\">said</a>:</p>\n<blockquote>\n<p>Lean uses Cauchy sequences.</p>\n</blockquote>\n<p>mathlib has two independent constructions of real numbers (and an isomorphism between those constructions). Of course none of them is circular. The key point for Cauchy sequences is that you get to choose the target of the absolute value. While constructing real numbers you need to use an absolute value on rational numbers with rational values.</p>",
        "id": 220014889,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1608054065
    },
    {
        "content": "<p>Which is the second construction?</p>",
        "id": 220030544,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1608060853
    },
    {
        "content": "<p>Found it! <code>topology.uniform_space.compare_reals</code></p>",
        "id": 220030621,
        "sender_full_name": "Riccardo Brasca",
        "timestamp": 1608060903
    },
    {
        "content": "<p>Yes, the other construction is Bourbaki reals (which are the real ones of course). I avoids the psychological hurdle of doing Cauchy sequences twice, one before constructing reals and one after. I also places real numbers in the broad context of completions of topological rings.</p>",
        "id": 220044381,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1608067396
    },
    {
        "content": "<p>Thanks for discussing this and thank you <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> for putting a name to it.  <a href=\"https://en.wikipedia.org/wiki/Ultrafinitism\">Ultrafinitism</a> it is.  I guess it was popular from 1959 to 1961.</p>",
        "id": 220198519,
        "sender_full_name": "Lars Ericson",
        "timestamp": 1608169793
    }
]