[
    {
        "content": "<p>What is an <code>oleans</code> file?   I see it mentioned from time to time.</p>",
        "id": 221655451,
        "sender_full_name": "Lars Ericson",
        "timestamp": 1609858805
    },
    {
        "content": "<p><code>.olean</code> is the file extension of the lean \"object\" files</p>",
        "id": 221656763,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609859404
    },
    {
        "content": "<p>these are generated when you compile a lean file, and contains everything lean needs to compile dependent lean files</p>",
        "id": 221656804,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609859429
    },
    {
        "content": "<p>Except as it may happen under the hood of <code>code</code>, I haven't manually compiled a file.  Is it like Python where the compilation happens silently in a <code>.</code> directory?  Is there a time when I would do it explicitly?  Is there a doc?</p>",
        "id": 221658687,
        "sender_full_name": "Lars Ericson",
        "timestamp": 1609860315
    },
    {
        "content": "<p>it doesn't really happen under the hood in the server mode, this can be a performance issue if you have a big project</p>",
        "id": 221658753,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609860356
    },
    {
        "content": "<p>with mathlib, you should be using <code>leanproject up</code> which downloads precompiled oleans</p>",
        "id": 221658829,
        "sender_full_name": "Mario Carneiro",
        "timestamp": 1609860377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364351\">@Lars Ericson</span>  I had a project that I wanted to be called from a Command Line Interface, and there were a lot of files being imported by the <code>main</code> file, and they had their own imports, and so on. Using <code> lean --run main.lean</code> took like 30 seconds, but if I used <code>lean --make main.lean</code>, it would generate the <code>olean</code> files in my directory, and after that <code>lean --run</code> was instant.</p>",
        "id": 221690058,
        "sender_full_name": "Logan Murphy",
        "timestamp": 1609874767
    }
]