[
    {
        "content": "<p>After having read a lot about git, I want to test my understanding:<br>\nMy understanding is that if one sets up a new repository on github, without adjusting any settings (i.e. this is not talking about mathlib, just my own new unrelated repository), then <code>git push origin</code> does the following: It uploads the commits in my local branch that are not part of the remote origin branch, to the github server. It then checks: if the master branch in the origin repository (i.e. on github) is an ancestor of my local master branch, then it updates the origin/master branch to my local master branch.<br>\ni.e. it doesn't do any merging.</p>\n<p>However, a github project can set up <code>git push origin</code> to do something other than the default behaviour. In particular, the leanproject has been set up so that it doesn't directly cause the origin/master branch to change, but provides you an option of doing a pull-request via the github website. So rather than <code>git push</code> doing a normal push, it doesn't directly do anything via git, but opens up a github pull-request, which if processed will cause the remote repository to do a pull of my local branch. This mislead me at first.</p>\n<p>Is this correct?</p>",
        "id": 204054467,
        "sender_full_name": "Chris M",
        "timestamp": 1594885565
    },
    {
        "content": "<p>I don't think GitHub lets you change push behavior in that way</p>",
        "id": 204054913,
        "sender_full_name": "Chris Wong",
        "timestamp": 1594885946
    },
    {
        "content": "<p>Most likely what you're seeing is that the mathlib master branch is <em>locked</em>, and so pushing directly to it will fail</p>",
        "id": 204054948,
        "sender_full_name": "Chris Wong",
        "timestamp": 1594885986
    },
    {
        "content": "<p>After getting that error, a reasonable person would respond by pushing to a differently named branch instead</p>",
        "id": 204054986,
        "sender_full_name": "Chris Wong",
        "timestamp": 1594886024
    },
    {
        "content": "<p>But that's something you do yourself</p>",
        "id": 204055003,
        "sender_full_name": "Chris Wong",
        "timestamp": 1594886042
    }
]