[
    {
        "content": "<p>I don't have much formal mathematical background so I would appreciate an explanation that is geared more towards computer science.</p>\n<p>The context for this question is that I'm trying to understand what differentiates a inductive predicate <code>inductive foo : ... -&gt; Prop</code> and an inductive type <code>inductive bar : ... -&gt; Type</code>. I understand how to use them, but struggle to see how they work.</p>\n<p>I also saw somewhere that <code>Prop</code> is <code>Sort 0</code> and <code>Type</code> is <code>Sort 1</code>. What does this mean?</p>\n<p>I would appreciate any resources for further reading on this topic.</p>",
        "id": 238612083,
        "sender_full_name": "Leo Ericson",
        "timestamp": 1620907394
    },
    {
        "content": "<p>Hello.</p>\n<p>(Fellow new member, so hopefully I don't get this wrong myself --) maybe this helps: <code>Prop</code> is a type, it's the type of propositional statements -- e.g. <code>2 = 2</code> or <code>8 is even</code> -- and also of the type <code>2 = 8</code>, which is also a proposition (even though it's a false one). The numbers you see in <code>Sort</code>, which I'll come back to in a sec, are universes -- there is an (infinite) hierarchy of types that live in successive universes, and essentially some rules that say you can't refer to types in higher universes from lower ones to prevent things like Russell's paradox. The universe at 0 is, in Lean, just a universe that <code>Prop</code> lives in -- and there's some further rules that let <code>Prop</code> refer to types in higher universes -- i.e. to allow one to state propositions about types no matter what universe they live in.</p>\n<p><code>Sort</code> is a word that just refers to both <code>Prop</code> and all the higher universe types, because well, <code>Type</code> is taken -- so <code>Prop</code> and <code>Type &lt;somenumber&gt;</code> are syntax sugar for <code>Sort</code> essentially.</p>\n<p>There's some info in <a href=\"https://leanprover.github.io/theorem_proving_in_lean/propositions_and_proofs.html\">https://leanprover.github.io/theorem_proving_in_lean/propositions_and_proofs.html</a> and the preceding chapter on dependent type theory and how Lean calls things from it, and <a href=\"https://www.youtube.com/watch?v=3sKrSNhSxik\">https://www.youtube.com/watch?v=3sKrSNhSxik</a> from <span class=\"user-mention\" data-user-id=\"110049\">@Mario Carneiro</span> has some explanation as well if you prefer videos.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"3sKrSNhSxik\" href=\"https://www.youtube.com/watch?v=3sKrSNhSxik\"><img src=\"https://uploads.zulipusercontent.net/924eac0b421c60eb234bae4366290dbd78c8134b/68747470733a2f2f692e7974696d672e636f6d2f76692f33734b72534e685378696b2f64656661756c742e6a7067\"></a></div>",
        "id": 238614746,
        "sender_full_name": "Julian Berman",
        "timestamp": 1620909074
    },
    {
        "content": "<blockquote>\n<p>There's some info in <a href=\"https://leanprover.github.io/theorem_proving_in_lean/propositions_and_proofs.html\">https://leanprover.github.io/theorem_proving_in_lean/propositions_and_proofs.html</a> and the preceding chapter on dependent type theory and how Lean calls things from it</p>\n</blockquote>\n<p>Thanks! I must have missed that when I skimmed the TOC before. I had read the Hitchhiker's guide and thought it was largely similar content. This looks to be what I need so I'll be off reading.</p>",
        "id": 238615913,
        "sender_full_name": "Leo Ericson",
        "timestamp": 1620909862
    }
]