[
    {
        "content": "<p>Being a programmer first when any reference to a math theory, conjecture etc.  is noted I instantly convert into a mental gap and continue, E.g.  <code>Hedetniemi's conjecture</code>.  While I can use Wikipedia to learn more about them, is there a better place to learn about them to connect the dots to make what I read make sense. I am not looking to get a degree in math but something that doesn't have me filling my mind with gaps. Even a connection to another gap is better than just a gap alone, at least then I am making progress.</p>",
        "id": 267037627,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641459081
    },
    {
        "content": "<p>I guess this depends <em>a lot</em> on the type of theory / conjecture you are talking about.</p>",
        "id": 267037690,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459138
    },
    {
        "content": "<p>For many things, Wiki is great. But on the other end of the spectrum, there are conjectures, where you need to be in Bonn, or at MIT, or wherever, to start learning about them.</p>",
        "id": 267037755,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459196
    },
    {
        "content": "<p>In general, I would say: check Wiki. If it isn't covered, do a quick internet search. If that doesn't show up anything on Encyclopedia of Math, or planetmath, or groupprops, or math.stackexchange, then you can ask a question on math.stackexchange.</p>\n<p>If it is slightly Lean/mathlib related, just ask a question in <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths\">#maths</a>. The cool thing about this community is that you have access to a bunch of friendly experts that will be happy to give you a pointer, or a more detailed explanation.</p>",
        "id": 267037868,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641459304
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"366057\">@Eric Taucher</span> it's not directly related to your question perhaps, but I have in the back of my head that at some point I would like to try to write some posts somewhere for \"Lean for the Inept Mathematician\" (or some less self-deprecating name :P) -- where I try to learn some math thing by reading some Lean API and walking through that and the math involved. It'd sort of be the Lean equivalent of a really useful early Python resource, this thing called <a href=\"https://pymotw.com/2/\">PyMOTW (module of the week)</a>. I'm in a similar boat, where I have vague notions of some primitive undergrad mathematical ideas but I think the exercise of filling in some of those mental gaps \"interactively\" along with lean (and a reader) might make for decent content. I mention this in case the idea seems interesting and you care to help motivate getting it started :)</p>",
        "id": 267040713,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641461591
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> <a href=\"#narrow/stream/113489-new-members/topic/Where.20to.20lookup.20math.20theories.2Fconjectures.20etc.2E.3F/near/267040713\">said</a>:</p>\n<blockquote>\n<p>you care to help motivate getting it started :)</p>\n</blockquote>\n<p>Possibly. <br>\nWhat would be expected on my part?</p>\n<p>On another site for Prolog every several months a similar topic comes up and then if dies out after a few weeks. The problem is that these false starts have been collecting for years and at times find themselves as top search results which then just adds more confusion to those already confused as they are more templates with a few example pages then a complete set of documentation or series of exercises.</p>\n<p>On the positive side I have made learning Lean my major project for now so it should be something I work with daily for the next several months  or more.</p>",
        "id": 267041825,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641462362
    },
    {
        "content": "<p>I don't know, this idea is still half baked :) -- but I think we'd need to brainstorm a first topic, some piece of math that is self contained enough to explain in 500-1000 words with like 3-5 pieces of Lean API related to it, and then stick some prose in a repo. To your point I think putting it anywhere indexable may not be wise until it turns out the idea sticks, so I was personally just planning to stick it in a git repo somewhere as soon as I got comfortable enough with Lean (has not happened yet but may never happen so may as well dive in at some point). </p>\n<blockquote>\n<p>On the positive side I have made learning Lean my major project for now so it should be something I work with daily for the next several months or more.</p>\n</blockquote>\n<p>Nice, lucky you.</p>",
        "id": 267042383,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641462782
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"321696\">Julian Berman</span> <a href=\"#narrow/stream/113489-new-members/topic/Where.20to.20lookup.20math.20theories.2Fconjectures.20etc.2E.3F/near/267042383\">said</a>:</p>\n<blockquote>\n<p>this idea is still half baked :) </p>\n</blockquote>\n<p>I can live with that. Have to start somewhere.</p>\n<blockquote>\n<p>brainstorm a first topic</p>\n</blockquote>\n<p>My thought on this, since proofs generally form a DAG is to start as close to the bottom as possible, (<a href=\"https://i.stack.imgur.com/za7tS.gif\">Mizar graph</a>) I know there is a similar image for Lean I just can find it at the moment.</p>\n<div class=\"message_inline_image\"><a href=\"https://i.stack.imgur.com/za7tS.gif\" title=\"Mizar graph\"><img src=\"https://uploads.zulipusercontent.net/d7ad8f124616cf413ea91a7c61f58a458667ece3/68747470733a2f2f692e737461636b2e696d6775722e636f6d2f7a613774532e676966\"></a></div><blockquote>\n<p>some piece of math that is self contained enough to explain in 500-1000 words with like 3-5 pieces of Lean API related to it, and then stick some prose in a repo.</p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span><br>\nToo much information scares new users.</p>\n<blockquote>\n<p>To your point I think putting it anywhere indexable may not be wise until it turns out the idea sticks, so I was personally just planning to stick it in a git repo somewhere as soon as I got comfortable enough with Lean (has not happened yet but may never happen so may as well dive in at some point). </p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 267046779,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641465788
    },
    {
        "content": "<p>Lean for the Inept Mathematician? I'm in if you need another pair of hands :D</p>",
        "id": 267053798,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641471089
    },
    {
        "content": "<p>Regarding sources for math theory, I found this yesterday, here on zulip:<br>\n<a href=\"https://stacks.math.columbia.edu/\">https://stacks.math.columbia.edu/</a></p>",
        "id": 267054038,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641471260
    },
    {
        "content": "<p>For a starting topic, I would probably suggest algebra</p>",
        "id": 267054367,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641471491
    },
    {
        "content": "<p>Or maybe euclidean geometry if we can get TikZ working with lean comments somehow</p>",
        "id": 267055072,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641472056
    },
    {
        "content": "<p>Apparently this topic has serendipitously morphed into something better. Maybe we should split part of it off into a new topic or I can change the title so it gets more traction or is more meaningful when searching.</p>",
        "id": 267056471,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641473112
    },
    {
        "content": "<p>For <code>Lean for the Inept Mathematician</code> who would the target audience be? What expectations of math would be needed?</p>\n<p>I did a very quick glance at  <a href=\"https://stacks.math.columbia.edu/\">https://stacks.math.columbia.edu/</a> and when <code>ring</code> was mentioned I knew the word and some of the concepts but could not have an intelligent conversation with some one with a math background.</p>",
        "id": 267057601,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641473985
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"366057\">Eric Taucher</span> <a href=\"#narrow/stream/113489-new-members/topic/Where.20to.20lookup.20math.20theories.2Fconjectures.20etc.2E.3F/near/267057601\">said</a>:</p>\n<blockquote>\n<p>For <code>Lean for the Inept Mathematician</code> who would the target audience be? What expectations of math would be needed?</p>\n</blockquote>\n<p>To make it easier, maybe the target audience could be ourselves (or some recent version of our past selves): people with enough experience in programming, who probably took CS classes, did calculus 1 or 2, linear algebra 1, basic discrete mathematics and had a short introduction to algebra and group theory, but nothing too deep (talking about myself here)</p>",
        "id": 267058400,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641474411
    },
    {
        "content": "<p>I'm going to create a repo to start I suppose, maybe that removes some initial inertia. Audience-wise I was assuming a vague thing like \"person interested in Lean who is not a mathematician\" -- which means yeah you may kind of know what a ring is but probably wouldn't mind seeing someone remind you of the definition if the article was about the basics of ring theory (and if it wasn't, maybe it starts off by linking to some definition of a ring).</p>",
        "id": 267058406,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641474415
    },
    {
        "content": "<p>Yes definitely \"ourselves\" is another good one!</p>",
        "id": 267058413,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641474421
    },
    {
        "content": "<p>\"person interested in Lean who is not a mathematician\" or \"person interested in mathematics and thought of Lean as a good interactive tool to learn it\". Both are very similar profiles I think</p>",
        "id": 267059138,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641474873
    },
    {
        "content": "<p>I thought of \"ourselves\" as a good target audience because it would be amazing to get to the point of actually being able to understand some of the talks that happen under <a class=\"stream\" data-stream-id=\"116395\" href=\"/#narrow/stream/116395-maths\">#maths</a> <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 267059389,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641475050
    },
    {
        "content": "<p>OK repo is here: <a href=\"https://github.com/Julian/lftim\">https://github.com/Julian/lftim</a> -- if you (or anyone) wants commit rights just let me know your GH username</p>",
        "id": 267059601,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641475184
    },
    {
        "content": "<p>Will set up github pages too perhaps</p>",
        "id": 267059615,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641475193
    },
    {
        "content": "<p>Though maybe that creeps into \"indexable\" territory from above.</p>",
        "id": 267059674,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641475211
    },
    {
        "content": "<p>But it will be easier to read if we put latex in a post or something.</p>",
        "id": 267059685,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641475222
    },
    {
        "content": "<p><code>arthurpaulino</code> <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 267059711,
        "sender_full_name": "Arthur Paulino",
        "timestamp": 1641475252
    },
    {
        "content": "<p>Personally I have no problem with <code>Lean for the Inept Mathematician</code> the definition of inept with regards to my knowledge of math and Lean here fits.  That is not saying I don't have a knowledge of math or an understanding of Proof Systems, it is jus that the cross roads of the two greatly diminishes my connections to the ideas in context on this forum. That is not a fault of anyone but an opportunity for me to excel.</p>",
        "id": 267059713,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1641475254
    },
    {
        "content": "<p>Yes definitely agreed, to me the name seemed fitting as well :P</p>",
        "id": 267059748,
        "sender_full_name": "Julian Berman",
        "timestamp": 1641475290
    },
    {
        "content": "<p>Some replies to this thread were split off to <a href=\"#narrow/stream/113489-new-members/topic/Lean.20for.20the.20Inept.20Mathematician\">https://leanprover.zulipchat.com/#narrow/stream/113489-new-members/topic/Lean.20for.20the.20Inept.20Mathematician</a></p>",
        "id": 267063911,
        "sender_full_name": "Bryan Gin-ge Chen",
        "timestamp": 1641477740
    }
]