[
    {
        "content": "<p>The <a href=\"https://en.wikipedia.org/wiki/QED_manifesto?wprov=sfla1\">wikipedia entry on the QED manifesto</a> states:</p>\n<p>\"[T]he Mizar library has successfully formalized a large portion of undergraduate mathematics. As of 2007 it is the largest such library.\"</p>\n<p>Obviously, this is outdated. What should the page say today?  And is there a meaningful quantitative way to compare the Mizar library with mathlib?</p>",
        "id": 287762968,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1656443740
    },
    {
        "content": "<p>We maintain <a href=\"https://leanprover-community.github.io/undergrad.html\">a list of undergraduate mathematics formalized in Lean</a>, based on the French curriculum. So my first suggestion would be to compare the percentage of completion of that list to that of Mizar.</p>",
        "id": 287781982,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1656453787
    },
    {
        "content": "<p>Another quick and dirty comparison would be <a href=\"https://www.cs.ru.nl/~freek/100/\">the progress on the top 100 theorems</a>. Apparently Lean is now ahead of Mizar by 1 whole theorem!</p>",
        "id": 287782218,
        "sender_full_name": "Anne Baanen",
        "timestamp": 1656453922
    },
    {
        "content": "<p>I think it's very difficult to make such comparisons, especially in this somewhat rapidly changing area, most obvious metrics have flaws. The aim of a reference work like Wikipedia should probably instead stick to mentioning some big projects in the area, when the absolute \"largest\" is hard to pin down with a reasonable measure of size.</p>",
        "id": 287786617,
        "sender_full_name": "Alex J. Best",
        "timestamp": 1656456540
    },
    {
        "content": "<p>Thanks for the links!  I just thought it would be appropriate to mention mathlib on that page.  And if it was possible to make a vague quantitative comparison, I would also include it there.  But I can't find as a good an overview over what parts of the curriculum are actually covered by the Mizar library.  So for now I've just made the most minimal edit to the <a href=\"https://en.wikipedia.org/wiki/QED_manifesto\">Wikipedia page</a>:</p>\n<blockquote>\n<p>The Mizar Mathematical Library formalizes a large portion of undergraduate mathematics, and was considered the largest such library in 2007.[4] Similar projects include the Metamath proof database and the mathlib library written in Lean.[5]</p>\n</blockquote>",
        "id": 287849560,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1656507910
    }
]