[
    {
        "content": "<p>Mathlib defines ZFC sets in these 4 steps:</p>\n<ul>\n<li>Define pre-sets inductively.</li>\n<li>Define extensional equivalence on pre-sets and give it a setoid instance.</li>\n<li>Define ZFC sets by quotienting pre-sets by extensional equivalence.</li>\n<li>Define classes as sets of ZFC sets. Then the rest is usual set theory.</li>\n</ul>\n<p><a href=\"https://leanprover-community.github.io/mathlib_docs/set_theory/zfc.html\">https://leanprover-community.github.io/mathlib_docs/set_theory/zfc.html</a></p>\n<p>I'm curious to the motivation behind this, and why it isn't sufficient to just use the regular <code>set</code> and then define all the axioms as constants</p>",
        "id": 259202836,
        "sender_full_name": "Lucas Teixeira",
        "timestamp": 1635320625
    },
    {
        "content": "<p><code>S : set X</code> means \"S is a subset of X\" and there's no X such that every set is a subset of it.</p>",
        "id": 259203285,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635320939
    },
    {
        "content": "<p>and mathlib doesn't have any axioms, so I doubt that an exception would be made for this.</p>",
        "id": 259203388,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635321014
    },
    {
        "content": "<p>The point is to construct a model of ZFC, not to define it axiomatically.</p>",
        "id": 259203762,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635321310
    },
    {
        "content": "<p>I wrote that docstring, but Mario would be a better person to ask about.</p>",
        "id": 259203812,
        "sender_full_name": "Yaël Dillies",
        "timestamp": 1635321347
    },
    {
        "content": "<p>This also proves that Lean is at least as powerful as ZFC, and we can trust that this ZFC is consistent assuming that Lean/mathlib without any additional axioms is consistent.</p>",
        "id": 259203897,
        "sender_full_name": "Kyle Miller",
        "timestamp": 1635321399
    },
    {
        "content": "<p>My understanding is that Mario's thesis also proves the converse -- that ZFC is strong enough to model all the constructions which Lean's dependent type theory is capable of, giving an equiconsistency result.</p>",
        "id": 259203972,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1635321453
    }
]