[
    {
        "content": "<p>Hello! I used to do complex differential geometry (compact Kahler manifolds with applications to algebraic geometry) before becoming a developer. I'm in Amsterdam until the summer when we plan to move back home to Iceland. I'm interested in playing around with Lean in general and formalizing things related to complex geometry in particular (though I see it may be quite a while before mathlib gets there).</p>",
        "id": 266780087,
        "sender_full_name": "Gunnar Þór Magnússon",
        "timestamp": 1641284272
    },
    {
        "content": "<p>Well, if <a href=\"https://github.com/leanprover-community/mathlib/pull/10000\">#10000</a> is merged, then complex analysis kicks of seriously. And I know that <span class=\"user-mention\" data-user-id=\"110050\">@Sebastien Gouezel</span> is aiming for differential forms and de Rham cohomology. So maybe the Kähler condition isn't actually that far off in the future.</p>",
        "id": 266781346,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641285285
    },
    {
        "content": "<p>I imagine there's a roadmap for getting to complex manifolds and differential geometry. If I can help in any way I'd be happy to do so, like with complex analysis or differential forms or manifolds or analytic sheaves. It'll be interesting to see how all the jumping between real and complex bundles, forms and cohomology will work out.</p>",
        "id": 266786544,
        "sender_full_name": "Gunnar Þór Magnússon",
        "timestamp": 1641288804
    },
    {
        "content": "<p>Well, to be fair, I don't think there's any roadmap written down anywhere.</p>",
        "id": 266786746,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641288949
    },
    {
        "content": "<p>Have you already played around with Lean a bit?</p>",
        "id": 266786807,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1641288967
    },
    {
        "content": "<p>A little. I've done the natural numbers game and the intermediate value theorem tutorial. I just finished reading through <a href=\"https://leanprover.github.io/theorem_proving_in_lean/introduction.html\">the docs</a> and am looking around in mathlib to see how some more complicated structures are done. I wanted to formalize something simple on my own, like maybe basic incidence geometries or groups, before trying to see if there was any low-hanging fruit in mathlib.</p>",
        "id": 266787576,
        "sender_full_name": "Gunnar Þór Magnússon",
        "timestamp": 1641289508
    },
    {
        "content": "<p>Maybe some of the workshops at <a href=\"https://github.com/ImperialCollegeLondon/formalising-mathematics\">https://github.com/ImperialCollegeLondon/formalising-mathematics</a> are now helpful? Alternatively it's a very good idea to just choose a project of your own, ask for help with the definitions (because they make or break the project), and then try to prove the theorems yourself.</p>",
        "id": 266791023,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1641291752
    },
    {
        "content": "<p>Those look pretty great, actually. Thanks!</p>",
        "id": 266792518,
        "sender_full_name": "Gunnar Þór Magnússon",
        "timestamp": 1641292781
    }
]