[
    {
        "content": "<p>I know at least one person who has been active on this server and lives in the LA area. (If someone else comments on this thread claiming to be near LA, I'll try to connect the two of you.)</p>",
        "id": 189281716,
        "sender_full_name": "Jalex Stark",
        "timestamp": 1582862018
    },
    {
        "content": "<p>I'm in LA, though I'm at the \"just curious\" level on Lean.</p>",
        "id": 193716889,
        "sender_full_name": "Howard B. Golden",
        "timestamp": 1586704273
    },
    {
        "content": "<p>I'm a grad student at UCLA, and probably will be for several more years, so I'd be happy to meet up in pandemic-free future-LA</p>",
        "id": 204880063,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1595567090
    },
    {
        "content": "<p>I'm near Los Angeles (Pasadena, to be more precise). I'm just getting my feet wet with Lean, though</p>",
        "id": 232624412,
        "sender_full_name": "Alex Nelson",
        "timestamp": 1617208993
    },
    {
        "content": "<p>I lived there in 1992 and I remember getting my feet wet too, in the floods.</p>",
        "id": 232625755,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1617209491
    },
    {
        "content": "<p>It rains in LA?</p>",
        "id": 232637595,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1617213815
    },
    {
        "content": "<p>I lived in California for 3 years and I think it rained once.</p>",
        "id": 232637630,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1617213834
    },
    {
        "content": "<p>I agree, I lived in Berkeley CA for two years and it also rained once. There were heavy downpours in LA in early 1992, nothing like I hadn't seen in the UK, just what I would call \"normal British weather\" for about three days but the system there was totally unprepared for it, they were rescuing people with helicopters from cars stranded in roads which had become rivers.</p>",
        "id": 232638565,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1617214192
    },
    {
        "content": "<p>Yes, we treat drainage as optional and have to wade through concrete rivers every winter. Reminds me of a certain island whose trains always seem to shut down in shock at the winter's first snow...</p>",
        "id": 232663787,
        "sender_full_name": "Aaron Anderson",
        "timestamp": 1617224220
    },
    {
        "content": "<p>Seems like you guys never listened to Albert Hammond...</p>",
        "id": 232685903,
        "sender_full_name": "Benjamin Davidson",
        "timestamp": 1617236484
    },
    {
        "content": "<p>I've lived in socal for all my life and, believe it or not, it used to rain a long time ago. Not so much since we've been in a continuous drought since 2009 or so.</p>",
        "id": 232700076,
        "sender_full_name": "Brandon Bocanegra",
        "timestamp": 1617249171
    }
]