[
    {
        "content": "<p>Hi, I'm a PhD student at Paris 13, but currently on an exchange in Bonn, working in analytic number theory and automorphic forms.</p>",
        "id": 285307580,
        "sender_full_name": "Bart Michels",
        "timestamp": 1654632858
    },
    {
        "content": "<p>What definition of an automorphic form do you use? I have had my eye on the adelic definition for a while but there's still plenty of work to do before we have it.</p>",
        "id": 285319135,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654638852
    },
    {
        "content": "<p>The classical one should be easier to implement, although it's not really the \"right\" definition. So you have semisimple Lie group G, the universal enveloping algebra U(g), a maximal compact subgroup K, discrete subgroup Gamma of finite co-volume (this last bit can be expressed without defining a measure on the quotient). U(g) has an action on smooth functions by its universal property (here you need vector fields, the Lie bracket), and take functions on G that are right K-invariant (say), left Gamma-invariant and that are joint eigenfunctions for the center Z(U(g)).<br>\n... and I forgot about Hecke operators, which are a pain unless G=SL_n and Gamma is very concrete, like SL_n(Z) or something that comes from a central simple algebra.</p>",
        "id": 285355379,
        "sender_full_name": "Bart Michels",
        "timestamp": 1654674005
    },
    {
        "content": "<p>It seems to me that we're getting closer and closer to being able to state that definition in Lean. We have universal enveloping algebras but I'm not sure we have enough glue yet to enable them to act on functions on the Lie group.</p>",
        "id": 285356051,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654674551
    },
    {
        "content": "<p>For analytic NT, I'm worried about things like:<br>\nlog(1+O(x)) + (1+x)^2 = 1+O(x)<br>\nwhich are very common. (The example is very constructed of course, but O's do appear on both sides of the equality and sometimes nested. Equalities should always be read left-to-right with ∀ quantifiers over the O's in the LHS and ∃'s for the RHS.)<br>\nYou can replace all O's by functions and formulate it as a ∀∃-statement about (partial) functions, but I'd like to approximate the notation we use as best as possible, even just as an experiment.</p>",
        "id": 285356401,
        "sender_full_name": "Bart Michels",
        "timestamp": 1654674788
    },
    {
        "content": "<p>My impression is that the formalisation community only just started thinking seriously about O notation and I'm sure there's still a lot to learn.</p>",
        "id": 285356876,
        "sender_full_name": "Kevin Buzzard",
        "timestamp": 1654675141
    }
]