[
    {
        "content": "<p>Pittsburgh represent!<br>\nThe Pittsburgh area has a very active Lean community, centered around Carnegie Mellon University and the neighboring University of Pittsburgh. </p>\n<p>We have weekly Lean meetings every Tuesday at 4.30pm in Thackeray Hall at Pitt.  (At least we used to, until the university closed down.)</p>",
        "id": 193712811,
        "sender_full_name": "Koundinya Vajjha",
        "timestamp": 1586697330
    },
    {
        "content": "<p>We use the <code>cmu-lean</code> mailing list on Google groups for the weekly meeting announcements. It is a private mailing list  but anyone is welcome to join. You should be able to find it on Google groups and click a button to send a request, but in any case you can email me at <code>avigad@cmu.edu</code> and I will send an invite. </p>\n<p>The meetings are informal. Sometimes we just talk shop, but I generally try to line up a volunteer to present something they are working on or a paper they are reading, or lead a discussion. The topics are not restricted to Lean; participants are generally interested in all aspects of formal methods and their applications to mathematics.</p>\n<p>We have had a few meetings by Zoom since the lockdown began. We'll take a break this week, but we're still planning to meet sporadically, as people volunteer to present. I have nearly all the slides done for a talk I was going to give at a phil math conference last week (<a href=\"https://princetonphilmath.wordpress.com/\" title=\"https://princetonphilmath.wordpress.com/\">https://princetonphilmath.wordpress.com/</a>), so I'll present those a week from Tuesday (April 21) unless we get a better offer.</p>",
        "id": 193713831,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1586699158
    },
    {
        "content": "<p>Tim Daly</p>\n<p>Out near the KPIT airport, just behind the Raccoon State Park.</p>",
        "id": 193950386,
        "sender_full_name": "Tim Daly",
        "timestamp": 1586894781
    },
    {
        "content": "<p>I am in Bethel Park.  Once this whole pandemic thing has resolved itself, I hope to become more involved with the Lean community at CMU and Pitt.  My background is in financial engineering, and as a result my mathematics background is more on the applied side.</p>",
        "id": 212414528,
        "sender_full_name": "William Sealy Gosset",
        "timestamp": 1601984272
    }
]