[
    {
        "content": "<p>Hi everyone! I'm just getting started with Lean, still in the process of reading docs and tutorials. I'd be interested to know if there are people in my area with an interest in formalizing maths. (Well, there are people in Paris and Lyon for sure!)</p>\n<p>Pierre</p>",
        "id": 290744717,
        "sender_full_name": "Pierre Guillot",
        "timestamp": 1658746822
    },
    {
        "content": "<p>Across the border, there's Karlsruhe and Freiburg. I'm not aware of other Lean users in Alsace at the moment.</p>",
        "id": 290744837,
        "sender_full_name": "Johan Commelin",
        "timestamp": 1658746912
    },
    {
        "content": "<p>Bienvenue !</p>",
        "id": 290744847,
        "sender_full_name": "Patrick Massot",
        "timestamp": 1658746920
    },
    {
        "content": "<p>See also <a href=\"#narrow/stream/224796-Geographic-locality/topic/Karlsruhe.2C.20DE\">the Karlsruhe thread</a> :)</p>",
        "id": 290744964,
        "sender_full_name": "Marc Huisinga",
        "timestamp": 1658746990
    },
    {
        "content": "<p>Hi Pierre, bienvenu!</p>",
        "id": 290745610,
        "sender_full_name": "Filippo A. E. Nuccio",
        "timestamp": 1658747432
    },
    {
        "content": "<p>Bonjour !</p>",
        "id": 290753047,
        "sender_full_name": "Xavier Roblot",
        "timestamp": 1658752596
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"516952\">@Pierre Guillot</span> !</p>",
        "id": 290761209,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1658757174
    },
    {
        "content": "<p>Hi Adam! it's been a while hasn't it? how are you?</p>",
        "id": 290761288,
        "sender_full_name": "Pierre Guillot",
        "timestamp": 1658757229
    },
    {
        "content": "<p>I'm well, and you? What got you interested in lean?</p>",
        "id": 290761602,
        "sender_full_name": "Adam Topaz",
        "timestamp": 1658757370
    },
    {
        "content": "<p>I'm doing great, and my life has changed entirely: I have a 2-year-old daughter :-)</p>\n<p>Where do you live now?</p>\n<p>I got interested in Lean very gradually. For one thing I've loved coding for a while (starting with assembly when I was a teenager!), and in recent years I've been using Sage very frequently. Then I  learned some Haskell just for kicks. Then I had some discussions with a CS friend here and we had this attempt at teaching some Coq to our students-- well, it was Edukera, some graphical interface over Coq, and it was disappointing in almost all respects, but whatever. (I'm speaking in the past but I'll have to teach it again in the fall.) Then Voevodsky created some buzz over HoTT.</p>\n<p>And then eventually I became aware, reading Quanta I think, that Lean was already being used by a lot of mathematicians, I discovered that it had plenty of documentation (unlike Coq or Isabelle, if you mean \"documentation for mathematicians\"), I started digging a little... I also spoke with Filippo Nuccio, that I've known for a number of years. It helps talking to someone you know, who's crossed the rubicon and moved to formalized maths (I didn't know you were part of the adventure, although Filippo quickly told me).</p>\n<p>Now I'm learning! It doesn't seem too difficult in itself, but some aspects are tricky to me -- I'm hoping that what I find relatively easy is the important stuff and what I find hard is anecdotal, but time will tell! Generally I just find it confusing to jump inside a very large project on which tons of other people have thought hard for a while. (And I haven't got to the point where I need to use GIT, which I know already puzzles me completely.)</p>",
        "id": 290763736,
        "sender_full_name": "Pierre Guillot",
        "timestamp": 1658758394
    }
]